{
  "title": "30-Minute Mole",
  "source": "Cooking.nytimes.com",
  "servings": "4 1/2 cups",
  "categories": [
    "Mexican"
  ],
  "ingredients": [
    "3cups unsalted vegetable broth or water",
    "3tablespoons neutral oil, such as canola",
    "3dried pasilla chiles, stemmed and seeded",
    "4dried guajillo chiles, stemmed and seeded",
    "1medium yellow onion, coarsely chopped",
    "4garlic cloves, minced",
    "6tablespoons unsalted roasted natural peanut butter or almond butter",
    "3tablespoons tahini",
    "2tablespoons turbinado or raw sugar",
    "2tablespoons cacao or unsweetened cocoa powder",
    "1/4cup dark chocolate chips or chunks",
    "1tablespoon dried oregano, preferably Mexican",
    "1/4teaspoon plus 1/8 teaspoon ground cumin",
    "1/4teaspoon ground cinnamon",
    "16-inch corn tortilla, toasted, or 1 tostada",
    "Salt and pepper",
    "Seared cauliflower or other vegetables or proteins, for serving"
  ],
  "directions": [
    "Heat broth in a small saucepan over medium-high until steaming; remove from heat. Meanwhile, heat 2 tablespoons oil in a medium pot over medium. Add all the dried chiles and sear until darkened, turning constantly so they don’t burn and become bitter, 1 to 2 minutes. Transfer chiles to the hot broth to rehydrate for 10 minutes. Set a bowl over the chiles to keep them submerged.",
    "Add the remaining tablespoon oil and the onion to the same medium pot (no need to wash). Cook over medium, stirring occasionally, until lightly browned, about 5 minutes. Add the garlic and cook, stirring frequently, until lightly toasted, about 1 minute. Transfer to a blender, along with the chiles and their soaking liquid, the peanut butter, tahini, sugar, cacao, chocolate, oregano, cumin, cinnamon and toasted tortilla. Blend until completely smooth and creamy. Season to taste with salt and pepper.",
    "Pour the mole back into the same medium pot and set over high heat. Once the mole starts to bubble, lower heat to medium and simmer, stirring every couple of minutes to make sure the mole isn’t burning or sticking to the pot, until the flavors marry, at least 10 minutes and up to 30 minutes. Use immediately or refrigerate in an airtight container for up to 1 week.",
    "Serve with cauliflower or vegetable or protein of your choice."
  ]
}