{
  "title": "5-Ingredient Focaccia Bread",
  "source": "Cafehailee.com",
  "servings": "1 10-12 inch round focaccia",
  "categories": [
    "Bread"
  ],
  "ingredients": [
    "Dough",
    "500g all purpose flour (you can also do 400g all purpose and 100g whole wheat if you want a nuttier taste!)",
    "5g instant yeast (I like SAF brand)",
    "14g kosher salt",
    "30g olive oil, plus more for the pan and the top of the focaccia",
    "400g room temperature water",
    "Salt Water Brine",
    "100g warm water",
    "5g kosher salt"
  ],
  "directions": [
    "In a large bowl, add flour, yeast, salt, olive oil, and water. Mix until thoroughly combined. Scrape down the sides of the bowl.",
    "Cover with plastic wrap and let rest at room temperature for 1 hour.",
    "Uncover and fold dough (see video).",
    "Cover and let rest again for 1 more hour.",
    "Fold dough again (see video).",
    "Cover and place dough in the fridge. Refrigerate for at least 12 hours, up to 3 days.",
    "On the day you are ready to bake, remove dough from the fridge.",
    "Spray a clean surface with water and transfer dough to the damp surface.",
    "Using damp hands, shape the dough into a tight ball (see video).",
    "Transfer dough to a heavily olive oiled 10-12 inch cast iron. Drizzle the top of the focaccia with a touch of olive oil. *",
    "Cover dough with plastic wrap and let rest at room temperature for 1 hour.",
    "Once 1 hour is up, preheat oven to 500F. (you will continue to let the dough rest as the oven preheats.)",
    "While oven preheats, mix salt into water to make the brine.",
    "When the oven is hot, dip fingers into salt water and dimple the dough all over, while pressing the dough out to fill the pan (see video).",
    "Splash a touch of the salt water over the top of the bread. (you will not use all the water! you just want to splash 1-2 tsp over the dough. There will be a lot of the brine leftover, you can just discard it)",
    "Drizzle the top of the focaccia all over with more olive oil.",
    "Bake for 20-25 minutes until golden. Rotate the pan as necessary to promote even browning.",
    "Once baked, let the focaccia cool for 5 minutes in the pan.",
    "Carefully remove focaccia to a wire rack to finish cooling. Cooling on a wire rack helps preserve the crunchy bottom crust.",
    "Serve warm :)",
    "*If you want to use the focaccia for a sandwich or you just want a thinner focaccia, you can also use a sheet tray here instead of the cast iron. After the one hour of resting on the sheet tray and then pressing it out, it may not totally fit the tray. In that case, wait another 20-25 minutes until the dough has relaxed again and try to fill out the tray. It may take a bit of gentle stretching as well, being careful not to tear or stretch too thin :)"
  ]
}