{
  "title": "A Little Bit of Everything Bagels",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 9",
  "difficulty": "Hard",
  "categories": [
    "Dessert Person"
  ],
  "ingredients": [
    "¼ cup sesame seeds",
    "3 tablespoons poppy seeds",
    "1½ teaspoons caraway seeds, crushed under a heavy saucepan",
    "2 tablespoons dried minced onion",
    "1 tablespoon dried minced garlic",
    "1 teaspoon active dry yeast (0.11 oz / 3g)",
    "2 tablespoons barley malt syrup (1.5 oz / 43g), plus several tablespoons for boiling",
    "3¾ cups bread flour (17.2 oz / 488g), plus more for kneading",
    "½ cup rye flour (2.3 oz / 65g)",
    "1 tablespoon Diamond Crystal kosher salt (0.32 oz / 9g)",
    "Coarse cornmeal, for dusting",
    "Flaky salt, for sprinkling the tops"
  ],
  "directions": [
    "Make the 'everything' mixture: In a small bowl, toss the sesame seeds, poppy seeds, crushed caraway seeds, onion, and garlic to combine. Set aside.",
    "Proof the yeast: In a small saucepan, gently warm 1¼ cups water over low heat until lukewarm. Pour the water into a bowl and whisk in the yeast and 2 tablespoons barley malt syrup. Let sit until foamy, about 5 minutes.",
    "Mix the dough: In a stand mixer with dough hook (or by hand), combine flours and salt. Make a well in the center and pour in the yeast mixture. Mix until a shaggy dough forms. Knead until smooth and stiff, 8–10 minutes. Add more flour as needed.",
    "Mix in seeds and proof: Add the seed mixture to the dough and mix until evenly distributed. Dust with flour, place in a bowl, cover, and let rise until nearly doubled, 1–1½ hours.",
    "Prepare baking sheets with cornmeal.",
    "Form bagels: Punch down dough, divide into 9 pieces (about 4 oz each), shape into rings, place on baking sheets, and cover. Refrigerate overnight.",
    "Float test: Test if bagels float in room-temp water. If not, let rise at room temp until they do. Then refrigerate until ready to cook.",
    "Preheat oven to 475°F. Boil water with barley malt syrup until the color of black tea. Set up ice water bath and wire rack.",
    "Boil bagels 30 seconds per side, then chill in ice bath. Transfer to wire rack.",
    "Bake: Dust sheets again with cornmeal. Place bagels, sprinkle with flaky salt, and bake 15–20 minutes, rotating sheets halfway through. Cool on rack."
  ]
}