{
  "title": "A Little Bit of Everything Bagels",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 9",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "¼cup sesame seeds",
    "3tablespoons poppy seeds",
    "1½teaspoons caraway seeds, crushed under a heavy saucepan",
    "2tablespoons dried minced onion",
    "1tablespoon dried minced garlic",
    "1teaspoon active dry yeast (0.11 oz / 3g)",
    "2tablespoons barley malt syrup (1.5 oz / 43g), plus several tablespoons for boiling",
    "3¾cups bread flour (17.2 oz / 488g), plus more for kneading",
    "½cup rye flour (2.3 oz / 65g)",
    "1tablespoon Diamond Crystal kosher salt (0.32 oz / 9g)",
    "Coarse cornmeal, for dusting",
    "Flaky salt, for sprinkling the tops"
  ],
  "directions": [
    "Make the “everything” mixture: In a small bowl, toss the sesame seeds, poppy seeds, crushed carraway seeds, onion, and garlic to combine. Set aside.",
    "Proof the yeast: In a small saucepan, gently warm 1¼ cups water (10 oz / 283g) over low heat, swirling the pan, just until it’s lukewarm but not hot, about 105°F on an instant-read thermometer (you can do this in the microwave, too, but beware of overheating). Pour the water into a medium bowl and whisk in the yeast and 2 tablespoons of the barley malt syrup (1.5 oz / 43g) until both are dissolved. Let the mixture sit until it’s foamy, about 5 minutes.",
    "Mix the dough: In a stand mixer fitted with the dough hook attachment (or in a large bowl if making by hand), combine the bread flour, rye flour, and kosher salt. Make a well in the center and pour in the yeast mixture. Mix on low speed until a shaggy dough forms. Increase the speed to medium and continue to mix, scraping down the sides of the bowl as needed, until you have a very smooth, stiff dough, 8 to 10 minutes. (Alternatively, stir with a wooden spoon to bring the dough together and then knead by hand on a clean work surface). The dough should be tacky but not sticky, so add more flour a tablespoon at a time if needed to prevent sticking.",
    "Mix in the seeds and proof the dough: With the mixer on low, add the “everything” mixture to the bowl with the dough and mix until the seeds and spices are evenly distributed. (Alternatively, scatter the seeds across the dough and the work surface and knead until all the seeds are well incorporated.) If you’re having a hard time incorporating the seeds into the stiff dough, add a teaspoon of water to help the mixture work in and stick. Gather the dough into a ball and dust it all over with a bit more bread flour. Place the dough in a large clean bowl and cover with plastic wrap. Place it in a warm, draft-free spot and let the dough rise until it’s nearly doubled in size, 1 to 1½ hours.",
    "Prepare the baking sheets: Generously sprinkle two large rimmed baking sheets with cornmeal and set aside.",
    "Portion and form the bagels, then chill overnight: Use a fist to punch down the dough and knock out some of the gas that built up during the first rise. Turn the dough out onto a clean, unfloured surface and use a bench scraper to divide the dough into 9 pieces weighing about 4 ounces (113g) each. (If making the Bialy Variation, skip to this page.) Working with one piece of dough at a time and keeping the other pieces covered, roll it into a ball, flatten it slightly, then poke a thumb through the center and out the other side. Work and stretch the dough outward to widen the hole, maintaining an even thickness all the way around, until you have a ring measuring about 4 inches across. Place the ring on the surface and flatten it slightly with the heel of your hand, then place it on one of the prepared baking sheets and cover with plastic wrap. Repeat until you’ve formed all the pieces of dough into rings and spaced them out evenly across both baking sheets. Make sure the sheets are covered and transfer to the refrigerator to chill for at least 8 hours and up to 12.",
    "The next morning, do the float test: Fill a large, wide Dutch oven about halfway with room-temperature water. Remove one of the baking sheets from the refrigerator—the bagels will have puffed slightly. Uncover the sheet and gently transfer one of the bagels to the Dutch oven. If it floats, the bagels are ready to go. Gently pat the test bagel dry, return it to the baking sheet, cover, and place the baking sheet back in the refrigerator until ready to cook. However, if it doesn’t float, take the second baking sheet out of the refrigerator and let both sheets of bagels sit at room temperature, covered, until a test bagel floats (repeat the test every 15 minutes). At that point, return the covered baking sheets to the refrigerator. Reserve the Dutch oven of water for boiling the bagels.",
    "Preheat the oven and prepare the boiling liquid: Arrange two oven racks in the upper and lower thirds of the oven and preheat to 475°F. Bring the reserved Dutch oven of water to a boil over high heat. Add barley malt syrup to the water a tablespoon at a time, stirring to dissolve, until the water is the color of strong black tea. Fill a large bowl with ice water and set it next to the boiling water along with a wire rack.",
    "Boil the bagels: Remove one baking sheet from the refrigerator and gently drop as many bagels into the boiling water as will comfortably fit. Boil for 30 seconds on the first side, then flip and boil for 30 seconds on the second side. Use a slotted spoon or spider to remove the bagels from the water and transfer them to the bowl of ice water. Turn the bagels a couple of times to cool them off, then transfer to the wire rack. Repeat until you’ve boiled all the bagels from both sheets and set them on the rack.",
    "Bake the bagels: Dust the same baking sheets with a bit more cornmeal to prevent sticking. Return the bagels to the baking sheets, spacing evenly. Sprinkle all the bagels with flaky salt and transfer to the oven. Bake until the bagels are deeply browned and shiny, 15 to 20 minutes, switching racks and rotating the sheets front to back after 10 minutes. Remove from the oven and let cool completely on the wire rack."
  ]
}