{
  "title": "A Very Olive-y Focaccia",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6 to 8",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "400grams (3 cups) bread flour",
    "1tablespoon plus 1⁄2 teaspoon kosher salt",
    "11⁄4 teaspoons instant yeast (I like Saf-instant brand)",
    "320grams (11⁄3 cups) room-temperature water",
    "1tablespoon olive oil, plus more for coating the bowl and pan and for topping the bread",
    "Unsalted butter, for greasing",
    "2tablespoons olive brine from the jar",
    "113grams (1 cup) whole pitted Castelvetrano olives",
    "Freshly cracked black pepper, for topping"
  ],
  "directions": [
    "1. Whisk the bread flour, salt, and yeast in a medium bowl. Add the water and olive oil, and mix until thoroughly combined. (I find using my hands is easiest.) The dough might look a little lumpy, but there shouldn’t be any dry pockets of flour. Scrape down the sides of the bowl.",
    "2. Cover the bowl with plastic wrap, and let the dough rest at room temperature for 45 minutes.",
    "3. Using damp hands, stretch and fold the dough: Gently pick up the north side of the dough, stretching it until you feel resistance, and then fold it over to the south side of the bowl. Rotate the bowl 90 degrees, and repeat three times, until four sides have been stretched and folded.",
    "4. Cover, let rest for another 45 minutes, and then repeat the folding process from step 3.",
    "5. Heavily grease a large bowl with olive oil, and transfer the dough to the bowl. Flip the dough over so it’s all coated in oil.",
    "6. Cover with plastic wrap, and place the dough in the refrigerator for at least 12 hours or up to 2 days.",
    "7. When you are ready to bake, remove the dough from the refrigerator. Lightly butter (about 1 tablespoon) and heavily oil (about 2 tablespoons) a 12-inch (30 cm) cast-iron pan.",
    "8. Spray a clean work surface with water, and transfer the dough to the damp surface.",
    "9. With damp hands, shape the dough by folding the side of the dough closest to you up to the center, bringing the left and right sides of the dough in toward each other, and then folding the farthest side of the dough toward you. Flip the end closest to you all the way over so that the bottom of the dough is now the top. Using cupped hands and working in a circular motion, shape the dough into a uniform ball.",
    "10. Transfer the dough to the cast-iron pan. Drizzle the top with a touch of olive oil.",
    "11. Cover with plastic wrap, and let rest at room temperature for 1 hour.",
    "12. Preheat the oven to 500°F (260°C) with a rack positioned in the lower third. Continue to let the dough rest as the oven preheats.",
    "13. When the oven is hot, using oiled hands, dimple and press out the dough to fill the pan. Pour the olive brine all over the top of the dough, and generously drizzle with more olive oil. Arrange the olives across the dough, and gently press them into the dough. Add a few cracks of pepper.",
    "14. Bake for 25 to 30 minutes, rotating halfway through the cooking time, until deeply golden. Let cool in the pan for 5 minutes.",
    "15. Using a spatula, carefully transfer the focaccia to a wire rack to help preserve the crunchy bottom crust. Serve warm. Keep any cooled leftovers wrapped in plastic or a ziplock bag, and store at room temperature for up to 3 days."
  ]
}