{
  "title": "Abbacchio al Forno con le Patate",
  "source": "My Kitchen in Rome - Rachel Roddy",
  "servings": "Serves 4",
  "categories": [
    "Italian",
    "My Kitchen in Rome - Rachel Roddy"
  ],
  "ingredients": [
    "4½pounds whole young leg of lamb",
    "3garlic cloves",
    "several sprigs of fresh rosemary",
    "a slice of lard or 4–6 tablespoons extra-virgin olive oil",
    "salt and freshly ground black pepper",
    "2¼pounds potatoes"
  ],
  "directions": [
    "In Rome, they slash the leg of lamb deeply, without cutting through it entirely, to create thick slices. If I have a larger leg, though, I simply make tiny slashes. Place the lamb in a roasting pan large enough to accommodate it with the potatoes. Slice the garlic and break the rosemary into small sprigs. Rub your hands with lard or olive oil, then massage the lamb generously, inserting the slivers of garlic and rosemary into the slashes as you go. By the time you’ve finished, the lamb should be glistening and scented with garlic and rosemary.",
    "Smear a little lard or oil on the base of the roasting pan, then place the lamb skin-side down in the pan. Season with salt and pepper and leave to rest for 30 minutes or so. Preheat the oven to 350°F.",
    "Cut the potatoes into quarters, rub them with lard or olive oil (hands are best for this), then arrange them around the lamb. Season the potatoes with a little salt. Slide the lamb into the oven. Cook for about 1 hour, basting every so often and turning the leg twice, or until the meat is very tender when prodded with a fork. Very young lamb might need less time and older lamb may need more. Some people like to pour a glass of white wine over the lamb halfway through the cooking time, although in this case I don’t, as it tends to make the potatoes soggy. Leave the meat to rest, covered loosely with aluminum foil, for at least 10 minutes, then serve in thick slices with a potato or two and a spoonful of the sticky juices from the bottom of the pan."
  ]
}