{
  "title": "Agnolotti dal Plin (Brisket and Caramelized Onion–Filled Pasta)",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 6 to 8 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Brisket Filling",
    "27g / 3 Tbsp salt, plus more q.b.",
    "1(912g / 2 lb) brisket, center cut with a moderate amount of fat",
    "56g / 4 Tbsp olive oil",
    "1.85kg / 5 or 6 onions, cut into ⅛-inch-thick slices",
    "2sprigs thyme",
    "474g / 2 cups water",
    "30g / ⅓ cup finely grated parmigiano-reggiano",
    "Whole nutmeg, q.b.",
    "To Finish",
    "1batch egg dough (this page)",
    "85g / 6 Tbsp unsalted butter, cold and cubed",
    "22g / ¼ cup finely grated parmigiano-reggiano",
    "Whole nutmeg, q.b."
  ],
  "directions": [
    "1 - To make the filling, salt the brisket on all sides and let sit to absorb for at least 1 hour or up to 24 hours in the refrigerator. (If you have refrigerated it, be sure to bring it to room temperature ahead of cooking.) Just before the brisket has sat long enough, preheat the oven to 275°F.",
    "2 - Pat the brisket dry with a paper towel to remove any excess moisture. Heat a large sauté pan over medium heat and add 42g / 3 Tbsp of the olive oil. Add the brisket, fat side down, and sear until the fat begins to melt and is golden brown, 4 to 5 minutes. Turn the brisket as needed to sear on all sides until golden brown, 4 to 5 minutes on each side. Transfer the brisket to a sheet pan.",
    "3 - Place half of the sliced onions on the bottom of a heavy sauce pot with a lid or a Dutch oven. Place the brisket on top of the onions and place the remaining onions on top of the brisket. Lay the thyme on top of the onions. Add the water, cover the pot with aluminum foil or parchment paper, and place the lid over the foil to seal it in place.",
    "4 - Transfer the pot to the oven and cook the brisket and onions until the meat easily pulls apart when tested with a fork, 5 to 6 hours. The onions will have “melted” and caramelized, creating a jus that will form the base of your sauce.",
    "5 - Place the meat grinder and small die in the refrigerator for at least 1 hour to chill. (You can speed the process by placing it in the freezer for 30 minutes instead.)",
    "6 - Remove the brisket from the oven, uncover, and, using a spoon, skim any excess fat that has risen to the top. Set aside in the pot until cool to the touch, about 20 minutes.",
    "7 - Transfer the brisket from the pot to a sheet pan. Strain the cooking liquid, reserving the solids (150g / ⅔ cup onions) and liquid (474g / 2 cups) separately. (Really squeeze the onions to ensure the liquid is separate.) Set both aside.",
    "8 - Pick the meat into small pieces, removing any fat. Fit your meat grinder with the small die and put the meat through the grinder. Then put the braised onions through the grinder.",
    "9 - Transfer the meat and onions to a bowl. Add the parmigiano and the remaining 14g / 1 Tbsp olive oil, season with grated nutmeg and salt q.b., and mix well. The mixture should taste well seasoned. Cover and refrigerate until ready to use. The filling is easier to work with at room temperature, so be sure to remove it from the refrigerator about 30 minutes before using.",
    "10 - To finish, following the instructions for agnolotti dal plin on this page, make 160 to 180 pieces with the pasta dough and filling.",
    "11 - Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "12 - Place a large sauté pan over low heat. Add the reserved braising liquid and butter and swirl to emulsify into a sauce. Keep on low, swirling occasionally.",
    "13 - Add the agnolotti to the water and turn down the heat to bring the water to a gentle simmer instead of a rolling boil. It is important to cook these gently at a simmer instead of a boil. Cook for 2 to 4 minutes, until tender at the thickest closure point.",
    "14 - Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Swirl the pasta in the sauce for 1 to 2 minutes to marry, using a spoon to gently turn the pasta over and coat all sides, until the sauce is almost gravy-like and begins to hug the pasta. If the sauce begins to tighten, add a splash of pasta cooking water and continue swirling to marry.",
    "15 - Divide into flat-bottomed bowls. Drizzle with the remaining sauce from the pan and garnish with the parmigiano and with grated nutmeg q.b."
  ]
}