{
  "title": "All-Purpose Chinese Steamed Bun Dough (Man Tou)",
  "source": "Thewoksoflife.com",
  "servings": "Serves: 10",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "4cups all purpose flour",
    "2teaspoons instant yeast",
    "2teaspoons baking powder",
    "2teaspoons sugar",
    "1 1/4cup lukewarm water"
  ],
  "directions": [
    "Mix the all purpose flour, instant yeast, baking powder, and sugar together in a large bowl. Add the water, and knead until it forms a smooth dough.",
    "Cover the dough with a cloth and let it rise for about 2 hours. Roll the dough ball into a log (the size depends on how large or small you want your man tou), and cut it into however many equal pieces you’d like.",
    "Arrange them in a metal steamer lined with cheese cloth (a bamboo steamer works also), about 2 inches apart. See our post on how to set up a steamer if you’re not familiar with steaming foods in Chinese cooking.",
    "Cover the steamer and let the buns rise for another 15 minutes. Turn on the heat to medium high and steam the buns for 20 minutes.",
    "Serve! To re-heat, just steam them again for about 5 minutes. Don’t be tempted to use the microwave, because they’ll dry out!",
    "That’s it! We’ll be referencing this recipe in the future, for other variations!",
    "Mix all the dry ingredients together in a large bowl. Add the water, and knead until it forms a smooth dough. Cover the dough with a cloth and let it rise for about 2 hours. Roll the dough ball into a log (the size depends on how large or small you want your man tou), and cut it into however many equal pieces you’d like.",
    "Arrange them in a steamer lined with cheese cloth, about 2 inches apart. Cover the steamer and let the buns rise for another 15 minutes. Turn on the heat to medium high and steam the buns for 20 minutes. Serve! To re-heat, just steam them again for about 5 minutes. Don’t be tempted to use the microwave, because they’ll dry out!"
  ]
}