{
  "title": "All Coconut Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 10",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Coconut Cake Layers",
    "Coconut oil for the pans",
    "3cups cake flour (12.7 oz / 360g)",
    "1tablespoon baking powder (0.42 oz / 12g)",
    "1½teaspoons Diamond Crystal kosher salt (0.16 oz / 5g)",
    "2sticks unsalted butter (8 oz / 227g), at room temperature",
    "3tablespoons virgin coconut oil (1.4 oz / 40g), at room temperature",
    "1¾cups granulated sugar (12.3 oz / 350g)",
    "4large eggs (7 oz / 200g), at room temperature",
    "2teaspoons vanilla extract",
    "1(13.5 oz / 383g) can unsweetened full-fat coconut milk, well shaken",
    "Assembly",
    "5ounces (142g) unsweetened large coconut flakes (about 2½ cups)",
    "Pastry Cream, Coconut Variation (this page)",
    "5ounces (142g) fresh coconut meat (this page)",
    "½recipe Classic Cream Cheese Frosting (this page)"
  ],
  "directions": [
    "Preheat the oven and prepare the pans: Arrange two oven racks in the upper and lower thirds of the oven and preheat to 350°F. Brush the bottoms and sides of the cake pans with melted coconut oil and line the bottoms with rounds of parchment paper, smoothing to eliminate air bubbles. Brush the parchment with more oil and set the pans aside.",
    "Mix the dry ingredients: In a large bowl, whisk together the flour, baking powder, and salt to combine. Set aside.",
    "Cream the butter, oil, and sugar: In a stand mixer fitted with the paddle attachment, combine the butter, coconut oil, and granulated sugar and beat on low until smooth. Increase the speed to medium-high and continue to beat, scraping down the sides once or twice, until the mixture is very light and fluffy, about 5 minutes.",
    "Add the eggs and vanilla: Reduce the mixer speed to medium and add the eggs one at a time, beating well after each addition. Beat on medium-high until the mixture is very light and thick, about 1 minute, then beat in the vanilla. Stop the mixer and scrape down the sides.",
    "Alternate the dry and wet ingredients: Add about one-third of the flour mixture and mix on low speed until the flour has almost disappeared. Add ½ cup (4.2 oz / 120g) of the coconut milk, mixing just until incorporated, then add the remaining flour in 2 additions, alternating with another ½ cup (4.2 oz / 120g) coconut milk (reserve the remaining coconut milk for soaking the layers). When the last traces of flour disappear, stop the mixer and remove the bowl. Use a flexible spatula to scrape down the sides and fold the batter several times to make sure it’s evenly mixed.",
    "Fill the pans and bake the layers: Divide the batter among the three pans (if you have a scale, weigh out 1 lb / 454g of batter per pan). Smooth the batter in an even layer all the way to the sides. Transfer the pans to the oven, placing two on the upper rack and one on the lower rack, staggering so the pan below doesn’t have another pan directly above it. Bake until the cakes are risen and just starting to pull away from the sides, the tops are lightly golden, and a cake tester or toothpick inserted into the centers comes out clean, 30 to 35 minutes, switching racks and rotating the pans front to back after 25 minutes.",
    "Cool the cakes: Remove the cakes from the oven and let cool completely in the pans. (Leave the oven on.)",
    "Prepare the coconut: While the cakes are cooling, spread the large coconut flakes on a small rimmed baking sheet and bake until the flakes are deep golden brown but still pale along one edge, about 5 minutes. Set aside to cool. If the fresh coconut is in large pieces, chop it up so the pieces are about the size of a quarter. Put it in the food processor and pulse, scraping down the sides, until it’s very finely chopped. Transfer to a small bowl and set aside (you should have about 1¼ cups).",
    "Split the layers: Use a small offset spatula or paring knife to cut around the sides of the pans to loosen the cakes. Invert them onto a wire rack, peel off the parchment, then reinvert onto a cardboard cake round or cutting board. The cakes should bake very flat so you won’t need to level them. You are, however, going to split the layers in half horizontally to make six thinner layers out of the three.",
    "Holding a serrated knife horizontally, mark the midway point around the side of a cake by making shallow score marks all the way around. Then, using long, even strokes and positioning the knife parallel to the work surface, follow the shallow cut as a guide all the way around the cake to slice it into two even layers. Lift the top layer off the cake and set aside. Repeat with the remaining layers so you have six total.",
    "Fill and stack the layers: Place a cake layer, cut-side up, on a cake round, serving plate, or cake stand and slide several strips of parchment partially underneath and all around the cake to cover and protect the plate or stand during frosting. Use a pastry brush to dab some of the reserved coconut milk across the surface of the cake to soak the layer. Using a small offset spatula, spread ½ cup of the pastry cream evenly over the top of the cake layer, leaving a ¼-inch border around the cake. Evenly sprinkle about ¼ cup (1 oz / 28g) of the chopped fresh coconut over the cream, then place another cake layer on top, making sure it’s positioned cut-side up and centered. Press gently to level, then brush with more coconut milk, spread with another ½ cup coconut pastry cream, and top with another ¼ cup fresh coconut. Repeat until you’ve soaked, stacked, and filled all the layers, placing the final layer cut-side down.",
    "Frost the cake: Use a small offset spatula to spread the cream cheese frosting around the top and sides of the stacked cake, smoothing the top. Press the cooled toasted coconut flakes into the sides and top of the cake so they adhere to the frosting.",
    "Serve: Slide the parchment strips out from underneath the cake before cutting into slices."
  ]
}