{
  "title": "All Allium Deep-Dish Quiche",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves: 8",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "Flaky All-Butter Pie Dough (this page)",
    "All-purpose flour, for rolling out and making a bit of paste for patching",
    "4large eggs (7 oz / 200g), at room temperature",
    "1medium yellow onion (8 oz / 227g), peeled and halved through the root end",
    "Neutral oil, such as vegetable or grapeseed, for brushing",
    "2tablespoons unsalted butter (1 oz / 28g)",
    "4ounces (113g) pancetta or bacon, chopped",
    "4garlic cloves, smashed and peeled",
    "5scallions, chopped",
    "1large shallot (2 oz / 57g), coarsely chopped",
    "1medium leek (10 oz / 283g), dark green tops discarded, white and light green stalk split lengthwise, rinsed, and chopped",
    "1½teaspoons Diamond Crystal kosher salt (0.16 oz / 5g), plus more as needed",
    "Freshly ground black pepper",
    "2teaspoons white wine vinegar",
    "2cups half-and-half (17 oz / 482g), at room temperature"
  ],
  "directions": [
    "Preheat the oven: Arrange an oven rack in the center position and preheat the oven to 425°F.",
    "Roll out the pastry and line the pan: Remove the pie dough from the refrigerator and let it sit at room temperature for about 5 minutes to soften slightly. Place the dough on a lightly floured surface and use a rolling pin to beat the dough all across the surface to make it more pliable. Dust the top and underside of the dough with more flour, then roll it out, dusting with more flour as needed to prevent sticking, into a 13-inch round. Slide the base of the springform pan underneath the dough round, centering it. Fold the edges of the dough inward, letting it overlap onto itself, so the entire pastry is sitting inside the metal base. Snap the outer ring into place around the base, then unfold the dough and press it firmly against the sides. The dough will fold onto itself in a few places, which is fine; just press firmly over the folds to even out the thickness all the way around. Transfer the pan to the freezer and chill until the pastry is very firm, about 10 minutes.",
    "Bake the crust: Remove the pan from the freezer, line the bottom and sides with a double layer of foil, and fill the pan with pie weights, dried beans, or rice. Place the pan on a foil-lined baking sheet and bake until the edges of the pastry are golden, 20 to 25 minutes. Remove the pan from the oven and carefully lift out the foil and weights. Reduce the oven temperature to 325°F (baking it again at this lower temperature minimizes shrinkage, helping to prevent cracks). Return the baking sheet to the oven and bake until the pastry is golden all over, 30 to 35 minutes longer. Remove from the oven and set aside. (Leave the oven on.)",
    "Patch, egg wash, and bake the crust again: In a small bowl, thoroughly mix a couple tablespoons of flour with a bit of water until you have a thick, smooth paste. Smear the paste into any cracks or crevices like it’s spackle to patch them, especially focusing on where the bottom meets the sides. Beat one of the eggs in a small bowl with a fork until streak-free, then brush the bottom and sides of the pastry with the egg (reserve the leftover egg for the filling). Return the baking sheet to the oven and bake just until the egg is set, about 5 minutes. Remove from the oven and set aside to cool. (Leave the oven on.)",
    "Make the decorative onion petals (optional): If skipping this step, coarsely chop the onion and proceed to the next step. Preheat a medium skillet (preferably cast-iron) over medium-high heat. Brush the cut sides of the onion with a bit of oil and place them in the pan oiled-side down. Cook the halves undisturbed until the inner layers of the onion have blackened all over (the outer layers will lift away from the skillet), about 5 minutes. Use a spatula to carefully remove the onion halves from the skillet. Transfer them to a cutting board to cool and remove the skillet from the heat but reserve it for the filling. When the onions are cool enough to handle, pull out the inner layers and separate them into “petals.” Set 7 or 8 petals aside, then chop the rest of the onion.",
    "Cook the allium mixture: Set the skillet over medium heat, add the butter, and heat until it’s melted and foamy, about 30 seconds. Add the pancetta and cook, stirring often, until the pieces are browned and crispy and the fat has rendered, about 4 minutes. Use a slotted spoon to transfer the crispy pancetta to a small bowl, leaving the fat in the skillet. To the skillet, add the garlic, scallions, shallot, leek, and chopped onion and cook, stirring often, until the onion is very soft and translucent and many of the bits are browned around the edges, 12 to 15 minutes. Season the mixture lightly with salt and a generous amount of black pepper, then stir in the vinegar. Remove the skillet from the heat and set aside to cool.",
    "Make the custard: In a blender (or in a bowl using a handheld blender or a whisk), combine the half-and-half, remaining 3 eggs, leftover beaten egg, and 1½ teaspoons salt and blend until completely smooth.",
    "Assemble the quiche: Scatter the allium mixture and pancetta across the surface of the crust, then slowly pour in the custard, filling as high as the crust will allow. Scatter the onion petals across the surface of the custard, making sure a little bit of custard fills the petals like a cup.",
    "Bake the quiche: Carefully transfer the quiche to the oven and bake until the center is just a bit wobbly when you shake the pan but looks set across the surface, 50 to 60 minutes. Remove from the oven and let the quiche cool completely in the pan.",
    "Slice and serve: Once the quiche is cool, remove the ring (if a bit of the custard leaked, slide a paring knife between the crust and the pan to loosen the quiche, then remove the ring). Cut into slices and serve."
  ]
}