{
  "title": "Almond Butter Banana Bread",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Makes 1 standard loaf",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 4½ × 8½-inch loaf pan, measured from the top",
    "Coconut oil for the pan",
    "3tablespoons plus ⅓ cup almond butter (4.6 oz / 130g) ①",
    "1tablespoon plus ⅔ cup sugar (5 oz / 143g)",
    "1teaspoon plus ½ cup virgin coconut oil (4 oz / 115g), gently warmed to liquefy ②",
    "1⅓cups all-purpose flour ③ (6.1 oz / 173g)",
    "1teaspoon baking powder (0.14 oz / 4g)",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "½teaspoon baking soda",
    "¼teaspoon ground cardamom",
    "2large eggs (3.5 oz / 100g), cold from the refrigerator",
    "1cup mashed banana (8 oz / 227g), from about 2 very ripe large bananas ④",
    "⅓cup plain whole-milk Greek yogurt (2.8 oz / 80g)",
    "1teaspoon vanilla extract",
    "½cup unsalted roasted almonds (optional), coarsely chopped (2.1 oz / 60g)"
  ],
  "directions": [
    "Preheat the oven and prepare the pan: Arrange an oven rack in the center position and preheat the oven to 350°F. Coat the bottom and sides of the loaf pan with coconut oil. Line the bottom and two longer sides with a piece of parchment paper, leaving an overhang of an inch or two on each side, and set the pan aside.",
    "Mix the almond butter swirl: In a small bowl, stir together 3 tablespoons of the almond butter, 1 tablespoon of the sugar, and 1 teaspoon of the coconut oil until smooth. Set the almond butter mixture aside.",
    "Mix the dry ingredients: In a large bowl, whisk together the flour, baking powder, salt, baking soda, and cardamom. Set aside.",
    "Mix the wet ingredients: In a medium bowl, whisk the eggs to break up the yolks and whites. Add the remaining ⅔ cup sugar (4.6 oz / 130g) and whisk vigorously until the mixture is smooth and slightly thickened, about 30 seconds. Add the mashed banana, Greek yogurt, vanilla, remaining ⅓ cup almond butter (2.9 oz / 83g), and ½ cup coconut oil (3.9 oz / 110g) and whisk vigorously until the mixture is smooth (some banana lumps are okay).",
    "Mix the wet ingredients into the dry: Pour the banana mixture into the bowl with the flour mixture and whisk gently just until you have a smooth batter with no dry spots. Add the almonds (if using) and fold the batter with a flexible spatula, scraping the bottom and sides of the bowl to make sure everything is well incorporated.",
    "Fill the pan and make the swirl topping: Scrape the batter into the prepared pan and smooth the top. Dollop teaspoons of the reserved almond butter mixture all across the top of the batter and then use a toothpick or the tip of a paring knife to drag figure eights across the surface, making a swirl pattern.",
    "Bake and cool: Bake until the top is risen and split and a cake tester or toothpick inserted into the center comes out clean, 60 to 70 minutes. Remove the banana bread from the oven and set aside to cool in the pan for at least 20 minutes, then use a paring knife or small offset spatula to cut between the cake and the pan along the shorter sides. Use the parchment paper to lift out the banana bread and let it cool completely on a wire rack before slicing. ⑤"
  ]
}