{
  "title": "American-Style Egg Rolls",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Servings: 12 egg rolls",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 12 ounces ground pork",
    "- 2 tablespoons lard, cut into 4 pieces, room temperature (optional)",
    "- 4 ounces shrimp (any size), peeled, deveined, tails removed, and coarsely chopped",
    "- 2 tablespoons soy sauce, divided",
    "- 4 teaspoons sugar, divided",
    "- 1 tablespoon oyster sauce",
    "- 1 tablespoon chicken bouillon powder",
    "- 1 1/2 teaspoons toasted sesame oil",
    "- 1 1/2 teaspoons Shaoxing wine",
    "- 1 1/2 teaspoons Chinese white rice vinegar",
    "- 1 teaspoon table salt",
    "- 1/2 teaspoon white pepper",
    "- 1/4 teaspoon five-spice powder",
    "- 1 teaspoon vegetable oil",
    "- 2 cups chopped green cabbage",
    "- 1 carrot, peeled and shredded",
    "- 1 1/2 ounces dried mung bean glass noodles",
    "- 12 (8-inch) square egg roll wrappers",
    "- 2 quarts peanut or vegetable oil for frying"
  ],
  "directions": [
    "1. Using a stand mixer fitted with paddle, beat pork and lard (if using) on medium speed until well combined and mixture has lightened in color, about 2 minutes. Reduce speed to medium-low and add shrimp, 1 tablespoon soy sauce, 1 tablespoon sugar, oyster sauce, bouillon powder, sesame oil, Shaoxing wine, vinegar, salt, pepper, and five-spice powder. Mix until just combined, about 30 seconds. Cover bowl with plastic wrap and refrigerate for 30 minutes.",
    "2. Heat an empty 14-inch flat-bottomed wok over high heat until just beginning to smoke. Reduce heat to medium-high, drizzle vegetable oil around perimeter of wok, and heat until just smoking. Add cabbage, carrot, remaining 1 tablespoon soy sauce, and remaining 1 teaspoon sugar. Cook, tossing slowly but constantly, until cabbage is just softened, about 2 minutes. Transfer vegetable mixture to a large plate, spread into an even layer, and refrigerate until cooled slightly, about 15 minutes.",
    "3. Meanwhile, soak noodles in 4 cups of hot water in a bowl for 15 minutes. Drain noodles and rinse under cold running water until chilled. Drain noodles again, then transfer to a cutting board and chop into rough 1-inch lengths. Return bowl with pork mixture to the mixer fitted with paddle. Add vegetable mixture and noodles and mix on low speed until well combined, about 1 minute.",
    "4. Fill a small bowl with water. Working with one wrapper at a time, arrange on the counter so one corner points toward the edge of the counter. Place rounded 1/4 cup filling on the lower half of the wrapper and mold it with your fingers into a neat 4-inch-long cylinder parallel to the edge of the counter. Dip your fingertip in water and moisten the entire border of the wrapper with a thin film of water.",
    "5. Fold the bottom corner of the wrapper over the filling and press gently along the length of the filling to remove air pockets. Fold side corners over to enclose the filling snugly; gently roll to form a tight cylinder and press edges to seal. Transfer egg roll seam side down to parchment paper-lined plate and cover with a damp paper towel while shaping remaining egg rolls. Stack egg rolls as needed, separating layers with additional parchment. (Egg rolls can be frozen until solid, then transferred to a zipper-lock bag and stored in the freezer for up to 1 month. Do not thaw before frying; increase frying time by 2 minutes.)",
    "6. Set a wire rack in a rimmed baking sheet and line the rack with a triple layer of paper towels. Add peanut oil to a clean, dry, 14-inch flat-bottomed wok or large Dutch oven until it measures about 1 1/2 inches deep. Heat over medium-high heat to 350 degrees. Using tongs, carefully add 6 egg rolls seam side down to hot oil and cook until deep golden brown, 4 to 8 minutes, flipping egg rolls halfway through frying. Adjust burner, if necessary, to maintain oil temperature between 325 and 350 degrees. Using tongs, transfer egg rolls to prepared rack and let drain. Return oil to 350 degrees and repeat with remaining 6 egg rolls; transfer to the prepared rack and let drain. Serve."
  ]
}