{
  "title": "Antipasto Salad with Pecorino-Pepperoncini Dressing",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Salad",
    "2romaine hearts, chopped into bite-size pieces (about 6 cups/325 g)",
    "1medium fennel bulb, halved and thinly sliced on a mandoline",
    "1⁄2 medium red onion, thinly sliced on a mandoline",
    "4large radishes, thinly sliced on a mandoline",
    "3mini seedless cucumbers, sliced into rounds",
    "Dressing",
    "1⁄2 cup (120 ml) extra virgin olive oil",
    "1⁄3 cup (35 g) finely grated pecorino Romano",
    "1⁄4 cup (60 ml) pepperoncini brine",
    "2tablespoons honey",
    "1tablespoon mayonnaise",
    "1tablespoon Dijon mustard",
    "1tablespoon red wine vinegar",
    "1teaspoon dried oregano",
    "1⁄2 teaspoon kosher salt",
    "1⁄4 teaspoon freshly cracked black pepper",
    "Toppings",
    "6Campari tomatoes, cut into quarters",
    "1⁄2 cup (110 g) sliced roasted red peppers",
    "1⁄2 cup (90 g) jarred quartered marinated artichokes in oil",
    "1⁄2 cup (75 g) halved and pitted mixed olives of choice",
    "3ounces (85 g) thinly sliced prosciutto",
    "3ounces (85 g) sliced mild provolone, chopped into bite-size pieces",
    "2ounces (57 g) hot or sweet soppressata, chopped into bite-size pieces",
    "1⁄4 cup (40 g) sliced pepperoncini",
    "1⁄4 cup (8 g) loosely packed torn fresh basil leaves"
  ],
  "directions": [
    "1. Make the salad: Place the romaine, fennel, and onion in an ice bath. Let sit for 5 minutes to crisp the lettuce and fennel and remove the onion’s astringency.2. Remove the vegetables from the ice bath and dry in a salad spinner, or lay out on a kitchen towel to dry completely. You don’t want a watery salad! Transfer to a large bowl along with the radishes and cucumbers. Set aside.3. Prepare the dressing: Add the olive oil, pecorino Romano, pepperoncini brine, honey, mayonnaise, mustard, vinegar, oregano, salt, and pepper to a jar, and shake until combined. Alternatively, whisk the ingredients in a small bowl.4. Add about half of the dressing to the lettuce mix, and toss to coat. Add more dressing as desired, and season with salt and pepper if needed. Transfer the salad to a large serving platter.5. Add the toppings: Top the salad with the tomatoes, peppers, artichokes, olives, prosciutto, provolone, soppressata, sliced pepperoncini, and basil. Serve any remaining dressing on the side for extra topping."
  ]
}