{
  "title": "Apple Cinnamon Sourdough",
  "source": "kneadylola.com",
  "servings": "Servings: 1 loaf",
  "categories": [
    "Sourdough"
  ],
  "ingredients": [
    "Levain Build",
    "25grams mature starter (100% hydration)",
    "25grams water (warm)",
    "25grams flour (whole wheat, or flour of your choice)",
    "Dough Build",
    "400grams bread flour (KAF Hi-Gluten Bread Flour)",
    "266grams water (warm)",
    "130grams apple (chopped)",
    "6grams cinnamon (cooked with apples)",
    "30grams brown sugar (cooked with apples)",
    "9grams sea salt",
    "80grams liquid levain"
  ],
  "directions": [
    "Build levain. Measure out and combine all levain ingredients (starter, water, flour). Stir well. Cover with a loose lid and let sit in a warm spot until risen, about four hours.",
    "About two hours before your levain is ready, start the autolyse. Combine all of the flour with 250 grams of water (reserve the remaining water). Mix well until all of the flour is fully hydrated. Cover and let rest in a warm spot with levain.",
    "Create apple mixture. Combine apples, cinnamon, and brown sugar in a small saucepan. Simmer over medium-low heat for 3-5 minutes or until apples are tender. Transfer mixture to a bowl and allow to come to room temperature.",
    "When levain is ready, add 80g to your autolysing dough. Add salt and remaining 16g of warm water. Mix well until fully combined, about 5 minutes. Cover and let rest for 30 minutes.",
    "Perform your first set of stretch & folds to incorporate the room temperature apple mixture. Cover and rest for 30 minutes.",
    "Perform your second set of stretch & folds. Cover and rest for 30 minutes.",
    "Perform your third set of stretch & folds. Cover and rest for 30 minutes.",
    "Perform your fourth set of stretch & folds. Cover and rest for 60 minutes.",
    "Perform your fifth and final set of folds. Rest untouched for the remainder of bulk (about two hours).",
    "Pre-shape your dough on a slightly wet work surface. Let dough bench rest, covered, for 30 minutes.",
    "Shape your dough. Place seam side up in a banneton that has been lightly dusted with rice flour. Let dough rest in the proofing basket for 20 minutes before covering and transferring to the fridge for an overnight cold retard.",
    "Retard dough for 12-18 hours at 38° F (3° C)",
    "Next day, preheat oven and baking vessel to 500° F (260° C) for one hour. Once ready to bake, remove your dough from the fridge. Turn out onto parchment paper and score. Transfer dough and parchment paper to baking vessel.",
    "Lower the oven temperature to 480° F (249° C) and bake covered for 20 minutes. Remove the lid, lower the oven to 450° F (232° C), and bake uncovered for an additional 25 minutes or until you have reached your desired crust color. Allow loaf to cool."
  ]
}