{
  "title": "Apple Tart",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 9-inch round or 14 x 4-inch rectangular removable-bottom tart pan, food processor, pastry bag, large cake icer or other pastry tip (optional)",
    "6medium Pink Lady or any sweet-tart, firm baking apples (about 2½ lb / 1.13kg)",
    "¼cup packed dark brown sugar (1.8 oz / 50g)",
    "6tablespoons unsalted butter (3 oz / 85g)",
    "Seeds scraped from ½ vanilla bean",
    "¼teaspoon Diamond Crystal kosher salt",
    "2½cups plus 4 tablespoons unfiltered unsweetened apple cider (22 oz / 624g)",
    "½recipe Rough Puff Pastry (this page) or 1 sheet thawed frozen store-bought puff pastry ①",
    "All-purpose flour, for rolling out",
    "1large egg, beaten",
    "Demerara sugar, for sprinkling the top",
    "½cup apricot jam (5.6 oz / 160g)"
  ],
  "directions": [
    "Cook the compote: Peel, halve, core, and coarsely chop 3 of the apples. In a medium saucepan, combine the brown sugar, 4 tablespoons of the butter (2 oz / 57g), the vanilla seeds, salt, and 1 tablespoon water (0.5 oz / 14g). Cook over medium-high heat, stirring often, until the sugar is dissolved and the mixture comes to a boil. Stop stirring and continue to cook, swirling the saucepan often, until the mixture is thick and the bubbles are large and slow to pop, about 2 minutes. Add the chopped apples and cook, stirring often and scraping the bottom of the saucepan with a wooden spoon or heatproof spatula to prevent scorching, until the apples are softened and starting to caramelize, 8 to 10 minutes. (If you are using particularly fresh or juicy apples, they may take quite a bit longer to take on color, but be patient and continue to cook until you see caramelization.)",
    "Reduce the compote: Slowly stir in 2½ cups of the apple cider (20 oz / 567g), taking care because the mixture will sputter, and return it to a boil. Reduce the heat to keep the cider at a vigorous simmer and cook until it is reduced by about half, 8 to 12 minutes. Crush the apples with a potato masher or the back of a wooden spoon and continue to cook, stirring and mashing often, until the mixture is reduced to a thick, coarsely textured, deep golden brown applesauce, 12 to 18 minutes. Continue to cook, stirring constantly to prevent scorching, until nearly all of the moisture has been driven off and you have a thick compote that doesn’t immediately cover the line left by the spoon as you drag it across the bottom of the pan, 5 to 8 minutes longer (you should have between 1½ and 1¾ cups). Remove from the heat and let cool slightly. Transfer the compote to a bowl or container and refrigerate until cold.",
    "Preheat the oven: Arrange an oven rack in the center position and preheat the oven to 425°F.",
    "Roll out the pastry: Let the pastry sit at room temperature for about 5 minutes to soften. Roll it out on a lightly floured surface, dusting the pastry with more flour as needed to prevent sticking, into a large ⅛-inch-thick rectangle. ② Trim along the 4 sides to create a clean rectangle measuring about 13 × 9 inches (a little longer or wider is fine). If using thawed frozen puff pastry, gently roll out the pastry on a lightly floured surface just to smooth creases and lengthen or widen as needed. Transfer the pastry to a parchment-lined rimmed baking sheet.",
    "Dock and egg wash the pastry: Leaving a 1-inch border around the edges, prick all across the surface of the pastry with the tines of a fork. Use a pastry brush to paint the 1-inch border of pastry with the beaten egg, then sprinkle the egg-washed area with a generous dusting of demerara sugar. Refrigerate the pastry while you slice the remaining apples.",
    "Slice the remaining apples: With the 3 remaining apples positioned upright and stem pointing skyward, cut down and around the cores to remove the flesh in 4 lobes (you’ll be left with a square-shaped core). Set the lobes flat-side down and slice lengthwise into thin slivers as evenly as possible, trying to keep the lobes together in their original shape.",
    "Assemble the tart: Remove the pastry and apple compote from the refrigerator and spread the compote in an even layer across the pastry and inside the sugared border. Working with one lobe at a time, fan out the apple slices and arrange them over the compote, tightly shingling (you may not use all of the apple slices). Melt the remaining 2 tablespoons butter and combine with 2 tablespoons cider. Use a pastry brush to dab the butter mixture over the apple slices.",
    "Bake the tart: Place the tart in the oven and reduce the temperature to 350°F. Bake the tart until the border is deeply browned and the apples are browned in spots, 40 to 55 minutes. Set the tart aside to cool.",
    "Glaze and serve the tart: In a small saucepan, combine the jam and remaining 2 tablespoons cider and bring to a simmer over medium-low heat, stirring to combine. Press the mixture through a fine-mesh sieve to remove any solids and then dab the jam mixture over the apples to glaze them. ③ Serve slightly warm or at room temperature."
  ]
}