{
  "title": "Apple Tarte Tatin",
  "source": "Modern Bistro - ATK",
  "servings": "Serves: 6 to 8",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "4Tablespoons Unsalted Butter, Cut into 1-Tablespoon Pieces, Divided",
    "5Gala or Golden Delicious Apples (6 to 7 Ounces Each), Peeled, Quartered, and Cored",
    "¼Teaspoon Table Salt",
    "¾Cup (5¼ Ounces) Sugar",
    "¼Cup Water",
    "2Tablespoons Light Corn Syrup",
    "1Recipe All-Butter Pie Dough, Rolled and Chilled"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 350 degrees. Melt 1 tablespoon butter in 10-inch ovensafe nonstick skillet over medium-low heat. Off heat, arrange apple quarters on their sides in melted butter in circular pattern around edge of skillet, nestling fruit snugly. Tuck remaining apples into center (it is not necessary to maintain circular pattern in center). Sprinkle salt over apples.",
    "2. Cover and cook over medium-low heat until apples have released enough juice to cover bottom of skillet and juice just begins to reduce, 10 to 15 minutes. Uncover and continue to cook until liquid has mostly evaporated, 3 to 5 minutes longer (apples may brown on undersides). Remove skillet from heat and set aside.",
    "3. Bring sugar, water, and corn syrup to boil in large heavy-bottomed saucepan over medium-high heat. Cook, without stirring, until mixture begins to turn straw-colored around edge of saucepan, 4 to 8 minutes. Reduce heat to medium-low and continue to cook, swirling saucepan occasionally, until mixture is light amber–colored and registers 355 to 360 degrees, 2 to 5 minutes longer. (To take temperature, remove saucepan from heat and tilt to 1 side; stir with thermometer to equalize hotter and cooler spots, avoiding bottom of saucepan.)",
    "4. Off heat, carefully stir in remaining 3 tablespoons butter (mixture will bubble and steam). Working quickly, pour caramel over apples (caramel will not completely cover apples). Carefully slide prepared dough over apples.",
    "5. Bake tart until thick, syrupy bubbles form around edge and crust is golden brown, 50 minutes to 1 hour. Transfer skillet to wire rack and let sit until cool enough to handle, 20 to 30 minutes.",
    "6. Run thin rubber spatula or plastic knife around edge of skillet to loosen tart. Invert large serving platter over skillet (make sure platter is larger than skillet and has sloped sides to catch excess caramel). Swiftly and carefully invert tart onto platter (if apples shift or stick to skillet, rearrange with spoon). Cut into wedges and serve warm or at room temperature."
  ]
}