{
  "title": "Apricot-Glazed Chicken With Chickpeas, Chorizo, And Spinach",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "¼cup apricot preserves",
    "2teaspoons grated lemon zest, plus lemon wedges for serving",
    "¾teaspoon table salt, divided",
    "½teaspoon pepper, divided",
    "4(12-ounce) bone-in split chicken breasts, trimmed and halved crosswise",
    "1tablespoon vegetable oil",
    "1(15-ounce) can chickpeas",
    "6ounces Spanish-style chorizo sausage, cut into ½-inch pieces",
    "1onion, chopped",
    "1½teaspoons smoked paprika",
    "8ounces (8 cups) baby spinach"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 450 degrees. Combine preserves, lemon zest, ⅛ teaspoon salt, and ⅛ teaspoon pepper in bowl; set aside. Pat chicken dry with paper towels and sprinkle with ½ teaspoon salt and ¼ teaspoon pepper.",
    "2. Heat oil in 12-inch ovensafe skillet over medium-high heat until just smoking. Place chicken skin side down in skillet and cook until well browned on first side, 5 to 7 minutes. Flip chicken and continue to cook until lightly browned on second side, about 3 minutes; transfer to plate.",
    "3. Off heat, combine chickpeas, chorizo, onion, paprika, remaining ⅛ teaspoon salt, and remaining ⅛ teaspoon pepper in now-empty skillet. Place chicken skin side up on top of chickpea mixture and brush with apricot mixture. Transfer skillet to oven and roast until chicken registers 160 degrees, 20 to 25 minutes.",
    "4. Using pot holders, remove skillet from oven. Transfer chicken to serving platter, tent with aluminum foil, and let rest while finishing chickpea mixture. Being careful of hot skillet handle, return skillet to medium-high heat. Add spinach, 1 handful at a time, and cook until wilted, about 2 minutes. Season with salt and pepper to taste. Transfer chickpea mixture to platter with chicken. Serve with lemon wedges."
  ]
}