{
  "title": "Arancine",
  "source": "The Food of Sicily - Fabrizia Lanza",
  "servings": "Makes 12 to 14 arancine",
  "categories": [
    "Italian",
    "The Food of Sicily - Fabrizia Lanza"
  ],
  "ingredients": [
    "For the Filling",
    "- 2 tablespoons olive oil",
    "- 1 small onion, finely chopped",
    "- 1 carrot, peeled and diced",
    "- 1 celery stalk, diced",
    "- 5 ounces (140 g) ground beef",
    "- 5 ounces (140 g) ground pork",
    "- 2 cups (480 ml) good-quality tomato sauce",
    "- ½ cup (75 g) frozen peas",
    "- 1 tablespoon estratto or tomato paste",
    "- ½ cup (120 ml) white wine",
    "- Fine sea salt and freshly ground black pepper",
    "For the Rice",
    "- 2 tablespoons olive oil",
    "- 1 small onion, finely chopped",
    "- 1½ cups (300 g) risotto rice (Carnaroli, Arborio, or Vialone Nano)",
    "- 2½ cups (600 ml) water",
    "- Pinch of saffron threads",
    "- 3 tablespoons grated Parmigiano-Reggiano cheese",
    "- Fine sea salt and freshly ground black pepper",
    "For the Coating",
    "- ¼ cup (30 g) all-purpose flour",
    "- 2 tablespoons water",
    "- 2 large eggs",
    "- 2⅓ cups (250 g) plain dried bread crumbs, plus more for dusting",
    "- Vegetable oil, for frying"
  ],
  "directions": [
    "1. Make the filling: Heat olive oil in a medium saucepan over medium-high heat. Sauté onion, carrot, and celery until softened, about 5 minutes. Add the meats and cook until browned, 6–8 minutes. Stir in tomato sauce and peas. Dissolve estratto in wine, then add to the pan. Reduce heat to medium-low and simmer until thickened, about 30 minutes. Season with salt and pepper. Let cool completely, at least 1 hour or overnight in the fridge.",
    "2. Cook the rice: In a medium saucepan, heat olive oil over medium. Sauté onion until softened, about 8 minutes. Stir in rice to coat. Add water and bring to a boil. Add saffron, stir, cover, and remove from heat. Let sit until tender and water is absorbed, about 20 minutes. Stir in cheese, season to taste, and spread on a sheet pan to cool.",
    "3. Prepare the coating: In a dish, whisk flour, water, and eggs until smooth. Spread bread crumbs in a second dish. Dust a baking sheet with bread crumbs. Keep a bowl of cold water nearby.",
    "4. Shape the arancine: With wet hands, scoop ¼ cup rice into your palm. Press to form a hollow center. Add 1 tablespoon filling and close rice around it. Shape into a ball the size of a small orange. Roll in egg mixture, then bread crumbs. Place on the prepared pan. Repeat with remaining ingredients.",
    "5. Fry the arancine: Heat 2 inches of oil in a heavy pot over medium-high heat. Line a plate with paper towels. Fry arancine in batches until golden, about 3 minutes, turning and basting to cook evenly. Drain on the paper towels.",
    "6. Serve hot."
  ]
}