{
  "title": "Arroz Verde",
  "source": "Bricia Lopez, Javier Cabral - Asada: The Art of Mexican-Style Grilling",
  "servings": "Serves 4",
  "categories": [
    "Asada: The Art of Mexican-Style Grilling",
    "Mexican"
  ],
  "ingredients": [
    "1cup (185 g) jasmine rice",
    "2fresh poblano chiles, stems and seeds removed, cut in half",
    "1ear corn, husk on",
    "½medium white onion (3½ ounces/100 g), quartered",
    "4cloves garlic, peeled",
    "1cup (40 g) chopped fresh cilantro",
    "1tablespoon apple cider vinegar",
    "2tablespoons grapeseed oil",
    "¾cup + 2 tablespoons (210 ml) chicken broth",
    "1½teaspoons sea salt",
    "1serrano chile",
    ""
  ],
  "directions": [
    "Place the rice in a mixing bowl and cover with cool water. Swirl the rice in the water and mix around with your hands. Pour off the water and repeat three times or until the water is clear. Drain the rice.",
    "Start a charcoal or gas grill. The gas should be set to high. If using a pellet grill, preheat your grill to 425°F (220°C) for at least 15 minutes. If using charcoal, the coals should be red but entirely covered with gray ash.",
    "Place the poblanos, corn, and onion directly on the grill. Grill for about 8 minutes, flipping once, until charred. Remove to a plate.",
    "Shuck the ear of corn and shave off the kernels. Set aside. In a blender or food processor, puree the charred poblanos, onion, and garlic with the cilantro, ¼ cup (60 ml) water, and the vinegar until smooth.",
    "In a large sauté pan with a tight-fitting lid, heat the oil over medium heat. When hot, add the rice, corn kernels. Cook, stirring regularly until the rice grains become translucent. This takes about 4 to 5 minutes.",
    "Stir the pureed poblano mixture into the vegetable mixture. Cook until the liquid is semi-reduced, about 1 to 2 minutes.",
    "Pour in the broth and stir thoroughly. Bring to a boil. Top with chile, cover, and cook over the lowest heat setting for 15 minutes. Remove from the heat and let stand for about 5 minutes. Fluff the rice with a fork and turn off the heat. Cover and let rest for 15 more minutes.",
    "Uncover and allow to cool for about 15 minutes. This will allow the rice to achieve the perfect fluff."
  ]
}