{
  "title": "Arroz con Pollo",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "6garlic cloves, minced",
    "5teaspoons distilled white vinegar, divided",
    "1½teaspoons minced fresh oregano or ½ teaspoon dried",
    "1¾teaspoons table salt, divided",
    "½teaspoon pepper",
    "4pounds bone-in chicken thighs, trimmed",
    "2tablespoons extra-virgin olive oil, divided",
    "1onion, chopped fine",
    "1small green bell pepper, stemmed, seeded, and chopped fine",
    "¼teaspoon red pepper flakes",
    "¼cup minced fresh cilantro, divided",
    "1¾cups chicken broth",
    "1(8-ounce) can tomato sauce",
    "¼cup water, plus extra as needed",
    "3cups medium-grain white rice",
    "½cup pitted green Manzanilla olives, halved",
    "1tablespoon capers, rinsed",
    "½cup jarred whole pimentos, cut into 2 by ¼-inch strips",
    "Lemon wedges"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 350 degrees. Combine garlic, 1 tablespoon vinegar, oregano, 1 teaspoon salt, and pepper in large bowl. Add chicken, toss to coat, and cover; let sit at room temperature for 15 minutes.",
    "2. While chicken marinates, heat 1 tablespoon oil in Dutch oven over medium heat until shimmering. Add onion and bell pepper and cook until softened, 5 to 7 minutes. Stir in pepper flakes and cook until fragrant, about 30 seconds. Stir in 2 tablespoons cilantro.",
    "3. Push vegetables to side of pot and increase heat to medium-high. Add chicken, skin side down, to cleared area of pot and brown lightly, 2 to 4 minutes per side, reducing heat if chicken begins to burn. Stir in broth, tomato sauce, and water and bring to simmer. Cover, reduce heat to medium-low, and simmer for 20 minutes.",
    "4. Stir in rice, olives, capers, and remaining ¾ teaspoon salt and bring to simmer. Cover, transfer pot to oven, and cook, stirring often, until chicken registers 175 degrees, rice is tender, and liquid has been absorbed, about 30 minutes. (If pot appears dry and begins to scorch after 20 minutes, stir in additional ¼ cup water.)",
    "5. Remove pot from oven and transfer chicken to cutting board; cover pot and set aside. Let chicken cool slightly, then shred chicken into large chunks using 2 soupspoons; discard skin and bones. Toss chicken chunks, pimentos, remaining 2 teaspoons vinegar, remaining 1 tablespoon oil, and remaining 2 tablespoons cilantro in clean bowl and season with salt and pepper to taste.",
    "6. Place chicken on top of rice, cover, and let stand until warmed through, about 5 minutes. Serve with lemon wedges."
  ]
}