{
  "title": "Artichoke And Parmesan Galette",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 6 to 8 servings for a light meal",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "crust",
    "1¼cups (165 grams) all-purpose flour, plus more for your work surface",
    "¼teaspoon fine sea or table salt",
    "¼cup (35 grams) finely grated Parmesan",
    "½cup (4 ounces or 115 grams) unsalted butter, cut into pieces",
    "2tablespoons (30 grams) sour cream",
    "2teaspoons (10 ml) fresh lemon juice (from about ¼ of a juicy lemon)",
    "¼cup (60 ml) very cold water",
    "Nonstick cooking spray or spray oil for coating pan",
    "filling",
    "Two 14-ounce (400-gram) cans artichoke hearts, drained very well, then patted out on towels (2⅓ cups drained)",
    "2large eggs",
    "¼cup (50 grams) mayonnaise",
    "¼cup (60 grams) sour cream",
    "½cup (120 ml) milk",
    "Finely grated zest and juice of ½ lemon",
    "1garlic clove, minced",
    "½teaspoon kosher salt",
    "Freshly ground black pepper",
    "½cup (65 grams) plus 2 tablespoons (15 grams) finely grated Parmesan",
    "2tablespoons chopped fresh flat-leaf parsley",
    "optional glaze",
    "1large egg yolk and a few drops of water"
  ],
  "directions": [
    "make the dough Stir the flour and salt together in a large bowl. Sprinkle the Parmesan and butter over this and, using a pastry blender or your fingertips, work it into the flour until the mixture resembles coarse meal, with the biggest pieces of butter the size of tiny peas. In a small bowl, stir together the sour cream, lemon juice, and water, and add this to the butter-flour mixture. With your fingertips or a wooden spoon, mix in the liquid until large clumps form. Pat the clumps into a ball. Wrap with plastic, and refrigerate for 1 hour, or up to 2 days.",
    "Heat the oven to 350 degrees. Coat a 9-inch cake pan, a standard pie dish, or a 9-inch pastry ring with nonstick spray, and place on a baking sheet.",
    "make the filling Roll out the crust, on a floured counter, into a roughly 12-inch round. Transfer it to the prepared baking dish, and let the extra dough drape over the sides.",
    "Drain the artichokes well, pressing out any extra liquid you can before spreading them out on a couple layers of paper towels for a few minutes, to remove as much moisture as possible. Cut them into thin slices, and place them in the bottom of the crust. Whisk together the eggs, mayo, sour cream, milk, lemon zest and juice, garlic, salt, pepper, and ½ cup of the grated Parmesan. Stir in the parsley. Pour the custard over the artichokes. Sprinkle with the remaining 2 tablespoons Parmesan. Gently lift the sides of the dough up over the custard filling, and pinch them together—you’re going to want to do this in the air, hovering over the filling, not by pressing down on it, of course, because the filling is primarily liquid. Let the creased dough edges gently, loosely rest on the surface of the tart. Repeat all around.",
    "finish and bake If desired, because it will add a deeper color and shine to the crust, whisk the yolk and water together, and gently brush over the surface of the crust. Bake for 35 to 40 minutes, until the eggs are set. If the top is not quite brown enough, run under broiler for 1 minute.",
    "Let the galette cool on a rack. Eat warm or at room temperature."
  ]
}