{
  "title": "Asparagus with Mint Pesto and Almonds",
  "source": "Pasta - Missy Robbins",
  "servings": "4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Pesto:",
    "50g / 2½ cups tightly packed mint leaves",
    "15g / ¾ cup tightly packed parsley leaves",
    "70g / 5 Tbsp olive oil, plus more q.b.",
    "22g / 3 Tbsp finely chopped raw almonds",
    "11g / 2 Tbsp finely grated pecorino romano",
    "11g / 2 Tbsp finely grated parmigiano-reggiano",
    "½clove garlic",
    "½tsp salt, plus more q.b.",
    "To Finish:",
    "900g / 2 lb asparagus (about 2 bunches)",
    "1lemon, cut in half and seeds removed",
    "Olive oil, q.b.",
    "Flaky sea salt, q.b.",
    "30g / ¼ cup finely chopped raw almonds",
    "28g / 1 oz pecorino romano",
    "5g / ¼ cup mint leaves"
  ],
  "directions": [
    "1. To make the pesto, bring a large pot of water to a boil over high heat. Generously salt the water. Set up a salted ice-water bath.2. Add the mint and parsley leaves to the boiling water and blanch for 10 to 15 seconds. This will help them retain their brightness.3. Using a spider, transfer the leaves to the ice-water bath to stop the cooking. Let them sit in the ice-water bath until thoroughly chilled, about 5 minutes. Otherwise, they may continue to oxidize when you process them, as blending introduces a little heat.4. Gather the leaves in your hands and squeeze out the water. Place them in a high-speed blender and puree until smooth, stopping and scraping down the blender jar to ensure they are well blended. (You may need to add a splash of water to get the blade moving.)5. Transfer the herb puree to a bowl. Add the oil, almonds, pecorino, and parmigiano. Using a Microplane, grate the garlic into the mixture. Add the salt and stir to combine. Check the seasoning and add more salt q.b. It should be loose enough to easily smother the asparagus. If needed, add olive oil to thin q.b.6. Measure out 64g / ¼ cup pesto. Cover with a thin layer of oil and set aside. Transfer the remaining pesto to an airtight container, cover with a thin layer of oil, and refrigerate for up to 3 days for another use.7. To finish, bring a large pot of water to a boil over high heat. Generously salt the water. Set up a salted ice-water bath.8. Cut off and discard the bottom 2 inches of each asparagus spear. Then, using a vegetable peeler, peel the bottom 4 inches of each spear.9. Add the asparagus to the boiling water and blanch for 45 seconds to 1 minute. The asparagus should still be firm and bright green.10. Using a spider, remove the asparagus from the water and immediately transfer to the ice-water bath to stop the cooking. Remove from the ice-water bath when completely cool and pat dry with a kitchen towel.11. Transfer the asparagus to a platter. Squeeze the juice from the lemon halves over the top. Drizzle with oil and sprinkle with sea salt q.b. Spoon the pesto in a wide strip across the middle of the asparagus. Garnish with the almonds, then shave the pecorino over the top and finish with the mint leaves."
  ]
}