{
  "title": "Authentic Baguettes at Home",
  "source": "Modern Bistro - ATK",
  "servings": "makes: four 15-inch-long baguettes",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "¼cup (1⅓ ounces) whole-wheat flour",
    "3cups (15 ounces) King Arthur all-purpose flour",
    "1½teaspoons salt",
    "1teaspoon instant or rapid-rise yeast",
    "1teaspoon diastatic malt powder (optional)",
    "1½cups (12 ounces) water",
    "2(16 by 12-inch) disposable aluminum roasting pans"
  ],
  "directions": [
    "1  Sift whole-wheat flour through fine-mesh strainer into bowl of stand mixer; discard bran remaining in strainer. Add all-purpose flour; salt; yeast; and malt powder, if using, to mixer bowl. Fit stand mixer with dough hook, add water, and knead on low speed until cohesive dough forms and no dry flour remains, 5 to 7 minutes. Transfer dough to lightly oiled large bowl, cover with plastic wrap, and let rest at room temperature for 30 minutes.",
    "2  Holding edge of dough with your fingertips, fold dough over itself by gently lifting and folding edge of dough toward center. Turn bowl 45 degrees; fold again. Turn bowl and fold dough 6 more times (total of 8 folds). Cover with plastic and let rise for 30 minutes. Repeat folding and rising every 30 minutes, 3 more times. After fourth set of folds, cover bowl tightly with plastic and refrigerate for at least 24 hours or up to 72 hours.",
    "3  Transfer dough to lightly floured counter, pat into 8-inch square (do not deflate), and divide in half. Return 1 piece of dough to container, wrap tightly with plastic, and refrigerate (dough can be shaped and baked anytime within 72-hour window). Divide remaining dough in half crosswise, transfer to lightly floured rimmed baking sheet, and cover loosely with plastic. Let rest for 45 minutes.",
    "4  (A) On lightly floured counter, roll each piece of dough into loose 3- to 4-inch-long cylinder; return to floured baking sheet and cover with plastic. Let rest at room temperature for 30 minutes.",
    "5  Lightly mist underside of couche with water, drape over inverted baking sheet, and dust with flour. Gently press 1 piece of dough into 6 by 4-inch rectangle on lightly floured counter, with long edge facing you. Fold upper quarter of dough toward center and press gently to seal. (B) Rotate dough 180 degrees and repeat folding step to form 8 by 2-inch rectangle.",
    "6  (C) Fold dough in half toward you, using thumb of your other hand to create crease along center of dough, sealing with heel of your hand as you work your way along the loaf. Without pressing down on loaf, use heel of your hand to reinforce seal (do not seal ends of loaf).",
    "7  (D) Hold your hand over center of dough and roll dough back and forth gently to tighten (it should form dog-bone shape).",
    "8  Starting at center of dough and working toward ends, gently and evenly roll and stretch dough until it measures 15 inches long by 1¼ inches wide. (E) Moving your hands in opposite directions, use back-and-forth motion to roll ends of loaf under your palms to form sharp points.",
    "9  Transfer dough to floured couche, seam side up. (F) On either side of loaf, pinch edges of couche into pleat, then cover loosely with large plastic garbage bag.",
    "10  Repeat steps 4 through 9 with second piece of dough and place on opposite side of pleat. (G) Fold edges of couche over loaves to cover completely, then carefully place sheet inside bag, and tie or fold under to enclose.",
    "11  (H) Let stand until loaves have nearly doubled in size and dough springs back minimally when poked gently with your fingertip, 45 to 60 minutes. While bread rises, adjust oven rack to middle position, place baking stone on rack, and heat oven to 500 degrees.",
    "12  Line pizza peel with 16 by 12-inch piece of parchment paper with long edge perpendicular to handle. Unfold couche, pulling from ends to remove pleats. Gently pushing with side of flipping board, roll 1 loaf over, away from other loaf, so it is seam side down. Using your hand, hold long edge of flipping board between loaf and couche at 45-degree angle. (I) Then lift couche with your other hand and flip loaf seam side up onto board.",
    "13  (J) Invert loaf onto parchment-lined peel, seam side down, about 2 inches from long edge of parchment, then use flipping board to straighten loaf. Repeat with remaining loaf, leaving at least 3 inches between loaves.",
    "14  (K) Holding lame concave side up at 30-degree angle to loaf, make series of three 4-inch-long, ½-inch-deep slashes along length of loaf, using swift, fluid motion, overlapping each slash slightly. Repeat with second loaf.",
    "15  (L) Transfer loaves, on parchment, to baking stone, cover with stacked inverted disposable pans, and bake for 5 minutes. Carefully remove pans and bake until loaves are evenly browned, 12 to 15 minutes longer, rotating parchment halfway through baking. Transfer to cooling rack and let cool for at least 20 minutes before serving. Consume within 4 hours."
  ]
}