{
  "title": "B-fast Tacos with Charred Scallion Salsa & Fried Pepitas",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 10 scallions",
    "- 2 limes",
    "- 1 bunch cilantro",
    "DAIRY",
    "- 8 large eggs",
    "- 3 tablespoons butter",
    "PANTRY",
    "- Kosher salt",
    "- ⅓ cup plus 2 tablespoons extra-virgin olive oil",
    "- ½ cup raw pepitas",
    "- Hot sauce (your fave brand)",
    "- 8 small corn or flour tortillas"
  ],
  "directions": [
    "1. Do some prep:",
    "- Slice 10 scallions crosswise into ½-inch(ish)-long pieces.- Cut 1 lime in half (for the salsa) and another one into quarters for serving.- Finely chop the leaves and tender stems from 1 bunch cilantro. Transfer to a medium bowl.- Crack 8 eggs into a medium bowl. Season with 1 teaspoon salt and vigorously whisk until no white streaks remain.",
    "2. Fry the pepitas: Combine 2 tablespoons olive oil and ½ cup raw pepitas in a large nonstick skillet and cook over medium heat, swirling and stirring occasionally, until golden brown and you hear crackling and popping, 5 to 6 minutes. Remove from the heat. Using a slotted spoon, transfer the pepitas to a small bowl, leaving whatever oil remains in the pan. Season the pepitas with salt.",
    "3. Make the charred scallion salsa:",
    "- Add the scallions to the skillet and return it to medium heat. Cook, turning the scallions occasionally, until they are charred all over and softened, 6 to 8 minutes. Transfer to the bowl of chopped cilantro. Reserve that skillet once more.",
    "- Stir ⅓ cup olive oil, the juice of 1 lime, and a few dashes of hot sauce into the scallion mixture. Season with salt—it should be very flavorful.",
    "4. Warm the tortillas:",
    "- Place a tortilla directly over a gas burner set to medium heat. Cook, flipping halfway through, until charred around the edges, about 1 minute total. If using an electric burner, heat a large cast-iron skillet over medium and cook the tortilla in the skillet until warmed through, about 30 seconds per side. Wrap the tortilla in a towel and repeat with the remaining tortillas. Keep cozy until ready to serve.",
    "5. Scramble the eggs: Wipe out the skillet. Add 3 tablespoons butter and melt it over medium-high heat. Add the eggs and cook, undisturbed, until a thin layer of cooked egg appears around the edge of the skillet, about 30 seconds. Using a rubber spatula in a figure-eight motion, stir the eggs gently, making sure all areas of the skillet get equal spatula play, and cook until fluffy and just barely set, about 2 minutes.",
    "6. Serve: Top each tortilla with some scrambled eggs, scallion salsa, and pepitas. Serve with the remaining salsa, the lime wedges, and hot sauce."
  ]
}