{
  "title": "BA's Best Chocolate Chip Cookies",
  "source": "Bonappetit.com",
  "servings": "16",
  "categories": [
    "Cookies"
  ],
  "ingredients": [
    "1½cups (200 g) all-purpose flour (spooning into measuring cups, then leveling)",
    "1¼tsp. (4 g) Diamond Crystal or ¾ tsp. (4 g) Morton kosher salt",
    "¾tsp. (4 g) baking soda",
    "¾cup (1½ sticks; 169 g) unsalted butter, divided",
    "1cup (200 g) (packed) dark brown sugar",
    "¼cup (50 g) granulated sugar",
    "1large egg",
    "2large egg yolks",
    "2tsp. vanilla extract",
    "6oz. (170 g) bittersweet chocolate (60%–70% cacao), coarsely chopped, or semisweet chocolate chips"
  ],
  "directions": [
    "Place racks in upper and lower thirds of oven; preheat to 375°. Whisk flour, salt, and baking soda in a small bowl; set aside.",
    "Cook ½ cup (1 stick; 113 g) butter in a large saucepan over medium heat, swirling often and scraping bottom of pan with a heatproof rubber spatula, until butter foams, then browns, about 4 minutes. Transfer butter to a large heatproof bowl and let cool 1 minute. Cut remaining ¼ cup (½ stick; 56 g) butter into small pieces and add to brown butter (it should start to melt but not foam and sizzle, so test with one piece before adding the rest).",
    "Once butter is melted, add both sugars and whisk, breaking up any clumps, until sugar is incorporated and no lumps remain. Add egg and egg yolks and whisk until sugar dissolves and mixture is smooth, about 30 seconds. Whisk in vanilla. Using rubber spatula, fold reserved dry ingredients into butter mixture just until no dry spots remain, then fold in chocolate (the dough will be soft but should hold its shape once scooped; if it slumps or oozes after being scooped, stir dough back together several times and let rest 5–10 minutes until scoops hold their shape as the flour hydrates).",
    "Using a 1½-oz. scoop (3 Tbsp.), portion out 16 balls of dough and divide between 2 parchment-lined rimmed baking sheets. Bake cookies, rotating sheets if cookies are browning very unevenly (otherwise, just leave them alone), until deep golden brown and firm around the edges, 8–10 minutes. Let cool on baking sheets.",
    "Do Ahead: Cookies can be made 3 days ahead. Store airtight at room temperature."
  ]
}