{
  "title": "Babkallah",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 12",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "Dough",
    "½cup whole milk (4 oz / 113g)",
    "1(0.25 oz / 7g) envelope active dry yeast (about 2¼ teaspoons)",
    "⅓cup granulated sugar (2.3 oz / 66g)",
    "4large egg yolks (2.5 oz / 70g)",
    "1teaspoon vanilla extract",
    "3cups all-purpose flour (13.8 oz / 390g), plus more for kneading",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "1stick unsalted butter (4 oz / 113g), cut into ½-inch pieces, at room temperature, plus more for the bowl",
    "Filling and Assembly",
    "6ounces (170g) semisweet chocolate, finely chopped (about 1 cup)",
    "⅓cup packed light brown sugar (2.3 oz / 65g)",
    "1½teaspoons ground cinnamon",
    "Pinch of kosher salt",
    "4tablespoons unsalted butter (2 oz / 57g), melted and cooled",
    "1large egg, beaten",
    "Demerara sugar, for sprinkling the top"
  ],
  "directions": [
    "Proof the yeast: In a small saucepan, gently warm the milk over low heat, swirling the pan, just until it’s lukewarm but not hot, about 105°F on an instant-read thermometer (you can do this in the microwave, too, but beware of overheating). Pour the milk into a large bowl and whisk in the yeast to dissolve; let the mixture sit until it’s foamy, 5 to 10 minutes.",
    "Make the dough: To the yeast mixture, add the granulated sugar, egg yolks, and vanilla and whisk to combine. Add the flour, salt, and butter and mix with a wooden spoon until a shaggy dough forms. Turn the dough out onto a lightly floured surface and knead, adding a bit more flour as necessary to prevent sticking, until the dough is smooth, supple, and no longer shiny, 8 to 10 minutes (you can also do this in a stand mixer fitted with the dough hook; mix on medium speed for 5 to 8 minutes).",
    "Let the dough rise once: Butter the inside of a large clean bowl, then gather the dough into a ball and place it inside. Cover the bowl with plastic wrap and let it sit in a warm place until the dough has doubled in size, 1½ to 2½ hours, depending on the ambient temperature.",
    "Mix the filling: In a small bowl, toss the chocolate, brown sugar, cinnamon, and salt to combine.",
    "Fill the dough: Turn the dough out onto a clean work surface and divide it into 3 equal portions. Shape each portion into a rope measuring 12 inches long. Flatten each rope with the heel of your hand, then use a rolling pin to roll out each piece into a 12 × 6-inch rectangle (you shouldn’t need any flour to prevent sticking). Brush the surface of each rectangle with the melted butter and then sprinkle with the chocolate mixture, dividing it evenly among the 3 pieces and leaving a ½-inch border uncovered along one long edge of the dough. Starting on the opposite long side, roll up each rectangle to form a spiraled log and pinch along the length of the seams to seal.",
    "Assemble the braid: Place the logs seam-side down and side by side on a parchment-lined baking sheet. Pinch the logs together at one end and braid them. Then pinch the opposite ends together and tuck both ends underneath the braid. Cover the babkallah loosely with plastic wrap and set aside in a warm spot until it’s expanded to about 1½ times its original size, 1 to 2 hours.",
    "Preheat the oven: Arrange an oven rack in the center position and preheat the oven to 350°F.",
    "Bake: Brush the babkallah with the egg, then sprinkle generously with demerara sugar. Bake until the surface of the dough is deeply browned, 35 to 45 minutes. Let cool completely on a wire rack."
  ]
}