{
  "title": "Baked Kale Salad with Chili Quinoa",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Serves 4",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "¾cup quinoa, any type",
    "1bunch Lacinato kale (16 ounces), thinly sliced",
    "1head savoy cabbage (24 ounces), thinly sliced",
    "2tablespoons avocado oil",
    "Diamond Crystal kosher salt",
    "Freshly ground black pepper",
    "2tablespoons chili oil of choice (I prefer Calabrian chili oil or Brightland Ardor oil)",
    "Agrodolce",
    "1small red onion, thinly sliced",
    "Extra-virgin olive oil",
    "5 or 6fresh sage leaves",
    "1tablespoon fresh rosemary leaves",
    "¼cup honey",
    "¼cup red wine vinegar",
    "¼cup warm water"
  ],
  "directions": [
    "1. Equally stagger two racks in the oven and preheat it to 450°F. Line two sheet pans with parchment paper.",
    "2. Cook the quinoa according to the package directions and set aside.",
    "3. Spread the kale evenly on one of the lined sheet pans and the cabbage on the other pan. Drizzle both with the avocado oil, season with salt and a few cracks of black pepper, and mix to coat. Roast the cabbage on the bottom rack until charred on the edges and slightly crisp, 20 to 23 minutes. For the last 5 to 7 minutes of baking, add the kale to the top rack. Remove both pans from the oven and reduce the oven temperature to 375°F.",
    "4. Spread the quinoa on a sheet pan and drizzle the chili oil all over. Season with ¼ teaspoon salt and mix. Roast the quinoa on the top rack until it is golden and lightly crisp, 19 to 21 minutes, stirring halfway through.",
    "5. Meanwhile, make the agrodolce: Place the onion in a small heatproof bowl.",
    "6. Set a small saucepan over medium heat and add 1 tablespoon olive oil. Add the sage and rosemary and sizzle for 1 to 2 minutes.",
    "7. In a small bowl, whisk together the honey, vinegar, and water. Pour the honey-vinegar mixture into the pan, season with salt, and bring to a simmer. Let the mixture simmer for 2 to 3 minutes to thicken. Remove the sage and rosemary and pour the mixture over the red onion. Stir to combine.",
    "8. In a large bowl, mix together the kale and cabbage and dress with the red onion agrodolce. Pile generously into individual bowls and top each with the chili quinoa."
  ]
}