{
  "title": "Baked Ricotta Chicken",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "Bread Crumbs",
    "½cup panko bread crumbs",
    "1tablespoon extra-virgin olive oil",
    "⅛teaspoon salt",
    "⅛teaspoon pepper",
    "Chicken",
    "8ounces (1 cup) whole-milk ricotta cheese",
    "1½ounces Parmesan cheese, grated (¾ cup)",
    "1teaspoon dried oregano",
    "½teaspoon table salt, divided",
    "½teaspoon pepper, divided",
    "¼cup extra-virgin olive oil, divided",
    "4(6- to 8-ounce) boneless, skinless chicken breasts, trimmed",
    "1½cups jarred pasta sauce, divided",
    "2tablespoons coarsely chopped fresh basil"
  ],
  "directions": [
    "1. For the bread crumbs Combine all ingredients in bowl. Microwave until panko is light golden brown, 1 to 2 minutes, stirring occasionally; set aside.",
    "2. For the chicken Adjust oven rack to upper-middle position and heat oven to 425 degrees. Process ricotta, Parmesan, oregano, ¼ teaspoon salt, and ¼ teaspoon pepper in food processor until smooth, about 10 seconds. With processor running, slowly add 3 tablespoons oil until incorporated; transfer ricotta mixture to bowl and set aside.",
    "3. Pat chicken dry with paper towels and pound to uniform thickness. Season with remaining ¼ teaspoon salt and remaining ¼ teaspoon pepper. Heat remaining 1 tablespoon oil in 12-inch skillet over medium heat until shimmering. Cook chicken until browned on both sides, about 6 minutes.",
    "4. Evenly spread ¾ cup sauce in bottom of 13 by 9-inch baking dish. Transfer chicken to dish, shingling breasts in center of dish on top of sauce. Pour remaining ¾ cup sauce over chicken, then top each piece with ⅓ cup ricotta mixture. Sprinkle chicken evenly with panko mixture. Bake until chicken registers 160 degrees, about 15 minutes. Sprinkle with basil and serve."
  ]
}