{
  "title": "Bakery Style Pb & J Cookies",
  "source": "Buuckfarmsbakery.com",
  "servings": "Yield: 8 large cookies",
  "categories": [
    "Cookies"
  ],
  "ingredients": [
    "For the Strawberry Jam:",
    "1C Chopped Fresh Strawberries",
    "1/4C Sugar",
    "Juice of 1/2 of a Lemon",
    "1/4C Water + 2 tsp, divided",
    "2tsp Cornstarch",
    "For the Peanut Butter Cookies:",
    "1/2C (113 g) Salted Butter, at room temperature",
    "1/2C (135 g) Creamy Peanut Butter",
    "3/4C (170 g) Light Brown Sugar",
    "1/4C (55 g) Granulated Sugar",
    "1Lg Egg, at room temperature",
    "1tsp. Pure Vanilla Extract",
    "1 1/4C (190 g) All Purpose Flour",
    "1/2tsp Baking Soda",
    "1/2tsp Baking Powder",
    "1/2tsp Salt",
    "1/2C Chopped Peanuts + extra to sprinkle on top of cookies",
    "Corse Sugar for Rolling Dough"
  ],
  "directions": [
    "For the Strawberry Jam:",
    "Add the strawberries, sugar, lemon juice, and 1/4 C of water to a small-medium saucepan over medium heat.",
    "Cook down until the strawberries begin to release their juices and become soft and the sugar dissolves.",
    "Remove from heat and add to a food processor or blender and blend until smooth.",
    "Return the strawberry mixture to the saucepan over medium-low heat.",
    "In a separate small bowl, whisk the cornstarch and 2 tsp of water until smooth.",
    "Add the cornstarch slurry to the strawberry puree and bring to a simmer. Simmer for 3 minutes.",
    "Remove from heat and allow to cool completely. Jam will continue to thicken as it cools.",
    "For the Peanut Butter Cookies:",
    "In the bowl of a stand mixer with the paddle attachment, cream the butter, sugars, and peanut butter for 5 minutes. Scrape down the bottom and sides of the bowl as needed.",
    "Add the egg and vanilla and mix another 1 minute.",
    "Add the flour, baking soda, baking powder, and salt. Mix until the dry ingredients are just incorporated, making sure not to overmix. Stop the mixer when a few streaks of flour remain.",
    "Use a rubber spatula to stir in the chopped peanuts.",
    "Use a kitchen scale to measure the dough out into 3.5 oz scoops (about 4 TBSP of dough)",
    "Roll the dough into balls in your hands then roll in the corse sugar.",
    "Place the cookie dough onto a cookie sheet and use the back of a spoon to create a well in the center of each cookie. Fill each well with about 1 TBSP of strawberry jam. Sprinkle with chopped peanuts.",
    "Chill the dough for at least 30 minutes, up to overnight.",
    "When ready to bake, preheat the oven to 350 and line two cookie sheets with parchment paper.",
    "Bake 4 cookies per sheet leaving room for them to spread.",
    "Bake at 350 for 12 minutes.",
    "Allow cookies to sit on the hot cookie sheet for 4-5 minutes, then transfer to a cooling rack."
  ]
}