{
  "title": "Baked Oatmeal with Caramelized Pears and Vanilla Cream",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 6 portions",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "vanilla sugar",
    "½cup plus 2 tablespoons (125 grams) granulated sugar",
    "½vanilla bean",
    "pears",
    "2tablespoons (30 grams) unsalted butter",
    "3pears (preferably D’Anjou, Forelle, or firm Bartletts)",
    "1lemon",
    "oatmeal",
    "1cup (235 ml) milk",
    "1cup (235 ml) water",
    "2tablespoons (30 grams) unsalted butter",
    "2large eggs",
    "1½teaspoons coarse or kosher salt",
    "2teaspoons baking powder",
    "3cups (240 grams) rolled oats",
    "to finish",
    "1cup (235 ml) heavy cream or half-and-half",
    ""
  ],
  "directions": [
    "make the vanilla sugar Place the sugar in a small bowl. Split the vanilla bean, scrape the seeds into the sugar, and use your fingertips to distribute the seeds throughout; the abrasion helps release more flavor. Save the pod: there’s tons more flavor to be had, and we’re going to use it.",
    "Heat the oven to 400 degrees. While it’s heating, place butter in a 9-by-13-inch or equivalent-sized baking dish in the oven to let it melt.",
    "prepare the pears Finely grate the zest of half of your lemon and set it aside; you’ll use it later. Juice the whole lemon, you’ll use it now. Peel the pears, split them lengthwise, and remove cores and any thick-looking stems. Toss the pears with the lemon juice. Remove the baking dish with melted butter from the oven, and sprinkle ½ cup vanilla sugar into it. Arrange the pears, cut side down, over the sugar, and drizzle with any lemon juice left in bowl. Cover tightly with foil, and bake for 20 minutes. Then remove foil and bake another 10 minutes.",
    "while pears are baking Whisk the milk, water, butter, eggs, salt, and reserved zest together in a large bowl. Sprinkle the baking powder over these and stir to combine; add oats, and stir again.",
    "bake the oats Use a thin spatula to turn the pears over carefully, spooning as much sauce from the pan over the pears as they will hold. Reduce heat to 350 degrees. Dollop the oat mixture around the pears in the pan. Return the dish to the oven and bake for 20 to 25 minutes, or until the pears are soft and the oatmeal edges are golden brown.",
    "meanwhile, make vanilla cream Bring the cream, remaining 2 tablespoons vanilla sugar, and reserved empty vanilla bean pod to a simmer in a saucepan. Simmer 5 minutes, reducing to ¾ cup. Chill the mixture if you prefer cold cream on your hot oatmeal (i.e., if you’re me).",
    "to serve Scoop one pear half and its surrounding oatmeal into a bowl, and drizzle with 1 to 2 tablespoons vanilla cream. Refrigerate leftovers until needed, up to one week, warming one portion at a time."
  ]
}