{
  "title": "Baked Penne with Spinach, Artichokes, and Chicken",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "12ounces (3¾ cups) penne",
    "¼teaspoon table salt, plus salt for cooking pasta",
    "3tablespoons unsalted butter",
    "1onion, chopped fine",
    "3garlic cloves, minced",
    "3tablespoons all-purpose flour",
    "2½cups chicken broth",
    "1cup heavy cream",
    "18ounces frozen artichoke hearts, thawed, patted dry, and quartered",
    "10ounces frozen spinach, thawed, squeezed dry, and chopped fine",
    "10ounces mozzarella cheese, shredded (2½ cups), divided",
    "2ounces Parmesan cheese, grated (1 cup), divided",
    "2tablespoons lemon juice",
    "4cups shredded cooked chicken"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 450 degrees. Bring 4 quarts water to boil in large Dutch oven. Add pasta and 1 tablespoon salt and cook, stirring often, until nearly al dente. Drain pasta and set aside.",
    "2. Dry now-empty pot, add butter, and melt over medium heat. Add onion and salt and cook until softened, about 5 minutes. Stir in garlic and cook until fragrant, about 30 seconds. Stir in flour and cook for 1 minute. Slowly whisk in broth and cream, scraping up any browned bits and smoothing out any lumps, and bring to simmer. Stir in artichokes and spinach and continue to simmer until vegetables are heated through, about 1 minute.",
    "3. Stir in 1½ cups mozzarella and ½ cup Parmesan until melted. Off heat, stir in lemon juice and season with salt and pepper to taste. Fold in cooked pasta and shredded chicken, breaking up any clumps of pasta. Pour into 13 by 9-inch baking dish (or similar size casserole dish) and sprinkle with remaining 1 cup mozzarella and remaining ½ cup Parmesan. (Casserole can be assembled, cooled [add cheese topping when cool], covered with plastic wrap, and refrigerated for up to 2 days. To bake, remove plastic and cover with aluminum foil; bake in 450-degree oven until hot, about 20 minutes, then remove foil and bake until cheese is spotty brown, about 15 minutes.)",
    "4. Bake until bubbling around edges and cheese is spotty brown, 12 to 15 minutes. Let cool for 10 to 15 minutes before serving."
  ]
}