{
  "title": "Banana Coffee Cake",
  "source": "Thepalatablelife.com",
  "servings": "9 serving(s)",
  "categories": [
    "Cake"
  ],
  "ingredients": [
    "1/2cup butter (softened)",
    "1cup brown sugar",
    "1cup mashed bananas",
    "1/2cup greek yogurt (or sour cream)",
    "2eggs",
    "1tsp vanilla",
    "1 1/2cups flour (195 grams)",
    "1tsp baking powder",
    "1tsp cinnamon",
    "1/2tsp salt",
    "1/2cup butter (softened)",
    "1/2cup brown sugar",
    "1cup flour",
    "1tsp cinnamon",
    "caramel sauce",
    "1cup whipping cream",
    "1tbsp sugar (+ more for bananas)",
    "3-4bananas",
    "BANANA BREAD",
    "1/2cup butter softened",
    "1cup brown sugar",
    "1cup mashed bananas",
    "1/2cup greek yogurt or sour cream",
    "2eggs",
    "1tsp vanilla",
    "1 1/2cups flour 195 grams",
    "1tsp baking powder",
    "1tsp cinnamon",
    "1/2tsp salt",
    "COFFEE CAKE CRUMB TOPPING",
    "1/2cup butter softened",
    "1/2cup brown sugar",
    "1cup flour",
    "1tsp cinnamon",
    "TOPPING",
    "caramel sauce",
    "1cup whipping cream",
    "1tbsp sugar + more for bananas",
    "3-4bananas"
  ],
  "directions": [
    "Preheat the oven to 350 (F). Prepare an 8Ã—8\" pan by lining it with parchment paper or thoroughly greasing it.",
    "Combine the butter and brown sugar in a large bowl and mix until well combined, about 2 minutes. Add mashed bananas, greek yogurt, eggs, and vanilla and mix until just combined.",
    "Add flour, baking powder, cinnamon, and salt. Mix until just combined. Pour the batter into the prepared pan.",
    "For the coffee cake crumb, combine butter, brown sugar, flour, and cinnamon in a small bowl. The mixture should stick together, but should slightly crumble if you run it between your fingers. If it isn't crumbling, add 1 tsp additions of flour until it does crumble.",
    "Crumble the mixture evenly on top of the banana bread batter. Transfer to the oven and bake for 30-40 minutes, until a toothpick comes out clean.",
    "While the banana bread coffee cake slightly cools, prepare the toppings. Add the whipping cream and sugar to a bowl and whisk until soft peaks form.",
    "Just before serving, slice a banana in half, lengthwise. Sprinkle with a light layer of sugar. If you have a butane / creme brulee torch, use it to torch the sugar until it is just melted. If you don't have a torch, transfer the bananas to a baking sheet and place them in the oven with the broiler on high. Keep an eye on them and remove as soon as the sugar has melted.",
    "To plate, add a piece of the banana coffee cake, drizzle it with some caramel sauce, top with a scoop of whipped cream, and place the bruleed bananas on top. Enjoy!"
  ]
}