{
  "title": "Banana Bread Roll",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 9 to 10 servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "cake",
    "Oil, for the pan",
    "3large eggs",
    "⅓cup (65 grams) dark-brown sugar",
    "⅓cup (65 grams) granulated sugar",
    "⅔cup (150 grams) mashed very ripe bananas (from 1 to 1½ medium bananas)",
    "1teaspoon (5 ml) vanilla extract",
    "2teaspoons (10 ml) bourbon (optional)",
    "1teaspoon (5 grams) baking soda",
    "¾teaspoon ground cinnamon",
    "Freshly grated nutmeg",
    "A pinch of ground cloves",
    "¼teaspoon kosher salt",
    "¾cup (100 grams) all-purpose flour",
    "Powdered sugar",
    "filling",
    "8ounces (225 grams) cream cheese, at room temperature",
    "2tablespoons (30 grams) unsalted butter, at room temperature",
    "¾cup (90 grams) powdered sugar, plus more for sprinkling",
    "1teaspoon (5 ml) vanilla extract"
  ],
  "directions": [
    "Heat the oven to 350 degrees. Line a 10-by-15-inch rimmed baking pan with parchment paper, and lightly spray it with oil for extra insurance.",
    "make the batter Beat the eggs in a large bowl until foamy, then continue beating while slowly adding the sugars. Beat until very thick and cappuccino-colored, 5 to 10 minutes. Beat in the bananas, vanilla, and bourbon, if using. Sprinkle the baking soda, spices, and salt evenly over the batter, and beat to combine. Add the flour, and beat just until it disappears. Spread the batter into your prepared pan.",
    "bake the cake For 10 to 12 minutes, or until it’s lightly bronzed all over and it springs back when lightly touched. Definitely rotate this one halfway through, because a thin cake is far more harmed by uneven baking.",
    "prepare the cake for assembly Cool for 5 minutes on a rack, then run a knife around the edges to loosen the cake. Sprinkle the top of the cake lightly with powdered sugar. Place a second sheet of parchment paper, this one larger than the cake, over the powdered top, and a cooling rack facedown over it. Flip the cake out onto the now parchment-covered rack. Carefully peel away the parchment paper from the bottom. Lightly powder this side, too. Starting from a short side, roll the cake and remaining parchment together into a log, and rest it, seam side down (so it doesn’t unroll), on the rack to cool completely, for about 45 minutes.",
    "make the filling and assemble Meanwhile, beat the cream cheese, butter, ¾ cup powdered sugar, and vanilla together until light and fluffy. Carefully unroll the cake, and spread the top with cream-cheese filling. Slowly, carefully, reroll the cake with the frosting inside, and rest it, seam side down, on a serving platter.",
    "to serve You can serve it right away, but I think it slices better when it’s had a chance to cool and set up a little more in the fridge, if you have time to spare. (You can also freeze it at this point.)",
    "Before serving, sprinkle the top with additional powdered sugar, and cut the cake into slices."
  ]
}