{
  "title": "Banh Mi Roll / Baguette",
  "source": "Brian Lagerstrom",
  "servings": "6 Rolls",
  "categories": [
    "Bread"
  ],
  "ingredients": [
    "▪380g warm water",
    "▪12g 4tsp instant yeast",
    "▪22g sugar",
    "▪525g bread flour",
    "▪12g salt"
  ],
  "directions": [
    "Add ingredients to a stand mixer with dough hook attachment. Mix on high for 6-8 minutes until dough has formed a ball and clears sides of the bowl. Alternatively you can knead by hand until dough looks similar.",
    "Transfer to a bowl and round it into a ball by rotating it and tucking it as shown @2:10. Cover and allow to ferment at room temp for 60 min.",
    "The dough should have risen a lot. Punch it down to release some gas, then do a strength building fold as shown @2:34. Then tuck and round into a ball as you did before, cover, and let ferment on at room temp for another 60 minutes.",
    "The dough should have risen a lot again. Flour dough and work surface and divide it into 6 equal pieces (about 150g each). Preshape each piece into a ball as shown @3:13. Once preshaped into balls, cover with a damp towel to relax for 15-20 minutes.",
    "Shape baguettes as shown @3:56 and place into a baguette pan. If you don’t have a baguette pan, check out my beginner baguette video https://youtu.be/5FR__Gt0CSo  to see how to bake these using a sheet tray.",
    "Cover shaped baguettes with damp towel and proof for 45 min.",
    "Preheat oven to 400 with baking stone/steel on top rack and cast iron skillet on bottom rack.",
    "When baguettes are proofed and ready to bake, they should indent when you poke them, then slowly bounce back.",
    "Score diagonally across the top of each, see video @6:33. Spray top of loaves liberally with water then load into preheated oven on top of baking stone/steel. Pour boiling water into cast iron skillet on bottom rack and close oven door quickly to bake for 30-35mins. Loaves are done when toasty and golden brown.",
    "Brush with melted butter"
  ]
}