{
  "title": "Bánh Cuốn (Steamed Rice Rolls)",
  "source": "Bonappetit.com",
  "servings": "About 16",
  "categories": [
    "Vietnamese"
  ],
  "ingredients": [
    "½cup cornstarch",
    "½cup rice flour (preferably any Thai brand)",
    "½cup tapioca starch",
    "½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt",
    "2Tbsp. plus 1½ tsp. vegetable oil",
    "⅓cup (or more) fresh lime juice (2–3 limes)",
    "3Tbsp. (or more) sugar",
    "1Tbsp. (or more) unseasoned rice vinegar (optional)",
    "5Tbsp. (or more) fish sauce",
    "2–3green Thai or serrano chiles, depending on heat preference, thinly sliced",
    "2garlic cloves, finely chopped (optional)",
    "Vegetable oil (for pan and baking sheet)",
    "⅓cup pork floss",
    "2Tbsp. finely chopped cilantro",
    "⅓cup store-bought fried shallots"
  ],
  "directions": [
    "Whisk ½ cup cornstarch, ½ cup rice flour, ½ cup tapioca starch, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a medium bowl. Make a well in the center and pour in 2 Tbsp. plus 1½ tsp. vegetable oil and 3 cups water. Whisk until a smooth, thin batter forms. Cover and let sit at room temperature 30–45 minutes.",
    "Whisk ⅓ cup fresh lime juice, 3 Tbsp. sugar, 1 Tbsp. unseasoned rice vinegar (if using), and ⅔ cup lukewarm water in a small bowl until sugar is dissolved. Taste and add more lime juice, sugar, or vinegar as needed until sauce tastes balanced. Whisk in 5 Tbsp. fish sauce; taste and add up to 1 Tbsp. more fish sauce if needed to achieve a balance of sour, sweet, and salty. Stir in 2–3 green Thai or serrano chiles, depending on heat preference, thinly sliced, and 2 garlic cloves, finely chopped (if using).",
    "Place batter and a small bowl with some vegetable oil on one side of stove. Spread out a kitchen towel on a nearby surface and place an inverted baking sheet on top. (Be sure to use a sturdy baking sheet—you will be banging the skillet against it.) Lightly brush baking sheet with oil.",
    "Heat an 8\"-diameter nonstick skillet over medium-low; brush lightly with oil. (The skillet is hot enough when a flick of batter sizzles gently on contact.) Give batter a good stir and ladle a scant ¼-cupful into skillet. Working quickly, swirl pan to coat bottom evenly. Cover and cook until crepe is translucent, bubbling (or even ballooning), and gently sizzling, about 1 minute. Uncover and cook until edges are pulling away from skillet and crepe is turning opaque but surface still looks wet, about 1 minute more. Invert crepe onto baking sheet, banging skillet to release. (Finished crepe should look like a mostly smooth white sheet.) Lift crepe to smooth out any wrinkles if needed.",
    "Working quickly (be sure to roll crepe while still a bit slippery), fold up bottom inch of crepe. Fold in the sides, then roll up crepe from the bottom and press lightly to seal (it should have the shape of a stubby 3½\"-long cigar). Remember that imperfections are hidden once the crepe is rolled; hide ragged edges by folding them inward. Transfer to a platter. Repeat with more oil and remaining batter, adjusting heat as needed.",
    "Sprinkle ⅓ cup pork floss over rolls. Top with 2 Tbsp. finely chopped cilantro and ⅓ cup store-bought fried shallots. Drizzle some dipping sauce over; serve remaining dipping sauce alongside.Do ahead: Dipping sauce can be made 8 hours ahead; cover and store at room temperature. Rolls can be assembled 2 days ahead; cover and chill. Bring to room temperature or reheat in the microwave in 10-second bursts just until warmed through before serving."
  ]
}