{
  "title": "BBQ Baby Back Ribs",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 4 to 6",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "RIBS",
    "5tablespoons freshly ground black pepper",
    "¼cup kosher salt",
    "3tablespoons five-spice powder",
    "4racks baby back ribs, trimmed",
    "BBQ SAUCE",
    "3cups hoisin sauce",
    "¾cup rice vinegar",
    "½cup Squid Brand fish sauce",
    "¼cup plus 2 tablespoons low-sodium soy sauce",
    "1½cups granulated sugar",
    "4shallots, finely diced",
    "4garlic cloves, finely chopped",
    "3-inch piece of fresh ginger, peeled and finely grated",
    "1tablespoon five-spice powder",
    "FOR SERVING",
    "Crispy Garlic",
    "3scallions (green and pale green parts), thinly sliced",
    "½cup chopped fresh cilantro leaves"
  ],
  "directions": [
    "1. Preheat the oven to 300 degrees F.",
    "2. Combine the pepper, salt, and five-spice powder in a small bowl. Generously rub each rack of ribs on both sides with the mixture and wrap each rack in heavy-duty foil.",
    "3. Place the racks on a large baking sheet and cook in the oven for about 2½ hours, until tender. Remove the ribs from the oven and let cool completely, about 30 minutes.",
    "4. Prepare the BBQ sauce: Whisk together the hoisin, vinegar, fish sauce, and soy sauce in a medium bowl. Set aside.",
    "5. In a medium, heavy-bottomed saucepan, add the sugar in an even layer over the bottom and cook over medium-high heat, stirring until the sugar just begins to melt. Cook for about 8 minutes, without stirring, until it turns a deep amber color.",
    "6. Slowly (the mixture will bubble) add the hoisin mixture to the caramel and continue whisking until smooth. Whisk in the shallots, garlic, ginger, and five-spice powder and bring to a boil. Reduce the heat to medium-low and continue cooking, whisking occasionally, for 20 minutes. Remove from the heat and let cool for 10 minutes. The BBQ sauce can be made up to 5 days in advance and stored in a container with a lid in the refrigerator.",
    "7. Once the ribs are cool, cut them into individual ribs, transfer to a large baking sheet, and toss them with 1 cup of the BBQ sauce.",
    "8. Preheat a grill to high or a grill pan over high heat. Grill the ribs on each side until slightly charred, about 2 minutes per side, brushing with more of the glaze.",
    "9. Transfer the ribs to a large platter and garnish with crispy garlic, scallions, and cilantro. Serve with additional sauce on the side."
  ]
}