{
  "title": "Beef & Stout Pies",
  "source": "Complete Irish Pub Cookbook",
  "servings": "Serves 4",
  "categories": [
    "Complete Irish Pub Cookbook",
    "England/Ireland"
  ],
  "ingredients": [
    "3tablespoons all-purpose flour",
    "1teaspoon salt",
    "1/2teaspoon black pepper",
    "2pounds boneless chuck steak or eye of round steak, cut into 1-inch pieces",
    "Vegetable oil, for frying",
    "1 1/4cups meat stock",
    "1onion, coarsely chopped",
    "8ounces cremini mushrooms, stems discarded, caps quartered",
    "1tablespoon tomato paste",
    "2teaspoons chopped fresh thyme",
    "1cup stout",
    "1pound store-bought puff pastry",
    "1egg yolk, lightly beaten"
  ],
  "directions": [
    "1. Combine the flour, salt, and pepper in a bowl, then toss the beef in the mixture until evenly coated.",
    "2. Heat 3 tablespoons of oil in a large skillet over medium-high heat. Cook the beef, in batches, and transfer to a flameproof casserole dish. Deglaze the skillet with 1/4 cup of stock, and add the liquid to the casserole dish.",
    "3. Heat another 1–2 tablespoons of oil in the skillet and cook the onion and mushrooms for 6–7 minutes, until soft. Add to the casserole dish with the tomato paste, thyme, stout, and remaining stock. Heat the casserole dish over medium-high heat, bring to a boil, then simmer gently with the lid slightly askew for 1 1/2 hours. Check the seasoning.",
    "4. Drain the meat mixture in a strainer set over a bowl, reserving the liquid. Let rest until cool.",
    "5. Preheat the oven to 425°F. Put a baking sheet in the oven to heat.",
    "6. Divide the meat mixture among four individual 13/4-cup pie plates with a flat rim or ovenproof bowls. Pour in enough of the liquid to not quite cover the filling. Dampen the rims of the pie plates.",
    "7. Cut the pastry into quarters. Roll out each piece to about 1 inch bigger than the pie plates. From each quarter, cut a 1/2-inch strip and press it onto a dampened rim. Brush with egg yolk, then drape the pastry quarter on top, covering the strip. Trim, crimp the edges with a fork, and make three slashes down the middle. Decorate the tops with shapes cut from the trimmings. Brush with the remaining egg yolk.",
    "8. Place the pies on the preheated baking sheet and bake in the preheated oven for 20 minutes. Reduce the heat to 400°F and bake for an additional 5 minutes."
  ]
}