{
  "title": "Beef Rendang with Potato Puree and Garlic Kale",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 6 to 8",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "SHORT RIB BRAISE",
    "¼cup plus 2 tablespoons canola oil",
    "5pounds boneless beef short ribs, excess fat trimmed, patted dry",
    "Kosher salt",
    "2quarts homemade Chicken Stock or low-sodium canned chicken broth or stock",
    "2cans Chaokoh unsweetened coconut milk",
    "½cup lightly toasted coconut flakes (see Note), 1 tablespoon reserved for garnish",
    "2cinnamon sticks",
    "3whole star anise",
    "2whole cloves",
    "½cup Squid Brand fish sauce",
    "½cup palm sugar",
    "¼cup Tamarind Paste",
    "1batch (2 cups) Rendang Paste",
    "POTATO PUREE",
    "3pounds Yukon Gold potatoes, peeled and diced",
    "2tablespoons kosher salt",
    "¾cup (1½ sticks) unsalted butter, cut into pieces",
    "1cup heavy cream",
    "GARLIC KALE",
    "3tablespoons canola oil",
    "2garlic cloves, chopped",
    "1large bunch kale, washed and still slightly damp, ribs removed and coarsely chopped",
    "Kosher salt",
    "TO SERVE",
    "Cilantro leaves, for garnish",
    "Crispy Fried Shallots, for garnish",
    "Lime wedges",
    "Roti Dough"
  ],
  "directions": [
    "1. Preheat the oven to 300 degrees F. Heat ¼ cup of the oil in a large pot over high heat until the oil begins to shimmer. Add half of the short ribs, season with salt, and sear on both sides for about 2 minutes per side, until golden brown. Transfer to a baking sheet and repeat with the remaining oil and beef. Drain the oil from the pot and discard.",
    "2. Add the stock, coconut milk, and coconut flakes to the pot and bring to a boil. While the mixture is coming to a boil, put the cinnamon, star anise, and cloves in a small piece of cheesecloth and tie it to create a sachet and add it to the liquid. Once the liquid has come to a boil, return the beef to the pot, cover, and transfer to the oven. Cook the beef for about 2½ hours, until fork-tender (begin checking at about 2 hours).",
    "3. Once the beef is tender, transfer it to a large bowl and cover with foil to keep warm. Remove the sachet. Transfer broth to a large bowl. Wipe out the pot for use in the next step.",
    "4. Whisk together the fish sauce, palm sugar, and tamarind paste in a bowl until the sugar begins to dissolve. Heat 2 tablespoons of the oil in a large pot over high heat until it begins to shimmer. Add the Rendang paste and cook, stirring constantly, for about 10 minutes, until the color deepens and the rawness of the shallot and garlic has been cooked out. Add the fish sauce mixture and cook, stirring constantly, for about 5 minutes, until the pan is deglazed and the paste has thickened slightly.",
    "5. Whisk in the braising liquid until smooth. Bring the sauce to a boil over high heat and continue cooking, whisking often, for about 40 minutes, until the sauce is reduced by half.",
    "6. Make the potato puree: Put the potatoes into a large saucepan and cover by 2 inches with cold water. Add the salt. Bring to a boil over high heat and cook for about 25 minutes, until the potatoes are fork-tender. Drain the potatoes well, return to the pot, and cook over high heat for a minute to dry out the potatoes. Transfer the potatoes, in batches to a ricer and rice into a large bowl.",
    "7. While the potatoes are cooking, combine the butter and cream in a small saucepan and bring to a simmer over low heat. Cook until the butter is completely melted. Add the mixture to the potatoes and mix until combined. Taste for seasoning. Keep warm.",
    "8. Return the beef to the pot and cook until the beef is warmed through, about 5 minutes longer.",
    "9. Sauté the kale: Heat the oil in a large sauté pan over low heat, add the garlic, and cook for about 2 minutes, until soft. Raise the heat to high and add the kale in bunches until it begins to wilt. Then add more and continue cooking until the kale is soft and wilted but still green. Season with salt.",
    "10. Put the potato puree in the center of each plate and top with some of the kale. Put the beef on top of the kale and spoon the curry sauce over and around the beef. Garnish with cilantro, crispy shallots, and the reserved coconut flakes. Serve with lime wedges and roti on the side."
  ]
}