{
  "title": "Beefsteak Skirt Steak Salad With Blue Cheese And Parsley Basil Vinaigrette",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 4 servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "vinaigrette",
    "1large or 2 small garlic cloves",
    "1½cups (55 grams) packed coarsely chopped fresh basil leaves",
    "½cup (20 grams) packed fresh flat-leaf parsley leaves",
    "⅓cup (80 ml) olive oil",
    "1tablespoon (15 ml) plus 1 teaspoon (5 ml) white wine vinegar",
    "2teaspoons (10 grams) smooth Dijon mustard",
    "Salt and freshly ground black pepper",
    "A pinch of crushed red pepper flakes, to taste",
    "salad and assembly",
    "2 to 3cups (40 to 60 grams) mixed salad greens (optional)",
    "1½pounds (680 grams) beefsteak tomatoes, in thick half-moon slices",
    "½cup (4 ounces or 115 grams) thickly crumbled blue cheese",
    "½medium red onion, very thinly sliced",
    "1pound (455 grams) skirt steak, trimmed of excess fat if necessary, at room temperature",
    "1tablespoon (15 ml) olive oil"
  ],
  "directions": [
    "make the dressing In a blender or food processor, pulse the garlic, basil, and parsley together until they’re chopped as finely as you can get them. With the machine running, drizzle in the olive oil, then the vinegar and mustard, scraping down the sides as needed. Season with salt, black pepper, and red pepper flakes to taste.",
    "No machine? Mince the garlic and herbs as finely as you can with a knife, transfer them to a bowl, and, whisking the whole time, slowly drizzle in the olive oil and vinegar before seasoning with salt and peppers.",
    "make the salad If using salad greens, place them first on a platter. Arrange the tomatoes on top, fanned out and slightly overlapped. Scatter half of the blue cheese and onion over the tomatoes.",
    "Pat the steak dry, and season on both sides with ½ teaspoon salt and many grinds of black pepper.",
    "to cook the steak on the stove Heat your largest, heaviest skillet over medium-high to high heat, and add 1 tablespoon olive oil. When the oil is very hot, place the steak in the skillet, and do not move it for 5 minutes. Turn it once, and cook for another 3 minutes for medium-rare. If your steak is larger than your biggest skillet, cut it in half and cook it in two pieces.",
    "to cook the steak on a grill Prepare a hot charcoal or high-heat gas grill for cooking. Lightly oil the grill rack, and grill the steak, turning once, 4 to 6 minutes for medium-rare. If you’re using a gas grill, it’s best to keep the lid on while grilling, to prevent heat loss.",
    "to finish Transfer the steak to a cutting board, and cover it loosely with foil while it rests for 5 minutes. Thinly slice the steak on the diagonal, across the grain, and arrange over the tomatoes. Scatter with the remaining blue cheese and onion. Drizzle vinaigrette on top, or serve it on the side."
  ]
}