{
  "title": "Best Chicken Parmesan",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2(6- to 8-ounce) boneless, skinless chicken breasts, trimmed",
    "1teaspoon kosher salt, divided",
    "2ounces whole-milk mozzarella cheese, shredded (½ cup)",
    "2ounces fontina cheese, shredded (½ cup)",
    "1large egg",
    "1tablespoon all-purpose flour",
    "1½ounces Parmesan cheese, grated (¾ cup)",
    "½cup panko bread crumbs",
    "½teaspoon garlic powder",
    "¼teaspoon dried oregano",
    "¼teaspoon pepper",
    "⅓cup vegetable oil",
    "1cup Quick Tomato Sauce (this page), warmed",
    "¼cup torn fresh basil"
  ],
  "directions": [
    "1. Starting at thick end, cut each chicken breast in half horizontally. Pound cutlets to uniform ½-inch thickness. Pat chicken dry with paper towels. Sprinkle each side of each cutlet with ⅛ teaspoon salt and let stand at room temperature for 20 minutes. Combine mozzarella and fontina in bowl; set aside.",
    "2. Adjust oven rack 4 inches from broiler element and heat broiler. Whisk egg and flour in shallow dish until smooth. Combine Parmesan, panko, garlic powder, oregano, and pepper in second shallow dish. Pat chicken dry with paper towels. Working with 1 cutlet at a time, dredge cutlets in egg mixture, allowing excess to drip off. Coat all sides in Parmesan mixture, pressing gently so crumbs adhere. Transfer cutlets to rimmed baking sheet and let sit for 5 minutes.",
    "3. Heat oil in 10-inch nonstick skillet over medium-high heat until shimmering. Cook 2 cutlets until crispy and golden brown on both sides, 3 to 4 minutes. Transfer cutlets to paper towel–lined plate and repeat with remaining cutlets. (Cooked chicken can be frozen for up to 1 month. To reheat, place frozen cutlets on wire rack set in rimmed baking sheet, top with cheese, bake in 400-degree oven on middle rack until crisp and hot throughout, 20 to 30 minutes, and continue with step 5.)",
    "4. Place cutlets on rimmed baking sheet and sprinkle cheese mixture evenly over cutlets, covering as much surface area as possible. Broil until cheese is melted and beginning to brown, 2 to 4 minutes.",
    "5. Transfer chicken to platter and top each cutlet with 2 tablespoons sauce. Sprinkle with basil and serve immediately, passing remaining sauce separately."
  ]
}