{
  "title": "BL Double T",
  "source": "By Heart - Hailee Catalano",
  "servings": "Makes 4 Sandwiches",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Sandwich Assembly",
    "24ounces (680 g) thick-sliced pepper bacon",
    "8slices potato bread",
    "1medium head iceberg lettuce, leaves separated, cold",
    "3large heirloom tomatoes (about 2 pounds/907 g), in a variety of colors, sliced 1⁄2 inch (1 cm) thick",
    "Flake salt and freshly cracked black pepper, to taste",
    "Torn fresh dill fronds, to taste",
    "Toum",
    "1⁄2 cup (75 g) peeled garlic cloves",
    "3tablespoons fresh lemon juice (from about 1 lemon)",
    "2teaspoons kosher salt",
    "11⁄2 cups (360 ml) canola oil, divided",
    "2tablespoons ice-cold water"
  ],
  "directions": [
    "1. Preheat the oven to 425°F (220°C). Line a sheet tray with parchment paper, and place a wire rack on top.",
    "2. Lay out the bacon across the wire rack. Transfer to the oven, and bake for 25 to 35 minutes, until golden and crispy. Transfer the bacon to a paper towel to drain.",
    "3. While the bacon cooks, make the toum: Place the garlic, lemon juice, and kosher salt in a quart (1 L) container or similar high-sided container (see Note), and use an immersion blender to blend until smooth and creamy.",
    "4. With the immersion blender running, very slowly stream in 3⁄4 cup (180 ml) of the canola oil, drop by drop. With the blender still running, slowly stream in the water. Stop the blender, and scrape down the sides as needed.",
    "5. With the blender running, slowly stream in the remaining 3⁄4 cup (180 ml) oil. The final result should be emulsified, thick, and mayo-y. Place in the refrigerator until you’re ready to assemble your sandwich.",
    "6. Toast the potato bread until very lightly golden.",
    "7. Assemble the sandwiches: Spread a layer of toum on a slice of toast and top with 2 large lettuce leaves and 2 tomato slices. Season the tomato with flake salt and pepper. Add 3 slices of bacon (breaking them as needed to fit the bread), and top with a generous amount of fresh dill.",
    "8. Spread another layer of toum on a second slice of toast, and top off the sandwich. Cut in half.",
    "9. Repeat with the ingredients for the remaining three sandwiches, and serve. Store any leftover toum in an airtight container in the refrigerator for up to 2 weeks.",
    "NOTE. You can make the toum in a food processor, although this method tends to be a little less foolproof. If you end up with a broken, watery toum, remove three-fourths of the broken sauce from the food processor and add 1 egg white to the remaining sauce in the food processor. Process until smooth. With the processor running, slowly stream in the reserved broken toum, drop by drop, until thick and mayo-y."
  ]
}