{
  "title": "Blackberry Caramel Tart",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 9-inch removable-bottom tart pan, food processor (for the Sweet Tart Dough)",
    "⅔cup sugar (4.6 oz / 130g)",
    "2tablespoons light corn syrup (1.4 oz / 40g)",
    "⅓cup heavy cream (2.8 oz / 81g), at room temperature",
    "1teaspoon vanilla extract",
    "¼teaspoon Diamond Crystal kosher salt",
    "Sweet Tart Dough (this page), fully baked in a 9-inch removable-bottom tart pan and cooled ①",
    "18ounces (510g) blackberries (about 3½ cups), rinsed and thoroughly dried",
    "1teaspoon unflavored gelatin powder (0.11 oz / 3g)"
  ],
  "directions": [
    "Make the blackberry caramel: In a medium heavy-bottomed saucepan, combine the sugar, corn syrup, and 3 tablespoons water (1.5 oz / 43g). Cook over medium heat, stirring with a heatproof spatula until the sugar is dissolved. Bring the mixture to a boil and stop stirring. Brush down the sides of the pan with a wet pastry brush as needed to dissolve any sugar crystals. Continue to cook, swirling the pan occasionally, until the syrup turns a medium amber color, 6 to 8 minutes (I normally advise cooking caramel to a deep, dark amber, but you actually want to stop short of this point; a lighter caramel will allow the flavor of the berries to shine). ② Immediately remove the saucepan from the heat and slowly stream in the heavy cream, stirring with a heatproof spatula until smooth (take care because the mixture will sputter). Stir in the vanilla, salt, and 6 ounces of blackberries (170g / about 1¼ cups). Return the saucepan to medium heat and bring to a lively simmer. Cook, stirring often and mashing the berries against the side of the saucepan until they’re broken down and the mixture is slightly thickened, about 5 minutes. Remove from the heat and set aside to cool slightly.",
    "Arrange the berries: Place the tart pan on a serving plate and arrange the remaining 12 ounces whole blackberries (340g / about 2¼ cups) inside the tart crust, spacing them evenly. Set aside.",
    "Soften the gelatin: Place 2 tablespoons cold water (1 oz / 28g) in a small bowl and sprinkle the gelatin over the top (don’t stir). Set aside to allow the gelatin to soften, about 10 minutes.",
    "Strain the caramel: Set a fine-mesh sieve over a medium bowl and scrape in the caramel (reserve the saucepan—you’ll use it again in a minute). Press on the solids in the sieve with the spatula to extract as much juice and caramel as possible (discard the solids).",
    "Melt the gelatin: Scrape the softened gelatin mixture, which by this point will have solidified and turned translucent, into the same saucepan you used for the caramel and place the pan back over low heat. Warm the pan, swirling until the mixture is completely clear and liquified and you see no traces of small granules. It’s super important to make sure the gelatin is fully melted, otherwise it won’t set the tart, so take your time and pay close attention. ③ At the same time, don’t let the mixture come to a boil, as this could destroy the setting power of the gelatin!",
    "Add the gelatin and cool down the filling: Stir the melted gelatin into the strained caramel and mix thoroughly. Fill a larger bowl one-third full with ice water and set the bowl of caramel inside. Stir constantly, scraping the sides of the bowl, until the caramel is thickened to the consistency of heavy cream, about 3 minutes.",
    "Fill the tart and chill: Carefully and slowly pour the caramel into the crust, pouring in several places around the blackberries and allowing the caramel to settle and fill in the gaps. Use all the caramel, which should fill the tart and submerge the blackberries about halfway. Refrigerate the tart until the caramel is completely set, at least 2 hours. If chilling longer than 2 hours, cover with plastic wrap. Remove the tart from the ring and serve."
  ]
}