{
  "title": "Blackened Squash in Tomato Brown Butter",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Serves 4 to 6 as a side",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "1large kabocha squash (2 pounds), or 2 smaller squashes, such as delicata, acorn, or honeynut",
    "Extra-virgin olive oil",
    "Diamond Crystal kosher salt",
    "4tablespoons salted butter",
    "2tablespoons tomato paste",
    "2tablespoons white wine vinegar",
    "1tablespoon honey",
    "½teaspoon ground cumin",
    "1teaspoon caraway seeds, crushed",
    "¼teaspoon red pepper flakes",
    "Freshly ground black pepper",
    "½cup torn fresh dill"
  ],
  "directions": [
    "1. Equally stagger two racks in the oven and preheat it to 450°F.",
    "2. Halve the squash through the stem and pull out the seeds. If using delicata, halve lengthwise and pull out the seeds. Cut the squash into pieces: 1-inch-thick wedges for the kabocha and acorn; ½-inch-thick slices crosswise for the honeynut. Cut the delicata crosswise into ½-inch-thick half-moons. Spread the squash onto two unlined sheet pans, making sure each piece makes contact with the pan. Drizzle each pan with 2 tablespoons olive oil and season with a few generous pinches of salt. Mix to coat.",
    "3. Transfer the pans to the oven and roast until cooked through, 20 to 22 minutes.",
    "4. While the squash is roasting, set a medium pan over medium heat and add the butter and let it brown: At first it will fully melt, then begin to fizz and foam for 2 to 3 minutes, forming dark brown flecks at the bottom of the pan. When it’s a deep, amber brown color, after about 5 minutes, take the pan off the heat.",
    "5. In a small bowl, whisk together the tomato paste, vinegar, honey, cumin, caraway seeds, pepper flakes, ¼ teaspoon black pepper, and ¼ cup water. Pour this into the brown butter and cook over medium heat for another 1 to 2 minutes, letting the tomato butter reduce by half, getting thick and almost syrupy. Taste and season with salt, as needed.",
    "6. Pull the squash out of the oven, flip to reveal the charred brown undersides, and pour the tomato butter directly over the squash. Give a few gentle, big mixes to combine. The squash will be soft enough to break into pieces, which is fine and part of the appeal.",
    "7. Garnish with the dill before serving and eat warm."
  ]
}