{
  "title": "Blood Orange and Olive Oil Upside-Down Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8 to 10",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 10-inch springform pan ①",
    "Extra-virgin olive oil for the pan",
    "4medium blood oranges (about 1½ lb / 680g) ②",
    "1⅓cups sugar (9.3 oz / 263g)",
    "1⅓cups cake flour (5.5 oz / 156g)",
    "½cup semolina flour (2.8 oz / 82g)",
    "2teaspoons baking powder (0.28 oz / 8g)",
    "½teaspoon Diamond Crystal kosher salt",
    "3tablespoons Grand Marnier (1.5 oz / 43g)",
    "1tablespoon finely grated orange zest",
    "1teaspoon orange blossom water or vanilla extract",
    "3large eggs (5.3 oz / 150g)",
    "1¼cups extra-virgin olive oil (9.9 oz / 280g)",
    "Plain whole-milk yogurt, lightly sweetened, for serving"
  ],
  "directions": [
    "Preheat the oven and prepare the pan: Arrange an oven rack in the center position and preheat the oven to 400°F. Brush the bottom and sides of the springform pan with oil, making sure to coat it all the way to the rim. Dust the inside of the pan with sugar, rotating the pan to coat the entire surface, then tap out the excess. Set the pan aside.",
    "Prepare the blood oranges: Position a blood orange on the cutting board so the “poles” are to your left and right and the fruit is resting on its side rather than upright. Use a sharp knife to cut off one of the poles, exposing a colorful round of fruit. Then slice the fruit as thinly as possible through the widest part, shaving off rounds that are no thicker than ⅛ inch. Reserve the ends for squeezing juice. Remove and discard any seeds from the slices and repeat until all the oranges are sliced (you should have 25 to 30 slices total). Squeeze the reserved ends of the blood oranges into a medium bowl until you have 2 tablespoons of juice (save any remaining fruit for juicing or another use).",
    "Build the upside-down layer in the pan: Add ⅓ cup of the sugar (2.3 oz / 66g) to the bowl with the juice and whisk until you have a smooth slurry. Pour the slurry into the bottom of the prepared pan and tilt in all directions to spread across the parchment. Arrange the orange slices in an overlapping pattern across the bottom of the pan and set aside.",
    "Mix the dry ingredients: In a medium bowl, whisk the cake flour, semolina, baking powder, and salt to combine and eliminate any lumps.",
    "Mix the wet ingredients: In a small bowl, stir together the Grand Marnier, orange zest, and orange blossom water and set aside.",
    "Beat the eggs and sugar: In a stand mixer fitted with the whisk attachment (or in a large bowl if using a hand mixer), beat the eggs and the remaining 1 cup sugar (7 oz / 200g), starting on low to break up the eggs and gradually increasing to high, until the mixture is very light, thick, and pale, and it falls off the whisk or beaters back into the bowl in a slowly dissolving ribbon, about 5 minutes (with a hand mixer, this will take several minutes longer).",
    "Beat in the oil: With the mixer still on high speed, gradually stream in the oil and beat until fully incorporated and the mixture is even thicker (it will be slightly reduced in volume).",
    "Alternate adding wet ingredients and dry: Reduce the mixer speed to low and add the flour mixture in 3 additions, alternating with the Grand Marnier mixture in 2 additions, beginning and ending with the dry ingredients. After the final addition of flour, stop the mixer and use a large flexible spatula to fold the batter several times, scraping the bottom and sides of the bowl to make sure it’s evenly mixed.",
    "Fill the pan and bake: Gently pour the batter over the blood orange slices, making sure not to disturb them, and smooth the top. Transfer the cake to the oven and immediately reduce the temperature to 350°F. Bake until the top is golden brown, the center is firm to the touch, and a cake tester or toothpick inserted into the center comes out clean, 35 to 45 minutes.",
    "Cool and unmold the cake: Transfer the pan to a wire rack and let the cake cool for 15 minutes. Run a thin knife around the edges of the cake and remove the outer ring (be careful, as some of the juices from the cake might run). Invert the cake onto a wire rack and remove the circular base. Carefully peel away the parchment and let the cake cool completely. For the best flavor and texture, wrap the cake in plastic and let it sit at room temperature for at least a day before serving.",
    "Serve: Slice and serve with sweetened yogurt."
  ]
}