{
  "title": "Blueberry Slab Pie",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 24",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Dough:",
    "7½cups all-purpose flour (34 oz / 975g), plus more for rolling out",
    "4tablespoons granulated sugar (1.8 oz / 50g)",
    "3teaspoons Diamond Crystal kosher salt (0.32 oz / 9g)",
    "6sticks unsalted butter (24 oz / 680g), cut into ½-inch pieces, chilled",
    "Filling and Assembly:",
    "3½pounds (1.6kg) fresh or frozen blueberries (about 11 cups)",
    "1cup granulated sugar (7 oz / 200g)",
    "7tablespoons cornstarch (2.2 oz / 61g)",
    "2tablespoons finely grated lemon zest",
    "⅓cup fresh lemon juice (2.7 oz / 76g)",
    "2teaspoons vanilla extract",
    "2½teaspoons ground ginger",
    "1½teaspoons ground cinnamon",
    "½teaspoon ground cardamom",
    "½teaspoon Diamond Crystal kosher salt",
    "1large egg, beaten",
    "Demerara sugar, for sprinkling the top",
    "Vanilla ice cream, for serving"
  ],
  "directions": [
    "Make the dough in the food processor: Prepare and refrigerate 1 cup of ice water while you assemble the dough. In a food processor, combine 3¾ cups of the flour (17.2 oz / 488g), 2 tablespoons of the granulated sugar (0.88 oz / 25g), and 1½ teaspoons of the salt (0.16 oz / 4.5g) and pulse a few times to combine. Add half of the butter pieces (12 oz / 340g) and toss to coat in the flour mixture. Process the mixture in long pulses until the butter is broken down into pieces no larger than a hazelnut. Transfer the entire mixture to a large bowl.",
    "Bring the dough together and chill: Place a large sheet of plastic wrap next to you on a work surface for the dough. Measure out ¾ cup (12 oz / 340g) ice water and slowly drizzle it over the flour mixture, tossing constantly with a fork to distribute. Once all the water is added, switch to your hands and toss the mixture several times, then knead until big, shaggy pieces of dough form (there will still be unincorporated flour). Transfer these shaggy pieces to the plastic wrap, leaving the dry bits behind. Drizzle in more ice water 1 tablespoon at a time, mixing with a fork and then your hands after each addition, until all the dough comes together. It will still look floury and dry in many places but should hold together when squeezed. Transfer all the dough to the plastic wrap and press into a single mass, then flatten into a ¾-inch-thick square. Wrap the dough tightly in the plastic, eliminating any air pockets. Use a rolling pin to firmly roll over the plastic-wrapped block of dough in both directions, forcing it into the corners and flattening into an even thickness. Transfer to the refrigerator. Repeat the entire dough-making process with the remaining 3¾ cups flour (17.2 oz / 488g), 2 tablespoons granulated sugar (0.88 oz / 25g), 1½ teaspoons salt (0.16 oz / 4.5g), 3 sticks of butter (12 oz / 340g), and more ice water. Chill both blocks of dough for at least 2 hours.",
    "Roll out one piece of dough and cut strips: Let one block of dough sit at room temperature for 5 to 10 minutes to soften slightly. Unwrap the dough and place it on a lightly floured surface. Use a rolling pin to beat the dough all across the surface to make it more pliable. Dust over top and underneath with more flour, then roll it out, dusting with more flour as needed, into a giant rectangular slab about 18 × 15 inches. If any cracks appear in the dough while rolling, cut a small piece of dough from the edge and press it over the crack to patch, then carry on. Use a wheel cutter or chef’s knife to cut the dough crosswise into strips measuring 1½ inches wide and 15 inches long. Place the strips on a parchment-lined baking sheet and refrigerate while you make the filling.",
    "Preheat the oven: Arrange an oven rack in the lowest position and line the entire rack with overlapping sheets of foil. There will be lots of buttery juices that will bubble over and start to smoke if they hit the oven floor, so you definitely want the foil there to catch any drips. If you have a second 18 × 13-inch half-sheet pan (you also need one for the slab pie), place it on the rack on top of the foil. Preheat the oven to 425°F. You will bake the slab pie nested inside this preheated half-sheet pan, which will help the bottom brown and bake through more quickly—thanks to my friend Sue Li for this excellent baking tip!",
    "Make the filling: In a large bowl, combine the blueberries, granulated sugar, cornstarch, lemon zest, lemon juice, vanilla, ginger, cinnamon, cardamom, and salt. Mix with a large flexible spatula or serving spoon until combined and set aside.",
    "Roll out the bottom crust and fill: Follow the same instructions as above for rolling out the second piece of dough, this time rolling it into a slightly thinner slab measuring about 21 × 16 inches. Loosely fold the slab in half, then slide the dough onto an 18 × 13-inch half-sheet pan and unfold, positioning it so you have about ½ inch of overhang all the way around. Press the dough firmly into the bottom and against the sides. Brush the inside border of the overhang with some of the beaten egg, then scrape the blueberry filling into the crust and press it firmly into an even layer.",
    "Arrange the top crust: Remove the strips of dough from the refrigerator and, starting at one end of the sheet pan, arrange them crosswise over the filling on a diagonal, overlapping the strips in a slight zigzag. Press the strips into the egg-washed border of the bottom crust and use scissors to trim off any excess. Brush the dough strips with egg and fold the overhang inward over the filling along all four sides. (The slab pie is already so labor-intensive at this point, I just leave the edge natural.) Brush more egg around the edges and generously sprinkle the entire top of the pie with demerara sugar. If your blueberries were not frozen, and if you have room in your refrigerator or freezer, chill the pie until the pastry is firm, 10 to 15 minutes (if not, the pie will be fine).",
    "Bake the pie and serve: The slab pie is heavy, so carefully nest it inside the preheated sheet pan (or place directly on the foil) and bake for 20 minutes. Reduce the oven temperature to 350°F and continue to bake until the top is deep golden brown and the filling is bubbling, another 1 hour 15 minutes to 1 hour 30 minutes. Let the pie cool on a wire rack for at least 1 hour before serving warm or at room temperature with vanilla ice cream."
  ]
}