{
  "title": "Bolo Bao",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Makes: 20 bao",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "Dough:",
    "- 2 tablespoons plus 2 2/3 cups (13 1/3 ounces) all-purpose flour, divided",
    "- 1/2 cup water, room temperature",
    "- 1/2 cup whole milk, chilled",
    "- 1 large egg",
    "- 1/3 cup plus 4 teaspoons (3 ounces) sugar",
    "- 3 1/2 teaspoons nonfat dry milk powder",
    "- 2 1/4 teaspoons instant or rapid-rise yeast",
    "- 1 teaspoon table salt",
    "- 4 tablespoons unsalted butter, cut into 2 pieces and softened",
    "Topping:",
    "- 2/3 cup plus 2 teaspoons (3 1/2 ounces) all-purpose flour",
    "- 1/4 teaspoon baking powder",
    "- 1/4 teaspoon table salt",
    "- 6 tablespoons unsalted butter, softened",
    "- 2/3 cup confectioners’ sugar",
    "- 2 large eggs, beaten",
    "- 2 teaspoons vanilla extract"
  ],
  "directions": [
    "1. For the dough: Whisk 2 tablespoons flour and water in a microwave-safe bowl until smooth. Microwave, whisking every 20 seconds, until the mixture thickens to a stiff, pudding-like consistency and reaches at least 150 degrees, 40 to 60 seconds. Whisk in milk until smooth, then whisk in egg until smooth.",
    "2. In the bowl of a stand mixer, whisk together the remaining 2 2/3 cups flour, sugar, milk powder, yeast, and salt. Add the cooked flour mixture. Fit the stand mixer with the dough hook and mix on low speed until all the flour is moistened, 1 to 2 minutes. Increase the speed to medium-high and knead until the dough is smooth and elastic, clearing the sides of the bowl, 10 to 12 minutes.",
    "3. Fit the stand mixer with the paddle. With the mixer on medium speed, add butter, 1 piece at a time, beating for 30 seconds after each addition. Continue mixing until the butter is fully incorporated and the dough is no longer shiny, 1 to 2 minutes.",
    "4. Transfer the dough to a very lightly floured counter. Knead briefly to form a ball and transfer it seam side down to a lightly greased large bowl. Cover with plastic wrap and let rise until doubled in size, 1 to 1 1/2 hours.",
    "5. For the topping: Meanwhile, whisk together the flour, baking powder, and salt in a small bowl. Using a clean, dry mixer bowl and paddle, mix butter and confectioners’ sugar on low speed until combined, about 1 minute. Increase the speed to medium-high and beat until light, pale, and fluffy, about 3 minutes. With the mixer running, gradually add eggs, then vanilla; mix until smooth, scraping down the bowl as needed, about 2 minutes. Add the flour mixture and mix on low speed until combined, about 30 seconds. Scrape down the bowl, then fold the ingredients by hand to fully mix. Transfer the mixture to a 1-quart heavy-duty zipper-lock bag and snip off 1 corner, making a hole no larger than 1/4 inch (alternatively, transfer to a pastry bag fitted with a 1/4-inch piping tip); set aside.",
    "6. Line 2 rimmed baking sheets with parchment paper. Transfer the dough to the counter and divide it into 20 equal pieces (about 1 1/2 ounces each); cover loosely with plastic. Working with 1 piece of dough at a time (keep the remaining pieces covered), form into a rough ball by stretching the dough around your thumbs and pinching the edges together so the top is smooth. Place the ball seam side down on the counter and, using your cupped hand, drag in small circles until the dough feels taut and round. Space 10 balls evenly on each prepared sheet, keeping the balls covered with plastic while rolling the remaining dough. Lightly spray the tops of the buns with vegetable oil spray, cover with plastic, and let rise until doubled in size, about 1 hour. Adjust the oven rack to the middle position and heat the oven to 375 degrees.",
    "7. Pipe about 2 tablespoons of topping in a tight spiral on top of each bun (the topping should form a circle roughly 2 inches in diameter and 1/4 inch thick). Bake, 1 sheet at a time, until the topping is golden brown, about 14 to 16 minutes, rotating the sheet halfway through baking. Transfer the buns to a wire rack and let cool for at least 10 minutes. Serve. (Buns can be individually wrapped in plastic and frozen for up to 2 weeks; thaw frozen buns at room temperature before reheating. To reheat, place buns on a rimmed baking sheet and bake in a 400-degree oven until the tops are dry but not browned and the centers are warmed through, about 4 to 6 minutes.)"
  ]
}