{
  "title": "Bone Broth From 'Nom Nom Paleo'",
  "source": "Seriouseats.com",
  "servings": "8 cups",
  "categories": [
    "Basics"
  ],
  "ingredients": [
    "2 1/2pounds assorted beef, chicken, and/or pork bones",
    "2medium leeks, trimmed, cleaned, and cut in half, or 1 small yellow onion, peeled, trimmed, and cut in half",
    "1medium carrot, peeled and cut into 3 pieces",
    "8cups water, plus more if needed",
    "2tablespoons Paleo-friendly fish sauce",
    "1teaspoon apple cider vinegar",
    "1/4ounce dried shiitake mushrooms (optional)",
    "4garlic cloves, peeled and smashed (optional)",
    "1(1-inch) piece fresh ginger, peeled and cut into thick coins",
    "Kosher salt or Celtic sea salt"
  ],
  "directions": [
    "1. Place the bones and vegetables in a large (at least 6-quart) stockpot, slow cooker, or pressure cooker, depending on your desired method of cooking.",
    "2. Add water to the pot, making sure the bones and vegetables are fully submerged. If you're using a pressure cooker, don't fill it beyond two-thirds capacity.",
    "3. Pour in the fish sauce and apple cider vinegar. If desired, add dried shiitake mushrooms, garlic, and/or ginger to the broth. Then, cook using one of the three methods below:",
    "4. If cooking the broth in a stock pot: Cover and bring to a boil over high heat. Skim off the scum, and turn down the heat to maintain a low simmer. Cook, covered, for 12 to 24 hours, or until the bones are soft. Check occasionally and add more water if needed to keep the bones and vegetables submerged. Cooking on the stovetop is the traditional way to make a pot of bone broth, but it takes a lot of babysitting. Patience is key!",
    "5. If cooking the broth in a slow cooker: Cover and set to cook on low for 8 to 24 hours. (You can actually simmer it for days; some say that the longer you cook your broth, the more nutrient rich it becomes.) The advantage of using a slow cooker to make your broth is that you can leave the house without fear of burning it down to the ground. Still, you'll have to wait a long time before you can sip on a mug of broth, so plan ahead.",
    "6. If cooking the broth in a pressure cooker: Lock the lid of the pressure cooker in place and cook over high heat. Once it reaches high pressure, immediately turn the burner down to the lowest possible setting (\"simmer\" usually works) that will still maintain high pressure. Set a timer for 45 minutes, and when it goes off, turn off the burner and remove the pot from the heat. Release the pressure naturally, about 10 to 15 minutes.",
    "7. Strain the broth through a fine mesh sieve (or cheesecloth-lined colander) to filter out the bones, veggies, and any remaining scummy bits. Season with salt to taste. Drink up.",
    "8. This broth will keep in a covered container for a few days in the refrigerator (or up to 6 months in the freezer). Once it's chilled, the bone broth should transform into a jiggly gel—a sure sign that it's loaded with gelatin. (And don't fret—it'll return to its liquid state once it's heated.)"
  ]
}