{
  "title": "Bouillabaisse",
  "source": "Modern Bistro - ATK",
  "servings": "8 to 10",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "Fish and Shellfish Marinade:",
    "1½pounds skinless fish fillets, cut into 1- to 1½-inch cubes",
    "8ounces medium shrimp (41 to 50 per pound), peeled and deveined, shells reserved",
    "8ounces large sea scallops, tendons removed and each scallop halved",
    "⅓cup shredded fresh basil",
    "¼cup extra-virgin olive oil",
    "3tablespoons Pernod",
    "3garlic cloves, minced",
    "2teaspoons table salt",
    "¼teaspoon red pepper flakes",
    "½teaspoon saffron threads",
    "Fish Stock:",
    "¼cup extra-virgin olive oil",
    "2onions, chopped",
    "1fennel bulb, stalks discarded, bulb chopped",
    "1large carrot, chopped",
    "3garlic heads, outer papery skin removed",
    "1(750-ml) bottle dry white wine",
    "2(28-ounce) cans diced tomatoes",
    "3pounds fish frames, gills removed and discarded, frames rinsed and cut into 6-inch pieces",
    "1pound leeks, white and light green parts only, halved lengthwise, chopped, and washed thoroughly",
    "4cups water",
    "Reserved shrimp shells",
    "1bunch fresh parsley, stems only",
    "5sprigs fresh thyme",
    "2bay leaves",
    "2teaspoons whole black peppercorns",
    "2teaspoons table salt",
    "Large strips of zest from 2 oranges",
    "½teaspoon saffron threads",
    "Stew:",
    "2pounds mussels, scrubbed and debearded",
    "1recipe Garlic-Rubbed Croutons",
    "1recipe Red Pepper Rouille"
  ],
  "directions": [
    "1  For the fish and shellfish marinade  Combine all ingredients in large bowl and toss until fish is thoroughly coated with herbs and oil. Cover with plastic wrap and refrigerate for 4 hours.",
    "2  For the fish stock  Meanwhile, heat oil in 8-quart stockpot or Dutch oven over medium-low heat until shimmering. Add onions, fennel, and carrot to pot, cover, and cook, stirring frequently, until vegetables are fragrant, about 15 minutes. Place garlic in large zipper-lock bag and seal. Smash garlic with rolling pin or meat pounder until flattened. Add smashed garlic to vegetables and continue to cook, stirring frequently, until vegetables are dry and just beginning to stick, about 15 minutes longer. (Take care not to let garlic burn.) Add wine and stir to scrape pot bottom, then add tomatoes and their juice, fish frames, leeks, water, shrimp shells, parsley stems, thyme sprig, bay leaves, peppercorns, and salt. Bring to simmer over medium-high heat, reduce heat to medium-low, and simmer, pressing down on fish bones occasionally with wooden spoon to submerge, until stock is rich and flavorful, about 1 hour.",
    "3  Strain stock through large fine-mesh strainer (you should have about 9 cups); rinse and wipe out pot and return strained stock to pot. Bring stock to boil over high heat and simmer briskly until reduced to 8 cups, about 10 minutes. Off heat, add orange zest and saffron. Let stand for 10 minutes to infuse flavors. Strain stock through fine-mesh strainer and set aside. (Stock can be refrigerated in airtight container for up to 2 days or frozen for up to 1 month and then defrosted.)",
    "4  For the stew  Return fish stock to clean 8-quart pot and bring to rolling boil over high heat. Stir in mussels and marinated fish and shellfish, cover pot, and return to simmer; simmer for 7 minutes, stirring a few times to ensure even cooking. Remove pot from heat, cover, and let stand until fish is cooked through and mussels have opened, about 2 minutes. Season with salt and pepper to taste, ladle into bowls, and float 1 crouton topped with dollop of rouille in each bowl. Serve."
  ]
}