{
  "title": "Braised Lamb Shoulder with Massaman Curry",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 8 to 10",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "½cup plus ¼ cup canola oil",
    "5pounds cleaned lamb shoulder, cut into 2-inch cubes",
    "Kosher salt",
    "2quarts homemade Chicken Stock or low-sodium canned chicken broth or stock",
    "4cans Chef’s Choice unsweetened coconut milk",
    "⅓cup Squid Brand fish sauce",
    "2tablespoons palm sugar",
    "5medium shallots, peeled and halved",
    "½cup garlic cloves, smashed",
    "3stalks lemongrass, trimmed and bruised (see this page)",
    "5fresh cilantro roots, cleaned and bruised",
    "8fresh kaffir lime leaves",
    "1cinnamon stick",
    "2star anise",
    "2cardamom pods",
    "2whole cloves",
    "1cup Massaman Curry Paste",
    "1cup Tamarind Paste",
    "2large Yukon Gold potatoes, peeled and cut into ½-inch dice",
    "Steamed Jasmine Rice",
    "Fresh cilantro leaves",
    "Roasted, unsalted peanuts",
    "Lime wedges"
  ],
  "directions": [
    "1. Preheat the oven to 325 degrees F.",
    "2. Heat half of the oil in a large wok or high-sided sauté pan over high heat until it begins to shimmer. Add the lamb pieces, in batches, and season with salt. Cook for about 8 minutes, until golden brown on all sides. Remove the lamb to a baking sheet with a slotted spoon. Repeat with the remaining oil and lamb. Discard the oil and return the pot to the stove over high heat.",
    "3. Add the stock, 1 can of the coconut milk, fish sauce, sugar, 1½ teaspoons salt, shallots, garlic, lemongrass, cilantro roots, and kaffir lime leaves and bring the mixture to a boil. As the mixture comes to a boil, combine the cinnamon stick, star anise, cardamom, and cloves in a piece of cheesecloth and tie with butcher’s twine to make a sachet. Add the sachet to the pot. As soon as the braising liquid comes to a boil, return the lamb to the pot, cover, and transfer to the oven.",
    "4. Cook the lamb for 2 to 2½ hours, until fork-tender. Start checking the meat at 2 hours. Once the lamb is finished cooking, remove it with a slotted spoon to a large bowl and cover with foil to keep it warm. Strain the braising liquid into a large bowl. Wipe out the pan and return it to the stove over high heat.",
    "5. Heat the remaining 6 tablespoons of oil and 1 can of the coconut milk in the Dutch oven over high heat until it begins to shimmer. Add the Massaman curry and tamarind paste and cook for 5 to 7 minutes, until fragrant and the color deepens and the mixture thickens.",
    "6. Add 4 cups of the braising liquid and the 2 remaining cans of coconut milk and bring to a boil over high heat. Cook until reduced by half. Reduce the heat to medium, add the potatoes, and cook for about 10 minutes, until almost cooked through (a skewer inserted meets with some resistance). Return the lamb to the pot and cook until heated through and the potatoes are tender, about 5 minutes longer.",
    "7. Serve with rice on the side and garnish with cilantro leaves, peanuts, and lime wedges."
  ]
}