{
  "title": "Braised Savoy Cabbage with Onions and Nutmeg",
  "source": "Pasta - Missy Robbins",
  "servings": "4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "1large head Savoy cabbage (about 1kg)",
    "56g / ¼ cup olive oil, plus 42g / 3 Tbsp to finish",
    "180g / 1 onion, cut in half and sliced",
    "40g / 8 cloves garlic, sliced",
    "367g / 1½ cups plus 3 Tbsp dry white wine",
    "120g / ½ cup plus 1 tsp unsalted butter, cold and cubed",
    "357g / 1½ cups water",
    "120g / 1 or 2 pieces parmigiano-reggiano rind",
    "¼whole nutmeg, plus more q.b.",
    "2g / 1 tsp dried red chile flakes",
    "6g / 2 tsp salt, plus more q.b.",
    "½tsp ground red chile",
    "Black pepper, q.b."
  ],
  "directions": [
    "1. Cut the Savoy cabbage in half through the stem end, then cut each half lengthwise into quarters. Core each quarter and separate the leaves, keeping them intact.2. Place a large Dutch oven over low heat and add 56g / ¼ cup of the olive oil. Add the onion and gently cook until soft but without color, 5 to 8 minutes. Add the garlic and gently cook until aromatic but without color, 10 to 15 seconds.3. Add the cabbage in small batches, allowing each batch to gently wilt before adding the next to the pan, 1 to 2 minutes per batch.4. Add the wine, increase the heat to medium, and cook until the wine has reduced by half, 5 to 8 minutes.5. Turn the heat down to low. Add the butter and water and then the parmigiano rinds.6. Grate the nutmeg over the pan. Add the chile flakes and stir to combine.7. Place a piece of parchment paper directly on top of the cabbage and braise over low heat until softened but not mushy, 20 to 30 minutes. You still want a little bite.8. Add the salt and stir to combine. Check your seasoning and add more salt q.b.9. Using a slotted spoon, transfer the cabbage to a large serving bowl. Add just enough of the braising liquid from the pan to cover the bottom of the bowl. The dish shouldn’t be soupy.10. Sprinkle the ground chile over the top. Grate nutmeg and grind pepper q.b. over the top. Then drizzle over the remaining 42g / 3 Tbsp olive oil."
  ]
}