{
  "title": "Brioche Twists with Coriander Sugar",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Makes 8 buns",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "½cup demerara sugar",
    "1tablespoon ground coriander",
    "Pinch of kosher salt",
    "½recipe Brioche Dough, chilled",
    "All-purpose flour, for rolling out",
    "4tablespoons unsalted butter, melted"
  ],
  "directions": [
    "Make the coriander sugar: In a small bowl, toss the demerara sugar, coriander, and salt to combine. Sprinkle onto a dinner plate and set aside for assembling the twists.",
    "Divide the dough and prepare the baking sheet: Divide the brioche dough into 8 equal pieces each weighing 2.25 ounces (64g); if you don’t have a scale, you can eyeball it. Place the pieces on a parchment-lined baking sheet, cover them with plastic wrap, and refrigerate to prevent the dough from softening (which will make it difficult to work with).",
    "Form the twists one at a time: Remove one piece of dough at a time from the refrigerator and roll it out on the work surface, applying a bit more pressure toward the center, until you have a rope about 10 inches long that’s a bit thicker at the ends and thinner toward the middle. In general, it’s easier to roll out the dough on an unfloured surface because the friction helps to stretch it, but add just the tiniest bit of flour if needed to prevent sticking. Working on a plate, use a pastry brush to coat the entire rope all over with melted butter, then roll the rope in the coriander sugar to coat completely. Grasping the rope in the center, twist the two ends once or twice around each other to form a keyhole.",
    "Place the twist back on the baking sheet in the refrigerator, tucking it underneath the plastic, and repeat the process with the remaining pieces of dough, melted butter, and coriander sugar. All the back-and-forth in and out of the fridge is to make sure all the twists proof at the same rate. At this point, the twists, covered on the baking sheet, can be refrigerated up to 12 hours.",
    "Proof the twists: Remove the twists from the refrigerator. Make sure they’re all evenly spaced on the baking sheet and let them sit at room temperature, covered, until the twists are puffed and the dough springs back when poked but holds a slight indentation, 55 to 65 minutes.",
    "Preheat the oven: Meanwhile, arrange an oven rack in the center position and preheat the oven to 350°F.",
    "Bake: When the twists are proofed, remove the plastic wrap and bake until they’re golden brown, 20 to 25 minutes. Let the twists cool on the baking sheet."
  ]
}