{
  "title": "Broccoili Melts",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 8 small-medium toasts",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "1pound (455 grams) broccolini or regular broccoli",
    "Coarse salt, to taste",
    "2tablespoons (30 ml) olive oil",
    "3garlic cloves, minced",
    "A few pinches of red pepper flakes",
    "Finely grated zest and juice of ½ lemon",
    "½cup (65 grams) finely grated aged Pecorino Romano",
    "8slices bread of your choice (I use a seeded white country loaf)",
    "8thin slices totally unfancy deli provolone",
    ""
  ],
  "directions": [
    "prep the broccoli rubble If you’re using broccolini, cut it into 2-inch segments. If you’re using regular broccoli, peel the stems with a vegetable peeler first, so that they cook evenly, and cut the rest into large chunks.",
    "Pour about a 1-inch puddle of salted water into a large sauté pan and bring to a boil. Add the broccoli, cover with a lid, and steam for 2 minutes. Drain the broccoli well, and pat it dry on paper towels, wringing out as much extra liquid as possible. Chop it into small (roughly ½-inch) bits.",
    "Wipe the sauté pan dry, and place over medium heat. Add the olive oil, and heat it for a full minute. Add the garlic and the pepper flakes, and cook for 1 minute, or until the garlic is just beginning to turn golden. Add the broccoli, and cook for 1 to 2 minutes more; season with salt. Transfer the mixture to a bowl, and add the lemon zest and juice, Pecorino, and more salt and pepper flakes to taste.",
    "make the toasts Heat the broiler. Arrange the slices of bread on a tray, and lightly toast on both sides, about 1 minute each. Scoop the broccoli mixture onto each slice of bread, lay a slice of provolone over it, and run it under the broiler until the cheese has melted and begun to blister, anywhere from 1 to 4 minutes, depending on the robustness of your oven. Eat. Repeat. Don’t forget to share, or at least hide the evidence if you decide not to do so.",
    ""
  ]
}