{
  "title": "Broccolini, Balsamic, Burrata",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Serves 2",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "½cup jarred roasted red peppers, packed in oil, drained",
    "Diamond Crystal kosher salt",
    "Freshly ground black pepper",
    "8ounces broccolini, bottom 2 inches of stalks removed",
    "Extra-virgin olive oil",
    "¼teaspoon red pepper flakes",
    "2teaspoons balsamic vinegar",
    "2servings ciabatta bread, split open horizontally",
    "4ounces burrata cheese"
  ],
  "directions": [
    "1. Equally stagger two racks in the oven and preheat it to 425°F. Line two sheet pans with parchment paper.",
    "2. In a blender, combine the roasted red peppers, 1 tablespoon water, a pinch of kosher salt, and a few cracks of black pepper and blend until fully smooth. Set the roasted pepper paste aside.",
    "3. Slice the broccolini down the center, creating long, thin strips. I keep them in long strips for the look, but you could also cut them into bite-size pieces. Spread them out on one of the lined pans and toss with 1 tablespoon olive oil. Season with the pepper flakes and salt and black pepper to taste and mix.",
    "4. Roast the broccolini on the top rack of the oven until it is bright and green, 8 to 10 minutes. Remove the broccolini from the oven, drizzle with the balsamic vinegar, and mix with tongs to coat.",
    "5. Set the ciabatta cut-side up on the second pan. Add the ciabatta to the top rack and move the broccolini to the lower rack. Bake both until the broccolini is crisped and slightly charred and the ciabatta is toasted, 8 to 9 minutes.",
    "6. Remove the broccolini and ciabatta from the oven. Tear the burrata into 2-inch pieces directly over the broccolini and mix together on the pan so the heat from the pan kind of melts the burrata into the broccolini.",
    "7. Add a swipe of the roasted pepper paste to the bottom of each slice of ciabatta and pile the broccolini mix on top. Dot with more pepper paste if you like, season with a few cracks of black pepper, and eat immediately."
  ]
}