{
  "title": "Broccoli and Soppressata Sheet-Pan Pizza",
  "source": "By Heart - Hailee Catalano",
  "servings": "SERVES 8 TO 10",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Pork",
    "1tablespoon unsalted butter",
    "6tablespoons olive oil",
    "1recipe Basic Sheet-Pan Pizza Dough",
    "Kosher salt and freshly cracked black pepper, to taste",
    "12ounces (340 g/about 2 crowns) broccoli, tough ends trimmed, chopped into 1⁄4-inch (6 mm) pieces (tender stems and all)",
    "3garlic cloves, minced",
    "3⁄4 cup (6 ounces/170 g) whole-milk ricotta",
    "Zest of 1 lemon, plus more for topping, optional",
    "8ounces (227 g) fontina, shredded",
    "8ounces (227 g) low-moisture whole-milk mozzarella, shredded",
    "8ounces (227 g) spicy soppressata, thinly sliced",
    "Hot honey, to taste (I like Mike’s or Zab’s)",
    "Torn fresh basil leaves, to taste"
  ],
  "directions": [
    "1. Preheat the oven to 500°F (260°C) with a pizza stone (if you have one) in the lower third (see Note). Grease a half-sheet pan (13 × 18 inches/33 × 46 cm) very well all over with the butter and 2 tablespoons olive oil.",
    "2. With oiled hands, place the Basic Sheet-Pan Pizza Dough on the tray, and press and stretch out the dough as far as you can. (It won’t fit the entire sheet tray at this point.) Oil the top with 1 tablespoon olive oil, and place a sheet of plastic wrap on top of the dough. Let the dough rest for 45 minutes at room temperature.",
    "3. Meanwhile, bring a medium pot to a boil over high heat. Generously season with salt. Add the broccoli, and boil until very soft, 6 to 8 minutes. Drain into a colander, and set aside.",
    "4. Dry out the pot and add the remaining 3 tablespoons olive oil and the garlic. Reduce the heat to medium, and cook, stirring, until the garlic is slightly golden, 2 or 3 minutes.",
    "5. Add the broccoli, and stir to coat. Reduce the heat to medium-low, and continue to cook, stirring occasionally, until the broccoli is super soft and mushy, 5 or 6 minutes.",
    "6. Turn off the heat, and mash the broccoli even further to form a chunky paste. Add to a medium bowl, and mix with the ricotta and lemon zest. Season with salt and pepper.",
    "7. After the dough has rested, press and stretch it out again, this time to fill the entire tray. If the dough still won’t quite stretch out the entire way, cover and let it rest another 15 minutes and try again.",
    "8. Add dollops of the broccoli mixture all over the dough, and spread out evenly, leaving about a 1⁄2-inch (1 cm) border for the crust. Sprinkle the fontina and mozzarella all over, and top with the soppressata.",
    "9. Bake in the lower third of the oven (on top of the pizza stone, if using) for 20 to 25 minutes, until golden and bubbly.",
    "10. Immediately transfer the pizza to a wire rack by lifting the pizza with a spatula and sliding the rack right under it. (This prevents the bottom crust from getting soggy.) Drizzle with hot honey, and top with torn fresh basil leaves and lemon zest, if using.",
    "11. Cut the pizza into squares, and serve."
  ]
}