{
  "title": "Brown Butter Corn Muffins",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 12",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "2cups corn kernels (10 oz / 284g), cut from about 2 large ears, or thawed frozen corn kernels",
    "1stick unsalted butter (4 oz / 113g)",
    "3tablespoons honey (2.3 oz / 64g)",
    "1cup all-purpose flour (4.6 oz / 130g)",
    "½cup medium or coarse yellow cornmeal (2.6 oz / 75g)",
    "2teaspoons baking powder (0.28 oz / 8g)",
    "¾teaspoon baking soda",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "2large eggs (3.5 oz / 100g), at room temperature",
    "¾cup sour cream (6.3 oz / 180g), at room temperature",
    "⅓cup buttermilk (2.8 oz / 80g), at room temperature",
    "⅓cup sugar (2.3 oz / 66g)"
  ],
  "directions": [
    "Preheat the oven: Arrange an oven rack in the center position and preheat the oven to 400°F.",
    "Prepare the pan: Use a pastry brush to coat the 12 cups of a muffin tin with a thin layer of melted butter. Add a few pinches of flour to each muffin cup and shake the pan to coat the cups with flour. Tap out the excess and set the pan aside.",
    "Brown the butter and cook the corn: Have the corn kernels nearby (if using thawed frozen corn, pat the kernels dry to avoid sputtering). In a small saucepan, cook the butter over medium-low heat, stirring and scraping the bottom and sides constantly with a heatproof spatula until the butter sputters, foams, and eventually the solid bits turn dark brown, 5 to 7 minutes. Add the corn to the saucepan carefully to avoid splatter, then add the honey. Continue to cook over medium heat, stirring occasionally, until the corn is tender, about 5 minutes (if using thawed frozen corn, the kernels will only take 2 or 3 minutes). Remove the saucepan from the heat and set aside to cool.",
    "Mix the dry ingredients: In a large bowl, whisk together the flour, cornmeal, baking powder, baking soda, and salt to combine. Set aside.",
    "Mix the wet ingredients: In a medium bowl, whisk the eggs until no streaks remain, then add the sour cream, buttermilk, and sugar and whisk vigorously until the mixture is smooth. Slowly add the cooled browned butter/corn mixture (it can be warm, just not hot), whisking constantly to incorporate. Make sure you scrape all the golden bits out of the saucepan!",
    "Mix the wet ingredients into the dry: Make a well in the center of the dry ingredients, then pour in the wet ingredients and gently mix with a flexible spatula, starting in the center and working outward, until no streaks of flour remain and the batter is smooth and well combined.",
    "Fill the muffin pan and bake: Use a ½-cup measure to scoop equal portions of batter into the prepared muffin cups. Bake the muffins until the tops are slightly domed and light golden brown and the centers spring back when pressed, 15 to 20 minutes. Remove the muffins from the oven and let them cool for 5 minutes in the pan, then turn them out onto a wire rack, set them upright, and let cool completely."
  ]
}