{
  "title": "Brown Butter & Labneh Banana Bread Cake",
  "source": "Molly Baz - Cook This Book",
  "servings": "Makes one 9 × 5-inch loaf",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "5large ripe bananas",
    "DAIRY",
    "10tablespoons (1¼ sticks/142g) unsalted butter, plus more for the pan",
    "⅓cup labneh, plus more for slathering",
    "2large eggs",
    "PANTRY",
    "2cups plus 2 tablespoons (255g) all-purpose flour",
    "1½teaspoons (9g) baking soda",
    "1½teaspoons (4g) kosher salt",
    "1cup packed (220g) dark brown sugar",
    "1teaspoon (5g) vanilla extract",
    "1tablespoon (11g) turbinado sugar, for sprinkling (optional)",
    "Flaky sea salt"
  ],
  "directions": [
    "1. Preheat oven to 350°F. Grease a 9×5-inch loaf pan with butter and line with parchment paper, leaving overhang on the long sides.",
    "2. Cut 10 tablespoons butter into pieces and melt in a small saucepan over medium heat. Cook, swirling often, until foamy, then browned and fragrant with golden milk solids, 5–6 minutes. Let cool.",
    "3. In a large bowl, whisk together 2 cups plus 2 tablespoons flour, 1½ teaspoons baking soda, and 1½ teaspoons salt.",
    "4. In another large bowl, mash 4 bananas until mostly smooth. Whisk in ⅓ cup labneh, 2 eggs, 1 cup dark brown sugar, and 1 teaspoon vanilla until smooth.",
    "5. Whisk in the cooled brown butter, scraping in all browned bits for flavor.",
    "6. Add dry ingredients to wet ingredients and whisk just until combined, with only a few floury patches remaining.",
    "7. Scrape batter into the prepared loaf pan and smooth the top. Slice remaining banana in half lengthwise and place both halves cut-sides up on top of the batter. Sprinkle with turbinado sugar if using.",
    "8. Bake 1 hour 10 minutes to 1 hour 25 minutes, until deeply browned and a toothpick comes out clean. Let cool slightly in the pan before lifting out.",
    "9. Serve warm or at room temperature with extra labneh and a sprinkle of flaky sea salt."
  ]
}