{
  "title": "Bucatini all’Amatriciana (Pasta with Tomato, Guanciale, and Pecorino)",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Sauce",
    "28g / 2 Tbsp olive oil",
    "160g / 5½ oz guanciale, thinly sliced",
    "456g / 2 cups tomato passata",
    "½tsp dried red chile flakes",
    "To Finish",
    "624g / 1 lb 6 oz extruded bucatini (this page)",
    "30g / ⅓ cup pecorino romano, plus 22g / ¼ cup for garnish"
  ],
  "directions": [
    "1 - To make the sauce, place a large sauté pan or Dutch oven over medium-low heat. Line a plate with paper towels.",
    "2 - Add the olive oil and guanciale to the sauté pan and cook until the fat has rendered and the pieces are just beginning to turn golden but have not browned (remember that they will crisp up when you remove them from the pan), 5 to 8 minutes.",
    "3 - Using a slotted spoon, remove one-quarter of the guanciale and place on the paper towels to drain. Reserve these pieces for garnish.",
    "4 - Turn down the heat to low, add the tomato passata and chile flakes, and cook until the rawness of the tomatoes is cooked out and the flavors have melded, 8 to 10 minutes. You are not looking to reduce the sauce.",
    "5 - To finish, bring a large pot of water to a boil over high heat. Generously salt the water.",
    "6 - Add the bucatini to the water and cook for 5 to 8 minutes, until al dente.",
    "7 - Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Add a splash of pasta cooking water and toss for 1 to 2 minutes to marry the pasta and the sauce. Remove from the heat and add 30g / ⅓ cup of the pecorino while tossing or stirring to combine. If the sauce feels tight, add a splash more pasta cooking water to loosen and continue tossing. When the pasta is properly married, it will cling to the sauce and have a glossy sheen.",
    "8 - Divide the pasta into bowls and garnish with the remaining pecorino and reserved guanciale."
  ]
}