{
  "title": "Buckwheat Blueberry Skillet Pancake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 4",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "5tablespoons unsalted butter (2.5 oz / 71g)",
    "1cup whole milk (8 oz / 227g), at room temperature",
    "½cup all-purpose flour (2.3 oz / 65g)",
    "¼cup buckwheat flour (1.1 oz / 30g)",
    "3large eggs (4.3 oz / 150g), at room temperature",
    "3tablespoons sugar (1.3 oz / 38g)",
    "¼teaspoon Diamond Crystal kosher salt",
    "¼teaspoon ground cardamom",
    "6ounces (170g) fresh or frozen blueberries (about 1¼ cups)",
    "Maple syrup, for serving"
  ],
  "directions": [
    "Brown the butter: In a small saucepan, cook 4 tablespoons of the butter (2 oz / 57g) over medium-low heat, stirring and scraping the bottom and sides constantly with a heatproof spatula, until the butter sputters, foams, and eventually the solid bits turn a dark brown, 5 to 7 minutes. Scrape the butter and all the toasted bits into a heatproof bowl and set aside to cool.",
    "Blend the batter and let it rest: In a blender, combine the milk, all-purpose flour, buckwheat flour, eggs, sugar, salt, and cardamom and blend on high until all the ingredients are thoroughly incorporated and you have a thin, smooth batter. (Alternatively, combine the ingredients in a medium bowl and blend with a handheld blender until smooth.) With the motor running, stream in the cooled browned butter and blend until incorporated. Cover the batter and set aside at room temperature to rest for at least 1 hour, or refrigerate up to 24 hours.",
    "Preheat the oven and reblend the batter: Arrange an oven rack in the center position and preheat the oven to 450°F. Briefly blend the batter again to recombine any ingredients that have settled.",
    "Heat a skillet and add the batter and blueberries: Heat a 10-inch ovenproof skillet (preferably cast-iron), over medium-high heat. Add the remaining 1 tablespoon butter to the skillet and swirl to coat the surface. Add about one-third of the batter to the skillet and cook until the top of the batter is set and goes from shiny to matte, about 2 minutes (this step creates a platform for the berries, so they don’t sink to the bottom of the skillet). Add the remaining batter to the skillet and scatter the blueberries on top (no need to thaw first if using frozen berries).",
    "Bake: Immediately transfer the skillet to the oven and bake until the edges are super puffed, browned, and crisp, the center is golden and set, and the blueberries have burst, 15 to 18 minutes.",
    "Serve: Remove the skillet from the oven and let sit for about 5 minutes. The pancake will fall as soon as it comes out of the oven—that’s normal! Cut the pancake into quarters, drizzle with maple syrup, and serve."
  ]
}