{
  "title": "Buffalo Waldorf Salad",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Serves 2 to 4",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "Pickled Celery",
    "3large celery stalks, very thinly sliced on the diagonal",
    "⅓cup unseasoned rice vinegar",
    "⅓cup white sugar",
    "1teaspoon kosher salt (Diamond Crystal or about half as much Morton)",
    "For the Dish",
    "Vegetable oil for deep-frying (about 2 quarts)",
    "1½teaspoons white sugar",
    "1½teaspoons kosher salt (Diamond Crystal or about half as much Morton)",
    "1cup very cold seltzer",
    "¾cup all-purpose flour",
    "2large medium-tart apples, like Pink Lady or Honeycrisp",
    "¼cup Frank’s RedHot Buffalo Wings Sauce, plus more for serving",
    "1cup Candied Walnuts (see below), roughly chopped",
    "½cup crumbled blue cheese",
    "2scallions, very thinly sliced (on the diagonal)",
    "Freshly ground black pepper",
    "Candied Walnuts",
    "2cups raw walnuts",
    "1cup light corn syrup",
    "1cup white sugar",
    "½teaspoon kosher salt (Diamond Crystal or about half as much Morton)"
  ],
  "directions": [
    "To pickle the celery: Put the celery in a small heatproof bowl. In a small pot, bring the rice vinegar, sugar, salt, and ⅓ cup water to a boil, stirring so the sugar dissolves. Pour the boiling liquid over the celery, give it a stir, and let it cool to room temperature. It’s good to go and keeps in the fridge for up to 1 month.",
    "To make the dish: Set up a cooling rack or line a baking sheet with paper towels. Get 2 inches of oil to 350°F in a heavy pot over medium-high heat. While it’s heating up, combine the sugar and salt in a small bowl. In a medium bowl, combine the seltzer and flour and gently whisk it together until it’s smooth. Pop this batter in the fridge until the oil’s ready.",
    "When you’re ready to fry, core the apples, then slice them into half-moons that are somewhere between ⅛ and ¼ inch thick.",
    "Working in four batches, dip the apple slices, one by one, in the batter, then carefully add them to the oil. Fry, flipping them once with tongs halfway through and trying your best to separate any that stick together, until they’re light golden brown, 5 to 6 minutes per batch. Move them to the cooling rack or prepared baking sheet and season with the sugar-salt mixture, then repeat with the rest of the batches.",
    "Once the apples are all fried and seasoned up, move them to a platter. Spoon the Frank’s over them and top with the candied walnuts, blue cheese, pickled celery (but not the liquid), and scallions. Grind on some pepper and serve with the bottle of Frank’s on the table for anyone who’s feeling extra spicy.",
    "Candied Walnuts: Get your oven to 350°F and line a baking sheet with parchment paper (for easy cleanup). Lightly coat the paper with nonstick spray, if you’ve got some, to make your life a little easier after cooking.",
    "Combine the walnuts, corn syrup, sugar, and 1 cup water in a medium pot, set it over high heat, and bring to a boil. Turn down the heat and cook at a pretty active simmer until the simmer-bubbles get big (a few should be about an inch wide), 15 to 20 minutes. Immediately strain the walnuts, discarding the syrupy liquid and tossing the walnuts a bit to drain off any excess. Transfer the walnuts to the baking sheet, sprinkle the salt on top, and bake them in the oven until they turn a nice copper brown, 15 to 20 minutes. Remove from the oven.",
    "When the walnuts are cool enough to handle, transfer them to a storage container. If you didn’t use nonstick spray, just get in there with a thin spatula to help them release from the parchment.",
    "These guys can be stored at room temp for up to 1 week."
  ]
}