{
  "title": "Buffalo Chicken Burgers",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "4tablespoons unsalted butter, plus 2 tablespoons melted and cooled, divided",
    "6tablespoons hot sauce",
    "1tablespoon molasses",
    "½teaspoon cornstarch",
    "1½pounds ground turkey or chicken",
    "1large shallot, minced",
    "2teaspoons Worcestershire sauce",
    "¼teaspoon pepper",
    "½teaspoon table salt",
    "2teaspoons vegetable oil",
    "4leaves Bibb or Boston lettuce",
    "4hamburger buns, toasted if desired",
    "2ounces mild blue cheese, crumbled (½ cup), room temperature",
    "1celery rib, sliced thin on bias, plus ¼ cup celery leaves"
  ],
  "directions": [
    "1. Microwave 4 tablespoons butter, hot sauce, molasses, and cornstarch in bowl, whisking occasionally, until butter is melted and mixture has thickened slightly, 2 to 3 minutes; cover to keep warm and set aside.",
    "2. Break ground turkey into small pieces in large bowl. Add remaining 2 tablespoons melted butter, shallot, Worcestershire, and pepper and gently knead with your hands until well combined. Divide chicken mixture into 4 equal portions, then gently shape each portion into ¾-inch-thick patty. Using your fingertips, press center of each patty down until about ½ inch thick, creating slight divot.",
    "3. Sprinkle patties with salt. Heat oil in 12-inch nonstick skillet over medium heat until just smoking. Transfer patties to skillet, divot side up, and cook until well browned on first side, 4 to 6 minutes. Flip patties, reduce heat to medium-low, and continue to cook until browned on second side and meat registers 160 degrees, 5 to 7 minutes. Transfer burgers to platter, brush with half of buffalo sauce, and let rest for 5 minutes.",
    "4. Arrange lettuce on bun bottoms. Serve burgers on buns, topped with blue cheese, celery, and celery leaves, passing extra buffalo sauce separately."
  ]
}