{
  "title": "Bulgogi Scallion Pancake-Adillas",
  "source": "Seriouseats.com",
  "servings": "2 large quesadillas, serving 4",
  "categories": [
    "Korean"
  ],
  "ingredients": [
    "1/4cup soy sauce",
    "2tablespoons brown sugar",
    "2tablespoons gochujang, plus more for drizzling (see note above)",
    "1tablespoon sesame oil",
    "1tablespoon rice vinegar",
    "2scallions, sliced, plus more to garnish",
    "3cloves garlic, minced",
    "1teaspoon ginger, grated",
    "1/4teaspoon black pepper",
    "1pound beef flank steak, ribeye, or sirloin, thinly sliced against the grain",
    "1recipe Extra-Flaky Scallion Pancakes",
    "1cup shredded cheddar cheese (4 ounces)",
    "1cup shredded Monterey Jack cheese (4 ounces)",
    "Cilantro, for topping"
  ],
  "directions": [
    "1. In a plastic zipper-lock bag, combine the soy sauce, brown sugar, gochujang, sesame oil, rice vinegar, scallions, garlic, ginger, and black pepper. Mix well. Add the sliced beef and close the bag, squeezing out any excess air. Shake well and toss to coat. Refrigerate for at least 30 minutes and up to 8 hours, turning bag occasionally to redistribute marinade.",
    "2. Heat a large skillet over high heat. Remove the meat from the marinade and cook until browned all over. Remove from heat and set aside.",
    "3. Prepare the Extra-Flaky Scallion Pancakes and set them aside on paper towels to absorb excess grease.",
    "4. Top 2 of the 4 scallion pancakes with bulgogi meat and cheese, and leave the other 2 bare. Heat a nonstick skillet over medium heat, then put 1 topped scallion pancake in the pan. Top with a bare scallion pancake to close.",
    "5. Let cook until the cheese begins to melt and the bottom pancake has crisped up and browned. Flip and cook on the second side until all of the cheese is melted and the bottom has browned. Remove from heat, set aside, and repeat to make the second quesadilla.",
    "6. Drizzle the quesadillas with additional gochujang, if desired, and top with scallions and cilantro. Serve immediately."
  ]
}