{
  "title": "Burger Bun",
  "source": "Brian Lagerstrom",
  "servings": "12 Buns",
  "categories": [
    "Bread"
  ],
  "ingredients": [
    "▪200g or 3/4c warm water (86F/30C)",
    "▪70g or 1/3c sugar",
    "▪1 large egg",
    "▪75g or 5 1/2Tbsp melted butter (not hot) + extra for brushing",
    "▪8g or 2 1/2Tsp instant yeast",
    "▪15g or 1 3/4Tbsp dough conditioner",
    "▪150g riced baked potato (or about 1c of baked potato before it’s riced)",
    "▪625g or 5c all purpose flour",
    "▪12g or 2tsp salt",
    "▪Egg wash (1 egg + splash of water)"
  ],
  "directions": [
    "Add ingredients to mixing bowl and mix with dough hook on medium speed for 8-10min. The dough will look loose at around 4-5 minutes before it comes together into a nice ball that’s no longer extremely sticky.",
    "Use a soaking wet hand and a grab and round in a  10 & 2 motion to tuck the dough into a taught ball. See video @3:18.  Cover and ferment at room temperature for 30min.",
    "The dough should have gassed up quite a bit. Aggressively degas the dough so that you can perform a strength building fold (as shown @3:50). After the strength building fold and another 10-2 rounding, cover the dough again and allow to ferment at room temp for another 30min.",
    "It will have risen a lot again after the second ferment, so aggressively degas it. Divide into 12 equal pieces (about 100g each). Shape and roll each piece of dough as shown @4:38 and place onto a baking sheet lined with oiled parchment. Don’t crowd buns. I recommend using at least 2 trays. Spritz with water and cover with a damp towel to proof for 60-90min. The buns are well proofed when they can take a poke and slowly bounce back. Brush top and sides of buns with egg wash (1 egg + splash water)",
    "Load into preheated 400F/205C, spritz the oven with 10-15 sprays of water, and bake for 15-18min until golden brown, rotating halfway through for even browning if needed.",
    "Brush tops with melted butter."
  ]
}