{
  "title": "Busiate alla Pesto Trapanese (Pasta with Tomato and Almond Pesto)",
  "source": "Pasta - Missy Robbins",
  "servings": "Servings 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Ingredients",
    "545g / 1 lb 3 oz cherry tomatoes",
    "10g / 2 garlic cloves",
    "10basil leaves",
    "100g / scant ¾ cup Sicilian almonds, coarsely chopped",
    "75g / ⅓ cup olive oil plus more to cover, as needed",
    "68g / ¾ cup pecorino romano",
    "Salt, q.b."
  ],
  "directions": [
    "1. Bring a small pot of water to a boil over high heat. Prepare an ice-water bath and set a colander in it.2. Using a sharp paring knife, cut an X into the bottom of each tomato. Drop the tomatoes into the boiling water and leave for 5 to 10 seconds to loosen their skins. Using a slotted spoon, transfer the tomatoes to the ice-water bath. After 30 seconds, transfer the tomatoes to a bowl. Peel the tomatoes and discard the skins. Transfer to a kitchen towel to remove any excess water.3. Transfer the tomatoes to a high-speed blender. Add the garlic and gently pulse to puree. Add the basil and continue to puree. Add the almonds and continue blending until you have a thick, uniform paste.4. With the blender running on low speed, drizzle in the 75g / ⅓ cup of oil. Once smooth, transfer the mixture to a mixing bowl. Fold in the cheese until well combined. Check your seasoning and add salt q.b.5. Measure out 383g / 1½ cups of the pesto. Transfer the remainder to an airtight container, cover with a layer of olive oil, and refrigerate for up to 3 days for another use.6. To finish, following the instructions for busiate on this page, make 624g / 1 lb 6 oz with the pasta dough.7. Bring a large pot of water to a boil over high heat. Generously salt the water.8. Add the busiate to the water and cook until al dente, 3 to 5 minutes.9. Add the pesto to a large mixing bowl. Using a spider or pasta basket, transfer the pasta directly to the mixing bowl. While gently tossing to combine, slowly add pasta cooking water, 15g / 1 Tbsp at a time, until the pesto is creamy and easily coats the pasta.10. Divide the pasta into bowls."
  ]
}