{
  "title": "Butcher’s Steak with Dried Chiles and Salted Peanuts",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 4 to 6",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "FOR THE SALSA",
    "¾cup canola or grapeseed oil, plus more as needed",
    "2ounces dried New Mexican chiles, stems removed (see Note)",
    "2ounces dried Guajillo chiles, stems removed, cut into rings",
    "4garlic cloves, smashed",
    "¼cup dry-roasted peanuts or toasted hazelnuts",
    "2tablespoons apple cider vinegar or distilled white vinegar",
    "Kosher salt",
    "FOR THE STEAK",
    "1½pounds hangar steak, boneless short ribs, strip steak, or any other beef steak of your choosing",
    "Kosher salt and freshly ground black pepper",
    "½small onion, thinly sliced",
    "2tablespoons canola oil",
    "1bunch watercress, stems trimmed",
    "2tablespoons fresh lime juice, plus 2 limes, quartered",
    "1bunch fresh cilantro, tender leaves and stems",
    "8–16corn tortillas, warmed"
  ],
  "directions": [
    "1 Make the salsa. Heat the oil, chiles, and garlic in a small pot over medium heat. Cook, swirling occasionally, until the chiles are toasted and the garlic is golden brown, 4 to 6 minutes. Remove from the heat and add the peanuts, swirling to coat. Transfer the mixture to a blender or food processor and pulse until coarsely pureed. Place in a bowl with the vinegar and add more oil as needed to create a spoonable sauce. Season with salt.2 Make the steak. Season the steak with salt and pepper; set aside. Place the onion in a bowl of ice water and let sit (this rinses away some of that raw onion-y bite).3 In a large skillet, preferably cast-iron, heat the oil over medium-high heat. Add the steak and cook until deeply, impossibly, golden brown on one side, 4 to 6 minutes. Flip and continue to cook until golden brown on that side as well, another 4 to 6 minutes. Transfer to a cutting board to rest 5 to 10 minutes.4 Toss the watercress with the lime juice; season with salt and pepper. Slice the steak and serve alongside the onions, watercress, cilantro, lime wedges, chile-peanut salsa, and tortillas."
  ]
}