{
  "title": "Butter Rolls",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Makes 21 rolls",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "8tablespoons / 113g salted butter",
    "1½cups / 360g whole milk",
    "¼cup / 55g sugar",
    "1tablespoon plus 2½ teaspoons / 12g active dry yeast",
    "3cups / 420g all-purpose flour",
    "1½cups /210g whole-wheat flour",
    "1tablespoon / 11g Diamond Crystal kosher salt",
    "1teaspoon flaky salt"
  ],
  "directions": [
    "In a small measuring cup, melt 6 tablespoons / 90g of the butter. Add the milk, 6 tablespoons / 90g warm water, and the sugar. Either by microwaving in 30-second increments or by cooking over low heat on the stove, bring this mixture to between 100° and 115°F.",
    "Sprinkle the yeast over the milk mixture and gently stir it in. Let it sit until it’s foamy on top, about 5 minutes.",
    "In a stand mixer fitted with the dough hook, combine both flours and the kosher salt. Pour in the yeasty milk and mix on medium speed, until the dough pulls from the sides of the bowl, 7 to 8 minutes.",
    "Use a damp hand to pull the dough away from the hook. Transfer to an oiled bowl and cover to proof until doubled in size, about 1 hour.",
    "When the dough has doubled, gently punch out any excess air. On a lightly floured countertop, portion the dough into twenty-one equal pieces (56g each). Stretch these into strips about 4 inches long, then swoop them into a loop around your knuckles, forming them into 2-inch-long oblong pieces. Nestle them 1 inch apart in a 9 by 13-inch baking dish in three rows of seven rolls in each.",
    "Cover the baking dish and let the rolls proof, until they have poofed up to the point where all their edges are touching, 1 to 1½ hours.",
    "Preheat the oven to 375°F. Bake until the rolls are golden brown, 20 to 25 minutes.",
    "Set a small pan over medium heat and brown the remaining butter, letting it melt and foam until there are deep golden-brown flecks at the bottom of the pan, 4 to 5 minutes.",
    "Remove from the oven, brush them with the brown butter and sprinkle with flaky salt. Let cool for 5 to 10 minutes before eating."
  ]
}