{
  "title": "Butternut Squash Grilled Cheese with Pickled Fennel",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Serves 6",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "1small fennel bulb, stalks and fronds removed, thinly sliced",
    "⅓cup fresh dill, stems removed",
    "¼cup white wine vinegar",
    "Diamond Crystal kosher salt",
    "Freshly ground black pepper",
    "1small butternut squash (1½ pounds), halved and seeded",
    "3tablespoons salted butter, plus more for grilling the sandwiches",
    "2garlic cloves, finely grated",
    "1tablespoon finely chopped fresh rosemary",
    "1tablespoon fresh thyme leaves",
    "5fresh sage leaves, finely chopped",
    "1teaspoon smoked paprika",
    "½teaspoon ground nutmeg",
    "½teaspoon cayenne pepper",
    "4ounces Gouda cheese, freshly grated (about 1½ packed cups)",
    "4ounces Cheddar cheese, freshly grated (about 1½ packed cups)",
    "1tablespoon heavy cream",
    "12slices rye bread or any bread you prefer"
  ],
  "directions": [
    "1. Position a rack in the center of the oven and preheat it to 400°F. Line a sheet pan with parchment paper.",
    "2. In a large bowl, combine the fennel, dill, vinegar, a generous pinch of kosher salt, and a few cracks of pepper. Toss to quickly “pickle” and set aside.",
    "3. Set the squash cut-side down on the lined sheet pan and roast until it is fork-tender, 30 to 40 minutes.",
    "4. When the squash is cool enough to handle, peel off the skin and use a potato masher, a fork, or a spoon (and a dream) and smash the squash until it resembles mashed potatoes. It won’t be completely smooth but do your best and don’t discard any excess liquid.",
    "5. Set a large Dutch oven over medium heat and melt 1 tablespoon of the butter. Add the garlic, rosemary, thyme, and sage and stir until they become fragrant, 30 to 45 seconds. Add the butternut squash, season with the paprika, nutmeg, cayenne, and a pinch of salt and stir. Add all the grated cheeses to a bowl and mix. Add about one-third of the combined cheeses, 1 tablespoon of the butter, and the cream. Turn the heat to medium-low and cook, stirring constantly, until you see the butter and cheeses melt together and begin to form a stringy butternut mash. Add another one-third of the cheese and stir until fully melted, then add the remaining cheese and stir until it melts in. Season to taste with additional salt and black pepper and remove the Dutch oven from the heat. The butternut squash should be one homogenous, cheesy mess.",
    "6. Butter one side of each bread slice. Set a large pan over medium heat and add the remaining 1 tablespoon butter to the pan. Let it melt, then place the bread buttered-side down. Add ⅓ cup (or more if you like) of the butternut squash mash to the unbuttered side of the bread and spread it evenly. Place another slice of bread on top, buttered-side up and pan-grill until toasted and golden brown on both sides, 3 to 4 minutes per side. Repeat the steps for the remaining slices of bread.",
    "7. Before serving, peel back the top slice of bread and add a few slices of the fennel slaw. Halve the sandwich right before eating and savor the cheese pull."
  ]
}