{
  "title": "Caesar-ish Potato Salad with Radishes & Dill",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "2pounds baby potatoes, any variety",
    "1garlic clove",
    "1lemon",
    "6radishes",
    "1cup dill leaves, plus more for finishing",
    "PANTRY",
    "Kosher salt",
    "3oil-packed anchovy fillets",
    "⅓cup mayonnaise",
    "1tablespoon Dijon mustard",
    "Freshly ground black pepper",
    "2tablespoons extra-virgin olive oil"
  ],
  "directions": [
    "1. Cook the potatoes:- Place 2 pounds potatoes and 1 cup salt in a large pot and cover with 3 quarts water. Bring to a simmer over medium-high heat. Once the water reaches a simmer, adjust the heat to medium to maintain a simmer and cook until the potatoes are easily pierced with a fork or paring knife. This should take roughly 8 to 10 minutes after the water comes to a simmer, but timing will vary greatly by the size of potato, so focus on the doneness rather than the minutes.",
    "2. While the potatoes cook, make your dressing:- Firmly smash and peel 1 garlic clove. Add a pinch of salt to the garlic and, using the side of your knife, mash the garlic to a paste.- Finely chop 3 anchovy fillets and then, using the side of your knife, mash them into a homogeneous paste. Combine the anchovy paste with the garlic paste and mash a few more times to combine.- Add the paste to a large bowl along with ⅓ cup mayonnaise, 1 tablespoon Dijon mustard, and 1 teaspoon black pepper. Whisk well to combine.- Slowly stream in 2 tablespoons olive oil, whisking as you go.- Cut a lemon in half and squeeze the juice of both halves into the dressing; whisk to combine. Season the dressing to taste with salt.",
    "3. Assemble the salad and serve:- Once the potatoes are cooked, drain them and let cool just until they can be handled. Smash each potato against the cutting board lightly with your palm so they are just crushed and their skins have broken to expose their flesh, but not totally crumbly. Add them to the dressing, tossing to evenly coat.- Thinly slice 6 radishes crosswise into coins. Finely chop 1 cup dill leaves. Add the radishes and dill to the potatoes and toss to coat. Taste and add more salt and black pepper as needed. Top with more dill leaves and serve immediately."
  ]
}