{
  "title": "Canederli (Speck and Rye Bread Dumplings)",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Passatelli Dough",
    "1loaf (456g / 16 oz) country bread, torn into pieces (about 8 cups)",
    "214g / 2⅓ cups plus 1 scant Tbsp finely grated parmigiano-reggiano",
    "300g / 6 eggs",
    "Whole nutmeg, q.b.",
    "Peel of 1 lemon, pith removed and peel finely chopped",
    "Brodo",
    "1(1.6 to 1.8kg / 3½ to 4 lb) chicken",
    "2.8 to 4.7kg / 3 to 5 qt water",
    "300g / 2 large carrots, peeled and cut into 1-inch pieces",
    "370g / 1 large onion, cut into quarters",
    "227g / ½ head celery, cut into 1-inch pieces",
    "150g / ½ leek, cut into 1-inch pieces",
    "30g / ½ bunch parsley",
    "100g / 1 head garlic, cut in half",
    "9g / 1 Tbsp black peppercorns",
    "1fresh bay leaf",
    "To Finish",
    "Salt, q.b.",
    "22g / ¼ cup finely grated parmigiano-reggiano",
    "Whole nutmeg, q.b."
  ],
  "directions": [
    "1 - To make the dough, preheat the oven to 200°F.",
    "2 - Spread the bread on a sheet pan and bake until dried out, 30 to 45 minutes. You do not want any color. To test for doneness, smash a shard of bread with the back of a spoon. The interior should be completely dry. Let cool.",
    "3 - Once cooled, place the bread in a food processor and pulse until very finely ground and uniform. Measure out 230g / scant 4 cups bread crumbs and set aside. Transfer the remainder to an airtight container and store in a cool, dry place for up to 2 weeks for another use.",
    "4 - Add the reserved bread crumbs and parmigiano to a mixing bowl and stir to combine. Transfer to a wooden work surface and make a well.",
    "5 - Add the eggs to a small mixing bowl and quickly whisk to combine. Add 35 to 40 gratings of the nutmeg and the lemon peel, and whisk to combine.",
    "6 - Add half of the egg mixture to the well and use a fork to incorporate the inner layer of cheese and bread crumbs, stirring in a continuous motion around the circumference to combine. Continue with the remainder of the egg mixture.",
    "7 - Once the bread crumbs, cheese, and egg mixture have formed a mass, gently knead the dough just until it comes together. The dough should be firm enough to stay together, yet soft enough that it could easily go through a potato ricer or passatelli press. Form the dough into a ball, cover it with plastic wrap, and let it rest for at least 1 hour. If you’re not forming passatelli until the evening or the next day, place the dough in the refrigerator and remove it 20 to 30 minutes before you plan to form the pasta. Use the dough within 24 hours.",
    "8 - To make the brodo, place the chicken in a large stockpot and add 2.8kg / 3 qt of the water. If the chicken is not fully covered, add more water to cover by 3 inches. Place over low heat and slowly bring to a simmer, 45 minutes to 1 hour. Once the liquid starts to simmer, scum will begin to rise to the top. Skim continually with a large spoon to keep the brodo very clear.",
    "9 - If the water level falls below the chicken after 1 hour, add enough of the remaining water to re-cover it and simmer for 2 hours longer, continuing to skim any impurities and adding more water as needed to keep the chicken covered.",
    "10 - After 3 hours, add the carrots, onion, celery, leek, parsley, garlic, peppercorns, and bay leaf and cook at a slow simmer until very flavorful, 1 to 2 hours longer.",
    "11 - Line a fine-mesh strainer with a coffee filter or cheesecloth and strain the brodo through it. Measure out 1.4 kg / 6 cups brodo and add to a large sauce pot. Let the remaining brodo cool, then store in an airtight container in the refrigerator for up to 5 days or in the freezer for another use. Refrigerate the chicken meat for another use.",
    "12 - To finish, place the large sauce pot with the brodo over medium heat. Bring to a gentle simmer and season with salt q.b.",
    "13 - Fit your potato ricer with the medium die.",
    "14 - Divide the passatelli dough into four pieces and place one quarter of the dough in the chamber of the potato ricer. Squeeze the handles together directly over the brodo, using a knife to cut 2- to 3-inch strands as they extrude. Repeat with the remaining quarters of dough, adding the passatelli to the pot.",
    "15 - Slowly cook the passatelli in the brodo until the pieces begin to float to the top, 2 to 3 minutes.",
    "16 - Divide into bowls and garnish with the parmigiano and grated nutmeg q.b."
  ]
}