{
  "title": "Cannoli with Ricotta Cream",
  "source": "The Food of Sicily - Fabrizia Lanza",
  "servings": "Makes 20 to 30 cannoli",
  "categories": [
    "Italian",
    "The Food of Sicily - Fabrizia Lanza"
  ],
  "ingredients": [
    "For the Ricotta:",
    "- 1 pound (450 g) whole-milk ricotta cheese",
    "For the Shells:",
    "- 2 cups (240 g) all-purpose flour, plus more for dusting",
    "- 1 tablespoon granulated sugar",
    "- 2½ teaspoons unsweetened cocoa powder",
    "- Pinch of fine sea salt",
    "- 1½ tablespoons lard or unsalted butter, at room temperature",
    "- 1½ tablespoons dry Marsala wine",
    "- 1 teaspoon red or white wine vinegar",
    "- 1 large egg, beaten",
    "- 1 to 2 tablespoons water, as needed",
    "- Vegetable oil, for frying",
    "For the Filling and Assembly:",
    "- ½ to ¾ cup (60 to 90 g) powdered sugar, plus more for dusting",
    "- Chopped pistachios, mini chocolate chips, and/or candied orange peel, for garnish"
  ],
  "directions": [
    "1. Drain the ricotta 1 to 2 days in advance by placing it in a sieve over a bowl in the fridge.2. To make the shells, whisk together flour, sugar, cocoa, and salt in a large bowl.3. Rub in the lard until well distributed.4. Add Marsala, vinegar, half of the beaten egg, and 1 tablespoon of water. Knead to form a stiff dough, adding the remaining water if needed.5. Wrap the dough in plastic and refrigerate for at least 30 minutes.6. Cut dough into quarters. Roll each through a pasta machine on the thickest setting five times, folding each time.7. Continue rolling on progressively thinner settings until 1/16 inch (2 mm) thick.8. Cut out 3½–4 inch (9–10 cm) rounds using a cookie cutter. Re-roll scraps as needed.9. Heat 2 inches (5 cm) of vegetable oil in a heavy pot for frying.10. Wrap each dough round loosely around a cannoli mold and seal with beaten egg.11. Fry wrapped molds in batches until golden and crisp, 1 to 2 minutes. Drain on paper towels and remove molds once cool.12. Mix drained ricotta with ½ cup (60 g) powdered sugar, adding more to taste.13. Just before serving, fill shells using a piping bag or small spoon.14. Garnish with pistachios, chocolate chips, or candied orange peel.15. Dust with powdered sugar and serve immediately."
  ]
}