{
  "title": "Cannoli Crunch Ice Cream Cake",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6 to 8",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "100grams (1⁄2 cup plus 3 tablespoons) cake flour, plus more for dusting",
    "100grams (1⁄2 cup) granulated sugar",
    "1teaspoon kosher salt",
    "3⁄4 teaspoon baking powder",
    "60grams (1⁄4 cup) whole milk, at room temperature",
    "50grams (1⁄4 cup) olive oil",
    "2egg yolks, at room temperature",
    "1egg, at room temperature",
    "1teaspoon vanilla bean paste",
    "1⁄8 teaspoon pure almond extract",
    "60grams (1⁄3 cup) mini chocolate chips",
    "45grams (1⁄2 cup) roughly crushed cannoli shells",
    "45grams (1⁄3 cup) roughly chopped roasted salted pistachios",
    "260grams (1 cup) whole-milk ricotta",
    "200grams (1⁄2 cup plus 2 tablespoons) sweetened condensed milk",
    "120grams (1⁄2 cup) heavy cream",
    "2tablespoons sweet Marsala wine or brandy",
    "1teaspoon vanilla bean paste",
    "3⁄4 teaspoon kosher salt",
    "Pinch of ground cinnamon"
  ],
  "directions": [
    "1. Preheat the oven to 350°F (180°C) with a rack positioned in the center. Butter the bottom of a 9 1⁄2 × 13-inch (24 × 33 cm) sheet tray (see Note), and line with parchment paper. Grease the pan all over with more butter, and dust with flour.",
    "2. Make the cake: Add the sugar, flour, salt, and baking powder to a large bowl, and whisk to combine and break up any clumps. In a medium bowl, whisk the whole milk, olive oil, egg yolks, egg, vanilla, and almond extract. Pour the wet ingredients into the dry, and mix with a rubber spatula until just combined. Don’t overmix; a few lumps are okay! Pour into the prepared pan.",
    "3. Bake for 12 to 15 minutes, until the cake springs back when gently pressed and doesn’t leave an imprint. Cool in the pan for 10 minutes and then carefully invert onto a wire rack to cool completely. (This cake layer can be made a day ahead, cooled, wrapped in plastic wrap, and stored at room temperature.)",
    "4. Place the cooled cake on a cutting board with one of the longer sides facing you. Cut the cake vertically into even thirds.",
    "5. Make the cannoli crunch: Mix the chocolate chips, cannoli shells, and pistachios in a small bowl.",
    "6. Make the no-churn ice cream layer: Line a 9 × 5 × 3-inch (23 × 13 × 8 cm) loaf pan with two long pieces of plastic wrap arranged like a plus sign, with overhang on all sides.",
    "7. Add the ricotta to a food processor, and process until light and fluffy, 1 minute. Transfer the whipped ricotta to a medium bowl along with the condensed milk, cream, Marsala, vanilla, salt, and cinnamon. Use an electric mixer on medium to whip until the mixture thickens and soft peaks form, 6 to 8 minutes.",
    "8. Assemble the cake: Add one-third of the ice cream (about 1 cup/58 g), to the bottom of the lined loaf pan. Add one-third of the cake, then another one-third of the cream, then half (about 1⁄2 cup/72 g) of the cannoli crunch. Add another third of the cake. Layer on the remaining cream, and finally, the last piece of cake. Cover the top with plastic wrap, and freeze overnight or for at least 12 hours.",
    "9. When you’re ready to serve, let the cake sit at room temperature for 5 to 10 minutes and then invert it onto a serving platter. Carefully remove the loaf pan and peel away the plastic. Top the cake with the remaining cannoli crunch, slice, and serve. Store any remaining cake wrapped in plastic in the freezer for up to 2 weeks."
  ]
}