{
  "title": "Caponata with Dried Cherries and Green Olives",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "1medium eggplant (1 to 11⁄4 pounds/454 to 567 g), cut into 1⁄2-inch (1 cm) cubes",
    "1⁄4 cup (60 ml) olive oil, plus more for coating the pan",
    "Kosher salt and freshly cracked black pepper, to taste",
    "5garlic cloves, minced",
    "3large shallots, diced",
    "1medium fennel bulb, cored and diced",
    "1medium red bell pepper, ribs and seeds removed, and diced",
    "2tablespoons tomato paste",
    "One 14.5-ounce (411 g) can diced tomatoes",
    "2teaspoons chopped jarred Calabrian chiles in oil, plus more to taste",
    "1⁄3 cup (50 g) chopped pitted Castelvetrano olives",
    "1⁄4 cup (35 g) dried cherries, roughly chopped",
    "2tablespoons pine nuts, toasted",
    "1tablespoon honey",
    "1teaspoon red wine vinegar, plus more to taste",
    "3tablespoons finely chopped fresh parsley"
  ],
  "directions": [
    "1. Preheat the oven to 400°F (200°C). Line a sheet tray with parchment paper.2. Place the eggplant on the sheet tray, and drizzle with 1⁄4 cup (60 ml) olive oil. Season with salt and pepper, and toss to coat. Spread out the eggplant in an even layer on the sheet tray.3. Roast for 25 to 30 minutes, tossing halfway through the cooking time, until soft and golden.4. Meanwhile, coat the bottom of a large sauté pan with olive oil, and heat over medium heat. When hot, add the garlic, shallots, and fennel, and season with salt and pepper. Cook, stirring occasionally, until soft, 10 to 12 minutes.5. Toss in the bell pepper, and cook until it starts to soften, 3 or 4 minutes. Add the tomato paste, and cook until darkened, 2 or 3 minutes.6. Stir in the diced tomatoes, chiles, and roasted eggplant. Reduce the heat to low, and cook until everything melds and stews together, 10 to 12 minutes.7. Turn off the heat and stir in the olives, cherries, pine nuts, honey, and vinegar. Season with salt and pepper, and add more chiles and vinegar to taste if desired.8. Let cool to room temperature and then stir in the parsley.9. Serve, or store in an airtight container in the refrigerator for up to 5 days."
  ]
}