{
  "title": "Caramelized Honey Pumpkin Pie",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 9-inch pie plate, pie weights or 4 cups dried beans or rice (for parbaking)",
    "Flaky All-Butter Pie Dough (this page), parbaked in a 9-inch pie plate and cooled",
    "5tablespoons unsalted butter (2.5 oz / 71g)",
    "⅓cup honey (4 oz / 113g) ①",
    "¾cup heavy cream (6 oz / 170g), at room temperature",
    "4large eggs (7 oz / 200g), at room temperature",
    "¼cup packed dark brown sugar (1.8 oz / 50g)",
    "1(15 oz / 425g) can unsweetened pumpkin puree (not pumpkin pie filling), preferably Libby’s ②",
    "2teaspoons ground cinnamon",
    "1½teaspoons ground ginger",
    "1teaspoon vanilla extract",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "½teaspoon ground allspice",
    "½teaspoon ground nutmeg (preferably freshly grated), plus more for serving",
    "¼teaspoon ground cloves ③",
    "Softly whipped cream, for serving"
  ],
  "directions": [
    "Preheat the oven: Arrange an oven rack in the center position and preheat the oven to 325°F. Place the parbaked pie crust on a foil-lined rimmed baking sheet and set aside.",
    "Brown the butter: In a small saucepan, cook the butter over medium-low heat, stirring and scraping the bottom and sides constantly with a heatproof spatula. The mixture will sputter as the water boils off. Continue to cook, stirring and scraping, until the sputtering subsides, the butter is foaming, and the solid bits turn a dark brown, 5 to 7 minutes.",
    "Caramelize the honey: Remove the saucepan from the heat and immediately add the honey (to prevent the butter from burning), stirring to combine. Return the saucepan to medium heat and bring to a boil. Continue to cook, swirling often, until the mixture is darkened slightly and has a savory, nutty smell, about 2 minutes. Remove the saucepan from the heat and slowly stream in the heavy cream, stirring constantly (be careful—the mixture may sputter) until it’s smooth. Set the warm honey mixture aside.",
    "Make the pumpkin filling: In a large bowl, whisk the eggs to break up the whites and yolks, then add the brown sugar and whisk vigorously until the mixture has lightened in color by a shade or two, about 1 minute. Whisk in the pumpkin, cinnamon, ginger, vanilla, salt, allspice, nutmeg, and cloves until smooth. Slowly stream in the warm honey mixture, whisking constantly, until the filling is completely homogenous.",
    "Fill the crust and bake: Pour the filling into the parbaked crust all the way to the top. (Depending on the height of your crust, you may have some leftover filling, which I recommend you keep! ④) Ever so carefully transfer the pie to the center rack and bake until the filling is set and puffed around the edges and the center wobbles gently, 45 to 60 minutes.",
    "Cool the pie gently: Turn off the oven and prop the door open with a wooden spoon. Let the pie cool completely in the oven. Doing so will allow it to cool gradually, which will prevent cracking on the surface.",
    "Serve: Slice the pie into wedges and top each piece with softly whipped cream. Grate a bit of fresh nutmeg over the cream and serve."
  ]
}