{
  "title": "Caramelle with Caramelized Onion, Brown Butter, and Balsamic",
  "source": "Pasta - Missy Robbins",
  "servings": "6 to 8 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Filling",
    "125g / ⅓ cup olive oil",
    "60g / ¼ cup unsalted butter, cold and cubed",
    "1.8kg / 5 large yellow onions, thinly sliced",
    "237g / 1 cup water",
    "2sprigs rosemary",
    "2sprigs thyme",
    "60g / ⅓ cup finely grated parmigiano-reggiano",
    "Salt, q.b.",
    "Black pepper, q.b.",
    "Bread Crumbs",
    "¼loaf (228g / 8 oz) country bread, torn into pieces (about 4 cups)",
    "56g / ¼ cup olive oil",
    "10g / 2 cloves garlic",
    "To Finish",
    "150g / 10 Tbsp plus 1 tsp unsalted butter, cold and cubed",
    "Aged balsamic vinegar, q.b.",
    "1sprig rosemary, leaves removed from stem",
    "2sprigs thyme, leaves removed from stems",
    "22g / ¼ cup finely grated parmigiano-reggiano",
    "Black pepper, q.b."
  ],
  "directions": [
    "1. To make the bread crumbs, preheat the oven to 200°F.",
    "2. Spread the bread on a sheet pan and bake until dried out, 30 to 45 minutes. You do not want any color. To test for doneness, smash a shard of bread with the back of a spoon. The interior should be completely dry. Let cool.",
    "3. Once cooled, place the bread in a food processor and pulse until broken down into fine crumbs. You want them to retain some texture, so be careful not to turn them to dust.",
    "4. Place a sauté pan over medium-low heat. Add the olive oil and garlic and cook until the garlic perfumes the oil, 1 to 2 minutes. Remove the garlic and save for another use.",
    "5. Turn the heat down to low. Line a plate with paper towels. Add the bread crumbs to the pan and cook, stirring occasionally, until they are golden brown, 5 to 8 minutes. Remove from the pan and transfer to the plate to drain. Let cool.",
    "6. Measure out 104g / ⅔ cup crumbs and set aside. Transfer the remainder to an airtight container and store in a cool, dry place for up to 1 week for another use.",
    "7. To make the filling, place a large Dutch oven over low heat. Add the oil and butter and swirl to emulsify.",
    "8. Add the onions and stir to make sure they are fully coated in the butter and olive oil. Cook until soft and translucent, 10 to 15 minutes. Stir occasionally so they cook evenly and do not burn.",
    "9. Add the water and stir to combine. Tie the rosemary and thyme together with kitchen twine and add to the pot.",
    "10. Cover the onions with a piece of parchment paper placed directly on top of them and cook, lifting the parchment to stir occasionally, until completely softened and a deep brown, 2 to 3 hours. At this point, all of the water should have evaporated. Remove from the heat and let cool.",
    "11. Once cooled, transfer the onions to a high-speed blender and puree until smooth.",
    "12. Transfer the onion puree to a bowl. Add the bread crumbs and parmigiano and season with salt and pepper q.b. Cover and refrigerate until ready to use.",
    "13. To finish, following the instructions for caramelle on this page, make 80 to 100 pieces with the pasta dough and filling.",
    "14. Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "15. Place a small saucepan over medium heat. Add 85g / 6 Tbsp of the butter and cook until just past golden brown, 3 to 4 minutes. Set aside. You will drizzle this over the plated pasta.",
    "16. Add the caramelle to the water and turn down the heat to bring the water to a gentle simmer instead of a rolling boil. It is important to cook these gently at a simmer instead of a boil. The filling is delicate and can break if cooked over high heat. Cook for 2 to 3 minutes, until tender at the thickest closure point.",
    "17. Place a large sauté pan over low heat. Add the remaining 65g / ¼ cup plus 1 tsp butter and 2 to 3 ladles (115g to 170g / ½ to ¾ cup) pasta cooking water. Swirl the contents of the pan to emulsify.",
    "18. Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Swirl the pasta in the sauce for 30 seconds to 1 minute to marry, using a spoon to gently turn the pasta over and coat all sides. If the sauce begins to tighten, add a splash more pasta cooking water to loosen and continue swirling to marry.",
    "19. Transfer the pasta to a serving platter or divide onto plates. Spoon the remaining sauce from the pan over the pasta, first loosening it with a splash of pasta cooking water if necessary. Drizzle the balsamic and reserved brown butter over the pasta. Garnish with the rosemary, thyme, parmigiano, and with pepper q.b."
  ]
}