{
  "title": "Caramelized Cabbage Risotto",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 4 main servings or 6 appetizer portions",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "5tablespoons (70 grams) butter",
    "1½tablespoons (20 ml) olive oil",
    "2medium yellow onions, thinly sliced",
    "½small-medium green cabbage (about 2½ pounds or 1⅛ kilograms whole), cored, halved, and thinly sliced (6 cups or 570 grams)",
    "1teaspoon coarse or Diamond kosher salt, plus more to taste",
    "6cups (1¼ liters) vegetable or chicken stock, at room temperature (you may find you need less)",
    "1½cups (280 grams) Arborio or other starchy short-grain white rice",
    "⅓cup (70 ml) dry white wine",
    "½cup (65 grams) finely grated Parmesan or aged Asiago, plus more in shavings for garnish",
    "Freshly ground black pepper, to taste",
    "Fresh chives, minced, for garnish",
    ""
  ],
  "directions": [
    "caramelize the cabbage Melt 1 tablespoon butter and the olive oil together in a large deep skillet or Dutch oven over medium heat. Add the onions and cabbage to the pan, toss them gently with the butter and oil, reduce the heat to medium-low, and cover the pan. Let the mixture cook for 15 minutes, stirring once or twice to avoid overcooked spots, then remove the lid, stir in the salt, and cook, stirring, for 20 to 25 minutes, bumping up the heat slightly if necessary, until the cabbage is soft and the onions are moderately caramelized and have taken on a golden color. Keep the closest watch on it in the second half of the cooking time, when it is most eager to scorch and stick. Deglaze with a splash of broth, then scoop the mixture into a bowl.",
    "make the risotto Wipe out the pot, and heat 1½ tablespoons butter in it over medium-high heat. Add the rice, and cook, stirring, for 1 minute. Add the wine, and stir until absorbed, about 1 minute more. Pour in about 1 cup broth, and cook at a strong simmer, stirring, until absorbed, about 2 minutes. Continue simmering and adding broth a splash or two at a time, stirring frequently, and letting each addition be absorbed before adding the next, until the rice is just tender (al dente) and looks creamy but loose, 18 to 20 minutes. Add the cabbage mixture, and, if needed, thin the risotto with another splash or two of broth. Good risotto doesn’t stand in a heap, but likes to spill out into a bit of a puddle in a shallow bowl.",
    "to finish Remove from the heat, and stir in the cheese, remaining 2½ tablespoons butter, and salt and pepper to taste. Serve garnished with a few shavings of cheese and some snipped chives."
  ]
}