{
  "title": "Caramel Apple Shortcakes With Apple Cider Reduction",
  "source": "Mesa Grill - Bobby Flay",
  "servings": "6",
  "categories": [
    "Mesa Grill - Bobby Flay"
  ],
  "ingredients": [
    "Shortcakes",
    "- 1½ cups all-purpose flour, plus extra for forming the biscuits",
    "- ¼ cup plus 3 tablespoons sugar",
    "- 1 tablespoon plus ½ teaspoon baking powder",
    "- ½ teaspoon baking soda",
    "- ½ teaspoon kosher salt",
    "- 6 tablespoons cold unsalted butter, cut into small cubes",
    "- About 1 cup buttermilk",
    "- 2 tablespoons whole milk or heavy cream",
    "Apple Cider Reduction",
    "- 1 quart apple cider",
    "- 2 tablespoons apple cider vinegar",
    "- 2 tablespoons apple brandy, such as applejack",
    "- ½ vanilla bean, split lengthwise and seeds scraped",
    "- 1 cinnamon stick",
    "Apples and Cream",
    "- 3 tablespoons unsalted butter",
    "- ½ vanilla bean, split lengthwise and seeds scraped",
    "- 5 Granny Smith apples, peeled, cored, and cut into eighths",
    "- ½ cup sugar",
    "- ¼ cup apple brandy, such as applejack",
    "- ¼ cup very cold heavy cream",
    "- ¾ cup very cold sour cream"
  ],
  "directions": [
    "1. Preheat the oven to 375 degrees F. Line a baking sheet with parchment paper.",
    "2. To make the shortcakes, whisk together the flour, the 3 tablespoons sugar, the baking powder, baking soda, and salt in a large bowl.",
    "3. Cut the butter into the mixture with a pastry cutter or your fingertips until the mixture turns a light yellow and the butter is still visible but in much smaller pieces. Gently stir in ½ cup of the buttermilk. Keep stirring in more buttermilk until a soft dough is formed; you may not need all of the buttermilk.",
    "4. Pat the dough out on a floured surface to a 1½-inch thickness. Cut out six 2-inch rounds with a metal cutter or the top of a glass; dip the cutter into flour before cutting each time to prevent sticking. Place the biscuits on the prepared baking sheet and brush the tops with the milk and sprinkle with the ¼ cup sugar.",
    "5. Bake the biscuits until golden brown, 12 to 15 minutes. Remove to a baking rack and let cool.",
    "6. To caramelize the apples, melt the butter over medium-high heat in a large sauté pan. Add the vanilla bean and seeds and apple slices and cook until the apples begin to brown, 5 to 7 minutes. Stir in the sugar and continue to cook, stirring occasionally, until the apples are soft and caramelized.",
    "7. Remove the pan from the heat and stir in the apple brandy. Carefully return to the heat and cook, stirring occasionally, for 5 minutes. Remove from the heat and let cool slightly. Remove the vanilla bean.",
    "8. Whip the heavy cream in a medium bowl with an electric mixer on medium speed until slightly thickened. Add the sour cream and continue whipping until soft peaks form.",
    "9. To serve, drizzle a few tablespoons of the apple cider reduction onto each of 6 plates. Split the shortcakes in half and place the bottoms on the plates. Spoon several heaping tablespoons of the caramelized apples over each shortcake bottom and top with a few dollops of the whipped cream and another drizzle of the apple cider reduction. Replace the tops."
  ]
}