{
  "title": "Caramelized Onion Pie",
  "source": "allo-simone.com",
  "servings": "",
  "categories": [
    "Vegetables"
  ],
  "ingredients": [
    "2medium-sized sweet onions (though you could replace or add other alliums to this dish – e.g. different varieties of onion, or shallots, leeks, etc.)",
    "garlic cloves — we used 5",
    "salted butter, about 3 Tablespoons’ worth",
    "balsamic vinegar, approx. 6 Tbsps",
    "honey, roughly 2 teaspoons",
    "fresh thyme, as much as you like",
    "bay leaves, 1 large or two small",
    "store-bought sheets of puff pastry, enough to cover the surface of the pan",
    "salt & pepper"
  ],
  "directions": [
    "Preheat your oven to 220°C/425°F and your frying pan to medium-high heat. Remove puff pastry from freezer to thaw.",
    "Peel and cut the onions across their middle (at the midway point between root and stem). Peel the cloves of garlic.",
    "Add enough butter to the pan to coat its bottom generously, and put in thyme and bay leaves.",
    "Once you can smell the fragrance of the herbs blooming in the air, pour in the balsamic vinegar and honey and give everything a swirl.",
    "Add the onions to the pan, cut side down. Pop in the garlic. You should have enough liquid in the pan to spoon a bit over the onions. If not, add a small splash of water and give the pan a gentle shake to combine the juices. Spoon over the onions, then season everything generously with salt and pepper and some more thyme leaves.",
    "Cover the pan with a lid and reduce heat to medium-low. You’ll want to leave the onions in long enough so that they can soften a bit and absorb the flavours in which they are bathing. This should take about 15 minutes, give or take. Then remove the lid to let the liquid caramelize, turning the heat up if necessary.",
    "While the liquid caramelizes, roll out your puff pastry to ensure it will neatly cover your pan. Once the onions are ready, place the pastry over the pan, using a wooden spoon to tuck in the edges snugly around the onions.",
    "Bake for 30 to 35 minutes, until the pastry is golden and puffed up. Remove from the oven (be careful! the pan is hot!). Cover the pan with your plate, then confidently flip the pie out of the pan and onto the plate. If possible, remove bay leaves before serving. Optional: decorate with additional thyme leaves, and lightly season with a bit more salt and pepper."
  ]
}