{
  "title": "Cardamom Morning Buns",
  "source": "Tastecooking.com",
  "servings": "",
  "categories": [],
  "ingredients": [
    "FOR THE BUNS:",
    "Danish Dough (recipe follows",
    "⅓C plus 1 tablespoon (90 g) unsalted butter, at room temperature, plus more for greasing",
    "½C (100 g) sugar",
    "Pinch of kosher salt",
    "2TSP freshly ground decorticated cardamom",
    "TO FINISH:",
    "Flour for dusting",
    "¼C (50 g) cardamom sugar (recipe follows)",
    "1C (200g) sugar",
    "2TBSP freshly ground decorticated cardamom",
    "¾C (185 g) whole milk",
    "2eggs",
    "2TBSP sugar",
    "1 ¾TSP active dry yeast",
    "4 ½C (553 g) bread flour, plus more for dusting",
    "1TBSP kosher salt",
    "1 ¼C (282 g) unsalted butter, chilled"
  ],
  "directions": [
    "12 BUNS",
    "MAKE THE DOUGH",
    "In the bowl of a stand mixer, whisk by hand the milk, eggs, sugar, and yeast. Add the flour and salt to the bowl and mix, using the dough hook attachment, on the lowest speed for about 2 minutes. (If you don’t have a stand mixer, you could knead the dough by hand.) The dough will look dry and shaggy, but fear not; it will come together eventually. Increase the speed to medium and continue mixing for 4 minutes, or until a firm dough forms. Turn out the dough onto a work surface and give it a few kneading strokes to bring it together into a smooth ball. Cover the surface of the ball with plastic wrap or a kitchen towel and let it rest on the counter for 1 hour or in the refrigerator for a maximum of 4 hours.",
    "After the dough has rested, remove the butter from the refrigerator and let it come to room temperature while you roll out the dough.",
    "Lightly dust a 13 by 18-inch (33 by 46 cm) baking tray with flour.",
    "Lightly dust a work surface with flour, then roll the dough into a 10 by 15-inch (25 by 38 cm) rectangle. Try to get fairly close to those dimensions, gently tugging at the corners. Place the dough on the prepared baking tray and put it in the refrigerator while you work with the butter.",
    "Lay out a piece of parchment paper on your work surface. If you’re using sticks of butter, cut the butter into tablespoon-size portions (you should end up with twenty pieces) and position them in a rectangular grid on the parchment paper, laying five pieces in one direction and four pieces in the other direction with each piece touching. If you’re using butter from a block, cut roughly uniform thick slices to create a 6 by 7-inch (15 by 18 cm) slab of butter. Cover the butter with a second sheet of parchment paper and roll over it gently with a rolling pin. Remove the top piece of parchment paper and, with a bench scraper or offset spatula, scrape the butter block lightly so that it has a smooth surface and a uniform thickness and measures approximately 6 by 9 inches (15 by 22 cm). Place the butter in the refrigerator for about 10 minutes to firm up again.",
    "After 10 minutes, press a fingertip against the top of the butter. It should take some effort to make a depression and feel like touching clay or Play-Doh. You want the butter close to the same softness as the refrigerated dough: soft but not melty, cold but not icy, and still workable.",
    "The first step is to “lock in” the butter. Lightly dust a work surface with flour, then position the 10 by 15-inch (25 by 38 cm) rectangle of dough so that the long (15-inch/38 cm) end is closest to you, parallel to the edge of your work surface. Place the rectangle of butter in the middle of the dough so that the short (6-inch/15 cm) end is parallel to the edge of your work surface. The long (9-inch/22 cm) ends of the butter rectangle should come close to meeting the short (10-inch/25 cm) ends of the dough rectangle, and there should be about 3 inches (7.5 cm) of bare dough to the left and the right of the butter. Fold these two flaps of dough snugly over the butter to enclose it, pinching the center seam, as well as the top and bottom, so that the butter is completely sealed inside the dough. The finished packet should be about 7 by 9 inches (18 by 23 cm). Next, you will be making three folds.",
    "Gently roll the dough out lengthwise, stretching the long (9-inch/22 cm) side to 18 inches (46cm). The goal is to make it longer but not much wider so that in the end it measures about 9½ by 18 inches (24 by 46 cm). As you roll, don’t push too hard or you risk tearing the dough or squeezing the butter out. Try to do it in more strokes rather than by exerting pressure. Once it measures about 9½ by 18 inches (24 by 46 cm), fold it in thirds, as you would a letter (this is called the “letter” fold). The top third folds down over the middle, and then the bottom third folds up over the middle and the top. The finished packet should be about 6 by 9½ inches (15 by 24 cm). Do your best to shape the corners with 90-degree angles, gently pinching and tugging as needed. Cover the dough in plastic wrap, put it back on the baking tray and refrigerate it for 30 minutes. You can continue using the same piece of plastic wrap for all subsequent steps.",
    "FOLD NO. 2: After 30 minutes, remove the dough from the refrigerator and take off the plastic wrap. Lightly dust the work surface with flour and position the dough with the short (6-inch/15 cm) end closest to you, parallel to the edge of your work surface, and roll it out vertically. Again, work swiftly but be gentle. The goal is to achieve the same measurement as before of approximately 9½ by 18 inches (24 by 46 cm). Then give the dough another letter fold, folding the top third of the dough down over the middle and the bottom third of the dough up over the middle and the top. Pat it together, pinch and square off the corners, cover it with the plastic wrap, put it back on the baking tray and refrigerate it for 45 minutes.",
    "FOLD NO. 3: After 45 minutes, remove the dough from the refrigerator and take off the plastic wrap. Once again, lightly dust the work surface with flour and position the dough with the short (6-inch/15 cm) end closest to you, parallel to the edge of your work surface, and roll it out following the same steps as above, once again aiming for a rectangle that is approximately 9½ by 18 inches (24 by 46 cm). Give the dough a final letter fold. The resulting packet should be about 6 by 9½ inches (15 by 24 cm).",
    "A laminated slab of dough is often referred to as a “book.” Books can come in all different sizes (depending on how many pastries need to be made). At this stage, your small book is so close to being ready to use! Last step: Wrap it back up in plastic wrap and let it rest in the refrigerator for at least 1 hour before beginning to shape it. Your book will stay fresh for 12 hours in the refrigerator or up to 1 month in the freezer. If you freeze your book, allow it to thaw in the refrigerator overnight before using.",
    "MAKE THE FILLING",
    "In the bowl of a stand mixer fitted with the paddle attachment, beat the butter, sugar, salt, and cardamom on medium for 1 to 2 minutes, until everything is well incorporated; it should be smooth and creamy. (The goal is simply to combine the ingredients, not to cream them or incorporate air.) Set the filling aside at room temperature to keep it soft and spreadable.",
    "Generously butter a 12-cup muffin tin. Be thorough and apply the butter onto the surface of the tin as well as inside the cups so that the dough won’t stick to the surface when it puffs during proofing or baking.",
    "Lightly dust a work surface with flour. Place the dough on a work surface with one of the short (6-inch/15 cm) ends close to you, parallel to the edge of the work surface. Roll the dough out, using vertical (up and down) motions, into a 13 by 18-inch (33 by 46 cm) rectangle, gently tugging and pinching at the corners to square them off as best you can. One short (13-inch/33 cm) end should be closest to you, parallel to the edge of the work surface. Spread the cardamom filling, using an offset spatula, evenly across the entire surface of the dough from one edge to the other in both directions. Roll the dough up widthwise, like a jelly roll, as tightly as possible. Try to keep the length close to the original 13 inches (33 cm). Using a chef’s knife, make twelve shallow cuts at 1-inch (2.5 cm) intervals. (Your rolls need to fit inside your muffin tin, where they will expand while proofing, so they should be about 1 inch/2.5 cm wide.) Then cut the roll into slices using the marks you made as a guide. Place each piece into a buttered cup of your muffin tin, with one of the cut sides down.",
    "PROOF THE BUNS",
    "Cover the muffin tin with a kitchen towel and set them in a warm and draft-free area until they are noticeably puffier, slightly dry looking, and the impression of a fingerprint is slow to fill in, 1 to 2 hours, depending on the temperature of your kitchen. For an alternate method that takes less time but requires a more watchful eye, see “Proofing Dough” on page 36.",
    "When the buns are sufficiently proofed, preheat the oven to 375°F (190°C).",
    "Place the muffin tin on a larger baking tray before baking. This is important as butter will ooze over the sides of the pan while the morning buns bake, and you want to catch it before it drips onto the bottom of the oven, where it will scorch and smoke.",
    "Bake for 25 to 30 minutes, until the pastry looks dark golden brown. Let the buns cool for 2 to 3 minutes, then tip the muffin tin onto its side and use an offset spatula to gently pry each bun loose, being careful not to let them uncoil.",
    "Add the cardamom sugar to a small bowl. Roll the surface of each morning bun, top down, in the sugar. Give it a good toss, so that the cardamom sugar sticks to the entire surface. Morning buns are best eaten warm or on the day they are baked. If you have some left over, store them in an airtight container until ready to enjoy, and then remove and heat them for 5 to 10 minutes in a preheated 350°F (175°C) oven. Pastries made from danish dough reheat well."
  ]
}