{
  "title": "Carne Asada Enchilada",
  "source": "Bricia Lopez, Javier Cabral - Asada: The Art of Mexican-Style Grilling",
  "servings": "Serves 4",
  "categories": [
    "Asada: The Art of Mexican-Style Grilling",
    "Mexican"
  ],
  "ingredients": [
    "8cloves garlic, peeled",
    "½large white onion (5¼ ounces/150 g)",
    "1chile manzano (2¾ ounces/75 g), stems removed (can substitute 2 serranos)",
    "4guajillo chiles, stems and seeds removed",
    "4pasilla chiles (1¾ ounces/45 g), stems and seeds removed",
    "1cup (240 ml) orange juice, freshly squeezed if in season",
    "½cup (120 ml) fresh lime juice",
    "½cup (120 ml) citrus vinegar (can substitute seasoned rice wine vinegar)",
    "1½tablespoons sherry, preferably Tres Coronas",
    "2tablespoons grapeseed oil",
    "1tablespoon crushed piloncillo (Mexican unrefined brown sugar; can substitute dark brown sugar)",
    "1tablespoon ground cumin",
    "2½teaspoons ground coriander",
    "2tablespoons sea salt",
    "2pounds (910 g) flap steak",
    "1medium white onion (8¾ ounces/250 g), sliced",
    "1orange, sliced",
    "For serving:",
    "Warm tortillas (preferably homemade; recipes on this page)",
    "Salsa of your choice (this page)"
  ],
  "directions": [
    "Start a charcoal or gas grill. The gas should be set to high. If using a pellet grill, preheat your grill to 450°F (230°C) for at least 15 minutes. If using charcoal, the coals should be red but entirely covered with gray ash.",
    "Wrap the garlic in aluminum foil. Place the wrapped garlic, the onion, and chile manzano on the grill. Cover and cook until everything—except the garlic, which will be tender—is charred, about 15 minutes, turning once. Remove to a plate. Toast the guajillo and pasilla chiles over the grill until aromatic, about 1 minute per side. Remove to the plate.",
    "In a high-speed blender, add the charred onion, garlic, and chiles along with the orange juice, lime juice, vinegar, sherry, oil, piloncillo, cumin, coriander, and salt. Blend until smooth.",
    "Pat the meat dry with paper towels. Using a gallon-size resealable bag, add the marinade, the onion and orange slices, and the meat. Seal and let sit in the refrigerator for at least 2 hours or overnight.",
    "Remove the steaks from the marinade and put them on the grill directly over the fire. Close the lid and cook, turning once, about 4 to 5 minutes on each side. Transfer the meat to a cutting board and let rest for 5 minutes.",
    "Slice the meat against the grain. Serve with warm tortillas and salsa."
  ]
}