{
  "title": "Carne Asada Clásica",
  "source": "Bricia Lopez, Javier Cabral - Asada: The Art of Mexican-Style Grilling",
  "servings": "Serves 4",
  "categories": [
    "Asada: The Art of Mexican-Style Grilling",
    "Mexican"
  ],
  "ingredients": [
    "½cup (120 ml) orange juice, freshly squeezed if in season",
    "¼cup (60 ml) fresh lime juice",
    "¼cup (60 ml) grapeseed oil",
    "1tablespoon apple cider vinegar",
    "2½teaspoons Worcestershire sauce",
    "6cloves garlic, minced",
    "6ounces (240 ml) dark Mexican ale",
    "1teaspoon freshly ground black pepper",
    "½teaspoon dried Mexican oregano",
    "½teaspoon smoked paprika",
    "¼teaspoon ground cumin",
    "⅛teaspoon ground cloves",
    "2tablespoons sea salt",
    "2pounds (910 g) flap steak",
    "4spring onions (can substitute 6 green onions), trimmed",
    "1cup (40 g) chopped fresh cilantro",
    "½large white onion (5¼ ounces/150 g), sliced",
    "2serrano chiles, sliced lengthwise",
    "For serving:",
    "Warm tortillas (preferably homemade; recipes on this page)",
    "Salsa taquera (this page and this page)",
    ""
  ],
  "directions": [
    "In a large bowl, add the orange juice, lime juice, oil, vinegar, Worcestershire sauce, garlic, and beer. Whisk to combine. Add the pepper, oregano, paprika, cumin, ground cloves, and salt, and whisk until the salt and spices have dissolved.",
    "Pat the meat dry with paper towels. Using the palm of your hand against a flat surface, lightly smash the spring onions until a little moisture comes out. In a gallon-size resealable bag, add them along with the marinade, cilantro, onion, serranos, and the meat. Mix well, seal, and let sit in the refrigerator for at least 2 hours or overnight.",
    "Remove the steaks from the refrigerator to allow them to reach room temperature before grilling, still in marinade, if possible. This should take at least 30 minutes.",
    "Start a charcoal or gas grill. The gas should be set to high. If using a pellet grill, preheat your grill to 450°F (230°C) for at least 15 minutes. If using charcoal, the coals should be red but entirely covered with gray ash.",
    "Remove the steaks from the marinade and put them on the grill directly over the fire. Close the lid and cook, turning once, about 4 to 5 minutes on each side. Transfer the meat to a cutting board and let rest for 5 minutes.",
    "Slice the meat against the grain. Serve with warm tortillas and salsa."
  ]
}