{
  "title": "Carrot and Pecan Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 10",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "1½cups pecan or walnut pieces and/or halves (5.3 oz / 150g)",
    "Neutral oil for the pans",
    "1pound (454g) carrots (about 5 large), peeled and coarsely grated (about 3 cups)",
    "1cup buttermilk (8.5 oz / 240g), at room temperature",
    "1tablespoon finely grated fresh ginger",
    "2teaspoons vanilla extract",
    "2½cups all-purpose flour (11.4 oz / 325g)",
    "2½teaspoons ground cinnamon",
    "2teaspoons baking powder (0.28 oz / 8g)",
    "2teaspoons Diamond Crystal kosher salt (0.21 oz / 6g)",
    "1teaspoon baking soda (0.21 oz / 6g)",
    "1teaspoon ground ginger",
    "¼teaspoon ground cloves",
    "4large eggs (7 oz / 200g), at room temperature",
    "¾cup granulated sugar (5.3 oz / 150g)",
    "¾cup packed dark brown sugar (5.3 oz / 150g)",
    "1cup neutral oil, such as vegetable or grapeseed (8 oz / 226g)",
    "Classic Cream Cheese Frosting, Brown Butter Variation (this page)"
  ],
  "directions": [
    "Preheat the oven and toast the pecans: Arrange two oven racks in the upper and lower thirds of the oven and preheat to 350°F. Scatter the pecans on a small rimmed baking sheet and bake on the lower rack, shaking halfway through, until the nuts are deep golden brown and very fragrant, 8 to 10 minutes. Remove and set aside to cool.",
    "Prepare the pans: Lightly brush the bottoms and sides of the three cake pans with oil and line the bottoms with rounds of parchment paper, smoothing to eliminate air bubbles. Set the pans aside.",
    "Mix the wet ingredients: In a medium bowl, stir together the carrots, buttermilk, fresh ginger, and vanilla to combine. Set aside.",
    "Crush the pecans: Place about two-thirds of the cooled pecans in a resealable plastic bag and seal, pressing out all the air. Use a rolling pin to lightly beat the nuts, breaking them up into smaller pieces. Open the bag and transfer the broken-up nuts to a small bowl and set aside. Place the remaining nuts in the same bag and seal, then beat thoroughly with the rolling pin to finely crush the nuts into a coarse meal. Transfer the nut meal to a medium bowl.",
    "Mix the dry ingredients: To the medium bowl with the nut meal, add the flour, cinnamon, baking powder, salt, baking soda, ground ginger, and cloves and whisk to combine. Set aside.",
    "Beat the eggs and sugar to ribbon: In a stand mixer fitted with the whisk attachment, combine the eggs and granulated and brown sugars. Beat first on medium-low to break up the eggs, then increase to medium-high and beat until the mixture falls off the end of the whisk back into the bowl in a slowly dissolving ribbon, about 4 minutes.",
    "Stream in the oil: With the mixer on medium-high, very slowly stream in the oil until the mixture is smooth and emulsified (it will deflate some).",
    "Alternate the dry and wet ingredients: Replace the whisk with the paddle attachment. Add about one-third of the flour mixture and mix on low speed until the flour has almost disappeared. Scrape in half of the carrot mixture, mixing just until incorporated, then add the remaining flour in 2 additions, alternating with the remaining carrot mixture. When the last traces of flour disappear, stop the mixer and remove the bowl. Use a flexible spatula to scrape down the sides and fold the batter several times to make sure it’s evenly mixed, then fold in the pecan pieces.",
    "Fill the pans and bake the layers: Divide the batter among the three prepared cake pans (if you have a scale, weigh out 1 lb 5 oz / 595g of batter per pan). Transfer the pans to the oven, placing two on the upper rack and one on the lower rack, staggering so the pan below doesn’t have another pan directly above it. Bake until the cakes are springy to the touch in the center and a cake tester or toothpick inserted into the centers comes out clean, 25 to 30 minutes, switching racks and rotating the pans front to back after 20 minutes.",
    "Cool the cakes: Remove the cakes from the oven and let cool completely in the pans. Use a small offset spatula or paring knife to cut around the sides. Invert onto a wire rack and peel off the parchment paper. Reinvert onto another rack, cutting board, or plate.",
    "Stack and frost the cake: Place a single cake layer upside down on a cake round, serving plate, or cake stand and slide several strips of parchment partially underneath and all around the cake to cover and protect the plate or stand during frosting. Using a small offset spatula, spread about 1 cup of the frosting across the surface, working all the way to the edges. Place another upside-down layer on top, centering it and pressing gently to level, then repeat with another 1 cup frosting. Place the third layer upside down on top and press gently. Cover the top and sides of the entire layer cake with another 1½ cups frosting in a very thin, even layer. This is the “crumb coat” which is just a base layer of frosting, so don’t worry if the cake shows through in several places. Refrigerate the cake until the frosting has hardened, 10 to 15 minutes, then cover the entire cake with a generous layer of frosting, working it across the top and down the sides in loose strokes (depending on how thick a layer you like, you may have ½ to 1 cup frosting leftover). Refrigerate the cake just until the frosting is set, 10 to 15 minutes.",
    "Serve: Slide the parchment strips out from underneath the cake before cutting into slices."
  ]
}