{
  "title": "Carrot Salad With Tahini, Crisped Chickpeas, And Salted Pistachios",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 2 large or 4 small servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "chickpeas",
    "1¾cups cooked chickpeas, or one 15.5-ounce/440-gram can, drained and patted dry on paper towels",
    "1tablespoon (15 ml) olive oil",
    "½teaspoon coarse sea salt",
    "¼teaspoon ground cumin",
    "dressing",
    "1medium garlic clove, minced",
    "¼cup (60 ml) lemon juice",
    "3tablespoons (25 grams) well-stirred tahini",
    "2tablespoons (30 ml) water, plus more if needed",
    "2tablespoons (30 ml) olive oil",
    "Salt and red pepper flakes to taste",
    "salad",
    "1pound (455 grams) carrots, peeled and coarsely grated",
    "¼cup (10 grams) coarsely chopped fresh parsley",
    "¼cup (30 grams) shelled salted pistachios, coarsely chopped",
    ""
  ],
  "directions": [
    "roast the chickpeas Heat the oven to 425 degrees. Toss the chickpeas with the olive oil, salt, and cumin until they’re all coated. Spread the chickpeas on a baking sheet or pan, and roast them in the oven until they’re browned and crisp. This can take anywhere from 15 to 20 minutes, depending on the size and firmness of your chickpeas. Toss them occasionally, to make sure they’re toasting evenly. Set aside until needed.",
    "make the dressing Whisk all the ingredients together until smooth, adding more water if needed to thin the dressing slightly. Taste and adjust the seasoning; don’t worry if the lemon juice makes it taste a little sharp; it will marry perfectly with the sweet grated carrots.",
    "assemble the salad Place the grated carrots in a large bowl, and toss them with the parsley. Mix in two-thirds of the dressing, adding more if desired. Add more salt and pepper if needed. Sprinkle with a large handful of chickpeas (you’ll have extra, and if you’re like us, you won’t regret it) and the pistachios.",
    "do ahead The salad keeps well in the fridge for 2 days; however, I’d add the chickpeas and pistachios right before serving, so they don’t get soft."
  ]
}