{
  "title": "Carrot Cake Cheesecake",
  "source": "Sugarspunrun.com",
  "servings": "Serving: 1",
  "categories": [
    "Cake"
  ],
  "ingredients": [
    "For Cheesecake:",
    "24oz cream cheese softened (680g) (use brick-style cream cheese, not the spreadable kind sold in tubs)",
    "¾cup granulated sugar (150g)",
    "1teaspoon vanilla extract",
    "½cup full-fat sour cream (120g)",
    "3large eggs room temperature preferred",
    "For Carrot Cake",
    "2 ½cups all-purpose flour (315g)",
    "1cup granulated sugar (200g)",
    "1cup light brown sugar (200g)",
    "1 ½teaspoons baking soda",
    "1teaspoon baking powder",
    "1teaspoon table salt",
    "2teaspoons ground cinnamon",
    "½teaspoon ground nutmeg",
    "1cup vegetable oil may substitute canola oil or other neutral cooking oil (235ml)",
    "½cup unsalted butter melted (113g)",
    "4large eggs room temperature preferred",
    "1Tablespoon vanilla extract",
    "3cups grated carrots peel before grating, this is typically 4 carrots for me (340g)",
    "1cup chopped walnuts or pecans optional (125g)",
    "For Frosting:",
    "8oz cream cheese softened (226g)",
    "½cup unsalted butter softened (113g)",
    "1teaspoon vanilla extract",
    "¼teaspoon table salt",
    "3cups powdered sugar (375g)",
    "1Tablespoon heavy cream"
  ],
  "directions": [
    "Preheat oven to 325F (165C) and line the bottom of an 8” round springform pan with parchment paper.",
    "In a large bowl, use an electric mixer to beat together cream cheese and sugar until smooth, creamy, and lump-free (be sure to scrape the sides and bottom of the bowl).",
    "Add sour cream and vanilla extract and stir on low-speed until combined.",
    "With mixer on low-speed, add eggs, one at a time, stirring until just combined after each addition (over-beating the eggs can make the cheesecake crack and make the texture off so don’t overdo it).",
    "Pour into prepared pan and bake in 325F (165C) oven for 35 minutes or until cheesecake is set. Center may still be slightly jiggly like jello and edges may be beginning to slightly crack or turn a light golden brown.",
    "Allow cheesecake to cool for ten minutes then carefully run a knife around the edge to loosen from the pan. Allow to cool until no longer warm to the touch then cover with foil and place in refrigerator to chill completely (at least 4 hours, preferably overnight, before assembling). Note: I do not remove the ring around the springform pan until I am ready to assemble the cake.",
    "Carrot Cake",
    "Preheat oven to 350F (175C) and grease and flour the sides and bottom of two 8” round cake pans (I like to also line the bottom of each pan with a round of parchment paper for extra insurance against sticking). Set side.",
    "In a large bowl, whisk together flour, sugars, baking soda, baking powder, salt, cinnamon and nutmeg until well-combined.",
    "Add oil and melted butter and stir until well-combined (mixture will be thick, but make sure batter is well-combined and no flour spots remain).",
    "Stir in eggs, one at a time, then stir in vanilla extract, carrots, and walnuts or pecans (if using).",
    "Divide batter into prepared pans and transfer to 350F (175C) oven and bake for 40 minutes or until a toothpick inserted in the center of the cake comes out with a few moist crumbs or clean. Allow cakes to cool in pan for 10-15 minutes then run a knife around the edge of the pan to loosen the cake from the sides and carefully invert to a cooling rack to cool completely before assembling. Meanwhile, prepare frosting.",
    "Frosting",
    "In a large bowl, use an electric mixer to beat together butter and cream cheese until creamy and smooth.",
    "Add vanilla and salt and stir well.",
    "With mixer on low-speed, gradually add powdered sugar until ingredients are completely combined.",
    "Add heavy cream and gradually increase mixer speed to high, then beat for 15-30 seconds until light and creamy.",
    "Assembly",
    "Level cakes if needed/desired and remove the collar from the springform pan. Place one cake layer on cake platter and cover with a layer of frosting.",
    "Carefully invert cooled cheesecake on top of the cake layer, cover with another layer of frosting, and top with remaining cake layer.",
    "Spread a smooth layer of frosting over the entire cake. Cut and serve, Store remaining cake covered in the refrigerator for up to 5 days."
  ]
}