{
  "title": "Cassoulet",
  "source": "Modern Bistro - ATK",
  "servings": "8 to 10",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "2pounds (5 cups) dried flageolet, cannellini, or navy beans, picked over and rinsed",
    "1tablespoon vegetable oil",
    "1pound boneless pork butt roast (Boston butt), trimmed and cut into 1-inch pieces",
    "1onion, chopped fine",
    "9garlic cloves, minced",
    "2tablespoons minced fresh thyme or 2 teaspoons dried",
    "½teaspoon table salt",
    "1cup dry white wine",
    "1tablespoon tomato paste",
    "10cups chicken broth, plus extra as needed",
    "1(28-ounce) can diced tomatoes, drained",
    "5slices hearty white sandwich bread, cut into ½-inch cubes",
    "3tablespoons unsalted butter, melted",
    "¼teaspoon table salt",
    "⅛teaspoon pepper",
    "1pound (4- to 6-inch-long) garlic pork sausages",
    "6confit duck legs, scraped clean of confit fat"
  ],
  "directions": [
    "1. For the pork and beans: Combine beans and 2½ quarts cold water in a large bowl and soak at room temperature for at least 12 hours or up to 24 hours. Drain beans and set aside.",
    "2. Heat oil in a large Dutch oven over medium-high heat until just smoking. Add pork and cook, stirring occasionally, until well browned, about 10 minutes, reducing heat if pan begins to scorch. Stir in onion, garlic, thyme, and salt and cook until onion begins to soften, about 3 minutes. Stir in wine and tomato paste, scraping up any browned bits. Stir in drained beans, broth, and tomatoes and bring to boil over high heat. Reduce heat to medium-low and simmer gently, uncovered, stirring occasionally, until beans and pork are just tender, about 1 hour (adjusting burner as needed to maintain gentle simmer).",
    "3. For the cassoulet: Meanwhile, adjust oven rack to middle position and heat oven to 400 degrees. Toss bread cubes with melted butter, salt, and pepper and spread over a rimmed baking sheet. Bake until light golden and crispy, about 15 minutes, stirring bread cubes halfway through baking; set aside. Do not turn off oven.",
    "4. Brown sausages in a 12-inch nonstick skillet over medium heat until golden on all sides, 5 to 8 minutes; transfer to paper towel–lined plate and set aside.",
    "5. When beans are just tender, the level of broth and beans should be equal; if necessary, add extra broth. Nestle sausages into the bean mixture and lay duck legs, skin side up, on top of beans (the duck skin should be exposed; do not nestle into beans). Bake, uncovered, until duck skin is golden and crispy and casserole is bubbling around edges, about 50 minutes.",
    "6. Sprinkle croutons over top and continue to bake until they form a crust, about 10 minutes longer. Let cassoulet cool and absorb some liquid, 15 to 20 minutes, before serving."
  ]
}