{
  "title": "Casunziei all’Ampezzana (Beet-Filled Pasta with Brown Butter, Poppy Seeds, and Smoked Ricotta)",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 6 to 8 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Filling",
    "454g / 1 lb beets (about 1 bunch, greens removed)",
    "5g / 1 Tbsp coriander seed",
    "6g / 1 Tbsp fennel seed",
    "2g / 1 tsp dried red chile flakes",
    "3sprigs rosemary",
    "3sprigs thyme",
    "42g / 3 Tbsp olive oil",
    "Salt, q.b",
    "116g / ½ cup ricotta (see “whipped” ricotta, this page)",
    "Black pepper, q.b.",
    "To Finish",
    "1batch egg dough (this page)",
    "171g / ¾ cup unsalted butter, cold and cubed",
    "9g / 1 Tbsp poppy seeds",
    "Black pepper, q.b.",
    "1small (57g / 2 oz) piece smoked ricotta"
  ],
  "directions": [
    "1 - To make the filling, preheat the oven to 350°F. Lay a large sheet of aluminum foil on your work surface and place the beets in the center. Add the coriander seed, fennel seed, chile flakes, rosemary, thyme, olive oil, and a splash of water and season with salt q.b. Seal all the edges and place the foil packet on a sheet pan.",
    "2 - Bake the beets until fork-tender, about 2 hours.",
    "3 - Open the foil packet and let the beets cool to the touch.",
    "4 - To avoid staining your hands semipermanent purple, wear rubber gloves to peel the beets. The skins should slide off easily.",
    "5 - Grate half of the beets on the fine side of a box grater.",
    "6 - Coarsely chop the other half of the beets and puree in a high-speed blender until smooth (you should not need to add liquid, as the beets should have enough moisture). To ensure the puree is supersmooth, stop and scrape down the sides of the blender jar, then process for 30 seconds longer. Transfer to a bowl and stir in the grated beets.",
    "7 - Wash the bowl of the food processor. Put the ricotta into the food processor and pulse just until it is as smooth as cake frosting and has a sheen, being careful not to process it longer or it will break. Transfer to the bowl holding the squash.",
    "8 - Add the ricotta to the beets and fold in until fully incorporated.",
    "9 - Season with salt and black pepper q.b. It should taste well seasoned. Cover and refrigerate until ready to use. (It will firm up slightly, making it a little easier to work with.)",
    "10 - To finish, following the instructions for casunziei on this page, make 75 to 90 pieces with the pasta dough and filling.",
    "11 - Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "12 - While the water is heating, place a large sauté pan over medium heat. Add the butter and cook until golden brown and foamy, 2 to 3 minutes. Try and time this step so your butter comes to the foamy stage at the same time as your pasta is ready to hit the pan.",
    "13 - Add the casunziei to the water and turn down the heat to bring the water to a gentle simmer instead of a rolling boil. It is important to cook these gently at a simmer instead of a boil. The filling is delicate and can break if cooked over high heat. Cook for 1 to 2 minutes, until tender at the thickest closure point. The center of your pasta will turn a deep magenta during cooking.",
    "14 - Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Swirl the pasta in the pan to coat with the butter, using a spoon to gently turn the pasta over and coat all sides. This is not a full marriage ceremony; think of it instead as an elopement.",
    "15 - Divide onto plates and spoon the remaining butter from the pan over the pasta. Garnish with the poppy seeds and with pepper q.b. Use a Microplane to finely grate the smoked ricotta over the top."
  ]
}