{
  "title": "Cauliflower Tabbouleh with Crunchy Seeds",
  "source": "Shuk From Market to Table",
  "servings": "Serves 4 to 6",
  "categories": [
    "Israel",
    "Shuk - From Market to Table"
  ],
  "ingredients": [
    "3tablespoons sesame seeds",
    "Olive oil, for frying",
    "3tablespoons pine nuts",
    "3tablespoons hulled pumpkin seeds (pepitas)",
    "3tablespoons hulled sunflower seeds",
    "1medium cauliflower, cored and cut into large florets",
    "1tablespoon nigella seeds",
    "2tablespoons finely chopped fresh cilantro",
    "2tablespoons finely chopped fresh mint",
    "2tablespoons finely chopped fresh parsley",
    "3tablespoons fresh lemon juice, plus more as needed",
    "3tablespoons extra-virgin olive oil, plus more as needed",
    "1teaspoon kosher salt, plus more as needed",
    "Freshly ground black pepper",
    "⅓cup (60 g) fresh pomegranate seeds, for garnish (optional)"
  ],
  "directions": [
    "Toast the sesame seeds in a dry medium skillet over medium heat, stirring continuously, for a couple of minutes, until golden. Transfer to a small plate and let cool.",
    "Line a plate with paper towels. Heat a thin layer of oil in the same skillet over medium-low heat. Add the pine nuts and sauté, shaking the skillet frequently, until they just turn light golden, 3 to 4 minutes. Use a slotted spoon to transfer them to the paper towels. Fry the pumpkin and sunflower seeds in the same manner; transfer them to the paper towels as well.",
    "Pulse the cauliflower florets in a food processor until they are broken down to couscous-size crumbles. Transfer the cauliflower to a large bowl. If there are any large pieces left, return them to the food processor and pulse until they reach the desired size, then add them to the bowl.",
    "Add the sesame seeds, pine nuts, pumpkin seeds, sunflower seeds, nigella seeds, cilantro, mint, and parsley to the bowl with the cauliflower. Add the lemon juice, oil, salt, and some energetic twists of pepper and toss to combine. Taste and adjust the seasoning, adding more salt, pepper, lemon juice, and/or oil as needed to make the salad yummy and bright.",
    "Sprinkle the pomegranate seeds on top (if using) and serve promptly."
  ]
}