{
  "title": "Cauliflower with Coconut Dressing & Fresno Almonds",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Serves 4 to 6 as a side",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "1head cauliflower (2 pounds)",
    "Extra-virgin olive oil",
    "Diamond Crystal kosher salt",
    "1Fresno pepper, seeded and halved",
    "1garlic clove, grated",
    "1teaspoon grated lime zest (about ½ lime)",
    "2tablespoons fresh lime juice (about 1 lime)",
    "¼cup canned unsweetened full-fat coconut milk",
    "½cup fresh mint leaves",
    "½cup fresh cilantro leaves",
    "1teaspoon sugar",
    "⅓cup raw almonds",
    "1½cups sweet cherries (½ pound), pitted and halved"
  ],
  "directions": [
    "1. Position a rack in the center of the oven and preheat it to 450°F.",
    "2. Cut the cauliflower into cherry-size florets and spread them out on an unlined sheet pan. Drizzle with 2 tablespoons olive oil and season with a few big pinches of salt.",
    "3. Roast for 15 minutes, then give the pan a shake to flip the florets. Roast until the cauliflower has browned and crisped on the edges, another 10 to 15 minutes; don’t be afraid to go dark.",
    "4. Meanwhile, finely dice half of the Fresno pepper and add it to a small bowl. Cut the other half into thin slices and set aside.",
    "5. To the bowl with the diced Fresno pepper, add the garlic, lime zest and juice, coconut milk, 5 finely chopped mint leaves, 1 tablespoon finely chopped cilantro, the sugar, and ½ teaspoon salt. Whisk this together and chill the dressing in the fridge while the cauliflower finishes roasting.",
    "6. Set a small pan over medium heat and add 2 tablespoons olive oil. Add the thinly sliced Fresno pepper and swirl, letting the oil simmer for 2 to 3 minutes. Add the almonds and let them toast in the oil until fragrant, another 2 to 3 minutes. Turn off the heat and season with salt.",
    "7. When the cauliflower is out of the oven, let it cool for a few minutes before adding it to a large bowl. Pour in the dressing and give it a few mixes. Add the cherries and almond–Fresno pepper mixture. Tear in the remaining mint and cilantro. Pile onto a big plate and serve."
  ]
}