{
  "title": "Charred Corn Succotash With Lime And Crispy Shallots",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 4 servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "crispy shallots",
    "Vegetable oil, for frying",
    "2large shallots, thinly sliced",
    "dressing",
    "Juice of 2 limes",
    "2teaspoons (10 grams) dark-brown sugar",
    "2tablespoons (30 ml) fish sauce",
    "salad",
    "1cup (115 grams) green beans, sliced on the diagonal into 1-inch segments",
    "4medium ears corn, shucked",
    "1tablespoon (15 ml) neutral oil",
    "2shallots, thinly sliced",
    "2garlic cloves, thinly sliced",
    "1fresh Thai or other green or red chile (more or less, to taste), thinly sliced",
    "Fine salt, to season",
    "1cup (155 grams) cherry tomatoes, halved",
    "1tablespoon thinly slivered Thai or other basil leaves",
    ""
  ],
  "directions": [
    "make the crispy shallots In your smallest skillet, heat ½ inch of oil over medium heat. (I use 8 to 10 tablespoons in my 6-inch skillet.) Add the shallots to the skillet, breaking the rings up a little as you drop them in. Cook, stirring, until the shallots are a good golden brown, then transfer them with a slotted spoon to a plate lined with several paper towels and sprinkle them with salt. The shallots will keep cooking a little after they leave the skillet, so removing them just a bit early is recommended.",
    "make the dressing Whisk together the dressing ingredients.",
    "for the salad Cook the green beans in a pot of salted water until crisp and just barely tender, about 3 minutes. Drain, and plunge them into ice water to stop them from cooking and to cool. If you’ve got better things to do than draw a bath of ice water, you could remove the beans at 2 minutes; they’ll continue cooking as they cool. Drain and pat dry.",
    "Remove any small children from the kitchen. Over a hot grill or an open gas-stove flame, char the ears of corn until most of the kernels are blackened, turning with tongs to get at all sides. The corn has a tendency to crackle and splatter, so wear oven mitts and be cautious. When the corn is cool enough to handle, shave off the kernels with a large knife, and reserve.",
    "In a large skillet, heat the neutral oil over medium heat. Add the shallots, garlic, and chile, and cook for 1 minute, until just softened. Add the corn, season with salt, and cook for 2 to 3 minutes, just to soften the corn. Turn off the heat, quickly stir in the green beans and tomatoes, and pour half the dressing over the top. Pile on a plate, and garnish with basil and crispy shallots. Serve with the remaining dressing on the side."
  ]
}