{
  "title": "Charred Leeks & Burrata with Walnut Bagna Cauda",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "3large leeks",
    "10garlic cloves",
    "½lemon",
    "DAIRY",
    "2tablespoons unsalted butter",
    "8ounces burrata or fresh whole-milk ricotta cheese",
    "PANTRY",
    "⅓cup plus 2 tablespoons extra-virgin olive oil",
    "Kosher salt and freshly ground black pepper",
    "10oil-packed anchovy fillets",
    "½cup walnuts",
    "Flaky sea salt",
    "Crusty bread, for serving"
  ],
  "directions": [
    "1. Position an oven rack in the lower third of your oven. Preheat the oven to 400°F.",
    "2. Prep and cook the leeks:- Trim and discard the dark green tops and hairy root ends of 3 leeks. Peel off and discard the first two layers. Cut the leeks in half lengthwise through the root end. If they seem particularly dirty, rinse them under cold water, keeping the layers intact as best as possible. Pat them dry.- Drizzle a rimmed baking sheet with 2 tablespoons olive oil. Add the leeks and turn with tongs to coat them in the oil. Season all over with kosher salt and black pepper. Arrange the leeks cut-sides down in a single layer on the baking sheet. Roast until softened and deeply caramelized on the cut sides, 14 to 18 minutes.",
    "3. Make the bagna cauda:- Firmly smash and peel 10 garlic cloves.- In a small saucepan, combine the garlic cloves, 10 anchovy fillets, and ⅓ cup olive oil. Set the saucepan over very low heat and cook gently, stirring occasionally and mashing with a fork once the garlic starts to soften, until the garlic and anchovies are totally dispersed, 12 to 14 minutes. The oil will barely simmer as the anchovies fry in the oil.- Finely chop ½ cup walnuts. Add the walnuts along with 2 tablespoons butter to the bagna cauda and continue to cook over low heat until the walnuts are toasted and crisp, 7 to 11 minutes longer.",
    "4. Plate it up:- Arrange the leeks on a serving platter, caramelized-sides up.- Tear an 8-ounce ball of burrata into large shards and scatter them on the platter with the leeks, or dollop 8 ounces of ricotta over them.- Spoon the warm walnut bagna cauda dressing over everything; season with flaky sea salt and more black pepper. Squeeze the juice of ½ lemon over top and serve with crusty bread alongside. If you have kitchen shears, they’re great for cutting the leeks into smaller, more manageable pieces for serving."
  ]
}