{
  "title": "Charred Sweet Potatoes with Chunky Peach Vinaigrette",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "11⁄2 pounds (680 g) mini sweet potatoes, scrubbed clean",
    "1⁄4 cup (60 ml) olive oil, plus more for coating the potatoes and skillet",
    "Kosher salt and freshly cracked black pepper, to taste",
    "1large ripe yellow peach, pitted and roughly chopped",
    "1 to 2tablespoons maple syrup, or to taste (depending on peach sweetness)",
    "2tablespoons unseasoned rice vinegar",
    "1teaspoon urfa biber chile",
    "2tablespoons unsalted butter",
    "1⁄4 cup (5 g) fresh mint leaves",
    "Flake salt, to taste, optional"
  ],
  "directions": [
    "1. Preheat the oven to 400°F (200°C).2. Rub the sweet potatoes with a little olive oil, and season all over with salt.3. Wrap the potatoes all together in one tight foil packet, sealing the sides very well to ensure no steam releases. Place on a sheet tray.4. Bake for 35 to 50 minutes, until the potatoes are tender. You can check them for doneness by simply piercing through the foil with a paring knife or cake tester. If they aren’t done, it’s okay to continue roasting them with the pierced foil.5. Meanwhile, add the peach and syrup to a medium bowl. Mash the peach with a fork to break it up slightly. Whisk in the vinegar, 1⁄4 cup (60 ml) olive oil, and chile, and season with salt and pepper.6. When the potatoes are tender, carefully open the foil packet to release the steam. Halve the potatoes lengthwise. (You can let them cool off a bit if needed.)7. Heat a 12-inch (30 cm) cast-iron skillet over medium-high heat. Coat the bottom of the pan with olive oil. Add the sweet potatoes, cut side down, and cook until they release from the pan and are nicely golden and charred, 5 to 7 minutes. Season with salt and pepper. Transfer the potatoes to a serving platter.8. Add the butter to the pan and melt and then reduce the heat to medium-low. Add the mint, and cook until the mint is crispy and the butter starts to brown, about 1 minute. Remove from the heat. Use a slotted spoon to remove the mint to a paper towel–lined plate. (It will crisp slightly as it cools.)9. Pour the brown butter over the potatoes and then top with a few spoonfuls of the reserved peach dressing. Garnish with the fried mint and a sprinkle of flake salt, if using, and serve with extra dressing on the side."
  ]
}