{
  "title": "Charred Cumin Beets",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 as a side",
  "categories": [
    "***NEED TO MAKE",
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "11⁄4 pounds (567 g) medium red beets (about 6), scrubbed clean",
    "Olive oil, for coating and charring the beets",
    "Kosher salt and freshly cracked black pepper, to taste",
    "1tablespoon chili crisp",
    "1tablespoon Chinese black vinegar",
    "1teaspoon granulated sugar",
    "1tablespoon unsalted butter",
    "1teaspoon cumin seeds, crushed in a mortar and pestle (or with the bottom of a pan)",
    "1⁄2 cup (20 g) loosely packed, roughly chopped cilantro (a combo of leaves and stems)",
    "1⁄4 small red onion, thinly sliced on a mandoline and rinsed"
  ],
  "directions": [
    "1. Preheat the oven to 400°F (200°C).2. Add the beets to a medium bowl, drizzle with the olive oil and a big pinch of salt, and toss to coat. Wrap the beets tightly in a foil packet, sealing the sides very well to ensure no steam releases during roasting. Place on a sheet tray.3. Roast for 50 to 60 minutes, until the beets are tender. You can check them for doneness by piercing through the foil with a paring knife; if it slides in easily, they are done.4. Meanwhile, mix the chili crisp, vinegar, and sugar in a small bowl. Set aside.5. When the beets are tender, carefully open the foil packet to release the steam. Rub off the skin with a paper towel. (You can let the beets cool a bit if needed.) Cut the beets in half.6. Coat a large cast-iron skillet with olive oil, and heat over medium-high heat until almost smoking.7. Add the beets, cut side down, and cook until charred, 3 or 4 minutes. Flip over the beets, and char for another 1 or 2 minutes.8. Turn off the heat, and add the butter and cumin seeds. Let the butter melt and the cumin seeds toast in the residual heat, and baste the beets in the cumin butter to coat, about 1 minute. Season with salt and pepper.9. Transfer the beets and buttery pan bits to a serving platter, and spoon over the reserved chili crisp mixture. Top with cilantro and red onions, and serve."
  ]
}