{
  "title": "Charred Brussels with Soy Butter & Fried Garlic",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "2pounds Brussels sprouts",
    "4garlic cloves",
    "DAIRY",
    "5tablespoons unsalted butter",
    "PANTRY",
    "¼cup vegetable or canola oil",
    "Kosher salt",
    "2tablespoons low-sodium soy sauce",
    "2teaspoons sherry vinegar",
    "¼teaspoon red pepper flakes",
    "2tablespoons honey"
  ],
  "directions": [
    "1. Preheat your baking sheet: Place an empty baking sheet in the oven on the bottom rack. Preheat the oven to 450°F.",
    "2. Prep the Brussels and garlic:- Trim the gnarly brown ends from the Brussels and cut them in half through the root end. Leave small ones whole. Place in a large bowl.- Thinly slice 4 garlic cloves evenly.- In a small saucepan, cover the garlic with ¼ cup vegetable oil and cook over medium heat, swirling the pan often, until the garlic is golden brown, 3 to 5 minutes. Remove from heat and strain the oil into the bowl of Brussels. Transfer the garlic chips to a small plate to cool.",
    "3. Cook the Brussels: Remove the baking sheet from the oven and arrange the Brussels cut-sides down in a single layer. Return the baking sheet to the oven and roast until softened and browned on the cut sides, 20 to 25 minutes. Transfer to a serving plate.",
    "4. Make the soy butter:- Cut 5 tablespoons butter into ½-inch cubes.- In the reserved saucepan, bring 2 tablespoons soy sauce and 1 tablespoon water to a simmer over medium-high heat.- Reduce heat to medium-low. Whisk in the butter pieces one at a time, waiting for each to melt before adding the next. Once all butter is incorporated, turn off the heat and stir in 2 teaspoons sherry vinegar and ¼ teaspoon red pepper flakes.",
    "5. Serve: Spoon the soy butter over the Brussels. Drizzle with 2 tablespoons honey and scatter the garlic chips on top."
  ]
}