{
  "title": "Cheesy Chicken Milanese",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "4",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "4boneless, skinless chicken breasts (6 to 8 ounces each)",
    "Kosher salt, freshly ground black pepper, and cayenne pepper",
    "1cup all-purpose flour, plus more for “gluing” the chicken",
    "4eggs",
    "1cup plain dried bread crumbs",
    "1cup panko bread crumbs",
    "1cup shredded whole-milk mozzarella cheese (4 ounces)",
    "Canola or vegetable oil, for shallow-frying",
    "3cups baby arugula",
    "1cup cherry tomatoes, halved or quartered",
    "A chunk of Parmigiano-Reggiano cheese",
    "Extra-virgin olive oil (the best you have)",
    "Good-quality balsamic vinegar"
  ],
  "directions": [
    "Preheat the oven to 325°F.",
    "Place a chicken breast between two big sheets of plastic wrap. Using the smooth side of a meat pounder or an empty wine bottle (lemme know if you need one), pound the chicken as thin as you can without ripping it to shreds. Season with salt, black pepper, and cayenne and repeat with the remaining chicken breasts.",
    "Set up three shallow bowls. Spread out the flour in one and season it liberally with salt, black pepper, and cayenne. Place the eggs in the second bowl, season them with salt, and beat them lightly just to combine. Combine the bread crumbs and panko in the third bowl and season with salt and black pepper.",
    "Place ¼ cup of the mozzarella on one side of each pounded chicken breast, about 2 inches in from the edges. Moisten the edges of the whole breast with water, then sprinkle a little flour all over the edges. Fold the breast over the cheese, pressing on the edges to seal.",
    "Take the folded breast and dip it into the seasoned flour on both sides, shaking off the excess. Move it to the egg and dip in both sides, letting the excess drip off. Transfer to the bread crumbs and press each side into the crumbs. Put the breast on a plate. Repeat the breading procedure with the remaining breasts in the same order: flour, eggs, bread crumbs.",
    "In a large skillet, heat about ½ inch of canola oil over medium-high heat. When the oil is hot, carefully lay 2 of the breaded cutlets in the skillet and cook until browned and crisp, 2 to 3 minutes. Flip the cutlets and cook until golden brown, another 2 to 3 minutes. Transfer the cutlets to a baking sheet and finish cooking in the oven, about 15 minutes, while you fry the remaining 2 cutlets, adding a little oil to the skillet if necessary between batches.",
    "To serve, arrange a cutlet on each of four plates and top each one with a handful of arugula and ¼ cup of the tomatoes. Use a vegetable peeler to shave some Parm over each cutlet, sprinkle with salt and pepper, and drizzle with olive oil and balsamic."
  ]
}