{
  "title": "Chicken and Rice with Caramelized Onions, Cardamom, and Raisins",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2½pounds bone-in chicken thighs, trimmed",
    "1teaspoon table salt, divided",
    "¼teaspoon pepper",
    "1tablespoon extra-virgin olive oil",
    "3onions, sliced thin",
    "1teaspoon packed brown sugar",
    "4garlic cloves, minced",
    "2teaspoons grated fresh ginger",
    "1teaspoon minced fresh thyme or ¼ teaspoon dried",
    "½teaspoon ground cardamom",
    "½teaspoon ground cumin",
    "⅛teaspoon saffron threads, crumbled",
    "2½cups chicken broth",
    "2cups basmati rice, rinsed",
    "⅓cup raisins",
    "3tablespoons minced fresh cilantro",
    "½teaspoon grated lemon zest plus 4 teaspoons juice"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 350 degrees. Pat chicken dry with paper towels and sprinkle with ½ teaspoon salt and pepper. Heat oil in Dutch oven over medium-high heat until just smoking. Brown half of chicken, skin side down, 6 to 8 minutes; transfer to large plate. Repeat with remaining chicken.",
    "2. Pour off all but 2 tablespoons fat left in pot. Add onions, sugar, and remaining ½ teaspoon salt and cook over medium heat, stirring often, until onions are deep golden brown, 25 to 35 minutes. Stir in garlic, ginger, thyme, cardamom, cumin, and saffron and cook until fragrant, about 30 seconds. Stir in broth, scraping up any browned bits. Add chicken, browned side up, along with any accumulated juices and bring to simmer. Cover and simmer gently for 20 minutes.",
    "3. Stir in rice. Cover, transfer pot to oven, and cook, stirring occasionally, until chicken registers 175 degrees, rice is tender, and liquid has been absorbed, 20 to 30 minutes.",
    "4. Remove pot from oven and transfer chicken to cutting board; cover pot and set aside. Let chicken cool slightly, then shred chicken with 2 forks into bite-size pieces; discard skin and bones. Gently stir shredded chicken, raisins, cilantro, and lemon zest and juice into rice, and season with salt and pepper to taste. Cover and let stand until chicken is warmed through, about 5 minutes. Serve."
  ]
}