{
  "title": "Chicken Florentine",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2tablespoons vegetable oil, divided",
    "12ounces (12 cups) baby spinach",
    "4(6- to 8-ounce) boneless, skinless chicken breasts, trimmed",
    "½teaspoon table salt",
    "¼teaspoon pepper",
    "1shallot, minced",
    "2garlic cloves, minced",
    "1¼cups chicken broth",
    "1¼cups water",
    "1cup heavy cream",
    "6tablespoons grated Parmesan cheese, divided",
    "1teaspoon grated lemon zest plus 1 teaspoon juice"
  ],
  "directions": [
    "1. Adjust oven rack to upper-middle position and heat broiler. Heat 1 tablespoon oil in 12-inch skillet over medium-high heat until shimmering. Add spinach and cook, stirring occasionally, until wilted, 1 to 2 minutes. Transfer spinach to colander to drain and let cool slightly. Once cool enough to handle, transfer spinach to clean dish towel, wrap towel tightly around spinach to form ball, and wring until dry; set aside.",
    "2. Pat chicken dry with paper towels and sprinkle with salt and pepper. Wipe skillet dry with paper towels. Heat remaining 1 tablespoon oil in now-empty skillet over medium-high heat until just smoking. Lightly brown chicken on both sides, 4 to 6 minutes. Add shallot and garlic to skillet and cook until fragrant, about 30 seconds. Stir in broth, water, and cream and bring to boil.",
    "3. Reduce heat to medium-low and simmer until chicken registers 160 degrees, about 10 minutes. Transfer chicken to plate and tent with aluminum foil. Continue to simmer sauce until reduced to 1 cup, about 10 minutes. Off heat, stir in ¼ cup Parmesan and lemon zest and juice.",
    "4. Slice chicken crosswise ½ inch thick and arrange in broiler-safe dish. Scatter spinach over chicken and pour sauce over spinach. Sprinkle with remaining 2 tablespoons Parmesan and broil until golden brown, 3 to 5 minutes. Serve."
  ]
}