{
  "title": "Chicken Enchiladas Rojas",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "¼cup vegetable oil, divided",
    "1onion, chopped fine",
    "3tablespoons chili powder",
    "3garlic cloves, minced",
    "2teaspoons ground coriander",
    "2teaspoons ground cumin",
    "2teaspoons sugar",
    "½teaspoon table salt",
    "1pound boneless, skinless chicken thighs, trimmed and cut into ¼-inch-wide strips",
    "2(8-ounce) cans tomato sauce",
    "⅓cup water",
    "½cup minced fresh cilantro",
    "⅓cup jarred jalapeños, rinsed, patted dry, and chopped",
    "10ounces sharp cheddar cheese, shredded (2½ cups), divided",
    "12(6-inch) corn tortillas",
    "Vegetable oil spray"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 400 degrees. Heat 2 tablespoons oil in large saucepan over medium heat until shimmering. Add onion and cook until softened and lightly browned, 5 to 7 minutes. Stir in chili powder, garlic, coriander, cumin, sugar, and salt and cook until fragrant, about 30 seconds. Stir in chicken, tomato sauce, and water and bring to gentle simmer. Cook, stirring occasionally, until chicken is tender and flavors meld, 8 to 10 minutes.",
    "2. Pour mixture through fine-mesh strainer into bowl, pressing on strained chicken mixture to extract as much sauce as possible; set sauce aside. Transfer chicken mixture to bowl, refrigerate for 20 minutes to chill, then stir in cilantro, jalapeños, and 2 cups cheddar.",
    "3. Brush both sides of tortillas with remaining 2 tablespoons oil. Stack tortillas, wrap in damp dish towel, and place on plate; microwave until warm and pliable, about 1 minute. Working with 1 warm tortilla at a time, spread ⅓ cup chicken filling across center of tortilla, roll tortilla tightly around filling, and place seam side down in greased 13 by 9-inch baking dish (or similar size casserole dish); arrange enchiladas in 2 columns across width of dish. (Enchiladas, wrapped tightly in plastic wrap and covered with aluminum foil, and sauce can be refrigerated separately for up to 24 hours or frozen for up to 1 month; if frozen, thaw completely in the refrigerator.)",
    "4. Spray top of enchiladas with oil spray and bake uncovered until lightly toasted on top, 10 to 15 minutes. Pour sauce over enchiladas, covering tortillas completely, then sprinkle remaining ½ cup cheddar across center of enchiladas. Cover dish tightly with greased aluminum foil and bake until enchiladas are hot throughout, bubbling around edges, and cheese is melted, 20 to 25 minutes. Serve immediately."
  ]
}