{
  "title": "Chicken Tandoori",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2tablespoons vegetable oil",
    "6garlic cloves, minced",
    "2tablespoons grated fresh ginger",
    "1tablespoon garam masala",
    "2teaspoons ground cumin",
    "2teaspoons chili powder",
    "1cup plain whole-milk yogurt",
    "¼cup lime juice (2 limes), divided, plus lime wedges for serving",
    "2teaspoons table salt",
    "3pounds bone-in chicken pieces (split breasts cut in half, drumsticks, and/or thighs), skin removed, trimmed"
  ],
  "directions": [
    "1. Heat oil in 10-inch skillet over medium heat until shimmering. Add garlic and ginger and cook until fragrant, about 30 seconds. Stir in garam masala, cumin, and chili powder and continue to cook until fragrant, 30 seconds longer. Transfer half of garlic mixture to medium bowl, stir in yogurt and 2 tablespoons lime juice, and set aside. In large bowl, combine remaining garlic mixture, remaining 2 tablespoons lime juice, and salt.",
    "2. Using sharp knife, make 2 or 3 short slashes in each piece of chicken. Transfer chicken to large bowl and gently rub with lime juice mixture until all pieces are evenly coated. Let sit at room temperature for 30 minutes.",
    "3. Adjust oven rack to upper-middle position and heat oven to 325 degrees. Set wire rack in aluminum foil–lined rimmed baking sheet. Pour yogurt mixture over chicken and toss until chicken is evenly and thickly coated. Arrange chicken pieces, scored side down, on prepared wire rack. Discard excess yogurt mixture. Roast chicken until breast pieces register 125 degrees and drumsticks/thighs register 130 degrees, 15 to 25 minutes. (Smaller pieces may cook faster than larger pieces. Remove pieces from oven as they reach correct temperature.)",
    "4. Adjust oven rack 6 inches from broiler element and heat broiler. Return chicken to wire rack, scored side up, and broil until chicken is lightly charred in spots and breast pieces register 160 degrees and drumsticks/thighs register 175 degrees, 8 to 15 minutes. Transfer chicken to plate, tent with foil, and let rest for 5 minutes. Serve with lime wedges."
  ]
}