{
  "title": "Chicken Tagine with Fennel, Chickpeas, and Apricots",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2tablespoons extra-virgin olive oil, divided, plus extra as needed",
    "5garlic cloves, minced",
    "1½teaspoons paprika",
    "½teaspoon ground turmeric",
    "½teaspoon ground cumin",
    "¼teaspoon ground ginger",
    "¼teaspoon cayenne pepper",
    "2(15-ounce) cans chickpeas, rinsed, divided",
    "8(5- to 7-ounce) bone-in chicken thighs, trimmed",
    "¾teaspoon table salt, divided",
    "¼teaspoon pepper",
    "1large fennel bulb, stalks discarded, bulb halved and cut into ½-inch-thick wedges through core",
    "3(2-inch) strips lemon zest, plus lemon wedges for serving",
    "1cinnamon stick",
    "½cup dry white wine",
    "1cup chicken broth",
    "1cup pitted large brine-cured green or black olives, halved",
    "½cup dried apricots, halved",
    "2tablespoons chopped fresh parsley"
  ],
  "directions": [
    "1. Adjust oven rack to upper-middle position and heat oven to 350 degrees. Combine 1 tablespoon oil, garlic, paprika, turmeric, cumin, ginger, and cayenne in bowl; set aside. Place ½ cup chickpeas in second bowl and mash to coarse paste with potato masher.",
    "2. Pat chicken dry with paper towels and sprinkle with salt and pepper. Heat remaining 1 tablespoon oil in 12-inch ovensafe skillet over medium-high heat until just smoking. Cook chicken skin side down until skin is crisped and well browned, 8 to 10 minutes; transfer chicken skin side up to plate.",
    "3. Pour off all but 2 tablespoons fat from skillet (or, if necessary, add extra oil to equal 2 tablespoons). Heat fat left in skillet over medium heat until shimmering. Arrange fennel cut side down in skillet and sprinkle with remaining ¼ teaspoon salt. Cover and cook until lightly browned, 3 to 5 minutes per side. Push fennel to sides of skillet. Add spice mixture, lemon zest, and cinnamon stick to center and cook, mashing spice mixture into skillet, until fragrant, about 30 seconds. Stir spice mixture into fennel. Stir in wine, scraping up any browned bits, and cook until almost evaporated, about 2 minutes.",
    "4. Stir in broth, olives, apricots, mashed chickpeas, and whole chickpeas and bring to simmer. Nestle chicken skin side up into skillet, keeping skin above liquid. Roast until fennel is tender and chicken registers 185 degrees, 35 to 40 minutes. Using pot holders, carefully remove skillet from oven. Discard lemon zest and cinnamon stick. Season with salt and pepper to taste. Sprinkle with parsley and serve with lemon wedges."
  ]
}