{
  "title": "Chicken Potpies That Fit In Your Pocket",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes 15 or 16",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "Filling",
    "One 4- to 4½-pound whole chicken (preferably one that had hobbies)",
    "1½tablespoons kosher salt (Diamond Crystal or about half as much Morton), or more if you like",
    "2tablespoons freshly ground black pepper",
    "2tablespoons vegetable oil",
    "2large onions; 1 roughly chopped, 1 finely diced",
    "2large carrots; 1 roughly chopped, 1 finely diced",
    "4celery stalks; 2 roughly chopped, 2 finely diced",
    "5garlic cloves, roughly chopped",
    "2tablespoons granulated chicken bouillon (preferably Totole brand; optional but optimal)",
    "¼cup rendered chicken fat (ideally) or unsalted butter",
    "¼cup all-purpose flour",
    "3tablespoons chopped thyme leaves",
    "3tablespoons chopped rosemary leaves",
    "2tablespoons Huy Fong Foods Sriracha",
    "1tablespoon Louisiana-style hot sauce",
    "2teaspoons sherry vinegar",
    "For the Pies",
    "15 or 16frozen roti paratha",
    "2eggs",
    "Chicken Salt or kosher salt",
    "1cup Big Zesty Buttermilk Dressing",
    "Two 2-ounce clamshells tarragon, finely chopped (about ½ cup)"
  ],
  "directions": [
    "To make the filling: Get your oven to 375°F.",
    "Spatchcock the chicken. Season it all over with 1 tablespoon of the salt and 1 tablespoon of the pepper. Get 1 tablespoon of the oil hot in a Dutch oven over medium heat. Sear the chicken (cut in half and sear in batches if needed) on both sides until deeply golden. Add the backbone too.",
    "Remove the chicken to a plate. Add the roughly chopped onion, carrot, celery, and garlic to the pot. Cook for a couple of minutes, scraping the bottom. Add 1 cup water, scrape again, then add chicken bouillon and 5 more cups water. Return the chicken, cover tightly, and cook in the oven for 1½ hours until falling apart.",
    "Meanwhile, sauté the finely diced onion, carrot, and celery in the remaining 1 tablespoon oil over medium-low heat until translucent. Transfer to a large mixing bowl.",
    "In the same skillet, heat the chicken fat or butter, then whisk in the flour to make a roux. Cook until light golden and no longer smells like raw flour, 2 to 3 minutes. Transfer to a small bowl.",
    "Remove the cooked chicken and let it cool. Strain the broth, discard solids, and simmer the liquid until reduced to about 2 cups, 15 to 20 minutes. Whisk in 3 tablespoons roux, thyme, and rosemary. Simmer until thickened like queso. Add more roux if needed.",
    "Shred the chicken, discard skin and bones. Add to the bowl with the vegetables. Stir in gravy, sriracha, hot sauce, vinegar, remaining ½ tablespoon salt, and remaining 1 tablespoon pepper. Adjust seasoning and chill the mixture for at least 1 hour, up to 3 days.",
    "To assemble the pies: Let the roti paratha thaw for 5–10 minutes until pliable. For each pie, place a generous ⅓ cup filling in the center. Fold over, press edges to seal, and crimp with a fork.",
    "Heat oven to 375°F. Line a baking sheet with parchment or foil.",
    "Place pies on sheet with space between. Whisk eggs with 2 tablespoons water, then brush over pies. Sprinkle with chicken salt. Bake 30 to 35 minutes until golden brown and hot inside.",
    "Mix buttermilk dressing with chopped tarragon. Dip the pies and eat."
  ]
}