{
  "title": "Chicken Saltimbocca",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "4(6- to 8-ounce) boneless, skinless chicken breasts, tenderloins removed, trimmed",
    "½cup all-purpose flour",
    "1teaspoon pepper",
    "1tablespoon minced fresh sage, plus 8 large leaves (optional)",
    "8thin slices prosciutto (4 ounces)",
    "¼cup extra-virgin olive oil, divided",
    "1¼cups dry vermouth or dry white wine",
    "2teaspoons lemon juice",
    "4tablespoons unsalted butter, cut into 4 pieces and chilled",
    "1tablespoon minced fresh parsley"
  ],
  "directions": [
    "1. Starting on thick side, cut each chicken breast in half horizontally. Pound cutlets to uniform ¼-inch thickness. Combine flour and pepper in shallow dish.",
    "2. Pat cutlets dry with paper towels. Working with 1 cutlet at a time, dredge cutlets in flour mixture, shaking off excess, and transfer to large platter. Sprinkle cutlets evenly with minced sage. Place 1 prosciutto slice on top of each cutlet, covering sage, and press lightly to adhere.",
    "3. Heat 2 tablespoons oil in 12-inch skillet over medium-high heat until shimmering. Add sage leaves, if using, and cook until leaves begin to change color and are fragrant, 15 to 20 seconds. Using slotted spoon, transfer leaves to paper towel–lined plate; set aside.",
    "4. Place 4 cutlets in skillet, prosciutto side down, and cook over medium-high heat until golden brown on first side, about 3 minutes. Using tongs, flip cutlets, reduce heat to medium, and continue to cook until no longer pink and lightly browned on second side, about 2 minutes longer; transfer cutlets to second large platter. Wipe out skillet with paper towels. Repeat with remaining 2 tablespoons oil and remaining 4 cutlets. Tent with aluminum foil and set aside while preparing sauce.",
    "5. Pour off fat from skillet. Add vermouth, scraping up any browned bits. Bring to simmer and cook until reduced to ⅓ cup, 5 to 7 minutes. Stir in lemon juice. Reduce heat to low and whisk in butter, 1 piece at a time. Off heat, stir in parsley and season with salt and pepper to taste. Pour sauce over cutlets; place sage leaf, if using, on top of each cutlet; and serve immediately."
  ]
}