{
  "title": "Chicken Tagine with Olives and Lemon",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "1¼teaspoons paprika",
    "½teaspoon ground cumin",
    "½teaspoon ground ginger",
    "¼teaspoon cayenne pepper",
    "¼teaspoon ground coriander",
    "¼teaspoon ground cinnamon",
    "3(2-inch) strips lemon zest, divided, plus 3 tablespoons juice",
    "5garlic cloves, minced, divided",
    "4pounds bone-in chicken pieces (2 split breasts halved crosswise, 2 drumsticks, and 2 thighs), trimmed",
    "¾teaspoon table salt",
    "¾teaspoon pepper",
    "1tablespoon extra-virgin olive oil",
    "1large onion, halved and sliced ¼ inch thick",
    "1¾cups chicken broth",
    "1tablespoon honey",
    "2carrots, peeled and cut crosswise into ½-inch-thick rounds, very large pieces cut into half-moons",
    "1cup pitted cracked green olives, halved",
    "2tablespoons chopped fresh cilantro"
  ],
  "directions": [
    "1. Combine paprika, cumin, ginger, cayenne, coriander, and cinnamon in small bowl and set aside. Mince 1 strip lemon zest, add 1 teaspoon minced garlic, and mince together until reduced to fine paste; set aside.",
    "2. Sprinkle chicken pieces with salt and pepper. Heat oil in Dutch oven over medium-high heat until just beginning to smoke. Add chicken, skin side down, and cook without moving until skin is deep golden, about 5 minutes. Using tongs, flip chicken and brown on second side, about 4 minutes. Transfer chicken to large plate; when cool enough to handle, remove and discard skin. Pour off and discard all but 1 tablespoon fat from pot.",
    "3. Add onion and remaining 2 lemon zest strips to pot and cook, stirring occasionally, until onion slices have browned at edges but still retain their shape, 5 to 7 minutes (add 1 tablespoon water if pot gets too dark). Add remaining garlic and cook until fragrant, about 30 seconds. Add spice mixture and cook, stirring constantly, until darkened and very fragrant, 45 to 60 seconds. Stir in broth and honey, scraping up any browned bits. Add thighs and drumsticks, reduce heat to medium, and simmer for 5 minutes.",
    "4. Add carrots and breast pieces with any accumulated juices to pot, arranging breast pieces in single layer on top of carrots. Cover, reduce heat to medium-low, and simmer until breast pieces register 160 degrees, 10 to 15 minutes.",
    "5. Transfer chicken to plate and tent with aluminum foil. Add olives to pot; increase heat to medium-high and simmer until liquid has thickened slightly and carrots are tender, 4 to 6 minutes. Return chicken to pot and stir in garlic mixture, lemon juice, and cilantro; season with salt and pepper to taste. Serve immediately."
  ]
}