{
  "title": "Chicken Milanese with Shaved Celery and Mushroom Salad",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Salad",
    "8ounces (227 g) cremini mushrooms, very thinly sliced on a mandoline",
    "2celery stalks, thinly sliced on a bias on a mandoline (some tender inner leaves reserved)",
    "1⁄4 small red onion, thinly sliced on a mandoline and rinsed",
    "1ounce (28 g) shaved pecorino Romano",
    "1⁄4 cup (10 g) chopped fresh parsley",
    "Zest of 1 lemon",
    "Juice of 1⁄2 lemon",
    "2tablespoons extra virgin olive oil",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Chicken",
    "2boneless, skinless chicken breasts (8 to 10 ounces/227 to 283 g each), halved horizontally",
    "Kosher salt and freshly cracked black pepper, to taste",
    "⅔cup (87 g) all-purpose flour",
    "2eggs, beaten",
    "1cup (90 g) panko breadcrumbs",
    "3⁄4 cup (83 g) finely grated pecorino Romano",
    "Olive oil, for pan-frying"
  ],
  "directions": [
    "1. Make the salad: Place the mushrooms, celery, onion, shaved pecorino Romano, and parsley in a large bowl. Set aside in the refrigerator.2. Make the chicken: Working with one piece of chicken at a time, place the chicken between two pieces of plastic wrap, and use a meat mallet or heavy-bottomed pan to pound it to an even 1⁄4 inch (6 mm) thickness. Transfer the pounded chicken to a small sheet pan lined with a wire rack or a plate, and repeat with the remaining chicken. Season both sides of the chicken with salt and pepper.3. Prepare the breading station: Place the flour in a shallow bowl. Place the eggs in another shallow bowl. Mix the panko and grated pecorino Romano in a third shallow bowl.4. Coat the chicken in the flour, then the egg, and then the panko mixture, making sure to evenly coat in each step. Place the breaded chicken back on the wire rack or plate, and repeat with the remaining cutlets.5. Heat 1⁄4 inch (6 mm) olive oil in a large skillet over medium heat until hot. (You can check by adding a bit of panko to see if it sizzles.)6. Working with two cutlets at a time, carefully add the breaded chicken to the pan by laying it away from you to avoid oil splashes. Cook until golden on one side, 3 or 4 minutes. Flip over and cook on the second side, another 3 or 4 minutes, carefully basting with the hot oil if there are any pale spots. Remove the chicken to a sheet tray lined with a wire rack, and repeat with the remaining cutlets, adding more oil to the pan as needed to keep it 1⁄4 inch (6 mm) up the sides. After cooking, let the oil cool completely and then discard it.7. Remove the salad from the refrigerator, and gently toss with the lemon zest, lemon juice, olive oil, salt, and pepper. Be careful not to break up the mushrooms too much as you toss.8. Serve the chicken cutlets topped with the salad and celery leaves."
  ]
}