{
  "title": "Chicken And Rice With Chorizo And Saffron",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "½cup all-purpose flour",
    "4(6- to 8-ounce) boneless, skinless chicken breasts, trimmed",
    "1teaspoon table salt, divided",
    "¼teaspoon pepper",
    "3tablespoons vegetable oil, divided",
    "8ounces Spanish-style chorizo sausage, quartered lengthwise and sliced ¼ inch thick",
    "1onion, chopped fine",
    "1red bell pepper, stemmed, seeded, and chopped fine",
    "1½cups long-grain white rice",
    "3garlic cloves, minced",
    "Pinch saffron threads, crumbled",
    "4½cups chicken broth",
    "1cup frozen peas"
  ],
  "directions": [
    "1. Spread flour in shallow dish. Pound chicken breasts to uniform thickness. Pat chicken dry with paper towels and sprinkle with ½ teaspoon salt and pepper. Working with 1 breast at a time, lightly dredge chicken in flour, shaking off excess.",
    "2. Heat 2 tablespoons oil in 12-inch nonstick skillet over medium-high heat until shimmering. Cook chicken until lightly browned on both sides, 8 to 10 minutes; transfer to plate.",
    "3. Heat remaining 1 tablespoon oil in now-empty skillet over medium heat until shimmering. Add chorizo, onion, bell pepper, and remaining ½ teaspoon salt and cook until onion is softened, about 5 minutes. Stir in rice, garlic, and saffron and cook until fragrant, about 30 seconds.",
    "4. Stir in broth, scraping up any browned bits. Nestle chicken into rice, add any accumulated juices, and bring to simmer. Reduce heat to medium-low, cover, and cook until chicken registers 160 degrees, about 10 minutes.",
    "5. Transfer chicken to clean plate, brushing any rice that sticks to chicken back into skillet, and tent chicken with aluminum foil to keep warm. Cover and continue to cook rice over medium-low heat, stirring occasionally, until liquid has been absorbed and rice is tender, about 10 minutes.",
    "6. Off heat, sprinkle peas over rice, cover, and let sit until heated through, about 2 minutes. Season with salt and pepper to taste, and serve with chicken."
  ]
}