{
  "title": "Chicken Francese",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "½cup plus 1 teaspoon cornstarch, divided",
    "2large eggs",
    "2tablespoons milk",
    "1cup chicken broth",
    "½cup dry white wine",
    "¾teaspoon table salt, divided",
    "4(6- to 8-ounce) boneless, skinless chicken breasts, trimmed",
    "¼teaspoon pepper",
    "6tablespoons unsalted butter, cut into 6 pieces, divided",
    "2tablespoons capers, rinsed",
    "1garlic clove, minced",
    "2tablespoons lemon juice",
    "1tablespoon chopped fresh parsley"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 200 degrees. Set wire rack in rimmed baking sheet.",
    "2. Meanwhile, place ½ cup cornstarch in shallow dish. Whisk eggs and milk together in second shallow dish. Whisk broth, wine, ¼ teaspoon salt, and remaining 1 teaspoon cornstarch together in bowl.",
    "3. Starting on thick side, cut each chicken breast in half horizontally. Pound cutlets to uniform ¼-inch thickness. Pat cutlets dry with paper towels and sprinkle with remaining ½ teaspoon salt and ¼ teaspoon pepper. Working with 1 cutlet at a time, dredge cutlets in cornstarch, shaking off excess; dip in egg mixture to coat, letting excess drip off; then place on large plate in single layer.",
    "4. Melt 2 tablespoons butter in 12-inch nonstick skillet over medium-high heat. Cook 4 cutlets until golden brown on both sides and cooked through, 4 to 6 minutes, using fork to flip. Transfer to prepared rack and place in oven to keep warm. Repeat with 2 tablespoons butter and remaining 4 cutlets; transfer to rack.",
    "5. Add capers and garlic to now-empty skillet and cook until fragrant, about 30 seconds. Add broth mixture to skillet and bring to boil. Cook until reduced by half, about 5 minutes. Off heat, stir in lemon juice and remaining 2 tablespoons butter.",
    "6. Transfer chicken to platter. Spoon sauce over chicken and sprinkle with parsley. Serve."
  ]
}