{
  "title": "Chicken Dan Dan Noodles",
  "source": "The Gaijin Cookbook - Ivan Orkin",
  "servings": "Serves 4",
  "categories": [
    "Japanese",
    "The Gaijin Cookbook - Ivan Orkin"
  ],
  "ingredients": [
    "Broth",
    "1whole chicken (about 4 pounds), preferably with head and feet still attached",
    "2pounds chicken feet or 3 pounds chicken backs",
    "Tare (Seasoning Sauce)",
    "1teaspoon Sichuan peppercorns",
    "1teaspoon red pepper flakes",
    "2tablespoons toasted sesame oil",
    "2tablespoons chicken fat, reserved from the broth (or vegetable oil)",
    "2tablespoons finely sliced scallions",
    "¼cup white soy sauce (shiro shoyu; see headnote)",
    "2tablespoons brown rice vinegar (see headnote; use regular rice vinegar in a pinch)",
    "½teaspoon sugar",
    "½teaspoon kosher salt",
    "Chicken Topping",
    "1tablespoon Sichuan peppercorns",
    "1tablespoon red pepper flakes",
    "2tablespoons toasted sesame oil",
    "3tablespoons chicken fat, reserved from the broth (or vegetable oil)",
    "3tablespoons chopped scallion whites",
    "1tablespoon minced or grated ginger",
    "1tablespoon minced garlic",
    "¼cup sesame seeds",
    "1pound ground chicken",
    "2tablespoons sugar",
    "2teaspoons kosher salt",
    "For Serving",
    "1pound fresh ramen noodles or any thick fresh noodle you like",
    "Chopped scallions"
  ],
  "directions": [
    "1. For the broth: Place the whole chicken in a large stockpot. Add the chicken feet or backs and cover with 5 quarts cold water. Bring to a simmer over medium heat, skimming any gray scum that floats to the surface during the first 10 to 15 minutes of cooking. Reduce the heat to medium-low and simmer for 6 hours, replenishing the broth with fresh water as it reduces. (I like to mark the top of the water line with a permanent marker at the beginning, so I don’t forget where I started.) Strain the broth, let cool to room temperature, and refrigerate overnight.",
    "2. The next day, scrape the fat off the top of the broth and reserve 5 tablespoons separately. (You will only need 2 cups broth for this recipe, but you can easily freeze the leftovers and use them wherever a clean, flavorful chicken stock will come in handy.)",
    "3. For the tare: Grind the Sichuan peppercorns and red pepper flakes together in a spice grinder; set aside. Heat a small skillet over medium heat, then add the sesame oil and the 2 tablespoons reserved chicken fat (or vegetable oil). Add the ground spices and sliced scallions and cook, stirring constantly, until the scallions have wilted slightly and the spices are very fragrant, about 2 minutes. Remove from the heat and immediately stir in the white soy sauce, vinegar, sugar, and salt. Transfer to a large bowl.",
    "4. Bring a large pot of water to a boil for the noodles and season liberally with salt. In a separate saucepan, reheat 2 cups chicken broth over low heat.",
    "5. Meanwhile, for the chicken topping: Grind the Sichuan peppercorns and red pepper flakes together in a spice grinder; set aside. Heat a large skillet over medium heat, then coat with the sesame oil and the 3 tablespoons reserved chicken fat. Add the scallions, ginger, and garlic and cook until very fragrant, about 2 minutes. Stir in the ground spices and sesame seeds and cook for another 2 minutes. Add the ground chicken, sugar, and salt and sauté, using a fork or wooden spoon to break up the chicken, until the meat is cooked through and any liquid has mostly cooked off, about 5 minutes.",
    "6. Once the chicken is ready, drop the noodles into the boiling water and cook until al dente. Drain the noodles thoroughly in a colander, shaking them to remove the excess water.",
    "7. To serve, whisk the hot broth into the reserved tare. Add the cooked noodles and toss to combine thoroughly. Portion among four bowls and top each with a quarter of the chicken topping. Garnish with chopped scallions and serve immediately."
  ]
}