{
  "title": "Chicken and Rice, Street Cart Style",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 4 servings",
  "categories": [
    "***NEED TO MAKE",
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "marinade and chicken",
    "Juice of ½ lemon",
    "2garlic cloves, minced",
    "1teaspoon kosher salt",
    "1teaspoon paprika, sweet, hot or smoked",
    "¾teaspoon ground coriander",
    "1½teaspoons ground cumin",
    "A pinch of ground cloves",
    "1teaspoon dried oregano",
    "2pounds (roughly 1 kilogram) boneless, skinless chicken thighs (about 6)",
    "1tablespoon (15 ml) olive oil, plus more to coat the pan",
    "rice",
    "1tablespoon (15 ml) olive oil",
    "½teaspoon ground turmeric",
    "¾teaspoon ground cumin",
    "2cups (360 grams) basmati or another long-grain white rice",
    "3½cups (840 ml) chicken stock",
    "1teaspoon kosher salt",
    "sauce",
    "1cup minus 2 tablespoons (200 grams) plain yogurt",
    "2tablespoons (25 grams) mayonnaise",
    "1tablespoon (15 ml) distilled white vinegar",
    "½teaspoon granulated sugar",
    "½teaspoon kosher salt",
    "assembly",
    "½head iceberg lettuce, chopped",
    "2medium tomatoes, chopped",
    "½small white or red onion, chopped",
    "Kosher salt and freshly ground pepper, to taste",
    "1tablespoon (15 ml) hot sauce",
    "1tablespoon (15 grams) harissa",
    "1tablespoon (15 ml) olive oil",
    "Chopped fresh cilantro, for garnish (optional)",
    "3large pocketless pita breads, toasted, halved"
  ],
  "directions": [
    "marinate the chicken Combine the ingredients for the marinade, and pour into a large ziplock bag. Add the chicken, seal, and slosh it around so that it coats evenly. Let the chicken marinate in the fridge for 30 minutes or up to 2 days.",
    "cook the chicken Heat a large, deep skillet with a lid over medium-high heat. Coat lightly with olive or vegetable oil. Arrange the cutlets (usually three at a time) in one layer, and do not move them until they’re brown and don’t want to stick anymore, 5 to 8 minutes. Flip, and brown well on second side, which will take 4 to 5 minutes more. Transfer to a plate. Don’t worry if they’re not 100 percent cooked through yet; you’re mostly prepping them so that when that line of nonpaying customers known as your family appears, you’ll be able to finish the meat and have it hot. Repeat with remaining chicken, then wipe out the pan.",
    "make the rice Add 1 tablespoon olive oil to the pan, and heat it, then add the spices and rice and toast together for a minute, stirring. Add the stock and salt, and bring to a simmer; then reduce the heat to its lowest setting, cover with a lid, and let cook for about 15 minutes, until the water has absorbed and the rice is tender. Let it rest for 3 to 5 minutes off the heat, then scoop onto half of a serving platter.",
    "While the rice cooks, make the sauce, combining all the ingredients in a medium bowl. Adjust seasonings to taste.",
    "Combine the lettuce, tomatoes, and onion in a large bowl to make the salad. Season with salt and pepper. The sauce will be your dressing.",
    "Stir the hot sauce and harissa together to make your hot sauce.",
    "to finish Chop the chicken into bite-sized, uneven pieces. The griddle guys do this with a bench scraper right on the griddle, but you can do it on your cutting board. Reheat the empty pan from the rice over medium-high, add a little olive or another oil, just to coat the pan lightly, and then add the chopped chicken. Cook, stirring and breaking up the meat with spatula into smaller pieces if desired, until it is fully cooked through, 2 to 4 more minutes. Add more salt to season, if desired. Scrape it on top of the rice.",
    "Pile the salad in the remaining part of the platter. Dress the dish with sauce, to taste, and garnish with cilantro. Serve with halved pitas.",
    ""
  ]
}