{
  "title": "Chicken Fat Mashed Potatoes",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Skin from 4 bone-in, skin-on chicken thighs",
    "1⁄4 cup (60 ml) water",
    "Kosher salt and freshly cracked black pepper, to taste",
    "3pounds (1.3 kg) russet potatoes (about 4), scrubbed, peeled, and cut into 2-inch (5 cm) chunks",
    "5garlic cloves, peeled",
    "3⁄4 cup (180 ml) heavy cream",
    "1⁄2 cup (120 ml) whole milk",
    "1⁄4 cup (57 g) unsalted butter, cubed",
    "Thinly sliced fresh chives, to taste"
  ],
  "directions": [
    "1. Arrange the chicken skins in a single layer in a medium nonstick pan. (It’s okay if the skins are crowded in the pan; they will shrink as they cook.) Add the water, set over medium-low heat, and cook, flipping occasionally, until the chicken skins are rendered and crispy and the water has evaporated, 30 to 35 minutes.2. Transfer the skins to a wire rack or paper towel–lined plate, and season with salt. Let cool completely.3. Strain the rendered chicken fat left in the pan through a fine-mesh strainer into a bowl, and set aside.4. Preheat the oven to 325°F (165°C). Line a sheet tray with parchment paper.5. Place the potatoes and garlic in a medium pot, cover with water, set over high heat, and bring to a boil. Generously salt the water, reduce the heat to medium, and simmer until the potatoes and garlic are very tender, 14 to 16 minutes.6. Meanwhile, combine the cream, milk, and butter in a small saucepan over low heat to melt the butter and keep warm while you finish the potatoes.7. When the potatoes and garlic are tender, drain them into a colander and then transfer them to the sheet tray. Hang onto the pot; you’ll use it again later.8. Bake the potatoes and garlic until they’ve dried out and the potatoes have a chalky white appearance on the outside, 6 to 8 minutes. This drying-out step makes for the fluffiest mash!9. Return the potatoes and garlic to the pot they were boiled in. Mash the potatoes using a potato masher. Alternatively, for extra-smooth mash, spoon the potatoes and garlic from the sheet pan into a ricer, working in batches as needed, and press through the ricer into the pot.10. Add the warm butter-cream mixture and 2 or 3 tablespoons of the reserved chicken fat (depending on your preference and how much fat you have), and mix well. Season with salt and pepper.11. Break the reserved chicken skins into shards.12. Serve the mash, topped with the crispy skins, chives, and more pepper."
  ]
}