{
  "title": "Chicken Souvlaki",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "Tzatziki",
    "½cucumber, peeled, halved lengthwise, seeded, and shredded",
    "¼teaspoon table salt",
    "½cup whole-milk Greek yogurt",
    "1tablespoon extra-virgin olive oil",
    "1tablespoon minced fresh mint and/or dill",
    "1small garlic clove, minced",
    "Chicken",
    "2tablespoons table salt for brining",
    "1½pounds boneless, skinless chicken breasts, trimmed and cut into 1-inch pieces",
    "⅓cup extra-virgin olive oil",
    "2tablespoons minced fresh parsley",
    "1teaspoon finely grated lemon zest plus ¼ cup juice (2 lemons)",
    "1teaspoon honey",
    "1teaspoon dried oregano",
    "½teaspoon pepper",
    "1green bell pepper, quartered, stemmed, seeded, and each quarter cut into 4 pieces",
    "1small red onion, halved through root end, each half cut into 4 pieces",
    "4–6(8-inch) pita breads"
  ],
  "directions": [
    "1. For the tzatziki Toss cucumber with salt in colander and let drain for 15 minutes. Whisk yogurt, oil, mint, and garlic together in bowl, then stir in drained cucumber. Season with salt and pepper to taste. Cover and refrigerate until chilled, at least 1 hour or up to 2 days.",
    "2. For the chicken Dissolve salt in 1 quart cold water in large container. Submerge chicken in brine, cover, and refrigerate for 30 minutes. Combine oil, parsley, lemon zest and juice, honey, oregano, and pepper in medium bowl. Reserve ¼ cup oil mixture in large bowl.",
    "3. Remove chicken from brine and pat dry with paper towels. Toss chicken with remaining oil mixture. Thread 4 pieces of bell pepper, concave side up, onto one 12-inch metal skewer. Thread one-quarter of chicken onto skewer. Thread 2 chunks of onion onto skewer and place skewer on plate. Repeat skewering remaining chicken and vegetables on 3 more skewers. Lightly moisten 2 pita breads with water. Sandwich unmoistened pitas between moistened pitas and wrap stack tightly in lightly greased heavy-duty aluminum foil.",
    "4A. For a charcoal grill Open bottom vent completely. Light large chimney starter mounded with charcoal briquettes (7 quarts). When top coals are partially covered with ash, pour evenly over half of grill. Set cooking"
  ]
}