{
  "title": "Chicken Quesadillas With Roasted Corn And Jack Cheese",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "3tablespoons plus 1 teaspoon vegetable oil, divided",
    "1pound boneless, skinless chicken breasts, trimmed",
    "¾teaspoon table salt, divided",
    "⅛teaspoon pepper",
    "3scallions, white and green parts separated, sliced thin",
    "2garlic cloves, minced",
    "1teaspoon ground cumin",
    "8ounces Monterey Jack cheese, shredded (2 cups)",
    "½cup jarred roasted red peppers, patted dry and chopped",
    "¼cup minced fresh cilantro",
    "1teaspoon hot sauce",
    "4(10-inch) flour tortillas",
    "1cup tomato salsa",
    "¼cup sour cream"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 450 degrees. Line rimmed baking sheet with aluminum foil and brush with 1 tablespoon oil.",
    "2. Pound chicken breasts to uniform thickness. Pat chicken dry with paper towels and sprinkle with ¼ teaspoon salt and pepper. Heat 1 tablespoon oil in 12-inch nonstick skillet over medium-high heat until just smoking. Gently lay chicken in skillet and cook, turning as needed, until lightly golden on both sides and registers 160 degrees, about 12 minutes. Transfer chicken to cutting board, let cool slightly, then shred into bite-size pieces using 2 forks.",
    "3. Add 1 teaspoon oil, scallion whites, garlic, cumin, and remaining ½ teaspoon salt to now-empty skillet and cook over medium heat until softened, about 2 minutes; transfer to medium bowl. Add chicken, scallion greens, Monterey Jack, peppers, cilantro, and hot sauce and toss to combine.",
    "4. Lay tortillas on counter. Spread chicken filling over half of each tortilla, leaving ½-inch border around edge. Fold other half of tortilla over top and press firmly to compact. Arrange quesadillas in single layer on prepared sheet with rounded edges facing center of sheet. Brush with remaining 1 tablespoon oil.",
    "5. Bake until quesadillas begin to brown, about 10 minutes. Flip quesadillas over and press gently with spatula to compact. Continue to bake until crisp and golden brown on second side, about 5 minutes. Let quesadillas cool on wire rack for 5 minutes, then slice each into 4 wedges. Serve with salsa and sour cream."
  ]
}