{
  "title": "Chicken Leg Quarters With Cauliflower And Shallots",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "1head cauliflower (2 pounds), cored and cut into 8 wedges through stem",
    "6shallots, peeled and halved",
    "¼cup extra-virgin olive oil, divided",
    "2tablespoons chopped fresh sage or 2 teaspoons dried, divided",
    "1teaspoon table salt, divided",
    "1teaspoon pepper, divided",
    "4(10-ounce) chicken leg quarters, trimmed",
    "2garlic cloves, minced",
    "1teaspoon grated lemon zest, plus lemon wedges for serving",
    "8ounces grape tomatoes",
    "1tablespoon chopped fresh parsley"
  ],
  "directions": [
    "1. Adjust 1 oven rack to lower-middle position and second rack 6 inches from broiler element. Heat oven to 475 degrees. Gently toss cauliflower and shallots with 2 tablespoons oil, 1 tablespoon sage, ½ teaspoon salt, and ½ teaspoon pepper on rimmed baking sheet. Arrange cauliflower pieces cut side down in single layer in center of sheet.",
    "2. Pat chicken dry with paper towels. Make 4 diagonal slashes through skin and meat of each leg quarter with sharp knife (each slash should reach bone). Sprinkle chicken with remaining ½ teaspoon salt and remaining ½ teaspoon pepper. Place each piece of chicken skin side up in 1 corner of sheet; rest chicken directly on sheet, not on vegetables.",
    "3. Whisk garlic, lemon zest, remaining 2 tablespoons oil, and remaining 1 tablespoon sage together in bowl. Brush skin side of chicken with seasoned oil mixture. Transfer sheet to lower rack and roast until chicken registers 175 degrees, cauliflower is browned, and shallots are tender, 25 to 30 minutes, rotating sheet halfway through roasting.",
    "4. Remove sheet from oven and heat broiler. Scatter tomatoes over vegetables. Place sheet on upper rack and broil until chicken skin is browned and crisp and tomatoes have begun to wilt, 3 to 5 minutes.",
    "5. Remove sheet from oven and let rest for 5 minutes. Sprinkle with parsley and serve with lemon wedges."
  ]
}