{
  "title": "Chicken Marbella",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "Paste",
    "⅓cup pitted green olives, rinsed",
    "⅓cup pitted prunes",
    "3tablespoons extra-virgin olive oil",
    "2tablespoons capers, rinsed",
    "4garlic cloves, peeled",
    "3anchovy fillets, rinsed",
    "½teaspoon dried oregano",
    "½teaspoon pepper",
    "¼teaspoon kosher salt",
    "Pinch red pepper flakes",
    "Chicken",
    "2½–3pounds bone-in, skin-on split chicken breasts and/or leg quarters, trimmed",
    "1½teaspoons table salt",
    "¼teaspoon pepper",
    "2teaspoons extra-virgin olive oil",
    "¾cup chicken broth",
    "⅓cup white wine",
    "⅓cup pitted green olives, rinsed and halved",
    "1tablespoon capers, rinsed",
    "2bay leaves",
    "⅓cup pitted prunes, chopped coarse",
    "1tablespoon unsalted butter",
    "1teaspoon red wine vinegar",
    "2tablespoons minced fresh parsley, divided"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 400 degrees.",
    "2. For the paste Pulse all ingredients in food processor until finely chopped, about 10 pulses. Scrape down bowl and continue to process until mostly smooth, 1 to 2 minutes. Transfer to bowl. (Paste can be refrigerated for up to 24 hours.)",
    "3. For the chicken Pat chicken dry with paper towels and sprinkle with salt and pepper. Heat oil in 12-inch ovensafe skillet over medium-high heat until just smoking. Cook chicken skin side down until browned, 5 to 8 minutes. Transfer chicken to plate. Drain off all but 1 teaspoon fat from skillet and return to medium-low heat.",
    "4. Add ⅓ cup paste to skillet and cook, stirring constantly, until fragrant and fond forms on pan bottom, 1 to 2 minutes. Stir in broth, wine, olives, capers, and bay leaves, scraping up any browned bits. Return chicken to pan, skin side up (skin should be above surface of liquid), and roast, uncovered, for 15 minutes.",
    "5. Remove skillet from oven and use back of spoon to spread remaining paste over chicken pieces; sprinkle prunes around chicken. Continue to roast until paste begins to brown, breasts register 160 degrees, and leg quarters register 175 degrees, 7 to 12 minutes longer.",
    "6. Transfer chicken to serving platter and tent with aluminum foil. Remove bay leaves from sauce and whisk in butter, vinegar, and 1 tablespoon parsley; season with salt and pepper to taste. Pour sauce around chicken, sprinkle with remaining 1 tablespoon parsley, and serve."
  ]
}