{
  "title": "Chicken Tinga",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2pounds boneless, skinless chicken thighs, trimmed",
    "½teaspoon table salt",
    "¼teaspoon pepper",
    "2tablespoons vegetable oil, divided",
    "1onion, halved and sliced thin",
    "3garlic cloves, minced",
    "1teaspoon ground cumin",
    "¼teaspoon ground cinnamon",
    "1(14.5-ounce) can fire-roasted diced tomatoes",
    "½cup chicken broth",
    "2tablespoons minced canned chipotle chile in adobo sauce plus 2 teaspoons adobo sauce",
    "½teaspoon packed brown sugar",
    "1teaspoon grated lime zest plus 2 tablespoons juice",
    "12(6-inch) corn tortillas, warmed",
    "1avocado, halved, pitted, and cut into ½-inch pieces",
    "2ounces cotija cheese, crumbled (½ cup)",
    "6scallions, minced",
    "Fresh cilantro leaves",
    "Lime wedges"
  ],
  "directions": [
    "1. Pat chicken dry with paper towels and sprinkle with salt and pepper. Heat 1 tablespoon oil in Dutch oven over medium-high heat until shimmering. Add half of chicken and brown on both sides, 3 to 4 minutes per side. Transfer to large plate and repeat with remaining chicken.",
    "2. Reduce heat to medium, add remaining 1 tablespoon oil to now-empty pot, and heat until shimmering. Add onion and cook, stirring frequently, until softened, about 5 minutes. Add garlic, cumin, and cinnamon and cook until fragrant, about 1 minute. Add tomatoes and their juice, broth, chipotle and adobo sauce, and sugar and bring to boil, scraping up any browned bits.",
    "3. Return chicken and any accumulated juices to pot, reduce heat to medium-low, cover, and simmer until meat registers 195 degrees, 15 to 20 minutes, flipping chicken after 5 minutes. Transfer chicken to cutting board.",
    "4. Transfer cooking liquid to blender and process until smooth, 15 to 30 seconds. Return sauce to pot. When cool enough to handle, shred chicken into bite-size pieces using 2 forks. Return chicken to pot with sauce. Cook over medium heat, stirring frequently, until sauce is thickened and clings to chicken, about 10 minutes. Stir in lime zest and juice and season with salt and pepper to taste. Serve with tortillas, passing avocado, cotija, scallions, cilantro, and lime wedges separately."
  ]
}