{
  "title": "Chicken Scarpariello",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "3pounds bone-in chicken pieces (2 split breasts halved crosswise, 2 drumsticks, and 2 thighs), trimmed",
    "1teaspoon table salt",
    "½teaspoon pepper",
    "1tablespoon vegetable oil",
    "8ounces sweet Italian sausage, casings removed",
    "1onion, halved and sliced thin",
    "1red bell pepper, stemmed, seeded, and sliced thin",
    "5jarred hot cherry peppers, seeded, rinsed, and sliced thin (½ cup), plus 2 tablespoons brine",
    "5garlic cloves, minced",
    "1teaspoon dried oregano",
    "1tablespoon all-purpose flour",
    "¾cup chicken broth",
    "2tablespoons chopped fresh parsley"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 350 degrees. Pat chicken dry with paper towels and season with salt and pepper. Heat oil in 12-inch ovensafe skillet over medium-high heat until just smoking. Add chicken to skillet, skin side down, and cook without moving until well browned, about 5 minutes. Flip chicken and continue to cook until browned on second side, about 3 minutes. Transfer chicken to plate.",
    "2. Add sausage to fat left in skillet and cook, breaking up with spoon, until browned, about 3 minutes. Transfer sausage to paper towel–lined plate.",
    "3. Pour off all but 1 tablespoon fat from skillet and return to medium-high heat. Add onion and bell pepper and cook until vegetables are softened and lightly browned, about 5 minutes. Add cherry peppers, garlic, and oregano and cook until fragrant, about 1 minute. Stir in flour and cook for 30 seconds. Add broth and cherry pepper brine and bring to simmer, scraping up any browned bits.",
    "4. Remove skillet from heat and stir in sausage. Arrange chicken pieces, skin side up, in single layer in skillet and add any accumulated juices. Transfer skillet to oven and bake until breasts register 160 degrees and drumsticks/thighs register 175 degrees, 20 to 25 minutes.",
    "5. Being careful of hot skillet handle, carefully remove skillet from oven. Transfer chicken to serving platter. Season onion mixture with salt and pepper to taste, then spoon over chicken. Sprinkle with parsley. Serve."
  ]
}