{
  "title": "Chicken Provençal With Saffron, Orange, And Basil",
  "source": "Modern Bistro - ATK",
  "servings": "4",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "8(5- to 7-ounce) bone-in chicken thighs, trimmed",
    "Table salt",
    "1tablespoon extra-virgin olive oil, divided",
    "1small onion, chopped fine",
    "6garlic cloves, minced",
    "1anchovy fillet, rinsed and minced",
    "⅛teaspoon cayenne pepper",
    "1cup dry white wine",
    "⅛teaspoon saffron threads",
    "1(14.5-ounce) can diced tomatoes, drained",
    "1cup chicken broth",
    "2½tablespoons tomato paste",
    "1½tablespoons chopped fresh thyme",
    "1teaspoon chopped fresh oregano",
    "1teaspoon herbes de Provence (optional)",
    "1bay leaf",
    "1½teaspoons grated orange zest, divided",
    "½cup pitted niçoise olives",
    "1tablespoon chopped fresh basil"
  ],
  "directions": [
    "1  Adjust oven rack to lower-middle position and heat oven to 300 degrees. Pat chicken dry with paper towels and sprinkle both sides with salt. Heat 1 teaspoon oil in Dutch oven over medium- high heat until shimmering. Add 4 thighs, skin side down, and cook without moving them until skin is crispy and well browned, about 5 minutes. Using tongs, flip chicken and brown on second side, about 5 minutes longer; transfer to large plate. Repeat with remaining 4 thighs and transfer to plate; set aside. Pour off all but 1 tablespoon fat from pot.",
    "2  Add onion to pot and cook over medium heat, stirring occasionally, until browned, about 4 minutes. Add garlic, anchovy, and cayenne and cook, stirring constantly, until fragrant, about 1 minute. Add wine and saffron, scraping up any browned bits. Stir in tomatoes; broth; tomato paste; thyme; oregano; herbes de Provence, if using; and bay leaf.",
    "3  Remove and discard skin from chicken, then submerge chicken in liquid and add any accumulated chicken juices to pot. Increase heat to high, bring to simmer, cover, and transfer pot to oven; cook until chicken offers no resistance when poked with tip of paring knife but still clings to bones, about 1¼ hours.",
    "4  Using slotted spoon, transfer chicken to platter and tent with aluminum foil. Discard bay leaf. Set pot over high heat, stir in 1 teaspoon orange zest, bring to boil, and cook, stirring occasionally, until slightly thickened and reduced to 2 cups, about 5 minutes.",
    "5  Stir in olives and cook until heated through, about 1 minute. Meanwhile, mix basil and remaining ½ teaspoon orange zest together. Spoon sauce over chicken, drizzle chicken with remaining 2 teaspoons oil, sprinkle with basil mixture, and serve."
  ]
}