{
  "title": "Chicago-Style Braised Italian Beef Sandwiches",
  "source": "By Heart - Hailee Catalano",
  "servings": "Makes Four 6-Inch (15 cm) Subs",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Pork",
    "4pounds (1.8 kg) beef shanks (3 or 4 pieces, 1 1⁄2 inch/4 cm thick)",
    "2teaspoons porcini mushroom powder (see Tip)",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Olive oil, for searing",
    "6garlic cloves, smashed",
    "3celery stalks, roughly chopped",
    "2large yellow onions, roughly chopped",
    "1tablespoon dried oregano",
    "2teaspoons garlic powder",
    "2teaspoons onion powder",
    "1teaspoon red pepper flakes",
    "One 12-ounce (360 ml) bottle amber ale of choice",
    "2cups (480 ml) unsalted beef stock, homemade or store-bought",
    "1dried bay leaf",
    "1⁄2 bunch fresh thyme sprigs",
    "For Serving",
    "3green bell peppers, stems removed, halved, and ribs and seeds removed",
    "Olive oil, for drizzling",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Four 6- to 8-inch (15 to 20 cm) Italian sub rolls, split",
    "Chicago-style giardiniera, homemade or store-bought, to taste"
  ],
  "directions": [
    "1. Preheat the oven to 325°F (165°C) with a rack positioned in the lower third.",
    "2. Season the beef all over with the mushroom powder and a generous amount of salt and black pepper.",
    "3. Coat the bottom of a large, heavy-bottomed oven-safe pot with olive oil, and heat over medium heat until the oil begins to ripple. Add the beef in batches, and sear until deeply golden, 5 to 7 minutes per side. Transfer to a plate.",
    "4. Add the garlic, celery, and onions, and cook, stirring occasionally, until lightly browned and slightly softened, 7 to 9 minutes. Add the oregano, garlic powder, onion powder, and red pepper flakes, and cook until aromatic, 30 seconds.",
    "5. Deglaze the pan with the beer, scraping up the brown bits from the bottom of the pan, and reduce by half, 2 or 3 minutes. Add the beef stock, bay leaf, and thyme, along with the reserved beef and any accumulated juices, bring to a simmer, and cover.",
    "6. Transfer the pot to the oven, and bake for 3 to 3 1⁄2 hours, until the meat is tender and shreds easily with a fork.",
    "7. Remove the pot from the oven. Increase the oven temperature to 400°F (200°C).",
    "8. Place the peppers on a sheet tray, toss with a generous drizzle of olive oil, and season with salt and black pepper. Turn the peppers cut side down, and bake for 30 to 40 minutes, until very, very soft. Let cool slightly. Remove the skins and then slice into 1 1⁄2-inch (4 cm) strips.",
    "9. Meanwhile, transfer the beef to a cutting board. Use a fork to gently break up the meat into bite-size pieces. (Don’t completely shred the meat. You want nice, small chunks.) Discard any large bones.",
    "10. Strain the liquid from the pot through a fine-mesh strainer into a medium pot. This is the jus for the sandwich. Bring the jus to a soft simmer over medium heat. Season with salt and black pepper. Return the meat to the jus, reduce the heat to very low, and keep warm until ready to serve.",
    "11. To serve, use a slotted spoon to scoop up some meat from the jus and pile it on a roll. Quickly dip the base of the roll in the jus to soak slightly. Top with the soft green peppers and some giardiniera, and serve."
  ]
}