{
  "title": "Chicken Canzanese",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "1tablespoon extra-virgin olive oil, divided",
    "2ounces prosciutto (¼ inch thick), cut into ¼-inch cubes",
    "4garlic cloves, sliced thin lengthwise",
    "8(5- to 7-ounce) bone-in chicken thighs, trimmed",
    "¼teaspoon pepper",
    "2teaspoons all-purpose flour",
    "2cups dry white wine",
    "1cup chicken broth",
    "4whole cloves",
    "1(4-inch) sprig fresh rosemary, leaves removed and minced fine (½ teaspoon), stem reserved",
    "12fresh sage leaves",
    "2bay leaves",
    "¼–½teaspoon red pepper flakes",
    "2tablespoons unsalted butter",
    "1tablespoon lemon juice"
  ],
  "directions": [
    "1. Adjust oven rack to lower-middle position and heat oven to 325 degrees. Heat 1 teaspoon oil in 12-inch ovensafe skillet over medium heat until shimmering. Add prosciutto and cook, stirring frequently, until just starting to brown, about 3 minutes. Add garlic and cook, stirring frequently, until garlic is golden brown, about 1½ minutes. Using slotted spoon, transfer prosciutto and garlic to small bowl and set aside.",
    "2. Increase heat to medium-high; add remaining 2 teaspoons oil to skillet and heat until just smoking. Pat chicken dry with paper towels and sprinkle with pepper. Cook chicken skin side down until browned, 5 to 8 minutes. Flip chicken and brown on second side, about 5 minutes longer. Transfer chicken to plate.",
    "3. Pour off all but 2 tablespoons fat from skillet. Sprinkle flour over fat and cook, stirring constantly, for 1 minute. Slowly add wine and broth; bring to simmer, scraping up any browned bits. Cook until liquid is slightly reduced, 3 minutes. Stir in cloves, rosemary stem, sage leaves, bay leaves, pepper flakes, and prosciutto-garlic mixture. Nestle chicken into liquid, skin side up (skin should be above surface of liquid), and bake, uncovered, until meat offers no resistance when poked with fork but is not falling off bones, about 1¼ hours. (Check chicken after 15 minutes; broth should be barely bubbling. If bubbling vigorously, reduce oven temperature to 300 degrees.)",
    "4. Using tongs, transfer chicken to serving platter; tent with aluminum foil. Discard cloves, rosemary stem, sage leaves, and bay leaves. Place skillet over high heat and bring sauce to boil. Cook until sauce is reduced to 1¼ cups, 2 to 5 minutes. Off heat, stir in butter, lemon juice, and minced rosemary. Season with salt and pepper to taste. Pour sauce around chicken and serve."
  ]
}