{
  "title": "Chicken Scarpariello with Sweet & Sour Vinegar Peppers",
  "source": "Italian American Don Angie Book",
  "servings": "SERVES 6",
  "categories": [
    "Italian",
    "Italian American - Don Angie"
  ],
  "ingredients": [
    "1pound sweet Italian sausage, casings removed",
    "6bone-in, skin-on chicken thighs (about 8 ounces each)",
    "2teaspoons kosher salt",
    "1teaspoon freshly ground black pepper",
    "3tablespoons vegetable oil",
    "2Anaheim or poblano chiles, seeded and cut into ¼-inch strips",
    "6garlic cloves, finely chopped",
    "1teaspoon dried oregano (ideally home-dried, this page)",
    "1teaspoon fennel seeds",
    "4sweet pickled cherry peppers (such as B&G), seeded and chopped",
    "1cup sweet pickled cherry pepper liquid",
    "2tablespoons rice vinegar",
    "2cups chicken stock, unsalted store-bought or homemade (this page)",
    "2tablespoons sriracha sauce",
    "2tablespoons honey",
    "1tablespoon sugar",
    "2tablespoons unsalted butter",
    "2teaspoons fresh lemon juice"
  ],
  "directions": [
    "Roll the sausage into meatballs the size of golf balls and set aside. Season the chicken thighs with the salt and pepper.In a large heavy-bottomed pot or Dutch oven, heat the vegetable oil over high heat until almost smoking. Add the chicken in a single layer, skin-side down, to sear (working in batches if necessary to avoid overcrowding). Reduce the heat to medium-high and cook the chicken until evenly golden brown and crispy, 8 to 10 minutes. Do not flip. Remove the chicken from the pot and set aside. Do not wash the pot.",
    "Return the pot to medium-high heat and add the sausage meatballs to sear on all sides until evenly golden brown, about 5 minutes. Remove the sausage from the pot and set aside with the chicken. Do not wash the pot.",
    "Return the pot to medium heat and add the Anaheim chiles and cook until soft, 2 to 3 minutes, scraping up any browned bits on the bottom. Add the garlic, oregano, and fennel seeds and cook until the garlic is golden, about 1 minute. Stir in the pickled deli peppers, pepper pickling liquid, rice vinegar, chicken stock, sriracha, honey, and sugar. Bring to a simmer over medium-high heat and cook until the volume is reduced by two-thirds, about 10 minutes.",
    "Add the chicken, skin-side up, and any accumulated juices to the pot. The sauce should come about halfway up the sides of the chicken. Simmer for 12 minutes, stirring the sauce occasionally but leaving the chicken skin-side up.",
    "Nestle in the meatballs around the chicken. Cover, reduce the heat to medium-low, and cook until a thermometer inserted into the thickest part of a chicken thigh reads 160°F and the sauce has thickened to a loose, glossy glaze (you should be able to draw a line along the bottom of the pot with your spoon), another 10 minutes.",
    "Stir in the butter and lemon juice. Serve immediately. Leftovers keep, tightly covered in the refrigerator, for up to 3 days."
  ]
}