{
  "title": "Chicken with 40 Cloves of Garlic",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "40garlic cloves, peeled",
    "2teaspoons vegetable oil, divided",
    "½teaspoon sugar",
    "8(5- to 7-ounce) bone-in chicken thighs, trimmed",
    "½teaspoon table salt",
    "¼teaspoon pepper",
    "½cup dry sherry",
    "¾cup chicken broth",
    "½cup heavy cream",
    "2teaspoons cornstarch dissolved in 1 tablespoon water",
    "2sprigs fresh thyme",
    "1bay leaf"
  ],
  "directions": [
    "1. Adjust oven rack to upper-middle position and heat oven to 450 degrees. Toss garlic in bowl with 1 teaspoon oil and sugar. Microwave garlic until slightly softened, with light brown spotting, about 4 minutes, stirring halfway through microwaving.",
    "2. Pat chicken dry with paper towels and sprinkle with salt and pepper. Heat remaining 1 teaspoon oil in 12-inch ovensafe skillet over medium-high heat until just smoking. Cook chicken skin side down until browned, 7 to 10 minutes. Transfer to plate, skin side up. Pour off all but 1 tablespoon fat from skillet. Reduce heat to medium-low, add garlic, and cook until evenly browned, about 1 minute.",
    "3. Off heat, add sherry to skillet. Return skillet to medium heat and bring sherry to simmer, scraping up any browned bits. Cook until sherry coats garlic and pan is nearly dry, about 4 minutes. Stir in broth, cream, cornstarch mixture, thyme sprigs, and bay leaf and simmer until slightly thickened, about 3 minutes. Return chicken skin side up to skillet along with any accumulated juices. Transfer skillet to oven and roast until chicken registers 175 degrees, 18 to 22 minutes.",
    "4. Using pot holder (skillet handle will be hot), remove skillet from oven. Transfer chicken and half of garlic to serving platter. Discard thyme sprig and bay leaf. Using potato masher, mash remaining garlic into sauce and season with salt and pepper to taste. Pour half of sauce around chicken. Serve, passing remaining sauce separately."
  ]
}