{
  "title": "Chicken Mole Poblano",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2dried ancho chiles, stemmed, seeded, and torn into ½-inch pieces (½ cup)",
    "½dried chipotle chile, stemmed, seeded, and torn into ½-inch pieces (scant tablespoon)",
    "3tablespoons vegetable oil",
    "1onion, chopped fine",
    "½teaspoon ground cinnamon",
    "⅛teaspoon ground cloves",
    "1ounce bittersweet, semisweet, or Mexican chocolate, chopped coarse",
    "2garlic cloves, minced",
    "2cups chicken broth",
    "1(14.5-ounce) can diced tomatoes, drained",
    "¼cup raisins",
    "¼cup almond butter",
    "2tablespoons sesame seeds, plus extra for garnish, toasted",
    "Sugar",
    "3½pounds bone-in chicken pieces (split breasts halved crosswise, legs, and/or thighs), skin removed, trimmed",
    "¼teaspoon table salt",
    "¼teaspoon pepper"
  ],
  "directions": [
    "1. Toast anchos and chipotle in 12-inch skillet over medium heat, stirring frequently, until fragrant, 2 to 6 minutes; transfer to plate. Add oil and onion to now-empty skillet and cook over medium-high heat until softened, 5 to 7 minutes.",
    "2. Stir in cinnamon, cloves, chocolate, and toasted chiles and cook until chocolate is melted and bubbly, about 2 minutes. Stir in garlic and cook until fragrant, about 30 seconds. Stir in broth, tomatoes, raisins, almond butter, and sesame seeds and bring to simmer. Reduce heat to medium and simmer gently, stirring occasionally, until slightly thickened and measures about 3½ cups, about 7 minutes.",
    "3. Transfer mixture to blender and process until smooth, about 20 seconds. Season with salt, pepper, and sugar to taste. (Sauce can be refrigerated for up to 3 days; loosen with water as needed before continuing.)",
    "4. Adjust oven rack to middle position and heat oven to 400 degrees. Pat chicken dry with paper towels and sprinkle with salt and pepper. Arrange chicken in single layer in shallow baking dish and cover with mole sauce, turning to coat chicken evenly. Bake, uncovered, until breasts register 160 degrees, and thighs/drumsticks register 175 degrees, 35 to 45 minutes.",
    "5. Remove chicken from oven, tent with aluminum foil, and let rest for 5 to 10 minutes. Sprinkle with sesame seeds and serve."
  ]
}