{
  "title": "Chicken Sausage With Braised Red Cabbage And Potatoes",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "1½pounds small red potatoes, unpeeled, halved",
    "¼cup vegetable oil, divided",
    "¾teaspoon table salt, divided",
    "¼teaspoon pepper",
    "1½pounds raw chicken sausage",
    "1onion, halved and sliced thin",
    "1head red cabbage (2 pounds), cored and shredded",
    "1½cups apple cider",
    "1Granny Smith apple, peeled and grated",
    "2bay leaves",
    "1½teaspoons minced fresh thyme or ½ teaspoon dried",
    "2tablespoons cider vinegar",
    "2tablespoons minced fresh chives"
  ],
  "directions": [
    "1. Toss potatoes with 1 tablespoon oil, ¼ teaspoon salt, and pepper in bowl. Cover and microwave, stirring occasionally, until potatoes are tender, about 5 minutes; drain well.",
    "2. Meanwhile, heat 1 tablespoon oil in 12-inch nonstick skillet over medium heat until shimmering. Brown sausage on all sides, about 5 minutes; transfer to plate.",
    "3. Add onion and remaining ½ teaspoon salt to fat left in skillet and cook over medium heat until onion is softened, about 5 minutes. Stir in cabbage, cider, apple, bay leaves, and thyme. Nestle sausage into vegetables and add any accumulated juices. Cover and cook until cabbage is very tender and sausage is cooked through, 20 to 25 minutes.",
    "4. Uncover and simmer until liquid is almost evaporated, 2 to 3 minutes. Transfer sausage to serving platter and discard bay leaves. Stir vinegar into vegetables and season with salt and pepper to taste. Transfer vegetables to platter with sausage and tent with aluminum foil.",
    "5. Wipe skillet clean with paper towels. Add remaining 2 tablespoons oil to now-empty skillet and heat over medium heat until shimmering. Add potatoes cut side down and cook until browned, 2 to 5 minutes. Transfer to platter with sausage and cabbage, sprinkle with chives, and serve."
  ]
}