{
  "title": "Chicken Pad See Ew",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "Chile Vinegar:",
    "⅓cup distilled white vinegar",
    "3Thai chiles, stemmed and sliced into thin rings",
    "Stir-Fry:",
    "8ounces (¼-inch-wide) rice noodles",
    "3tablespoons vegetable oil, divided",
    "⅛teaspoon baking soda",
    "12ounces boneless, skinless chicken breasts, trimmed and sliced thin crosswise",
    "1tablespoon plus 2 teaspoons soy sauce, divided",
    "½teaspoon cornstarch",
    "¼cup oyster sauce",
    "2tablespoons packed dark brown sugar",
    "1tablespoon distilled white vinegar",
    "1teaspoon molasses",
    "1teaspoon fish sauce",
    "3garlic cloves, sliced thin",
    "3large eggs",
    "10ounces Chinese broccoli or broccolini, trimmed, florets cut into 1-inch pieces, stalks cut ½ inch thick on bias"
  ],
  "directions": [
    "1. For the chile vinegar: Combine vinegar and Thai chiles in bowl; set aside for serving. (Chile vinegar can be refrigerated for up to 1 day; bring to room temperature before serving.)",
    "2. For the stir-fry: Bring 4 quarts water to boil in large pot. Remove from heat, add noodles, and let sit, stirring occasionally, until soft and pliable but not fully tender. Drain noodles and rinse under cold running water until chilled. Drain noodles well again and toss with 2 teaspoons oil; set aside.",
    "3. Combine 2 teaspoons water and baking soda in medium bowl. Add chicken and toss to coat; let sit for 5 minutes. Add 2 teaspoons soy sauce and cornstarch and toss until well combined. Whisk oyster sauce, sugar, vinegar, molasses, fish sauce, and remaining 1 tablespoon soy sauce in small bowl until sugar dissolves; set aside.",
    "4. Cook 2 teaspoons oil and garlic in nonstick skillet or flat-bottomed wok over medium-low heat until garlic is deep golden brown, 1 to 2 minutes. Add chicken and increase heat to high. Cook, tossing chicken slowly but constantly, until no longer pink, 2 to 6 minutes; transfer to large bowl.",
    "5. Heat 1 tablespoon oil in now-empty pan over high heat until shimmering. Add eggs and scramble quickly using rubber spatula. Continue to cook, scraping slowly but constantly along bottom and sides of pan, until eggs just form cohesive mass, 15 to 30 seconds (eggs will not be completely dry). Transfer to bowl with chicken and break up any large egg curds.",
    "6. Heat remaining 2 teaspoons oil in now-empty pan over high heat until just smoking. Add Chinese broccoli and ¼ cup water (water will sputter) and cover immediately. Cook, without stirring, until broccoli is bright green, about 2 minutes. Uncover and continue to cook, tossing slowly but constantly, until all water has evaporated and broccoli is crisp-tender and spotty-brown, 1 to 3 minutes. Add noodles, oyster sauce mixture, and chicken-egg mixture and cook, tossing slowly but constantly, until thoroughly combined and noodles are well coated and tender, 2 to 4 minutes. Serve, passing chile vinegar separately."
  ]
}