{
  "title": "Chicken Chimichangas",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "1cup plus 2 tablespoons water, divided",
    "½cup long-grain white rice, rinsed",
    "¼teaspoon table salt",
    "2tablespoons minced fresh cilantro",
    "1scallion, sliced thin",
    "1tablespoon vegetable oil",
    "1onion, chopped fine",
    "2tablespoons ancho chile powder",
    "1tablespoon minced canned chipotle chile in adobo sauce",
    "2garlic cloves, minced",
    "½teaspoon ground cumin",
    "1cup chicken broth",
    "1pound boneless, skinless chicken breasts, trimmed",
    "1(15-ounce) can pinto beans, rinsed",
    "2tablespoons all-purpose flour",
    "4(10-inch) flour tortillas",
    "4ounces sharp cheddar cheese, shredded (1 cup)",
    "3cups vegetable oil for frying"
  ],
  "directions": [
    "1. Bring 1 cup water, rice, and salt to boil in small saucepan over medium-high heat. Reduce heat to low, cover, and cook until rice is tender and water is absorbed, about 20 minutes. Remove rice from heat and let sit, covered, for 10 minutes. Add cilantro and scallion and fluff with fork to incorporate; cover to keep warm.",
    "2. Meanwhile, heat 1 tablespoon oil in 12-inch nonstick skillet over medium heat until shimmering. Add onion and cook until softened, about 5 minutes. Stir in chile powder, chipotle, garlic, and cumin and cook until fragrant, about 1 minute. Stir in broth and bring to simmer. Nestle chicken into sauce. Reduce heat to medium-low, cover, and cook until chicken registers 160 degrees, 10 to 15 minutes, flipping halfway through cooking.",
    "3. Transfer chicken to cutting board, let cool slightly, then cut crosswise into very thin pieces. Continue to simmer sauce until thickened and measures ½ cup, about 10 minutes; remove from heat. Coarsely mash half of beans in bowl using potato masher, then add to sauce with remaining beans and sliced chicken.",
    "4. Whisk flour and remaining 2 tablespoons water together in bowl. Wrap tortillas in damp dish towel and microwave until warm and pliable, about 1 minute. Lay warm tortillas on counter. Mound rice, chicken-bean mixture, and cheddar across center of tortillas. Working with 1 tortilla at a time, brush edges of tortilla with flour paste, then wrap top and bottom of tortilla tightly over filling and press firmly to seal. Brush ends of tortilla thoroughly with paste, fold into center, and press firmly to seal.",
    "5. Adjust oven rack to middle position and heat oven to 200 degrees. Line plate with several layers of paper towels. Set wire rack in rimmed baking sheet. Heat 3 cups oil in large Dutch oven over medium-high heat to 325 degrees. Place 2 chimichangas seam side down in oil and fry, turning as needed, until well browned on both sides, about 4 minutes. Adjust burner, if necessary, to maintain oil temperature between 300 and 325 degrees. Transfer chimichangas to prepared plate, let drain briefly, then transfer to prepared rack and keep warm in oven. Return oil to 325 degrees and repeat with remaining 2 chimichangas. Serve."
  ]
}