{
  "title": "Chicken And Orzo With Tomatoes And Parmesan",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "1½cups orzo",
    "½cup all-purpose flour",
    "4(6- to 8-ounce) boneless, skinless chicken breasts, trimmed",
    "½teaspoon table salt",
    "¼teaspoon pepper",
    "2tablespoons extra-virgin olive oil, divided",
    "3garlic cloves, minced",
    "2teaspoons minced fresh oregano or ½ teaspoon dried",
    "Pinch red pepper flakes",
    "2cups chicken broth",
    "1(14.5-ounce) can diced tomatoes",
    "¼cup grated Parmesan cheese",
    "3tablespoons chopped fresh basil"
  ],
  "directions": [
    "1. Toast orzo in 12-inch nonstick skillet over medium-high heat until golden brown, 3 to 5 minutes; transfer to bowl.",
    "2. Spread flour in shallow dish. Pound chicken breasts to uniform thickness. Pat chicken dry with paper towels and sprinkle with salt and pepper. Working with 1 breast at a time, lightly dredge chicken in flour, shaking off excess.",
    "3. Heat 1 tablespoon oil in 12-inch nonstick skillet over medium-high heat until shimmering. Cook chicken until lightly browned on both sides, 8 to 10 minutes; transfer to plate.",
    "4. Cook remaining 1 tablespoon oil, garlic, oregano, and pepper flakes in now-empty skillet over medium heat until fragrant, about 30 seconds. Stir in broth, tomatoes, and toasted orzo.",
    "5. Nestle chicken into orzo, add any accumulated juices, and bring to simmer. Reduce heat to medium-low, cover, and cook until chicken registers 160 degrees, about 10 minutes.",
    "6. Transfer chicken to clean plate, brushing any orzo that sticks to chicken back into skillet, and tent chicken with aluminum foil to keep warm. Cover and continue to cook orzo over medium-low heat, stirring occasionally, until liquid has been absorbed and orzo is tender, about 5 minutes.",
    "7. Off heat, stir in Parmesan and basil and season with salt and pepper to taste. Serve with chicken."
  ]
}