{
  "title": "Chicken, Broccoli, and Ziti Casserole",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 8",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "4slices hearty white sandwich bread, torn into pieces",
    "5ounces Asiago cheese, grated (2½ cups), divided",
    "2tablespoons unsalted butter, melted, plus 3 tablespoons unsalted butter",
    "8garlic cloves, minced, divided",
    "1pound ziti",
    "Table salt for cooking pasta",
    "1onion, chopped fine",
    "¼teaspoon red pepper flakes",
    "¼cup all-purpose flour",
    "½cup white wine",
    "3cups whole milk",
    "2cups chicken broth",
    "4(6- to 8-ounce) boneless, skinless chicken breasts, trimmed and sliced crosswise ¼ inch thick",
    "12ounces broccoli florets, cut into 1-inch pieces"
  ],
  "directions": [
    "1. Pulse bread, ½ cup Asiago, melted butter, and one-quarter of garlic in food processor until coarsely ground, about 10 pulses. Set aside.",
    "2. Adjust oven rack to middle position and heat oven to 400 degrees. Bring 4 quarts water to boil in large pot. Add pasta and 1 tablespoon salt and cook until nearly al dente. Drain in colander and rinse under cold water until cool.",
    "3. Melt remaining 3 tablespoons butter in now-empty pot over medium heat. Add onion and cook until softened, about 5 minutes. Add pepper flakes and remaining garlic and cook until fragrant, about 30 seconds. Stir in flour and cook until golden, about 1 minute. Slowly whisk in wine and cook until liquid is almost evaporated, about 1 minute. Slowly whisk in milk and broth, scraping up any browned bits and smoothing out any lumps, and bring to boil. Add chicken and simmer until no longer pink, about 5 minutes. Off heat, stir in remaining 2 cups Asiago until melted.",
    "4. Microwave broccoli, covered, in large bowl until bright green and nearly tender, 2 to 4 minutes. Stir broccoli and pasta into pot and season with salt and pepper to taste. Transfer to 13 by 9-inch baking dish (or similar size casserole dish). (Casserole can be assembled, minus bread crumbs, and refrigerated for up to 24 hours. Bring to room temperature before adding bread crumbs and baking.) Sprinkle with bread-crumb mixture and bake until sauce is bubbling around edges and topping is golden brown, 20 to 25 minutes. Let cool for 5 minutes before serving."
  ]
}