{
  "title": "Chicken Bouillabaisse",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "3pounds bone-in chicken pieces (split breasts halved crosswise, drumsticks, and/or thighs), trimmed",
    "½teaspoon table salt",
    "¼teaspoon pepper",
    "2tablespoons extra-virgin olive oil",
    "1large leek, white and light green parts only, halved lengthwise, sliced thin, and washed thoroughly",
    "1small fennel bulb, stalks discarded, bulb halved, cored, and sliced thin",
    "4garlic cloves, minced",
    "1tablespoon tomato paste",
    "1tablespoon all-purpose flour",
    "¼teaspoon saffron threads, crumbled",
    "¼teaspoon cayenne pepper",
    "3cups chicken broth",
    "1(14.5-ounce) can diced tomatoes, drained",
    "12ounces Yukon Gold potatoes, unpeeled, cut into ¾-inch pieces",
    "½cup dry white wine",
    "¼cup pastis or Pernod",
    "1(3-inch) strip orange zest",
    "1tablespoon chopped fresh tarragon or parsley"
  ],
  "directions": [
    "1. Adjust oven racks to upper-middle and lowest positions and heat oven to 375 degrees. Pat chicken dry with paper towels and sprinkle with salt and pepper. Heat oil in Dutch oven over medium-high heat until just smoking. Cook chicken skin side down until browned, 5 to 8 minutes. Flip chicken and brown on second side, about 5 minutes; transfer to plate.",
    "2. Add leek and fennel to fat left in pot and cook, stirring often, until beginning to soften and turn translucent, about 4 minutes. Stir in garlic, tomato paste, flour, saffron, and cayenne and cook until fragrant, about 30 seconds. Slowly whisk in broth, scraping up any browned bits and smoothing out any lumps. Stir in tomatoes, potatoes, wine, pastis, and orange zest. Bring to simmer and cook for 10 minutes.",
    "3. Nestle chicken thighs and drumsticks into pot with skin above surface of liquid. Cook, uncovered, for 5 minutes. Nestle breast pieces into pot, adjusting pieces as necessary to ensure that skin stays above surface of liquid. Transfer pot to upper rack and cook, uncovered, until breasts register 145 degrees and thighs/drumsticks register 160 degrees, 10 to 20 minutes.",
    "4. Remove pot from oven and heat broiler. Return pot to oven and broil until chicken skin is crisp and breasts register 160 degrees and drumsticks/thighs register 175 degrees, 5 to 10 minutes (smaller pieces may cook faster than larger pieces; remove individual pieces as they reach correct temperature and return to pot before serving).",
    "5. Using large spoon, skim excess fat from surface of stew. Stir in tarragon and season with salt and pepper to taste. Serve in wide, shallow bowls."
  ]
}