{
  "title": "Chicken Vesuvio",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "8(5- to 7-ounce) bone-in chicken thighs, trimmed",
    "1¼teaspoons table salt, divided",
    "½teaspoon pepper",
    "1½pounds Yukon Gold potatoes, 2 to 3 inches in diameter, halved crosswise",
    "2tablespoons vegetable oil, divided",
    "14garlic cloves, peeled (2 whole, 12 halved lengthwise)",
    "1tablespoon lemon juice",
    "1½teaspoons dried oregano",
    "½teaspoon dried thyme",
    "1½cups dry white wine",
    "2tablespoons minced fresh parsley, divided"
  ],
  "directions": [
    "1. Adjust oven rack to upper-middle position and heat oven to 450 degrees. Pat chicken dry with paper towels and sprinkle on both sides with ¾ teaspoon salt and pepper. Toss potatoes with 1 tablespoon oil and remaining ½ teaspoon salt. Mince 2 whole garlic cloves and immediately combine with lemon juice in small bowl; set aside.",
    "2. Heat remaining 1 tablespoon oil in large roasting pan over medium-high heat until shimmering. Place chicken, skin side down, in single layer in pan and cook, without moving it, until chicken has rendered about 2 tablespoons of fat, 2 to 3 minutes. Place potatoes cut side down in chicken fat, arranging so that cut sides are in complete contact with surface of pan. Sprinkle chicken and potatoes with oregano and thyme. Continue to cook until chicken and potatoes are deeply browned and crisp, 8 to 12 minutes longer, moving chicken and potatoes to ensure even browning and flipping pieces when fully browned. When all pieces have been flipped, tuck halved garlic cloves among chicken and potatoes. Remove pan from heat and pour wine into pan (do not pour over chicken or potatoes). Transfer pan to oven and roast until potatoes are tender when pierced with tip of paring knife and chicken registers 185 to 190 degrees, 15 to 20 minutes.",
    "3. Transfer chicken and potatoes to deep platter, browned sides up. Place pan over medium heat (handles will be hot) and stir to incorporate any browned bits. Using slotted spoon, transfer garlic cloves to cutting board. Chop coarse, then mash to smooth paste with side of knife. Whisk garlic paste into sauce. Continue to cook until sauce coats back of spoon, 3 to 5 minutes longer. Remove from heat and whisk in reserved lemon juice mixture and 1 tablespoon parsley. Pour sauce around chicken and potatoes. Sprinkle with remaining 1 tablespoon parsley and serve."
  ]
}