{
  "title": "Chicken Pad Kee Mao",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "8ounces (⅜-inch-wide) rice noodles",
    "2tablespoons vegetable oil, divided",
    "⅛teaspoon baking soda",
    "12ounces boneless, skinless chicken breasts, trimmed and sliced thin crosswise",
    "¼cup plus 2 teaspoons soy sauce, divided",
    "½teaspoon cornstarch",
    "½cup packed brown sugar",
    "3tablespoons lime juice (2 limes), plus lime wedges for serving",
    "2tablespoons fish sauce",
    "3Thai chiles, stemmed and sliced into thin rings",
    "½head napa cabbage, cored and cut into 1-inch pieces (6 cups)",
    "1½cups coarsely chopped fresh Thai or Italian basil"
  ],
  "directions": [
    "1. Bring 4 quarts water to boil in large pot. Remove from heat, add noodles, and let sit, stirring occasionally, until soft and pliable but not fully tender. Drain noodles and rinse under cold running water until chilled. Drain noodles well again and toss with 2 teaspoons oil; set aside.",
    "2. Combine 2 teaspoons water and baking soda in medium bowl. Add chicken and toss to coat; let sit for 5 minutes. Add 2 teaspoons soy sauce and cornstarch, and toss until well combined. Whisk remaining ¼ cup soy sauce, sugar, lime juice, fish sauce, 2 tablespoons water, and Thai chiles in small bowl until sugar has dissolved; set aside.",
    "3. Heat 2 teaspoons oil in nonstick skillet or flat-bottomed wok over medium-high heat until just smoking. Add chicken and increase heat to high. Cook, tossing chicken slowly but constantly, until no longer pink, 2 to 6 minutes; transfer to clean medium bowl.",
    "4. Heat remaining 2 teaspoons oil in now-empty pan over high heat until just smoking. Add cabbage and cook, tossing slowly but constantly, until crisp-tender, about 3 minutes. Add noodles, sauce, and chicken and cook, tossing slowly but constantly, until thoroughly combined and noodles are well coated and tender, 2 to 4 minutes. Off heat, fold in basil. Serve with lime wedges."
  ]
}