{
  "title": "Chicken Posole Verde",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 6 to 8",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "4pounds bone-in chicken thighs, trimmed",
    "1teaspoon table salt, divided",
    "¼teaspoon pepper",
    "2teaspoons vegetable oil",
    "1onion, chopped fine",
    "3garlic cloves, minced",
    "1tablespoon chopped fresh oregano or 1 teaspoon dried",
    "4½cups chicken broth, divided",
    "12ounces tomatillos, husks and stems removed, rinsed well, dried, and quartered",
    "2jalapeños, stemmed, halved, and seeded",
    "2½cups fresh cilantro leaves and stems, trimmed (2 bunches)",
    "2(15-ounce) cans white or yellow hominy, rinsed"
  ],
  "directions": [
    "1. Adjust oven rack to lower-middle position and heat oven to 300 degrees. Pat chicken dry with paper towels and sprinkle with ¾ teaspoon salt and pepper. Heat oil in Dutch oven over medium-high heat until just smoking. Brown half of chicken on both sides, 8 to 10 minutes; transfer to plate. Repeat with remaining chicken; transfer to plate. When chicken is cool enough to handle, remove skin.",
    "2. Pour off all but 1 tablespoon fat from pot. Add onion and remaining ¼ teaspoon salt and cook over medium heat until softened, about 5 minutes. Stir in garlic and oregano and cook until fragrant, about 30 seconds. Stir in 4 cups broth, scraping up any browned bits, and bring to simmer. Nestle chicken into pot and add any accumulated juices. Cover, transfer pot to oven, and cook until chicken is tender and registers at least 175 degrees, about 1 hour.",
    "3. Remove pot from oven. Transfer chicken to cutting board, let cool slightly, then shred into bite-size pieces using 2 forks; discard bones.",
    "4. Meanwhile, process tomatillos, jalapeños, cilantro, and remaining ½ cup broth in blender until smooth, about 30 seconds. Stir tomatillo mixture and hominy into stew, bring to simmer over medium heat, and cook until flavors meld, 10 to 15 minutes. Stir in chicken and cook until heated through, about 2 minutes. Season with salt and pepper to taste. Serve."
  ]
}