{
  "title": "Chile Lime Chicken Wings",
  "source": "Nomnompaleo.com",
  "servings": "",
  "categories": [
    "Mexican"
  ],
  "ingredients": [
    "½medium onion, roughly chopped",
    "2jalapeno peppers (or 1 serrano pepper), ribs and seeds removed",
    "3garlic cloves, peeled",
    "½cup cilantro, tightly packed",
    "Freshly ground pepper",
    "Zest from 2 limes",
    "¼cup lime juice",
    "2tablespoons Paleo-friendly fish sauce (Red Boat!)",
    "2tablespoons coconut aminos",
    "6pounds chicken wings and/or drumsticks",
    "1-2tablespoons melted fat of choice",
    "4limes, cut into wedges"
  ],
  "directions": [
    "Here’s what to do:",
    "Toss the onion, peppers, garlic, cilantro, ground pepper, lime zest and juice, fish sauce, and coconut aminos into a blender, and…",
    "…blitz everything together until a bright green purée is formed.",
    "Place the chicken wings in a large bowl, and add the marinade.",
    "Mix well with your hands.",
    "Marinate the chicken in the fridge for at least 30 minutes and up to 12 hours. Don’t marinate the wings longer than 12 hours because the acid will make the meat mushy. Ew.",
    "Take the wings out of the refrigerator 30 minutes before you intend to cook them.",
    "You can cook these chicken wings either in the oven or – if you can stand the chilly weather outside – on your backyard grill.",
    "Want to stay indoors? Arrange a rack in the middle of the oven and preheat it to 400°F on convection roast (or 425°F on the regular setting). Line a rimmed baking sheet with foil, and place a wire rack on top. Then, arrange the wings on the greased wire rack, and…",
    "…roast ‘em for 30 minutes (flipping midway) or until the wings turn golden brown.",
    "If you’re grilling the chicken wings, first use long-handled tongs to grease the cooking grate with a wad of paper towels dipped in melted fat. Then, cook the wings over medium-hot coals (or with gas grill burners set to medium) for about 15 minutes, turning once, until the fat has rendered and the skin turns crisp and golden.",
    "Serve with lime wedges, and let the feeding frenzy commence."
  ]
}