{
  "title": "Chili Jam (Nam Prik Pao)",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Yields: About 3 cups",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "- 1 cup canola oil",
    "- 8 medium shallots, thinly sliced",
    "- 17 dried shrimp, soaked in warm water for 15 minutes, drained, and patted dry with paper towels",
    "- 50 garlic cloves, thinly sliced",
    "- 50 whole dried Thai chilies",
    "- 1 cup plus 2 tablespoons palm sugar",
    "- ¼ cup homemade tamarind paste",
    "- ¼ cup Squid Brand fish sauce, plus more for finishing"
  ],
  "directions": [
    "1. Heat the oil in a medium saucepan over medium heat until it reaches 300 degrees F. Line a large plate with paper towels. Fry the shallots in two batches until golden brown and crispy, stirring a few times, about 4 minutes. Remove with a slotted spoon to the prepared plate. Bring the oil back up to 300 degrees F.",
    "2. Add the shrimp to the oil and fry until lightly golden brown and crisp, about 1 minute. Transfer to the plate with the shallots.",
    "3. Add the garlic to the oil and cook, stirring constantly, until light golden brown, 3 to 4 minutes. Transfer to the plate with the shrimp and shallots.",
    "4. Add the chilies to the oil, and fry, stirring a few times until their color deepens slightly and they become fragrant, about 45 seconds to 1 minute. Transfer the oil to a heatproof bowl or measuring cup and let cool, about 10 minutes.",
    "5. Combine the shallots, shrimp, garlic, chilies, and ¼ cup of the reserved oil in a blender and blend until smooth. Transfer the mixture to a medium saucepan, add the palm sugar, tamarind, fish sauce, and 1 cup of water and blend until smooth.",
    "6. Transfer the paste to a medium saucepan and cook over medium heat, stirring often, for 10 minutes. Remove from the heat, let cool to room temperature, and season with more fish sauce, if desired or needed. Store, tightly covered, for up to 1 month in the refrigerator."
  ]
}