{
  "title": "Chili Char Siu Pork Jowls",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "4 to 6 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "Marinade:",
    "- ¼ cup / 50g granulated sugar",
    "- 2 Tbsp molasses",
    "- 1 tsp five-spice powder",
    "- 1 tsp kosher salt",
    "- 4 garlic cloves, minced",
    "- ¼ cup / 60ml hoisin sauce",
    "- 3 Tbsp Sichuan Chili Crisp (this page), or as needed",
    "- 2 Tbsp Shaoxing wine",
    "- 2 tsp toasted sesame oil",
    "Main:",
    "- 2 lb / 900g pork jowls",
    "- 2 Tbsp maltose or honey",
    "- White rice for serving"
  ],
  "directions": [
    "1. To make the marinade: The day before cooking, in a large bowl, combine the sugar, molasses, five-spice powder, salt, garlic, hoisin sauce, chili crisp, wine, and sesame oil. Stir to mix well. Place the pork in a large resealable bag and pour ½ cup / 120ml of the marinade inside, massaging to coat the pieces of meat evenly. Squeeze the air out of the bag to seal and place it in the refrigerator overnight.",
    "2. Microwave your container of maltose for 10 to 20 seconds to make it easier to work with. In a medium pan over medium heat, add the maltose and the remaining marinade, bringing the mixture to a simmer for about 5 minutes. Let the sauce cool, and then transfer to a covered container and place in the refrigerator.",
    "3. To finish: When ready to cook the next day, preheat the oven to 450°F / 230°C. Line a large baking tray with aluminum foil and place a grilling rack on top.",
    "4. Remove the pork and sauce from the refrigerator. Add a thin layer of water to the prepared tray; this will help keep the meat moist. Remove the pork from the marinade and discard the marinade. Place the pork on the grilling rack and bake in the oven for about 10 minutes.",
    "5. Remove the tray from the oven. Using a pastry brush or spoon, generously baste the pork with the sauce on both sides. Flip and return the pork to the oven to cook on the other side for about 5 more minutes. Remove, baste again, flip once more, and return the pork to the oven to cook for another 5 minutes. Remove the pork and use the remainder of the sauce to baste it.",
    "6. Turn on the broiler and return the pork to the oven. Broil for 2 to 3 minutes on each side. Remove the pork from the oven and let it rest on the grilling rack for about 10 minutes.",
    "7. Slice the meat on the diagonal and serve with the rice. Serve with more chili crisp to taste."
  ]
}