{
  "title": "Chili Oil Chaoshou",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "Makes 6 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "Filling",
    "- 1 (2-inch / 5cm) piece ginger",
    "- 1 large scallion, white and green parts, chopped",
    "- ¼ cup / 60ml water",
    "- ½ lb / 225g ground pork (30% fat, 70% lean)",
    "- 1 egg",
    "- 1 tsp Shaoxing wine",
    "- 1 tsp toasted sesame oil",
    "- ½ tsp kosher salt",
    "- ¼ tsp ground white pepper",
    "- 12 oz / 340g wonton skins",
    "Sauce",
    "- 2 Tbsp Sichuan Chili Crisp",
    "- 2 Tbsp Chili Oil",
    "- 3 Tbsp light soy sauce",
    "- ¼ cup / 60ml chicken stock, warmed",
    "- 2 tsp kosher salt",
    "- ½ tsp Ground Roasted Sichuan Pepper",
    "- 1 tsp Ground Chili Powder",
    "- 1 tsp roasted sesame seeds",
    "- 1 or 2 thinly sliced scallions, green parts only"
  ],
  "directions": [
    "1. To make the filling: Smash the ginger with the flat side of a cleaver until it is crushed, then coarsely chop. In a small bowl, combine the ginger and scallion with the water and set aside to soak.2. In a medium bowl, add the pork, egg, wine, sesame oil, salt, and pepper and mix vigorously to combine. Remove the ginger and scallion from the water and discard. Gradually pour the soaking water into the meat mixture, combining it with the meat until it forms a light and springy paste.3. Line a baking tray with wax paper.4. Take a wonton skin and smear about ½ Tbsp / 15g of the meat mixture into the center. Wet the perimeter with some water and fold the wonton skin diagonally into a triangle. Press down to seal the sides. Place the triangle into your palm with a tip facing your wrist, bend your middle finger toward you, and crease the triangle in the middle. Dab a bit of water on one corner and bring the other corner on top to seal it. The wonton should sit straight up. Repeat until all wontons are formed. You can freeze any wontons you’re not planning to eat right away for up to 3 months.5. To make the sauce: In a medium bowl, combine the chili crisp, chili oil, soy sauce, stock, salt, roasted Sichuan pepper, chili powder, sesame seeds, and scallions and mix. Divide the sauce among six bowls.6. In a large pot over high heat, bring water to a boil. Working in batches of about ten wontons, cook for 3 to 4 minutes until they float. Wait another minute, then use a slotted spoon to remove them from the pot. Place about six to eight wontons into each bowl and serve hot!"
  ]
}