{
  "title": "Chilled Sesame Noodles",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "4 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "- 1 lb / 450g Chinese noodles",
    "- 1 Tbsp neutral oil",
    "- 1 cucumber, julienned into batons 2 inches / 5cm long",
    "- 2 tsp kosher salt",
    "Sauce:",
    "- 3 Tbsp Sichuan Chili Crisp (this page)",
    "- 3 Tbsp roasted sesame paste or peanut butter",
    "- 3 Tbsp light soy sauce",
    "- 1½ Tbsp black vinegar",
    "- 1 tsp toasted sesame oil",
    "- 1 Tbsp granulated sugar",
    "- 2 Tbsp minced garlic",
    "- ¼ tsp Ground Roasted Sichuan Pepper (this page)",
    "Garnishes:",
    "- Roasted sesame seeds",
    "- Sliced scallions, green parts only",
    "- Chopped cilantro leaves"
  ],
  "directions": [
    "1. To cook the noodles: In a medium pot over high heat, bring water to a boil and cook the noodles according to the package instructions until they’re al dente. (Cooking time will vary based on your choice of noodles.) Drain the noodles in a colander and rinse under cold water to stop them from cooking further.",
    "2. Transfer the noodles to a large bowl and add the neutral oil, mixing to prevent the noodles from sticking together. Set aside.",
    "3. Place the cucumbers in a medium bowl, sprinkle with the salt, and gently massage the cucumbers with your hands to coat. Set aside for at least 15 minutes to lightly pickle and let the water sweat out. Drain the liquid. The cucumbers should taste well seasoned and just slightly crunchy.",
    "4. To make the sauce: In a small bowl, combine the chili crisp, sesame paste, soy sauce, vinegar, sesame oil, sugar, garlic, and roasted Sichuan pepper and mix well. Add 1 to 2 Tbsp of water to dilute the sauce if you want a slightly looser consistency.",
    "5. Place the cucumbers in the bowl with the noodles, pour the sauce over it, and, using tongs, mix well to combine.",
    "6. Transfer the noodles to a serving bowl and garnish with the sesame seeds, scallions, and cilantro."
  ]
}