{
  "title": "Chimichurri Couscous Chicken Bowl",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "Chimichurri Sauce",
    "1cup fresh parsley leaves",
    "¼cup extra-virgin olive oil",
    "1tablespoon red wine vinegar",
    "2garlic cloves, minced",
    "½teaspoon dried oregano",
    "¼teaspoon red pepper flakes",
    "Bowl",
    "1tablespoon extra-virgin olive oil, divided",
    "2cups pearl couscous",
    "2½cups chicken or vegetable broth",
    "2garlic cloves, minced",
    "4cups shredded cooked chicken",
    "1cup chopped fresh parsley",
    "1English cucumber, chopped fine",
    "½cup oil-packed sun-dried tomatoes, rinsed, patted dry, and chopped fine"
  ],
  "directions": [
    "1. For the sauce Pulse all ingredients in food processor until coarsely chopped, about 10 pulses, scraping down sides of bowl as needed. Season with salt and pepper to taste. (Sauce can be refrigerated for up to 3 days.)",
    "2. For the bowl Heat 2 teaspoons oil and couscous in medium saucepan over medium heat, stirring frequently, until half of grains are golden brown, about 3 minutes. Stir in broth and bring to boil. Reduce heat to medium-low, cover, and simmer, stirring occasionally, until couscous is tender and broth is absorbed, 9 to 12 minutes.",
    "3. Remove couscous from heat and let sit, covered, for 3 minutes. Transfer to bowl to cool slightly, about 10 minutes.",
    "4. While couscous cools, heat remaining 1 teaspoon oil in 12-inch nonstick skillet over medium-high heat until shimmering. Add garlic and cook, mashing garlic into skillet, until fragrant, about 30 seconds. Stir in chicken, toss to coat, and remove skillet from heat.",
    "5. Stir parsley and ¼ cup chimichurri sauce into cooled couscous in bowl and season with salt and pepper to taste. Divide evenly among individual serving bowls, then top with chicken, cucumber, and sun-dried tomatoes. Drizzle with remaining chimichurri sauce. Serve."
  ]
}