{
  "title": "Chinese Chicken Salad",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2oranges",
    "¼cup rice vinegar",
    "¼cup soy sauce",
    "3tablespoons grated fresh ginger",
    "3tablespoons sugar",
    "1tablespoon Asian chili-garlic sauce",
    "2pounds boneless, skinless chicken breasts, trimmed",
    "3tablespoons vegetable oil",
    "2tablespoons toasted sesame oil",
    "½head napa cabbage, cored and sliced thin (5½ cups)",
    "2romaine lettuce hearts (12 ounces), sliced thin",
    "2red bell peppers, stemmed, seeded, and cut into 2-inch-long matchsticks",
    "1cup fresh cilantro leaves",
    "1cup salted dry-roasted peanuts, chopped",
    "6scallions, sliced thin on bias"
  ],
  "directions": [
    "1. Cut away peel and pith from oranges. Holding fruit over large bowl to catch juice, use paring knife to slice between membranes to release segments; set segments aside for serving. Squeeze juice from membrane into bowl (juice should measure ¼ cup). Whisk in vinegar, soy sauce, ginger, sugar, and chili-garlic sauce. Pound chicken breasts to uniform thickness.",
    "2. Transfer ½ cup orange juice mixture to 12-inch skillet and bring to simmer over medium-high heat; set aside remaining orange juice mixture. Add chicken to skillet, cover, and reduce heat to medium-low. Cook until chicken registers 160 degrees, 10 to 15 minutes, flipping chicken halfway through cooking. Transfer to plate; set aside.",
    "3. Once chicken is cool enough to handle, shred into bite-size pieces using 2 forks.",
    "4. Bring pan juices to boil and cook until reduced to ¼ cup, 1 to 3 minutes. Off heat, stir in chicken and any accumulated juices and let sit for 10 minutes.",
    "5. Slowly whisk vegetable oil and sesame oil into reserved orange juice mixture. Add cabbage, romaine, bell peppers, cilantro, peanuts, and scallions and toss to combine. Transfer to serving platter and top with chicken and reserved orange segments. Serve."
  ]
}