{
  "title": "Chinese Boneless Spare Ribs",
  "source": "Thewoksoflife.com",
  "servings": "Serves: 8",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "2 1/2pounds boneless pork butt",
    "(sliced ¾” thick into 4”x8” slices; can also use boneless country ribs)",
    "2cloves garlic (minced)",
    "3 1/2tablespoons sugar",
    "2 1/2teaspoons sea salt",
    "1teaspoon five spice powder",
    "1/4teaspoon ground white pepper",
    "2tablespoons Shaoxing wine",
    "1tablespoon hoisin sauce",
    "1tablespoon ground bean sauce",
    "1tablespoon ketchup",
    "3tablespoons pineapple juice",
    "1teaspoon sesame oil",
    "1/8teaspoon red food coloring (optional)",
    "2tablespoons maltose (or honey, for brushing)"
  ],
  "directions": [
    "1. SLICE & MARINATE THE PORK",
    "If your pork is not already frozen, freeze until firm (but not rock solid, about 45 minutes) for easier slicing. Cut the pork into ¾-inch (2 cm) thick slabs.",
    "The size of the pieces depends on the cuts of pork you’re using. Mine were about 4×8 inches (10×20 cm).",
    "In a large mixing bowl (large enough to hold the pork pieces), combine the garlic, sugar, salt, five spice powder, white pepper, Shaoxing wine, hoisin sauce, ground bean sauce, tomato ketchup, pineapple juice, sesame oil, and red food coloring (if using).",
    "Mix until smooth and well-combined.",
    "Add the pork.",
    "Toss until well coated in the marinade.",
    "Cover with plastic wrap or a large sheet pan, transfer to the refrigerator, and marinate overnight (12-24 hours). For maximum flavor penetration and distribution, you can stir the pork a few times during the marinating period, but this step isn’t strictly necessary.",
    "2. ROAST THE PORK",
    "Once the marinating period is over, let the pork come up to room temperature on the counter for 2 hours.",
    "Preheat the oven to 425°F. (Use an oven thermometer to ensure an accurate temperature.)",
    "Line a sheet pan or roasting pan with heavy duty foil (for quick clean-up) and place a metal rack on top.",
    "Place the boneless pork on the metal rack, ideally with 1/2-inch of room between the pieces. Pour ½ cup of hot water on the bottom of the pan, and transfer to the preheated oven for 15 minutes.",
    "After 15 minutes, flip the pork. Return to the oven for another 15 minutes. If the pan is dry, add an additional ½ cup of hot water.",
    "Mix the maltose or honey with 2 teaspoons of hot water, and generously brush the pork on both sides.",
    "If desired, you can roast the pork under the broiler for a few minutes. Cook until the pork is lightly charred and caramelized, but watch closely so they don’t burn!",
    "After broiling, brush them once more with the maltose (or honey). Rest at room temperature for at least 5-10 minutes before cutting.",
    "3. SLICE AND SERVE!",
    "To serve, thinly slice the pork into lengths.",
    "Serve alongside your fried rice of choice!",
    "If your pork is thawed, freeze until firm (but not rock solid, about 45 minutes) for easier slicing. Cut the pork into ¾-inch (2 cm) thick slabs. The size of the pieces depends on the cuts of pork you’re using. Mine were about 4×8 inches (10×20 cm).",
    "In a large mixing bowl, combine the garlic, sugar, salt, five spice powder, white pepper, Shaoxing wine, hoisin sauce, ground bean sauce, tomato ketchup, pineapple juice, sesame oil, and red food coloring (if using). Mix until everything is well combined and smooth.",
    "Add the pork and toss until well coated in the marinade. Cover with plastic wrap or a large sheet pan, transfer to the refrigerator, and marinate overnight (12-24 hours). For maximum flavor penetration and distribution, you can stir the pork a few times during the marinating period, but this step isn’t strictly necessary.",
    "Once the marinating period is over, let the pork come up to room temperature on the counter for 2 hours.",
    "Preheat the oven to 425°F. Line a sheet pan or roasting pan with heavy duty foil (for quick clean-up) and place a metal rack on top.",
    "Place the boneless pork on the metal rack, leaving at least 1 inch of room between the pieces. Pour ½ cup of hot water on the bottom of the pan, and transfer to the preheated oven for 15 minutes.",
    "After 15 minutes, flip the pork. Return to the oven for another 15 minutes. If the pan is dry, add an additional ½ cup of hot water.",
    "Mix the maltose or honey with 2 teaspoons of hot water, and generously brush the pork on both sides. If desired, you can roast the pork under the broiler set to low for a few minutes until the pork is lightly charred and caramelized, but watch closely so they don’t burn!",
    "After broiling, brush them once more with the maltose (or honey). Rest at room temperature for at least 5-10 minutes before cutting. To serve, thinly slice the pork into lengths, and serve alongside your fried rice of choice."
  ]
}