{
  "title": "Chocolate-Chunk Sesame Scones",
  "source": "By Heart - Hailee Catalano",
  "servings": "Makes 6 Big Scones",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Crème fraîche, for mixing",
    "113grams (1⁄2 cup) crème fraîche, cold (see Note 1)",
    "60grams (1⁄4 cup) buttermilk, cold",
    "Dry Ingredients",
    "228grams (13⁄4 cups) all-purpose flour, plus more for dusting",
    "35grams (1⁄4 cup) whole-wheat flour",
    "100grams (1⁄2 cup) granulated sugar",
    "2teaspoons baking powder",
    "1teaspoon baking soda",
    "2teaspoons kosher salt",
    "Butter",
    "113grams (1⁄2 cup/1 stick) unsalted butter, cold and cut into 1⁄2-inch (1 cm) cubes",
    "Chocolate & Sesame",
    "One 4-ounce (113 g) bar semisweet chocolate, roughly chopped",
    "30grams (3 tablespoons) sesame seeds, toasted (see Note 2), plus more for topping",
    "Egg Wash",
    "1egg",
    "1tablespoon water",
    "For Finishing",
    "Demerara sugar, for sprinkling (or more granulated if you can’t find demerara)"
  ],
  "directions": [
    "1. Mix the crème fraîche and buttermilk in a small bowl. Place in the refrigerator.",
    "2. Whisk the all-purpose flour, whole-wheat flour, granulated sugar, baking powder, baking soda, and salt in a large bowl.",
    "3. Add the butter, and toss to coat in the flour mixture. Use your fingers to press the butter pieces, one at a time, into flat shingles and then drop them back into the flour mixture. Toss again with your hands to coat the butter in the flour. Add the chocolate and sesame seeds, and gently toss with your hands to combine.",
    "4. Pour in the crème fraîche mixture. Stir with a rubber spatula until the wet ingredients start to mix with the dry.",
    "5. Switch to mixing with your hands to gently incorporate everything and form a very rough and shaggy dough. It will seem very dry, which is what you want! Don’t mix so much that it forms a cohesive dough.",
    "6. Turn out the dough onto a parchment paper-lined sheet tray. Press the dough together into a rough 8-inch (20 cm) square (about 3⁄4 inch/2 cm thick), using your hands and/or a bench scraper. The dough will still feel dry in spots and should barely hold together. Place the sheet tray of dough in the freezer to chill for 30 minutes.",
    "7. Remove the dough from the freezer, and use the parchment paper to lift the dough and fold it in half like a book. Press any pieces of butter, dry flour, or chocolate that may have fallen off back into the dough.",
    "8. Using a lightly floured rolling pin, roll out the dough to a rough 8-inch (20 cm) square (about 3⁄4 inch/2 cm thick). Press the dough together with your hands as needed to form an even square, as it will likely still be quite crumbly.",
    "9. Fold the square of dough in half like a book again, using the parchment paper to lift the dough. The dough should be a rough 8 × 4-inch (20 × 10 cm) rectangle (about 11⁄4 inches/3 cm thick), but use your hands as needed to press the dough together and make the rectangle as even as possible. The dough should no longer feel dry or crumbly.",
    "10. Transfer the dough (along with the parchment) to a sheet tray, and wrap the sheet tray lightly with plastic wrap. Place the dough in the refrigerator, and chill for at least 4 hours or overnight.",
    "11. When you are ready to bake, preheat the oven to 425°F (220°C). Line a sheet tray with parchment paper.",
    "12. Whisk the egg and water in a small bowl until homogeneous to make an egg wash.",
    "13. Remove the dough from the refrigerator, and transfer to a cutting board. With the long side of the dough positioned closest to you, cut the log into thirds to make approximately 22⁄3×4-inch (7 × 10 cm) rectangles. Cut each third in half diagonally to make 6 triangular scones.",
    "14. Brush the top of each scone with the egg wash, and generously sprinkle with demerara sugar and sesame seeds. Place the scones on the sheet tray with ample space in between.",
    "15. Bake for 20 to 25 minutes, until very deeply golden brown.",
    "16. Let cool on the tray for 5 minutes, and serve warm, or let cool completely and enjoy at room temperature. The scones are delicious both warm and fully cooled. Store any cooled leftovers in an airtight container at room temperature for up to 2 days.",
    "NOTES1. If you are in the mood for a project, you can make the crème fraîche from scratch using the method for making cultured cream (up to step 2) in the Cultured Butter recipe.",
    "2. Toast the sesame seeds in a small, dry sauté pan over medium heat until aromatic and lightly browned, 3 to 5 minutes."
  ]
}