{
  "title": "Chocolate Cream Pie",
  "source": "Browneyedbaker.com",
  "servings": "Yield: 8",
  "categories": [],
  "ingredients": [
    "For the Crust:",
    "24Oreo cookies with filling, crushed into crumbs",
    "4tablespoons unsalted butter, melted and cooled",
    "For the Chocolate Cream Filling:",
    "2½cups (600 ml) half-and-half",
    "Pinch salt",
    "⅓cup (66 g) granulated sugar, divided",
    "2tablespoons (14 g) cornstarch",
    "6egg yolks, at room temperature",
    "6tablespoons (85 g) unsalted butter, cold and cut into 6 pieces",
    "6ounces semisweet or bittersweet chocolate, finely chopped",
    "1ounce unsweetened chocolate, finely chopped",
    "1teaspoon vanilla extract",
    "For the Whipped Cream Topping:",
    "1½cups (360 ml) heavy cream",
    "⅓cup (38 g) powdered sugar",
    "¾teaspoon vanilla extract"
  ],
  "directions": [
    "Make the Crust: Preheat oven to 350 degrees F. Combine the Oreo cookie crumbs and the melted butter in a medium bowl and toss with a fork until the crumbs are evenly moistened. Transfer the crumbs to a 9-inch pie plate. Press the crumbs evenly into the bottom and up the sides of the pan, forming a crust. Refrigerate the lined pie plate for 20 minutes. Bake for 10 minutes, until the crust is fragrant and set. Cool on a wire rack while the filling is prepared.",
    "Make the Chocolate Cream Filling: Bring the half-and-half, salt and 3 tablespoons of the sugar to a simmer in a medium saucepan over medium-high heat, stirring occasionally with a wooden spoon to dissolve the sugar. Stir together the remaining sugar and cornstarch in a small bowl. Whisk the yolks thoroughly in a medium bowl for about 30 seconds, until slightly thickened. Add the cornstarch mixture and whisk until the mixture is glossy and the sugar has begun to dissolve, about 1 minute. When the half-and-half reaches a full simmer, drizzle about ½ cup hot half-and-half over the yolks, whisking constantly to temper; then whisk the egg yolk mixture into the simmering half-and-half. Return to a simmer, whisking constantly, until 3 or 4 bubbles burst on the surface and mixture is thickened and glossy, about 15 seconds longer.",
    "Off the heat, whisk in the butter, one piece at a time, until incorporated; add the chopped chocolate and whisk until melted, scraping the bottom of the pan with a rubber spatula to fully incorporate. Stir in the vanilla, then immediately pour the filling through a fine-mesh sieve set over a bowl. Using a spatula, scrape the strained filling into the baked and cooled crust and spread into an even layer. Press plastic wrap directly on the surface of the filling and refrigerate the pie until the filling is cold and firm, about 3 hours.",
    "Make the Whipped Cream Topping: When ready to serve, beat the cream, sugar, and vanilla on medium speed and whip. The cream will start to get frothy, and then will begin to thicken (around the 2-3 minute mark). Increase the speed to medium-high and beat for another 30 seconds to 1 minute, or until the cream looks billowy and there are distinct trails left by the whisk in the whipped cream. If you remove the whisk from the mixer and turn it upside down, the whipped cream should remain upright and not droop off. Spread or pipe the whipped cream over the chilled filling and serve. Leftovers should be stored, covered, in the refrigerator for up to 2 days."
  ]
}