{
  "title": "Chocolate Chip Cookies",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Makes about 18 large cookies",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "2sticks unsalted butter (8 oz / 227g), cut into tablespoons",
    "2tablespoons heavy cream, half-and-half, or whole milk (1 oz / 28g)",
    "2cups all-purpose flour (9.2 oz / 260g)",
    "2teaspoons Diamond Crystal kosher salt (0.22 oz / 6g)",
    "1teaspoon baking soda (0.21 oz / 6g)",
    "¾cup packed dark brown sugar (5.3 oz / 150g)",
    "¾cup granulated sugar (5.3 oz / 150g)",
    "2large eggs (3.5 oz / 100g), cold from the refrigerator",
    "1tablespoon vanilla extract",
    "5ounces (142g) bittersweet chocolate disks, half coarsely chopped",
    "5ounces (142g) milk chocolate disks, half coarsely chopped"
  ],
  "directions": [
    "Preheat the oven and prepare the baking sheet: Arrange an oven rack in the center position and preheat the oven to 400°F. Line a large rimmed baking sheet with parchment paper and set aside.",
    "Brown the butter: Measure out 4 ounces (113g) of the butter and set aside in a large bowl. In a small saucepan, cook the remaining 4 ounces (113g) butter over medium-low heat, stirring frequently, until the butter comes to a boil. Continue to cook, scraping the bottom and sides of the pan constantly with a heatproof spatula, until the butter sputters, foams, and eventually you see browned bits floating about, 5 to 7 minutes. Add the browned butter to the bowl with the other butter, making sure you scrape in all the browned bits, then add the heavy cream (no need to stir). Set aside to cool.",
    "Mix the dry ingredients: In a medium bowl, whisk together the flour, salt, and baking soda to combine. Set it aside.",
    "Mix the batter: To the bowl with the browned butter mixture (it can be slightly warm, just make sure it’s not hot), add the brown and granulated sugars and whisk vigorously until the mixture is very smooth and thick, about 45 seconds (since we’re not going for a light and cakey cookie texture, you don’t need a mixture that’s light and fluffy). Add the eggs and vanilla and whisk until the mixture is satiny, about 45 seconds. Add the flour mixture and whisk until the batter is smooth and well combined. It will look a little loose—this is normal. Switch to a flexible spatula to scrape down the bowl, folding to make sure everything is well incorporated. Add both the chocolates (whole disks and chopped) and mix to combine. Set the batter aside for 5 minutes to firm up slightly.",
    "Scoop and chill the dough: Using a 2-ounce scoop or ¼-cup measure, scoop level portions of dough and place on a parchment-lined baking sheet as close together as possible (you’ll space them out before baking). Cover the sheet tightly with plastic wrap and refrigerate for at least 12 hours and up to 48 (if you’re pressed for time, a couple of hours in the refrigerator will do—just note the baked cookies won’t be as chewy or wrinkly-looking).",
    "Preheat the oven and prepare the pans: When you’re ready to bake, arrange two oven racks in the upper and lower thirds of the oven and preheat to 350°F. Line two rimmed baking sheets with parchment paper.",
    "Bake the first batch of cookies: Place 6 pieces of chilled cookie dough on each of the prepared baking sheets, spacing them so they’re at least 3 inches apart. Bake the cookies on the upper and lower racks until they are dark golden brown around the edges, 18 to 22 minutes, switching racks and rotating the sheets front to back after 12 minutes. Allow the cookies to rest for 5 minutes on the baking sheets, then use a metal spatula to transfer the cookies to a wire rack to cool.",
    "Bake the remaining cookies: Carefully move one of the oven racks to the center position, place the remaining dough on one of the baking sheets (it’s okay if it’s still warm), and bake on the center rack (this last sheet might bake a bit faster than the first two)."
  ]
}