{
  "title": "Chocolate Pecan Slab Pie",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 12 to 18 servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "crust",
    "3¾cups (490 grams) all-purpose flour, plus more for your work surface",
    "1½teaspoons fine sea salt",
    "1½tablespoons (20 grams) granulated sugar",
    "1½cups (12 ounces or 340 grams) unsalted butter, very cold",
    "¾cup (175 ml) very cold water",
    "filling",
    "3⅓cups (330 grams) pecan halves",
    "8ounces (225 grams) bittersweet chocolate, coarsely chopped, or about 1¼ cups chocolate chips",
    "½cup (120 ml) heavy cream",
    "10tablespoons (145 grams) unsalted butter",
    "1⅔cups (215 grams) packed dark-brown sugar",
    "1cup (235 ml) maple syrup or golden syrup (see headnote)",
    "¼teaspoon coarse sea salt",
    "1½teaspoons apple cider vinegar",
    "1tablespoon (15 ml) vanilla extract",
    "1½tablespoons (25 ml) bourbon (optional)",
    "5large eggs",
    "to finish",
    "1egg, beaten with 1 teaspoon (5 ml) water"
  ],
  "directions": [
    "to make the pie dough by hand, with my one-bowl method In the bottom of a large bowl, combine the flour, salt, and sugar. Work the butter into the flour with your fingertips or a pastry blender until the mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. (Some people like to do this by freezing the stick of butter and coarsely grating it into the flour, but I haven’t found the results as flaky.)",
    "with a food processor In the work bowl of a food processor, combine the flour, salt, and sugar. Add the butter, and pulse the machine until the mixture resembles a coarse meal and the largest bits of butter are the size of tiny peas. Turn the mixture out into a mixing bowl.",
    "both methods Add the cold water, and stir with a spoon or flexible silicone spatula until large clumps form. Use your hands to knead the dough together a few times right in the bottom of the bowl. Divide the dough and wrap each half in a sheet of plastic wrap or waxed paper, and refrigerate until firm, at least 1 hour or up to 72 hours, or you can quick-firm this in the freezer for 15 minutes. If you plan to keep it longer than 3 days, it will have the best flavor if you freeze it until needed.",
    "prepare the filling Heat the oven to 375 degrees. Line the bottom of a 10-by-15-by-1-inch baking sheet or jelly-roll pan with parchment paper.",
    "Spread the pecans on a rimmed baking sheet and toast in the oven for 10 to 12 minutes, stirring once or twice so that they toast evenly. Set aside until needed. If you like smaller bits, you can chop some or all of the nuts to your desired size.",
    "Melt the chocolate chunks with the heavy cream, and stir until smooth. Spread over the bottom of the frozen crust. Freeze the crust again until the chocolate is solid, about another 10 minutes.",
    "assemble the pie On a lightly floured surface, roll one of your dough halves (the larger one, if you have two different sizes) into an 18-by-13-inch rectangle. This can be kind of a pain, because it is so large. Do your best to work quickly, keeping the dough as cold as possible and using enough flour so it doesn’t stick to the counter. Transfer the dough to your prepared baking sheet, and gently drape some of the overhang in, so that the dough fills out the inner edges and corners. Some pastry will still hang over the sides of the pan; trim this to ½ inch. Freeze the piecrust in the pan until it is solid.",
    "In a large saucepan, combine the butter, brown sugar, maple or golden syrup, and salt. Bring to a simmer over medium heat, and cook for 2 minutes, stirring regularly. Remove the pan from the heat and stir in the pecans, cider vinegar, vanilla, and bourbon (if using). Pour into a bowl (so that it cools faster), and set the mixture aside to cool a little, 5 to 10 minutes. Then whisk in one egg at a time until combined. Pour the mixture into the prepared pie shell.",
    "Roll the second of your dough halves (the smaller one, if they were different sizes) into a 16-by-11-inch rectangle. You can drape it over in one piece (cutting slits to vent the top), or cut it into wide strips to form a lattice; pinch or crimp the upper and lower crusts together, and fold the bottom crust’s overhang, if you wish, over the top crust to seal it. (The lattice is always a bit of a mess, but no matter how much you hodge-podge it, people will freak out when they see it.) Lightly beat the egg with water, and brush this over the top crust and edges.",
    "bake the pie Bake at 350 degrees until the crust is golden and the filling is bubbling, about 30 minutes. Transfer to a wire rack until just warm to the touch, about another 30 minutes, before cutting into squares."
  ]
}