{
  "title": "Chocolate Buttermilk Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 10",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "2⅓cups all-purpose flour (10.6 oz / 300g)",
    "2½teaspoons baking powder (0.35 oz / 10g)",
    "2teaspoons Diamond Crystal kosher salt (0.21 oz / 6g)",
    "½teaspoon baking soda",
    "6ounces (170g) semisweet chocolate, coarsely chopped (about 1 cup)",
    "⅔cup brewed coffee (5.5 oz /157g) or 1 teaspoon instant coffee dissolved in ⅔ cup water",
    "½cup Dutch process cocoa powder (1.4 oz / 41g)",
    "⅔cup buttermilk (5.6 oz / 160g), at room temperature",
    "2teaspoons vanilla extract",
    "1½sticks unsalted butter (6 oz / 170g), at room temperature",
    "1cup granulated sugar (7 oz / 200g)",
    "1cup packed light brown sugar (7 oz / 200g)",
    "¼cup neutral oil, such as vegetable or grapeseed (2 oz / 57g)",
    "3large eggs (5.3 oz / 150g), at room temperature",
    "Silkiest Chocolate Buttercream (this page) or Classic Cream Cheese Frosting, Chocolate Variation (this page)"
  ],
  "directions": [
    "Preheat the oven and prepare the pans: Arrange two oven racks in the upper and lower thirds of the oven and preheat to 350°F. Butter the bottoms and sides of three 8-inch cake pans and line the bottoms with rounds of parchment paper, smoothing to eliminate air bubbles. Butter the parchment, then sprinkle the pans generously with flour. Shake and rotate the pans to coat the bottoms and sides, then tap out the excess. Set the pans aside.",
    "Mix the dry ingredients: In a large bowl, whisk together the flour, baking powder, salt, and baking soda and set aside.",
    "Melt the chocolate mixture: In a separate large heatproof bowl, combine the chopped chocolate, coffee, and cocoa powder. Set the bowl over a medium saucepan filled with about 1 inch of simmering (not boiling) water and heat, whisking occasionally, until the chocolate is melted and the mixture is completely smooth. Remove from the heat and whisk in the buttermilk and vanilla. Set aside.",
    "Cream the butter, sugars, and oil: In a stand mixer fitted with the paddle attachment, combine the butter, granulated sugar, brown sugar, and oil and beat on low speed until smooth. Increase the speed to medium-high and continue to beat, scraping down the sides once or twice, until the mixture is very light and fluffy, about 5 minutes.",
    "Add the eggs: Reduce the mixer speed to medium and add the eggs one at a time, beating well after each addition. Stop the mixer and scrape down the sides.",
    "Alternate the dry and wet ingredients: Add about one-third of the flour mixture and mix on low speed until the flour has almost disappeared. Add half of the cooled chocolate mixture, mixing just until incorporated, then add the remaining flour in 2 additions, alternating with the remaining chocolate mixture. When the last traces of flour disappear, stop the mixer and remove the bowl. Use a flexible spatula to scrape down the sides and fold the batter several times to make sure it’s evenly mixed and no chocolate streaks remain.",
    "Fill the pans and bake the layers: Divide the batter among the three pans (if you have a scale, weigh out 18 oz / 510g of batter per pan), smoothing the batter into an even layer. Transfer the pans to the oven, placing two on the upper rack and one on the lower rack, staggering so the pan below doesn’t have another pan directly above it. Bake until the cakes are risen and just starting to pull away from the sides, the top is firm to the touch, and a cake tester or toothpick inserted into the centers comes out clean, 30 to 40 minutes, switching racks and rotating the pans front to back after 25 minutes.",
    "Cool the cakes: Remove the cakes from the oven and let cool completely in the pans. Use a small offset spatula or paring knife to cut around the sides of the pans to release the cakes, then invert the cakes onto a wire rack and peel off the parchment paper.",
    "Level the layers (if necessary): Reinvert the cooled layers onto a cardboard cake round or cutting board. If the cakes have pronounced domes, or if you’re a stickler for flat, even layers, use a large serrated knife and long, even strokes to slice horizontally through the very top of the cakes, keeping the blade parallel to the work surface, to remove the dome (snack on the cake scraps). This creates a flat top for easier stacking and assembly. If the cakes have just a slight dome, you can leave them as is.",
    "Stack and frost the cake: Place the first cake layer on a cake round, serving plate, or cake stand upside down (also cut-side down if you leveled the layers) and slide several strips of parchment partially underneath and all around the cake to cover and protect the plate or stand during frosting. Using a small offset spatula, spread ¾ cup of the chocolate frosting over the cake in an even layer all the way to the edges, then top with another upside-down cake layer and cover with another ¾ cup frosting. Place the third layer on top, upside down, and cover the top and sides of the entire cake with 1 cup of the frosting in a very thin, even layer. This is the “crumb coat,” which is just a base layer of frosting, so don’t worry if the cake shows through in several places. Refrigerate the cake until the frosting has hardened, 10 to 15 minutes, then cover the top and sides with the remaining frosting.",
    "Serve: Slide the parchment strips out from underneath the cake before cutting into slices."
  ]
}