{
  "title": "Chocolate & Stout Ice Cream",
  "source": "Complete Irish Pub Cookbook",
  "servings": "Makes about 3 1/2 cups",
  "categories": [
    "Complete Irish Pub Cookbook",
    "England/Ireland"
  ],
  "ingredients": [
    "1 1/2cups whole milk",
    "3/4cup sugar",
    "5 1/2ounces semisweet dark chocolate (at least 85 percent cocoa solids), broken into small pieces",
    "4egg yolks",
    "1teaspoon vanilla extract",
    "1 1/3cups stout",
    "1cup heavy cream",
    "grated chocolate, to decorate"
  ],
  "directions": [
    "1. Pour the milk into a saucepan and add the sugar. Bring to a boil, stirring, until the sugar has dissolved. Remove from the heat and stir in the chocolate.",
    "2. Pour the egg yolks into a heatproof bowl and beat for 5 minutes, or until the beaters leave a faint trail when lifted from the mixture. Stir some of the warm chocolate mixture into the egg yolks, then gradually beat in the rest.",
    "3. Place the bowl over a saucepan of gently boiling water. Stir continuously for about 10 minutes, until the mixture reaches a temperature of 185°F, or is thick enough to coat the back of a spoon. Be careful not to let it boil.",
    "4. Strain the mixture through a fine strainer into a pitcher. Stir in the vanilla extract. Sit the bottom of the pitcher in iced water until cold, then cover with plastic wrap and chill for 2 hours.",
    "5. Meanwhile, pour the stout into a saucepan and bring to a boil. Reduce the heat and simmer briskly for 8 minutes, until reduced to 1 cup. Pour into a pitcher, let cool, then chill in the refrigerator.",
    "6. Stir the cream and chilled stout into the chocolate mixture, mixing well. Pour the mixture into the bowl of an ice cream machine. Churn and freeze following the manufacturer’s instructions. Alternatively, pour the mixture into a shallow freezerproof container, cover with plastic wrap, and freeze for about 2 hours, until beginning to harden around the edges. Beat until smooth to get rid of any ice crystals. Freeze again, repeat the process twice, then freeze until completely firm.",
    "7. Move the ice cream to the refrigerator 30 minutes before serving to soften. Serve in chilled dishes, sprinkled with grated chocolate."
  ]
}