{
  "title": "Chocolate-Cardamom Cake with Roasted Pears",
  "source": "Modern Bistro - ATK",
  "servings": "Serves: 8",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "Pears",
    "1Tablespoon Unsalted Butter",
    "3Ripe But Firm Bartlett or Bosc Pears (6 to 8 Ounces Each), Peeled, Halved, and Cored",
    "Cake",
    "½Cup (2½ Ounces) All-Purpose Flour",
    "¼Cup (¾ Ounce) Unsweetened Cocoa Powder",
    "1Teaspoon Ground Cardamom",
    "¼Teaspoon Baking Powder",
    "¼Teaspoon Table Salt",
    "¾Cup (5¼ Ounces) Granulated Sugar",
    "2Large Eggs, Room Temperature",
    "8Tablespoons Unsalted Butter, Melted and Cooled",
    "1Teaspoon Vanilla Extract",
    "2Ounces Semisweet Chocolate, Chopped Fine",
    "Confectioners’ Sugar"
  ],
  "directions": [
    "1. For the pears: Adjust oven rack to middle position and heat oven to 450 degrees. Melt butter in 12-inch ovensafe skillet over medium-high heat. Arrange pears cut side down in skillet and cook, without moving pears, until just beginning to brown on first side, 3 to 5 minutes. Transfer skillet to oven and roast for 10 minutes. Flip pears and continue to roast until fork easily pierces fruit, 8 to 12 minutes. Remove skillet from oven (skillet handle will be hot) and transfer pears cut side down to paper towel–lined plate. Reduce oven temperature to 325 degrees.",
    "2. For the cake: Grease 9-inch springform pan. Whisk flour, cocoa, cardamom, baking powder, and salt together in bowl. Whisk granulated sugar and eggs in large bowl until pale yellow, about 1 minute. Whisk in melted butter and vanilla until combined. Using rubber spatula, fold in flour mixture until few streaks remain. Fold in chocolate until just combined (don’t overmix).",
    "3. Transfer batter to prepared pan and smooth into even layer. Cut 1 pear half crosswise into ¼-inch-thick slices; leave pear intact on cutting board. Discard first 4 slices from narrow end of sliced pear. Slide small offset spatula under pear and gently press pear to fan slices toward narrow end. Slide fanned pear onto batter with narrow end facing center and wide end almost touching edge of pan. Do not press pear into batter. Repeat slicing, fanning, and placing remaining 5 pear halves evenly around pan. Bake until toothpick inserted in center comes out with few moist crumbs attached, 45 to 55 minutes, rotating pan halfway through baking.",
    "4. Let cake cool in pan on wire rack for 20 minutes. Remove sides of pan and let cake cool completely, about 1½ hours. To unmold cake, slide thin metal spatula between cake bottom and pan bottom to loosen, then slide cake onto serving platter. Dust with confectioners’ sugar before serving."
  ]
}