{
  "title": "Chocolate Cream Pie with Oreo Crust",
  "source": "Cooking.nytimes.com",
  "servings": "8 to 10 servings",
  "categories": [],
  "ingredients": [
    "2cups/270 grams Oreo crumbs (from about 24 standard-sized Oreos)",
    "4tablespoons/57 grams unsalted butter (1/2 stick), melted",
    "1/2teaspoon kosher salt",
    "1/2cup/100 grams granulated sugar",
    "3tablespoons cornstarch",
    "2tablespoons cocoa powder",
    "3/4teaspoons kosher salt",
    "3cups/720 milliliters whole milk",
    "6large egg yolks",
    "8ounces/225 grams semisweet bar chocolate, finely chopped",
    "2tablespoons unsalted butter, cut into small cubes",
    "1teaspoon vanilla extract",
    "1cup/240 milliliters heavy cream",
    "1tablespoons confectioners’ sugar",
    "Crushed Oreos, for garnish (optional)"
  ],
  "directions": [
    "Heat oven to 350 degrees. Add Oreos to the bowl of a food processor and process until fine crumbs form. Add melted butter and salt, and process until crumbs are evenly moistened. Tip mixture out into a 9-inch pie plate, and press crumbs evenly into bottom and sides of pan. Bake until crust is fragrant and set, about 12 minutes. Transfer to a rack to cool.",
    "Set a fine mesh sieve over a medium bowl. In a medium saucepan, whisk together granulated sugar, cornstarch, cocoa powder and salt. Pouring just a little at first, whisk the milk into the sugar mixture until you have a smooth paste. Gradually add remaining milk, whisking constantly. Whisk in egg yolks. Cook mixture over medium heat, whisking constantly, until it has thickened and just come up to a low boil, about 8 to 9 minutes. Continue to cook, stirring constantly, for 1 minute.",
    "Pour custard through sieve, pushing it through with a rubber spatula. Discard any solids. Stir in chocolate, butter and vanilla, and let it stand for 1 minute. Stir until smooth. Pour mixture into prepared crust. Let cool slightly, then cover loosely with plastic wrap and chill until firm, at least 6 hours.",
    "To serve, whip cream and confectioners’ sugar until soft peaks form. Top with whipped cream and sprinkle with crushed Oreos, if using."
  ]
}