{
  "title": "Chorizo & Chickpea Carbonara",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- ½ lemon",
    "DAIRY",
    "- 4 large egg yolks",
    "- 1 large egg",
    "- 2 ounces grated Parmesan cheese (about ½ cup), plus more for serving",
    "PANTRY",
    "- Kosher salt",
    "- 4 ounces cured (Spanish) chorizo (about a 6-inch piece)",
    "- 1 (14.5-ounce) can chickpeas",
    "- 3 tablespoons extra-virgin olive oil",
    "- Freshly ground black pepper",
    "- 1 pound dried rigatoni"
  ],
  "directions": [
    "1. Bring a large pot of heavily salted water to a boil.",
    "2. Make the egg mixture:- In a medium bowl, whisk together 4 egg yolks and 1 whole egg. Whisk in 2 ounces grated Parmesan cheese (½ cup).",
    "3. Start the sauce:- Dice 1 (4-ounce) piece of Spanish chorizo into ¼-inch pieces.- Thoroughly drain and rinse 1 (14.5-ounce) can of chickpeas in a fine-mesh strainer.- In a large Dutch oven, combine the chorizo and 3 tablespoons olive oil. Cook over medium heat until it just starts to sizzle, about 3 minutes.- Add the chickpeas and stir well to coat in the oil. Continue to cook, stirring occasionally and crushing some of the chickpeas with the back of a wooden spoon, until they are crisp in some areas and the chorizo has leeched out some of its red oil, 5 to 6 minutes longer. Coarsely grind lots of black pepper into the pot to bloom the pepper and bring out its aroma. Remove the pot from the heat.",
    "4. Cook the pasta:- While the chickpeas cook, add the rigatoni to the boiling water and give it a stir. Cook according to the package directions for al dente. Scoop out and reserve 1½ cups of the pasta water, then drain the pasta.- Whisk ½ cup of the reserved pasta water into the egg and Parmesan mixture until well combined.",
    "5. Bring it all together:- Transfer the pasta to the Dutch oven along with about half of the remaining pasta water. Turn the heat to medium-low and stream in the egg mixture, stirring vigorously and constantly with a spoon, until the pasta is coated in a thick, creamy, pale yellow sauce. You will see it magically transform from a raw egg mixture to a slightly thickened creamy sauce. Add a splash or two more pasta water if it looks a little too thick and could be saucier.- Finely grate the zest of ½ lemon into the pasta. Taste and add more salt and black pepper if you think it needs it.",
    "6. Serve: Top with more grated Parmesan and black pepper and serve."
  ]
}