{
  "title": "Chrysanthemum Caesar",
  "source": "Italian American Don Angie Book",
  "servings": "SERVES 4 TO 6",
  "categories": [
    "Italian American - Don Angie",
    "Salads"
  ],
  "ingredients": [
    "Dressing",
    "⅓cup Japanese mayonnaise, such as Kewpie",
    "1tablespoon plus 2 teaspoons fresh lemon juice",
    "1tablespoon plus ½ teaspoon neutral oil, such as vegetable",
    "1tablespoon extra-virgin olive oil",
    "2tablespoons plus 2 teaspoons finely grated Parmigiano-Reggiano cheese",
    "2teaspoons Roasted Garlic Puree (this page)",
    "Half of 1 anchovy fillet",
    "¾teaspoon garlic grated on a Microplane (about 2 cloves)",
    "1tablespoon sugar",
    "¼teaspoon colatura or fish sauce",
    "¾teaspoon kosher salt",
    "¼teaspoon freshly ground black pepper",
    "Salad",
    "1¼pounds (about 40 stalks) chrysanthemum greens (see Note)",
    "¼cup toasted sesame seeds",
    "¾cup Crispy Garlic Bread Crumbs (this page)",
    "2½tablespoons fresh lemon juice",
    "2½tablespoons extra-virgin olive oil",
    "1½teaspoons kosher salt",
    "4ounces Parmigiano-Reggiano cheese"
  ],
  "directions": [
    "Make the dressing: In a blender, combine the mayonnaise, lemon juice, ¼ cup water, both oils, the parmesan, roasted garlic puree, anchovy, grated garlic, sugar, colatura, salt, and pepper and blend on high speed until incorporated. You should have about 1 cup dressing. Set aside. (The dressing may be made up to 3 days ahead.)",
    "Make the salad: First, to prepare an ice bath using a salad spinner, place 2 cups of ice and 8 to 10 cups water in the bottom of the spinner and place the basket on top of the ice, submerged in the water. (Set the lid aside for now.) To clean chrysanthemum greens, pick the leaves (discard any that are bruised) from the stalks and place them into the basket in the ice water. Discard the stalks.",
    "Allow the greens to sit in the ice water for at least 10 and up to 20 minutes. Pull the basket with the greens out, discard the ice and water, return the basket of greens to the spinner, and spin the greens dry. (Alternatively, if you don’t have a salad spinner, use a sieve set in a large bowl to create the ice bath, then drain the ice water and dry the greens very well with paper towels.)In a small bowl, combine the sesame seeds and garlic bread crumbs.",
    "In a large bowl, toss the greens with the lemon juice, olive oil, and salt. Place the dressed greens in a loose pile on a serving platter or individual plates. Drizzle the dressing deliberately and slowly over the top of the greens to dress them evenly. Top with the sesame/bread crumb mixture. Grate the parmesan with a Microplane over the top of the salad to shower the entire dish in a small mountain of cheese.",
    "Serve immediately. The dressing and bread crumbs can be made ahead, but the assembled salad dish is best eaten straightaway."
  ]
}