{
  "title": "Cinnamon Sugar Palmiers",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Makes 16 palmiers",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "½cup demerara sugar (3.5 oz / 100g)",
    "2teaspoons ground cinnamon",
    "Pinch of kosher salt",
    "½recipe Rough Puff Pastry (this page) or 1 recipe Flaky All-Butter Pie Dough (this page)",
    "All-purpose flour, for rolling out",
    "1large egg, beaten"
  ],
  "directions": [
    "Make the cinnamon sugar: In a small bowl, toss together the demerara sugar, cinnamon, and salt to combine.",
    "Roll out the pastry and dust with cinnamon sugar: Let the pastry sit at room temperature for a few minutes to soften slightly. Roll it out on a lightly floured piece of parchment paper, lifting and dusting with more flour as needed, into a rectangle measuring 12 × 10 inches and ¼ inch thick. Use a pastry brush to dust any excess flour off the top or underside of the dough. Brush the entire surface with a thin layer of the beaten egg and then sprinkle half of the cinnamon sugar over the top, pressing it gently into the surface of the pastry.",
    "Roll up the pastry: Starting at one of the longer sides of the slab and using the parchment paper to help you, tightly roll the pastry into a spiral just until you reach the midline. Rotate the parchment paper 180 degrees and repeat from the other side of the pastry so you have two tight spirals of equal thickness that touch. Firmly pinch the two sides together along the entire length of the pastry, compressing the spirals (the pastry will puff in the oven, causing the spirals to unwind a bit). Slide the pastry off the parchment, then brush the outsides of the pastry with more egg and sprinkle with the remaining cinnamon sugar, making sure every bit of surface is coated.",
    "Freeze until firm: Wrap the piece of parchment paper you used for rolling out the pastry around the sugared log and again squeeze firmly up and down the length to help keep the two spirals together. Transfer the log to the freezer and chill until the pastry is very firm but not frozen solid, 20 to 25 minutes.",
    "Preheat the oven and prepare the baking sheet: Arrange an oven rack in the center position and preheat the oven to 375°F. Line a large rimmed baking sheet with parchment paper and set aside.",
    "Cut the palmiers and bake: Remove the pastry log from the freezer and place on a cutting board. Use a sharp knife to trim away the ragged ends of the pastry, making crosswise slices about ½ inch in from each end. Cut the log in half crosswise and then in half again to make four equal pieces, then slice each quarter into four equal pieces so you have 16 palmiers measuring between ½ and ¾ inch thick. Transfer the palmiers to the prepared baking sheet cut-sides down, spacing them evenly, and bake until they are puffed and golden brown and the sugar has melted and caramelized into glassy puddles on the baking sheet, 25 to 30 minutes. Let cool completely on the baking sheet."
  ]
}