{
  "title": "Citrus-Ginger Cabbage with Sesame Tofu",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Makes 4 (big!) salads",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "½cup cashews",
    "Boiling water",
    "1medium head red cabbage (2 pounds)",
    "1medium Cara Cara orange",
    "½teaspoon grated lime zest (about ½ lime)",
    "1tablespoon fresh lime juice (about ½ lime)",
    "½cup fresh cilantro leaves, plus a few sprigs for garnish",
    "1tablespoon grated fresh ginger",
    "3garlic cloves, grated",
    "1tablespoon soy sauce",
    "1tablespoon rice vinegar",
    "½teaspoon sriracha",
    "½cup fresh mint leaves, plus a few leaves for garnish",
    "1(16-ounce) block extra-firm tofu",
    "2teaspoons toasted sesame oil",
    "Diamond Crystal kosher salt",
    "Avocado oil",
    "1tablespoon white sesame seeds"
  ],
  "directions": [
    "1. Put the cashews in a small heatproof bowl and add boiling water to cover. Set aside.",
    "2. Thinly slice the cabbage with a knife or on a mandoline and place in a large bowl. Supreme the orange (see opposite) and add the segments to the cabbage. Squeeze any juice from the leftover orange peels over the cabbage. Add the lime zest.",
    "3. In a blender, combine the center piece of the orange (no waste!), the lime juice, ¼ cup of the cilantro, the ginger, garlic, soy sauce, vinegar, and sriracha. Drain the cashews and add them to the blender with ½ cup cool water. Blend until smooth, adding a bit more water if it’s too thick.",
    "4. Pour this dressing over the cabbage and stir to combine. Tear in the remaining cilantro and all the mint.",
    "5. Cut the tofu into 1-inch-thick squares and press out any moisture (see this page). In a large bowl, gently toss the tofu pieces with the sesame oil and a pinch of salt.",
    "6. Set a large pan over medium heat and add enough avocado oil to coat the bottom. Bring the oil up to 325°F and pan-fry the tofu pieces for 3 to 4 minutes on each side. When the tofu is finished remove it from the pan, turn the heat to medium-low, add the sesame seeds, and toast until golden brown, 3 to 4 minutes.",
    "7. Pile the salad into a bowl, add the tofu on top, and garnish with the toasted sesame seeds and a few mint and cilantro leaves."
  ]
}