{
  "title": "Citrus Chicken Rested in Herbs",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 4 to 6",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "½cup fresh lime or lemon juice (from 4–6 lemons or limes), plus 1 lime or lemon, thinly sliced",
    "½cup fresh orange juice, plus 1 orange, thinly sliced, seeds removed",
    "½cup soy sauce",
    "2tablespoons canola oil, plus more",
    "2tablespoons yuzu kosho or sambal, or 1 jalapeño, finely chopped",
    "2garlic cloves, finely grated",
    "Kosher salt and freshly ground black pepper",
    "3½- to 4-pound chicken, halved lengthwise through the backbone (see Note, this page), or bone-in, skin-on parts",
    "½cup fresh cilantro, tender leaves and stems, coarsely chopped",
    "½cup fresh parsley, tender leaves and stems, coarsely chopped",
    "A few sprigs fresh rosemary, thyme, oregano, or marjoram (optional)",
    ""
  ],
  "directions": [
    "1 To make the marinade, combine the lime juice, orange juice, soy sauce, oil, yuzu kosho, and garlic in a medium bowl and season with salt and pepper. Set about half aside for later, and add the rest of the marinade to a large bowl, resealable bag, or baking dish. Add the chicken, tossing to coat well. Let it sit in the marinade for a while (at least 30 minutes, but up to 24 hours, in the refrigerator).2 Preheat the oven to 450°F. (Alternatively, heat a grill to medium heat, with cooler coals or low flames on one side. You can grill the chicken over hotter flames, but it can be challenging to manage; for beginners, it’s good to err on the side of the coals being slightly cooler than slightly hotter.)3 Remove the chicken from the marinade (discarding the marinade the chicken was sitting in) and place skin side up on a rimmed baking sheet. Roast until the skin is deeply browned and lightly charred and the chicken is cooked through, 35 to 45 minutes; no need to flip or turn the chicken. (Alternatively, place the chicken skin side down on the grill and cover; make sure the vents are open. Let it grill, resisting the urge to turn or check too frequently, until it’s nicely golden brown with those cute little grill marks, 10 to 12 minutes; just like when you’re searing chicken in a skillet, the skin will release effortlessly once it’s cooked and golden. Attempting to move it beforehand will probably tear the skin and maybe ruin your day! Using your finest and largest tongs, carefully flip the chicken and cover so that it continues to grill and cook on the other side, another 10 to 12 minutes. Flip once more, skin side down, and add a few halves of cut citrus. Continue to grill another 5 to 8 minutes, to recrisp the skin and finish cooking through.)4 Place the remaining citrus slices on a platter or cutting board and scatter with the herbs. Place the cooked chicken on top, skin side up, and pour the reserved marinade over. Let the chicken rest for 10 to 20 minutes, allowing its juices to mingle with the fresh citrus and herbs. Carve the chicken into pieces before serving."
  ]
}