{
  "title": "Citrus Risotto",
  "source": "The Food of Sicily - Fabrizia Lanza",
  "servings": "Serves 4",
  "categories": [
    "Italian",
    "The Food of Sicily - Fabrizia Lanza"
  ],
  "ingredients": [
    "- 1 small orange",
    "- 1 small lemon",
    "- 1 small grapefruit",
    "- 1 small onion, finely chopped",
    "- 1 garlic clove, finely chopped",
    "- 2 tablespoons olive oil",
    "- 1½ cups (300 g) risotto rice, such as Carnaroli, Arborio, or Vialone Nano",
    "- ½ cup (120 ml) dry white wine",
    "- 4 to 6 cups (1 to 1.5 L) vegetable broth",
    "- 4 tablespoons (55 g) unsalted butter",
    "- ½ cup (50 g) finely grated Parmigiano-Reggiano cheese",
    "- Fine sea salt and freshly ground black pepper"
  ],
  "directions": [
    "1. Bring a small pot of water to a boil.2. While the water heats up, use a vegetable peeler to remove strips of zest from all the citrus fruits, making sure to take just the thin colorful layer and avoiding any spongy white pith. Slice the zest strips into matchsticks. (Set the fruits aside.)3. Add the sliced zest to the boiling water and cook until very tender, about 5 minutes. Drain well and set aside.4. Meanwhile, using a very sharp knife, carefully cut away the white pith and outer membrane from the citrus to expose the flesh, following the curve of the fruit. Cut out the segments of each citrus fruit by slicing between the interior membranes and combine all the segments in a bowl. Squeeze all the juice from the pulp clinging to the remaining membranes into a separate bowl. Set the bowls aside.5. In a heavy saucepan, gently sauté the onion and garlic in the olive oil over medium heat, stirring occasionally, until softened and translucent, 6 to 8 minutes. Add the rice and cook for a minute or two, stirring to coat it with the olive oil. Pour in the wine and stir to combine. Once the wine has been absorbed by the rice, add about 1 cup (240 ml) of the broth. Cook, stirring frequently, until the rice absorbs most of the broth. Continue adding ladlefuls of the broth, about 1 cup (240 ml) at a time. Each time you add broth, add a few sliced citrus zests, a couple of citrus segments, and a splash of citrus juice. (Reserve a small amount of each for garnishing the finished risotto.)6. When the rice is plump and tastes tender, about 20 minutes, remove the pan from the heat and add the butter and Parmigiano, vigorously shaking the pan to incorporate. Taste and season with salt and pepper.7. Garnish the risotto with the remaining citrus zest, segments, and juice and serve at once."
  ]
}