{
  "title": "Clams on Toast with Bacon & Old Bay Mayo",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "Produce",
    "- 2 ears corn",
    "- 6 garlic cloves",
    "- 2 large leeks",
    "- 1 small bunch chives",
    "Seafood & Meat",
    "- 32 littleneck or manila clams",
    "- 6 ounces cold thick-cut bacon",
    "Pantry",
    "- ¾ cup mayonnaise",
    "- 2½ teaspoons Old Bay seasoning",
    "- Kosher salt",
    "- ½ teaspoon red pepper flakes",
    "- ¾ cup dry white wine",
    "- 2 large (1-inch-thick) slices country bread",
    "- 3 tablespoons extra-virgin olive oil"
  ],
  "directions": [
    "Mise it out- Submerge the clams in a large bowl of cold water, swooshing them around to release any grit. Scrub particularly dirty clams with a clean sponge. Let sit for at least 10 minutes.- Remove the husks from 2 ears of corn. Shave the kernels off each ear into a medium bowl. Discard the cobs.- Thinly slice 5 garlic cloves and add them to the bowl of corn.- Trim and discard the dark green tops and hairy root ends of 2 leeks. Peel off and discard the first two layers; dice the leeks. Rinse under cold water if needed to release any grit. Add to the corn.- Thinly slice 1 small bunch of chives and set aside.",
    "Make the Old Bay mayo- Stir together ¾ cup mayonnaise and 2½ teaspoons Old Bay seasoning in a small bowl. Finely grate 1 garlic clove into the mixture, stir, and season with salt.",
    "Build the broth- Dice 6 ounces cold bacon into ½-inch pieces. Place in a large Dutch oven over medium heat. Cook until crisp and golden brown, 8 to 10 minutes.- Add the corn mixture, ½ teaspoon red pepper flakes, and 1 teaspoon salt to the Dutch oven. Cook, stirring occasionally, until vegetables are soft, 8 to 10 minutes.- Drain the clams in a colander.- Add ¾ cup white wine to the vegetables, simmering until the pot is nearly dry, 2 to 3 minutes.",
    "Cook the clams- Add the clams to the pot, stirring to coat. Cover and cook until all the clams open, 8 to 15 minutes. Start checking at around 8 minutes. Transfer cooked clams to a bowl and allow the remaining ones to cook longer (discard any clams that don't open).",
    "Fry the bread- Cut 2 slices of bread in half crosswise to get 4 pieces.- Heat 3 tablespoons olive oil in a large cast-iron skillet over medium-low heat. Add the bread slices and cook on one side until golden brown and crisp, 5 to 6 minutes.- Slather some Old Bay mayo on the fried side of each toast and place one toast in each of 4 shallow bowls, fried-side up.",
    "Serve- Spoon the clams over the toast, top with broth, vegetables, and sliced chives."
  ]
}