{
  "title": "Classic English Muffins",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8 to 10",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "1½cups whole milk (12.7 oz / 360g)",
    "2tablespoons unsalted butter (1 oz / 28g)",
    "2tablespoons honey (1.5 oz / 43g)",
    "1teaspoon active dry yeast (0.11 oz / 3g)",
    "2¾cups bread flour (12.7 oz / 360g)",
    "¼cup whole wheat flour (1.2 oz / 35g)",
    "2teaspoons Diamond Crystal kosher salt (0.21 oz / 6g)",
    "Neutral oil, for the bowl and baking sheet",
    "Cornmeal, for dusting"
  ],
  "directions": [
    "Scald the milk: In a small saucepan, heat the milk over medium heat just until it starts to steam and a skin forms on the surface. You might see some tiny bubbles form around the sides, but don’t let the milk come to a full boil. Maintain the milk at this temperature, decreasing the heat slightly if needed, for about 30 seconds, then remove it from the heat. Whisk in the butter and honey and set aside, whisking occasionally, until the mixture is warm but not hot, 10 to 15 minutes (you’re going to use the scalded milk to proof the yeast, and if it’s too hot, the yeast will die; it should feel lukewarm and register around 105°F on an instant-read thermometer).",
    "Proof the yeast: Combine the yeast and 2 tablespoons of the milk mixture in a small bowl and stir to dissolve the yeast. Let sit until the mixture is foamy, about 5 minutes.",
    "Mix the dough: In a stand mixer fitted with the dough hook attachment, combine the bread flour, whole wheat flour, salt, milk mixture, and yeast mixture and mix on low just until the flour is incorporated into the liquid. Increase the speed to medium-high and continue to mix, occasionally scraping down the sides with a flexible spatula or scraper until the dough is smooth, elastic, and climbing up the hook but still very wet and sticky, 8 to 10 minutes.",
    "Let the dough rise: Generously oil the inside of a separate large bowl and scrape in the dough. You want it to slide around freely, so shake the bowl and loosen any areas where the dough is stuck to the sides. Cover the bowl tightly with plastic wrap and let rise in a warm spot until the dough is doubled in size and filled with big air pockets, 1 to 1½ hours.",
    "Prepare the baking sheet: While the dough is rising, line a large rimmed baking sheet with parchment paper and generously brush the surface with more oil. Dust with cornmeal and set aside.",
    "Flatten the dough and chill: When the dough has risen, use a dough scraper or spatula to gently loosen the dough from around the bowl and let it gently slide out onto the prepared baking sheet. Try not to knock out too much air as you do this. Generously brush another sheet of parchment paper with oil and place it oiled-side down on top of the dough, then use the palms of your hands to flatten it down into a thin, even slab measuring about ½ inch thick. Leaving the top layer of parchment right where it is, cover the baking sheet with plastic wrap and refrigerate for at least 8 hours and up to 12 (cold dough will not only be easier to handle, but the English muffins will taste better, too).",
    "Form the English muffins: Remove the baking sheet from the refrigerator, uncover, and peel off the top layer of parchment. Use an oiled 3½-inch round cutter to punch out as many rounds as you can from the slab, fitting them close together for as little scrap as possible. The dough will be sticky, so oil your hands as well if needed, and press down firmly with the cutter, twisting once you hit the parchment. Depending on the shape of the slab and how tightly you cut out the rounds, you could get anywhere from 7 to 9 English muffins—if you have large pieces of scrap dough, pinch them together and cut another round. Discard any scraps and make sure the rounds have a little breathing room between them.",
    "Griddle the muffins: Transfer as many rounds as will fit to a cold griddle or large skillet, spacing them ½ inch apart (in a skillet, you’ll have to cook them in batches). Heat the griddle or skillet over medium-low heat and cook until the muffins are puffed, the bottoms are crisp and deeply browned, and the surface has gone from shiny to matte, 7 to 10 minutes. Flip the muffins gently, reduce the heat to low, and cook until the second side is deeply browned, another 5 to 7 minutes. If the muffins are cooking faster, reduce the heat—you want them to cook slowly to help form interior nooks and crannies and to ensure that the centers are cooked through. If you’re using a skillet, cook the remaining batches over low heat the entire time.",
    "Let cool and then split: Transfer the English muffins to a wire rack as they’re done and let them cool completely. Stab the tines of a fork into the pale sides of the muffin at the midway point, puncturing the dough all the way around, then slowly pull the halves apart. Eat fresh or toasted."
  ]
}