{
  "title": "Classic Birthday Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 10",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "3cups cake flour (12.7 oz / 360g)",
    "2teaspoons baking powder (0.28 oz / 8g)",
    "1½teaspoons Diamond Crystal kosher salt (0.16 oz / 5g)",
    "½teaspoon baking soda",
    "2sticks unsalted butter (8 oz / 226g), at room temperature",
    "1¾cups sugar (12.3 oz / 350g)",
    "¼cup neutral oil, such as vegetable or grapeseed (2 oz / 57g)",
    "5large egg yolks (2.6 oz / 80g)",
    "2large eggs (3.5 oz / 100g)",
    "1tablespoon vanilla extract",
    "1cup buttermilk (8.5 oz / 240g), at room temperature",
    "Classic Cream Cheese Frosting, Chocolate Variation",
    "Sprinkles, for decorating"
  ],
  "directions": [
    "Preheat the oven and prepare the pans: Arrange two oven racks in the upper and lower thirds of the oven and preheat to 350°F. Butter the bottoms and sides of the cake pans and line the bottoms with rounds of parchment paper, smoothing to eliminate air bubbles. Set the pans aside.",
    "Mix the dry ingredients: In a large bowl, whisk together the flour, baking powder, salt, and baking soda to combine. Set aside.",
    "Cream the butter, sugar, and oil: In a stand mixer fitted with the paddle attachment, combine the butter, sugar, and oil and beat on low until smooth. Increase the speed to medium-high and continue to beat, scraping down the sides once or twice, until the mixture is very light and fluffy, about 4 minutes.",
    "Add the eggs and vanilla: Reduce the mixer speed to medium and add the egg yolks, a few at a time, beating well after each addition, followed by the whole eggs. Beat on medium-high until the mixture is very light and thick, about 1 minute. Beat in the vanilla. Stop the mixer and scrape down the sides.",
    "Alternate the dry and wet ingredients: Add about one-third of the flour mixture and mix on low speed until the flour has almost disappeared. Add half of the buttermilk, mixing just until incorporated, then add the remaining flour mixture in 2 additions, alternating with the remaining buttermilk. When the last traces of flour disappear, stop the mixer and remove the bowl. Use a flexible spatula to scrape down the sides and fold the batter several times to make sure it’s evenly mixed.",
    "Fill the pans and bake the layers: Divide the batter among the three pans (if you have a scale, weigh out 17 oz / 482g of batter per pan). Smooth the batter in an even layer all the way to the sides. Transfer the pans to the oven, placing two on the upper rack and one on the lower rack, staggering so the pan below doesn’t have another pan directly above it. Bake until the cakes are risen and just starting to pull away from the sides, the tops are golden brown, and a cake tester or toothpick inserted into the centers comes out clean, 30 to 35 minutes, switching racks and rotating the pans front to back after 25 minutes.",
    "Cool the cakes and level the layers: Remove the cakes from the oven and let them cool completely in the pans. Cut around the sides with a paring knife or offset spatula, then invert the layers onto a wire rack and peel away the parchment paper. Reinvert the layers onto a cardboard cake round or cutting board. Use a long serrated knife and long, even strokes to slice off the domed tops of the cakes, keeping the blade parallel to the work surface. (Snack on the cake scraps.) This creates level layers for easier stacking and assembly.",
    "Stack and frost the cake: Place the first cake layer cut-side down on a cake round, serving plate, or cake stand and slide several strips of parchment partially underneath and all around the cake to cover and protect the plate or stand during frosting. Using a small offset spatula, spread ¾ cup of the frosting over the cake in an even layer all the way to the edges, then top with another layer, cut-side down, and cover with another ¾ cup frosting. Place the third layer on top, cut-side down, and cover the top and sides of the entire layer cake with 1 cup of the frosting in a very thin, even layer. This is the “crumb coat,” which is just a base layer of frosting, so don’t worry if the cake shows through in several places. Refrigerate the cake until the frosting has hardened, 10 to 15 minutes, then cover all the surfaces with the remaining frosting. Decorate with sprinkles as desired.",
    "Serve: Slide the parchment strips out from underneath the cake before cutting into slices."
  ]
}