{
  "title": "Clay Pot Chicken Rice",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "3scallions, white and green parts separated and sliced thin",
    "4garlic cloves, minced",
    "2tablespoons soy sauce",
    "2tablespoons Shaoxing wine",
    "4teaspoons oyster sauce",
    "2teaspoons dark soy sauce",
    "2teaspoons grated fresh ginger",
    "2teaspoons sugar",
    "1/2teaspoon white pepper",
    "1tablespoon cornstarch",
    "4(5- to 7-ounce) bone-in chicken thighs, trimmed",
    "2ounces dried shiitake mushrooms, rinsed",
    "1 1/2cups jasmine rice, rinsed",
    "1teaspoon table salt, plus 2 teaspoons salt for soaking rice",
    "2tablespoons vegetable oil",
    "1cup chicken broth",
    "2ounces lap cheong (Chinese sausage), sliced thin (optional)"
  ],
  "directions": [
    "1. Combine scallion whites, garlic, soy sauce, Shaoxing wine, oyster sauce, dark soy sauce, ginger, sugar, and pepper in large bowl. Transfer 3 tablespoons sauce to small bowl; set aside. Whisk cornstarch into remaining marinade.",
    "2. Working with 1 thigh at a time, position cleaver at middle of thigh, perpendicular to bone. Slice through meat so bone is exposed. Hold knife steady, with base of blade resting on top of bone, and use nondominant hand to push down on spine of knife to split thigh into 2 pieces. Transfer thigh pieces to bowl with marinade and toss to coat. Cover and refrigerate for 30 minutes.",
    "3. Meanwhile, microwave 4 cups water and mushrooms in covered bowl until steaming, about 10 minutes, stirring halfway through microwaving. Let sit until softened, about 30 minutes. Lift mushrooms from bowl with fork and transfer to cutting board. Squeeze mushrooms dry, stem, and slice 1/4 inch thick. Measure out and reserve 1/4 cup mushroom soaking liquid; discard remaining liquid.",
    "4. Place rice and 2 teaspoons salt in medium bowl and cover with 4 cups hot tap water. Stir gently to dissolve salt; let sit for 15 minutes, then drain rice.",
    "5. Heat oil in 4 1/2- to 7-quart glazed ceramic or earthenware pot over medium-low heat until shimmering. Arrange chicken skin side down in single layer in pot and cook until fat begins to render, 5 to 7 minutes; return chicken to bowl. Add broth and reserved mushroom liquid to fat left in pot, scraping up any browned bits. Stir in rice and 1 teaspoon salt and bring to boil over medium-high heat. Reduce heat to medium-low and simmer until no water is visible above rice, about 5 minutes.",
    "6. Arrange chicken skin side up on top of rice and add any accumulated juices. Top with mushrooms and lap cheong, if using. Cover and continue to cook until chicken registers at least 175 degrees, rice is tender, and deep golden crust has formed on bottom of pot, 25 to 35 minutes, rotating pot halfway through cooking. Off heat, drape clean dish towel underneath lid and let sit for 10 minutes. Drizzle reserved sauce over chicken and sprinkle with scallion greens. Serve."
  ]
}