{
  "title": "Coconut Short Rib Curry (Beef Rendang)",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "SERVES 4",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "2pounds boneless beef short ribs, cut into large cubes",
    "Kosher salt",
    "2tablespoons vegetable oil",
    "4large shallots, roughly chopped",
    "3-inch piece fresh ginger, peeled and roughly chopped",
    "2stalks fresh lemongrass, peeled and roughly chopped (see Tip)",
    "3fresh or dried kaffir lime leaves (see Tip)",
    "6cloves garlic",
    "1tablespoon red pepper flakes",
    "2teaspoons ground turmeric",
    "1½teaspoons ground coriander",
    "1teaspoon ground cinnamon",
    "1(13.5-ounce) can full-fat coconut milk, shaken",
    "¼cup (lightly packed) brown sugar",
    "½cup unsweetened finely shredded coconut",
    "Cooked rice, for serving",
    "Chopped fresh cilantro or scallions, for garnish"
  ],
  "directions": [
    "In a blender or food processor, combine the shallots, ginger, lemongrass, kaffir lime leaves, garlic, red pepper flakes, turmeric, coriander, cinnamon, 2 teaspoons salt, and ¼ cup water. Process until smooth, adding a little more water if necessary to keep the stuff moving in the machine.",
    "In a large heavy-bottomed pot or Dutch oven with a tight-fitting lid, heat the oil over medium-high heat. Season the meat generously with salt and pepper. Brown the meat (DFWI) until a crust forms, 4 minutes per side, then remove it to a plate. (Do this in batches if necessary to not crowd the pan, and in between batches, splash in some water, scrape up the browned bits, and add those juices to the seared meat on the plate.)",
    "Add the blended spice mixture to the pot and cook, stirring, until the mixture darkens and is very fragrant, 2 to 3 minutes. Add the coconut milk and brown sugar and stir until the sugar is dissolved. Return the meat to the pot. Bring it to a low boil, reduce the heat to a gentle simmer, cover, and cook for 2 hours. (Check in on the pot every once in a while to make sure it’s not totally dry; if it is, splash some water in there.)",
    "Stir in the shredded coconut, cover, and cook until the meat is really soft and falling apart, another 1 hour. Uncover, increase the heat to medium-high, and cook, stirring, until any liquid is reduced and the meat is coated in a thick paste (it’s not really super saucy). Serve with rice and garnish with cilantro or scallions."
  ]
}