{
  "title": "Coconut Shrimp with Crushed Chickpeas & Basil",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1(2-inch) piece fresh ginger",
    "5garlic cloves",
    "1cup packed basil leaves",
    "2limes",
    "SEAFOOD",
    "1½pounds (size U10 or U15) shrimp, peeled, tails left on, and deveined",
    "PANTRY",
    "¼cup sambal oelek",
    "1tablespoon honey",
    "Kosher salt",
    "1(14-ounce) can full-fat coconut milk",
    "¼cup unsweetened shredded coconut",
    "2(14.5-ounce) cans chickpeas",
    "2tablespoons vegetable oil"
  ],
  "directions": [
    "Marinate the shrimp- Finely grate 1 (2-inch) piece of ginger (no need to peel it!) and 5 garlic cloves into a medium bowl.- Whisk in 1/4 cup sambal oelek, 1 tablespoon honey, 2 teaspoons salt, and 1 (14-ounce) can coconut milk.- Add 1 1/2 pounds shrimp to the marinade, turning to coat. Let sit at room temp for at least 15 minutes or, covered, in the fridge for up to 1 hour.",
    "Toast the coconut- Heat a large nonstick skillet over medium.- Add 1/4 cup unsweetened shredded coconut and toast, stirring often, until golden brown all over, 3 to 4 minutes.- Transfer to a small bowl to cool. Wipe out and reserve the skillet.",
    "Cook the shrimp- Drain and rinse 2 (14.5-ounce) cans of chickpeas in a fine-mesh strainer.- Line a plate or rimmed baking sheet with a few layers of paper towels.- Using tongs, remove the shrimp from the marinade, shaking off any excess, and transfer to the paper-towel-lined plate. Reserve the bowl of marinade.- Heat 1 tablespoon vegetable oil in the reserved skillet over medium-high heat until just beginning to show wisps of smoke.- Add half of the shrimp in a single layer and cook, undisturbed, until browned on one side, about 3 minutes.- Flip and cook 30 seconds longer. Transfer to a serving bowl and repeat with the remaining shrimp and 1 tablespoon vegetable oil.",
    "Finish the sauce- Add the drained chickpeas and reserved marinade to the skillet.- Cook, smashing some of the chickpeas into the sauce with a wooden spoon to release their starch, until the sauce thickens slightly and deepens in color, 4 to 5 minutes.- Turn off the heat and stir in 1 cup basil leaves.- Cut 1 lime in half, squeeze the juice into the chickpeas, and stir to combine.- Taste the sauce and add more salt if needed.",
    "Serve- Cut 1 lime into wedges.- Top the shrimp with the chickpea sauce and toasted shredded coconut.- Serve with the lime wedges."
  ]
}