{
  "title": "Cod En Papillote With Leeks And Carrots",
  "source": "Modern Bistro - ATK",
  "servings": "4",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "4tablespoons unsalted butter, softened",
    "1teaspoon minced fresh thyme",
    "2garlic cloves, minced, divided",
    "1¼teaspoons grated lemon zest, divided, plus lemon wedges for serving",
    "1teaspoon table salt, divided",
    "½teaspoon pepper, divided",
    "2tablespoons minced fresh parsley",
    "2carrots, peeled and cut into matchsticks",
    "1pound leeks, white and light green parts only, halved lengthwise, washed thoroughly, and cut into matchsticks",
    "¼cup dry white wine",
    "4(6- to 8-ounce) skinless cod fillets, 1 inch thick"
  ],
  "directions": [
    "1. Adjust oven rack to lower-middle position and heat oven to 450 degrees. Mash butter, thyme, half of garlic, ¼ teaspoon lemon zest, ¼ teaspoon salt, and ⅛ teaspoon pepper in bowl. Combine parsley, remaining garlic, and remaining 1 teaspoon lemon zest in second bowl. Combine carrots, leeks, ¼ teaspoon salt, and ⅛ teaspoon pepper in third bowl.",
    "2. Lay four 16 by 12-inch rectangles of aluminum foil on counter with short sides parallel to counter edge. Divide vegetable mixture evenly among foil rectangles, arranging in center of lower half of each sheet of foil. Mound vegetables slightly and sprinkle with wine. Pat cod dry with paper towels, sprinkle with remaining ½ teaspoon salt and remaining ¼ teaspoon pepper, and place on top of vegetables. Spread butter mixture over fillets. Fold top half of foil over fish, then tightly crimp edges into rough 9 by 6-inch packets.",
    "3. Place packets on rimmed baking sheet (they may overlap slightly) and bake until cod registers 135 degrees, about 15 minutes. Carefully open packets, allowing steam to escape away from you. Using thin metal spatula, gently slide cod and vegetables, and any accumulated juices, onto individual plates. Sprinkle with parsley mixture and serve with lemon wedges."
  ]
}