{
  "title": "Coffee Coffee Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 15 to 20",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "Coffee Ribbon",
    "3tablespoons packed light brown sugar",
    "2teaspoons ground cinnamon",
    "1tablespoon instant coffee granules",
    "Coffee Crumb Topping",
    "1¼cups all-purpose flour (5.6 oz / 160g)",
    "½cup packed light brown sugar (3.5 oz / 100g)",
    "2teaspoons instant coffee granules",
    "¾teaspoon ground cardamom",
    "¼teaspoon Diamond Crystal kosher salt",
    "1stick unsalted butter (4 oz / 113g), cut into pieces, at room temperature",
    "Cake",
    "3½cups all-purpose flour (16 oz / 455g)",
    "2½teaspoons baking powder (0.35 oz / 10g)",
    "1½teaspoons Diamond Crystal kosher salt (0.16 oz / 6g)",
    "½teaspoon baking soda",
    "⅔cup sour cream (6 oz / 170g)",
    "½cup strong brewed coffee (4 oz / 113g)",
    "1tablespoon instant coffee granules",
    "2teaspoons vanilla extract",
    "12tablespoons unsalted butter (6 oz / 170g), at room temperature",
    "¼cup neutral oil, such as vegetable or grapeseed (2 oz / 57g)",
    "1cup granulated sugar (7 oz / 200g)",
    "¾cup packed light brown sugar (5.3 oz / 150g)",
    "4large eggs (7 oz / 200g), at room temperature"
  ],
  "directions": [
    "Preheat the oven and prepare the pan: Generously butter the bottom and sides of a 13 × 9-inch pan and set aside. Arrange an oven rack in the center position and preheat the oven to 350°F.",
    "Make the coffee ribbon: In a small bowl, toss together the brown sugar, cinnamon, and instant coffee. Set the coffee ribbon mixture aside.",
    "Make the coffee crumb topping: In a medium bowl, toss together the flour, brown sugar, coffee granules, cardamom, and salt. Add the butter and toss to coat, then use your fingertips to smash the butter into the dry ingredients until no visible bits of butter remain and the mixture is crumbly but holds together when squeezed. Set the crumb topping aside.",
    "Combine the dry ingredients: In a medium bowl, whisk together the flour, baking powder, salt, and baking soda to combine and set aside.",
    "Combine the wet ingredients: In a separate medium bowl, whisk together the sour cream, brewed coffee, instant coffee granules, and vanilla until smooth and set aside.",
    "Cream the butter, oil, and sugars: In a stand mixer fitted with the paddle attachment, beat the butter, oil, granulated sugar, and brown sugar on low just until smooth, then increase the speed to medium-high and beat, scraping down the sides of the bowl once or twice, until the mixture is very light and fluffy, about 5 minutes.",
    "Add the eggs: Reduce the mixer speed to medium and add the eggs one at a time, beating well after each addition. Stop the mixer and scrape down the sides.",
    "Alternate the dry and wet ingredients: Add about one-third of the flour mixture and mix on low speed until the flour has almost disappeared. Add half of the sour cream mixture, beating just until incorporated, then add the remaining flour in 2 additions, alternating with the remaining sour cream mixture. When the last traces of flour disappear, stop the mixer and remove the bowl. Use a flexible spatula to scrape down the sides and fold the batter several times to make sure it’s evenly mixed.",
    "Assemble the cake: Scrape half of the batter into the prepared pan and smooth it into an even layer, working it into the corners. Sprinkle the coffee ribbon mixture all across the batter, trying to cover every bit of surface area. Dollop the remaining batter all over, then smooth it into an even layer. Scatter the crumb topping over the batter, covering the entire surface.",
    "Bake: Bake the cake until the top is puffed and golden brown and a cake tester or toothpick inserted into the center comes out clean, 40 to 45 minutes (be careful not to overbake it; the cake will still wobble in the center when a tester comes out clean). Remove the cake from the oven and let it cool completely on a wire rack. Cut into squares and serve."
  ]
}