{
  "title": "Cold Crab Dip with Buttery Poppy Seed Saltines",
  "source": "By Heart - Hailee Catalano",
  "servings": "Makes about 3 cups (750 g) dip and 48 crackers",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Dip",
    "⅔cup (140 g) labne or sour cream",
    "1⁄3 cup (70 g) Kewpie mayonnaise, or any mayo you have on hand",
    "2tablespoons whole-grain mustard",
    "1large shallot, minced",
    "1⁄4 cup (10 g) chopped fresh dill",
    "1⁄4 cup (10 g) chopped fresh parsley",
    "Zest and juice of 1 lemon",
    "1pound (454 g) lump crab, drained and picked through for shells (I prefer jumbo lump)",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Saltines",
    "48saltine crackers (about 11⁄4 sleeves)",
    "1⁄2 cup (1 stick/113 g) unsalted butter, melted",
    "11⁄2 teaspoons poppy seeds",
    "Freshly cracked black pepper, to taste",
    "For Serving",
    "1large celery stalk, thinly sliced on a heavy bias",
    "2teaspoons chopped jarred Calabrian chiles in oil, or to taste",
    "Celery leaves, for garnish"
  ],
  "directions": [
    "1. Preheat the oven to 400°F (200°C) with a rack positioned in the center. Line a sheet tray with parchment paper.2. Make the dip: Add the labne, mayonnaise, mustard, shallot, dill, parsley, lemon zest, and lemon juice to a medium bowl, and stir to combine.3. Gently fold in the crab without breaking up the meat too much. Season with a touch of salt (be careful because the crab has natural salinity) and a good amount of pepper. Place in the refrigerator to chill while you prepare the saltines.4. Make the saltines: Spread out the saltines evenly on the sheet tray. Brush the melted butter over the saltines, generously coating the top of each cracker. Sprinkle with the poppy seeds and pepper.5. Bake for 10 to 12 minutes, until golden and crispy. Let cool completely, about 15 minutes.6. Mix the celery and chiles in a small bowl.7. Serve the cold dip topped with the spicy celery and celery leaves, with the saltines on the side for dipping."
  ]
}