{
  "title": "Collards And Grits With Salsa Macha",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Serves 4",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "Grits",
    "1½cups whole milk",
    "1½teaspoons kosher salt (Diamond Crystal or about half as much Morton), or more if you like",
    "¾cup good stone-ground grits",
    "Heaping ⅓ cup Philadelphia cream cheese, room-temp so it’s nice and soft",
    "¼cup sour cream",
    "3tablespoons unsalted butter",
    "2teaspoons Tabasco jalapeño sauce, plus more for the freaks",
    "¾teaspoon freshly ground black pepper",
    "For the Dish",
    "3cups Scotty’s Good-with-Everything Collard Greens (this page), hot",
    "Peanut Butter Salsa Macha (this page) for serving",
    "¾cup salted roasted peanuts, roughly chopped",
    "¾cup packed roughly chopped cilantro",
    "4lime wedges"
  ],
  "directions": [
    "To make the grits: Combine the milk, salt, and 1½ cups water in a medium pot and bring to a boil over medium-high heat. Whisk the mixture with one hand and pour in the grits with the other; whisk constantly until it returns to a simmer, about 2 minutes. Turn down the heat to low so the grits simmer gently and cook, stirring occasionally, until they’re tender, about 45 minutes. Don’t worry if they look a little dry and sad. They won’t in a minute.",
    "Add the cream cheese, sour cream, butter, Tabasco, and pepper and whisk well to melt the butter and totally mix in the cream cheese. Add more salt and Tabasco until you’re happy. Turn off the heat and cover to keep them warm, if necessary.",
    "To assemble the dish: Spoon the grits into four bowls, then top with the collard greens (plus a little pot likker, if there is any hanging around). Spoon on some salsa macha, spreading it around to distribute the spiciness, then pile on the peanuts and sprinkle on the cilantro. Serve with the lime wedges."
  ]
}