{
  "title": "Confetti Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 16",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "5½cups cake flour (23.3 oz / 660g)",
    "2⅓cups sugar (16.4 oz / 466g)",
    "4½teaspoons baking powder (0.63 oz / 18g)",
    "1½teaspoons Diamond Crystal kosher salt (0.16 oz / 5g)",
    "¾teaspoon baking soda",
    "3sticks unsalted butter (12 oz / 340g), at room temperature",
    "1½cups buttermilk (12.7 oz / 360g)",
    "⅓cup neutral oil, such as vegetable or grapeseed (2.6 oz / 75g)",
    "3large eggs (5.3 oz / 150g), at room temperature",
    "6large egg whites (7.4 oz / 210g), at room temperature",
    "1tablespoon vanilla extract",
    "½teaspoon almond extract (optional)",
    "½cup store-bought rainbow sprinkles (3.3 oz / 93g), plus more for decorating",
    "Classic Cream Cheese Frosting (this page)"
  ],
  "directions": [
    "Preheat the oven and prepare the pans: Butter the bottom and sides of the cake pans. Line the bottoms with rounds of parchment paper, smoothing to eliminate air bubbles, and set aside. Arrange two oven racks in the lower and upper thirds of the oven and preheat to 350°F.",
    "Mix the dry ingredients: In a stand mixer bowl with at least a 5-quart capacity, combine the flour, sugar, baking powder, salt, and baking soda. Mix on the lowest speed with the paddle attachment just to combine (beware of flying flour).",
    "Mix in the fat and some of the liquid: Add the butter, buttermilk, and oil and beat on low just until the flour is moistened. Gradually increase the speed to medium-high and beat, scraping down the sides of the bowl once or twice, until the mixture is completely smooth, about 1 minute.",
    "Whisk the egg mixture and add the remaining ingredients: In a medium bowl, thoroughly whisk the whole eggs, egg whites, vanilla, and almond extract (if using) until no streaks remain. With the mixer on medium-low, add the egg mixture to the flour mixture in 2 additions, beating well after each addition. Increase the speed to medium and continue to beat until the batter is very light and thick, about 2 minutes.",
    "Fold in the sprinkles: Remove the bowl from the stand mixer and add the sprinkles; fold them into the batter with a large flexible spatula to distribute evenly. Try not to mix too much or the color of the sprinkles will start to bleed.",
    "Fill the pans and bake: Scrape the batter into the prepared pans, dividing evenly (for uniform layers, use a scale and weigh out 1 lb 12 oz / 785g batter per pan). Smooth the batter in an even layer all the way to the sides. Transfer the pans to the oven, placing two on the upper rack and one on the lower rack, staggering so the pan below doesn’t have another pan directly above it. Bake until the tops are golden brown, the centers spring back when pressed, and a cake tester or toothpick inserted into the centers comes out clean, 35 to 40 minutes, switching racks and rotating the pans front to back after 30 minutes.",
    "Cool the cakes and level the layers: Remove the cakes from the oven and let them cool completely in the pans, then use a small offset spatula or paring knife to cut around the sides. Invert onto a wire rack, remove the parchment paper, then reinvert the layers onto a cardboard cake round or cutting board. Use a long serrated knife and long, even strokes to slice off the domed tops of the cakes, keeping the blade parallel to the work surface. (Snack on the cake scraps.) This creates level layers for easier stacking and assembly.",
    "Stack and frost the cake: Place the first cake layer, cut-side down, on a cake round, serving plate, or cake stand and slide several strips of parchment partially underneath and all around the cake to cover and protect the plate or stand during frosting. Using a small offset spatula, spread 1 cup of frosting over the cake in an even layer all the way to the edges, then top with another cake layer, cut-side down, and cover with another 1 cup frosting. Place the third layer on top, cut-side down, and cover the top and sides of the entire layer cake with another 1½ cups frosting in a very thin, even layer. This is the “crumb coat,” which is just a base layer of frosting, so don’t worry if the cake shows through in several places. Refrigerate the cake until the frosting has hardened, 10 to 15 minutes, then cover all the surfaces with the remaining frosting. Decorate the outside of the cake with more sprinkles.",
    "Serve: Slide the parchment strips out from underneath the cake and let it come to room temperature before slicing."
  ]
}