{
  "title": "Cool Ranch Taco Salad",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "6 as a main course or 8 to 10 as an appetizer",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "For the Dressing",
    "⅔cup vegetable oil",
    "¼cup ketchup",
    "¼cup distilled white vinegar",
    "1tablespoon sugar",
    "½teaspoon kosher salt",
    "½teaspoon cayenne pepper",
    "For the Beef Mixture",
    "2large ears corn, husked, or 1½ cups frozen corn kernels, thawed and patted dry",
    "1tablespoon canola oil",
    "1pound ground beef",
    "1tablespoon paprika",
    "2teaspoons ground cumin",
    "2teaspoons garlic powder",
    "2teaspoons dried oregano",
    "1teaspoon cayenne pepper",
    "1½teaspoons kosher salt",
    "1teaspoon freshly ground black pepper",
    "1(15-ounce) can black beans, drained and rinsed",
    "½cup chopped fresh cilantro",
    "For the Salad",
    "1large head iceberg lettuce, shredded",
    "2beefsteak tomatoes, cut into chunks",
    "1large avocado, cut into chunks",
    "¼cup sliced black olives (optional)",
    "2cups Cool Ranch Doritos (or other tortilla chips if that’s what you’ve got)",
    "¼cup chopped red onion",
    "½cup sour cream"
  ],
  "directions": [
    "MAKE THE DRESSING: In a screw-top jar, shake to mix the oil, ketchup, vinegar, sugar, salt, and cayenne.",
    "MAKE THE BEEF MIXTURE: Heat a large dry skillet over high heat until really hot. Put the whole ears of corn in the pan and DFWI (Don’t F*ck With It!!) until the underside is charred, about 3 minutes. Keep cooking, turning two more times, until the corn is charred in spots all over, 8 to 9 minutes. Remove to a plate. (If using thawed frozen kernels, char them in the dry skillet in a single layer, only stirring once or twice, until slightly blackened, about 6 minutes.)",
    "Let the pan cool a bit. Add the oil and heat over medium-high heat until shimmering-hot. Add the meat, breaking it up, until cooked through, 5 to 6 minutes.",
    "Drain most of the liquid from the pan but leave enough to keep the meat juicy. In a small bowl, combine the paprika, cumin, garlic powder, oregano, cayenne, salt, and black pepper. Add the spice mixture to the meat along with the black beans and ½ cup water. Cook, stirring gently, 5 minutes. Remove from the heat, let cool slightly, and stir in the cilantro.",
    "MAKE THE SALAD: Arrange the lettuce in a big salad bowl and top with the beef-bean mixture. Cut the corn from the cobs and add it to the salad with the tomatoes, avocado, and olives (if using). Pour the dressing over the salad and crumble the chips all over the top. Sprinkle with the onion and top with the sour cream."
  ]
}