{
  "title": "Coq au Riesling",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "1(4- to 5-pound) whole chicken, cut into 8 pieces (4 breast pieces halved crosswise, 2 drumsticks, 2 thighs), giblets discarded, wings and back reserved",
    "1½teaspoons table salt, divided",
    "½teaspoon pepper",
    "2slices bacon, chopped",
    "3shallots, chopped",
    "2carrots, peeled and chopped coarse",
    "2celery ribs, chopped coarse",
    "4garlic cloves, lightly crushed and peeled",
    "3tablespoons all-purpose flour",
    "2½cups dry Riesling",
    "1cup water",
    "2bay leaves",
    "6sprigs fresh parsley, plus 2 teaspoons minced",
    "6sprigs fresh thyme",
    "1pound white mushrooms, trimmed and halved if small or quartered if large",
    "¼cup crème fraîche"
  ],
  "directions": [
    "1. Remove skin from chicken breast pieces, drumsticks, and thighs and set aside. Sprinkle chicken pieces with 1¼ teaspoons salt and pepper; set aside. Cook bacon in large Dutch oven over medium-low heat, stirring occasionally, until beginning to render fat, 2 to 4 minutes. Add chicken skin, back, and wings to pot; increase heat to medium; and cook, stirring frequently, until bacon is browned, skin is rendered, and chicken back and wings are browned on all sides, 10 to 12 minutes. Remove pot from heat; carefully transfer 2 tablespoons fat to small bowl and set aside.",
    "2. Return pot to medium heat. Add shallots, carrots, celery, and garlic and cook, stirring occasionally, until vegetables are softened, 4 to 6 minutes. Add flour and cook, stirring constantly, until no dry flour remains, about 30 seconds. Slowly add wine, scraping up any browned bits. Increase heat to high and simmer until mixture is slightly thickened, about 2 minutes. Stir in water, bay leaves, parsley sprigs, and thyme springs and bring to simmer. Place chicken pieces in even layer in pot, reduce heat to low, cover, and cook until breasts register 160 degrees and thighs/drumsticks register 175 degrees, 25 to 30 minutes, stirring halfway through cooking. Transfer chicken pieces to plate as they come up to temperature.",
    "3. Discard back and wings. Strain cooking liquid through fine-mesh strainer set over large bowl, pressing on solids to extract as much liquid as possible; discard solids. Let cooking liquid settle for 10 minutes. Using wide shallow spoon, skim fat from surface and discard.",
    "4. While liquid settles, return pot to medium heat and add reserved fat, mushrooms, and remaining ¼ teaspoon salt; cook, stirring occasionally, until lightly browned, 8 to 10 minutes.",
    "5. Return liquid to pot and bring to boil. Simmer briskly, stirring occasionally, until sauce is thickened to consistency of heavy cream, 4 to 6 minutes. Reduce heat to medium-low and stir in crème fraîche and minced parsley. Return chicken to pot along with any accumulated juices, cover, and cook until just heated through, 5 to 8 minutes. Season with salt and pepper to taste, and serve."
  ]
}