{
  "title": "Coq au Vin",
  "source": "Modern Bistro - ATK",
  "servings": "4",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "6ounces thick-cut bacon (about 5 slices), chopped",
    "Vegetable oil, as needed",
    "4pounds bone-in, skin-on chicken pieces (split breasts cut in half, drumsticks, and/or thighs)",
    "¾teaspoon table salt",
    "½teaspoon pepper",
    "8ounces (about 2 cups) frozen pearl onions",
    "10ounces white mushrooms, trimmed and quartered",
    "2garlic cloves, minced",
    "1tablespoon tomato paste",
    "3tablespoons all-purpose flour",
    "1(750-ml) bottle medium-bodied red wine",
    "2½cups chicken broth",
    "1teaspoon minced fresh thyme or ¼ teaspoon dried",
    "2bay leaves",
    "2tablespoons unsalted butter, cut into 2 pieces, chilled",
    "2tablespoons minced fresh parsley"
  ],
  "directions": [
    "1  Cook bacon in Dutch oven over medium heat until crispy, 5 to 7 minutes. Using slotted spoon, transfer bacon to paper towel–lined plate; set aside. If necessary, add vegetable oil to fat in pot to equal 2 tablespoons.",
    "2  Pat chicken dry with paper towels and sprinkle with salt and pepper. Heat pot with fat on medium-high heat until shimmering. Brown half of chicken, 5 to 8 minutes per side, reducing heat if pan begins to scorch. Transfer chicken to large plate, leaving fat in pot. Return pot to medium-high heat and repeat with remaining chicken; transfer chicken to plate.",
    "3  Pour off all but 1 tablespoon of fat in the pot (or add vegetable oil if needed to make this amount). Add onions and mushrooms and cook over medium heat, stirring occasionally, until lightly browned, about 10 minutes. Stir in garlic and tomato paste and cook until fragrant, about 30 seconds. Stir in flour and cook for 1 minute. Stir in wine, broth, thyme, and bay leaves, scraping up any browned bits.",
    "4  Nestle chicken, along with any accumulated juices, into pot and bring to simmer. Cover, turn heat to medium-low, and simmer until chicken is tender and breasts register 160 degrees, about 20 minutes, and/or thighs and drumsticks register 175 degrees, about 1 hour. (If using both types of chicken, simmer thighs and drumsticks for 40 minutes before adding breasts.)",
    "5  Transfer chicken to serving dish and tent with aluminum foil. Using wide spoon, skim as much fat as possible from surface of sauce and return to simmer until sauce is thickened and measures about 2 cups, about 20 minutes. Off heat, remove bay leaves, whisk in butter, and season with salt and pepper to taste. Pour sauce over chicken, sprinkle with parsley and reserved bacon, and serve."
  ]
}