{
  "title": "Coq au Vin",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "6ounces thick-cut bacon (about 5 slices), chopped",
    "4pounds bone-in, skin-on chicken pieces (split breasts halved crosswise, drumsticks, and/or thighs), trimmed",
    "Vegetable oil, as needed",
    "¾teaspoon table salt",
    "½teaspoon pepper",
    "2cups frozen pearl onions",
    "10ounces white mushrooms, trimmed and quartered",
    "1tablespoon tomato paste",
    "2garlic cloves, minced",
    "3tablespoons all-purpose flour",
    "1(750-ml) bottle red wine",
    "2½cups chicken broth",
    "1teaspoon minced fresh thyme or ¼ teaspoon dried",
    "2bay leaves",
    "2tablespoons unsalted butter, cut into 2 pieces and chilled",
    "2tablespoons minced fresh parsley"
  ],
  "directions": [
    "1. Cook bacon in Dutch oven over medium heat until crispy, 5 to 7 minutes. Using slotted spoon, transfer bacon to paper towel–lined plate; set aside.",
    "2. Pat chicken dry with paper towels and sprinkle with salt and pepper. If necessary, add vegetable oil to fat left in pot to equal about 2 tablespoons. Heat over medium-high heat until shimmering. Cook half of chicken skin side down until browned, 5 to 8 minutes. Flip chicken and brown on second side, about 5 minutes; transfer chicken to plate. Repeat with remaining chicken; transfer chicken to plate.",
    "3. Pour off all but 1 tablespoon of fat in pot (or add vegetable oil if needed to make this amount). Add onions and mushrooms and cook over medium heat, stirring occasionally, until lightly browned, about 10 minutes. Stir in tomato paste and garlic and cook until fragrant, about 30 seconds. Stir in flour and cook for 1 minute. Stir in wine, broth, thyme, and bay leaves, scraping up any browned bits.",
    "4. Nestle chicken, along with any accumulated juices, into pot and bring to simmer. Cover, turn heat to medium-low, and simmer until breasts register 160 degrees, about 20 minutes, and thighs/drumsticks register 175 degrees, about 1 hour. (If using both types of chicken, simmer thighs and drumsticks for 40 minutes before adding breasts.)",
    "5. Transfer chicken to serving dish and tent with foil. Skim as much fat as possible from surface of sauce and return to simmer until thickened and measures about 2 cups, about 20 minutes. Off heat, discard bay leaves, whisk in butter, and season with salt and pepper to taste. Pour sauce over chicken, sprinkle with reserved bacon and parsley, and serve."
  ]
}