{
  "title": "Corn-Filled Cappelletti With Black Pepper And Pecorino",
  "source": "Pasta - Missy Robbins",
  "servings": "6 to 8 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Filling",
    "3 or 4ears corn, kernels cut off cobs to make 500g / 3¾ cups",
    "474g / 2 cups milk",
    "44g / 3 Tbsp ricotta (see “whipped” ricotta, this page)",
    "Salt, q.b.",
    "To Finish",
    "1batch egg dough (this page)",
    "28g / 2 Tbsp olive oil",
    "5g / 1 clove garlic, thinly sliced",
    "75g / 5 Tbsp unsalted butter, cold and cubed",
    "30g / ⅓ cup finely grated pecorino romano",
    "Black pepper, q.b."
  ],
  "directions": [
    "1. To make the filling, place the corn and milk in a heavy saucepan over low heat. Gently heat the milk mixture and cook, stirring occasionally so the milk does not scorch, until the corn is tender enough to be pureed, 20 to 30 minutes.",
    "2. Using a slotted spoon, transfer the corn to a high-speed blender. Reserve the milk.",
    "3. Blend the corn into a smooth, thick paste, adding 1 Tbsp of the reserved milk at a time if necessary to achieve a good consistency.",
    "4. Prepare an ice-water bath and set a bowl in it. Transfer the corn mixture to the bowl to cool, 5 to 10 minutes.",
    "5. Put the ricotta into a food processor and pulse just until it is as smooth as cake frosting and has a sheen, being careful not to process it longer or it will break.",
    "6. When the corn mixture is cool, remove the bowl from the ice-water bath and fold the ricotta into the mixture. Season with salt q.b. It should taste well seasoned. Refrigerate until firm, 1 to 2 hours.",
    "7. To finish, following the instructions for cappelletti on this page, make 90 to 100 pieces with the pasta dough and filling.",
    "8. Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "9. Add the cappelletti to the water and turn down the heat to bring the water to a gentle simmer instead of a rolling boil. The filling is very delicate and will break if cooked over high heat. Cook for 2 to 4 minutes, until tender at the thickest closure point.",
    "10. While the pasta is cooking, place a large sauté pan over low heat and add the olive oil. Add the garlic and cook until aromatic but without color, 10 to 15 seconds. Add the butter and 3 ladles (170g / ¾ cup) pasta cooking water. Swirl the contents of the pan to emulsify.",
    "11. Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Swirl the pasta in the sauce for 30 to 45 seconds to marry, using a spoon to gently turn the pasta over and coat all sides. If the sauce begins to tighten, add more pasta cooking water to loosen, and continue swirling the pasta in the pan.",
    "12. Transfer the pasta to a large serving platter or divide onto plates. Spoon the remaining sauce from the pan over the top and garnish with the pecorino and with pepper q.b."
  ]
}