{
  "title": "Corzetti with Sungold Tomatoes, Pecorino, and Herbs",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "500g / 1 lb 1½ oz Sungold tomatoes (from about 2 pint-size baskets)",
    "56g / ¼ cup olive oil",
    "40g / 8 cloves garlic, finely chopped",
    "Salt, q.b.",
    "1batch egg dough (this page)",
    "30g / 2 Tbsp unsalted butter, cold and cubed",
    "22g / ¼ cup finely grated pecorino romano",
    "5g / ¼ cup tender chervil leaves",
    "5g / ¼ cup small to medium basil leaves",
    "5g / ¼ cup marjoram leaves"
  ],
  "directions": [
    "1   To make the tomatoes, bring a large pot of water to a boil over high heat. Prepare an ice-water bath and set a colander in it.",
    "2   Using a sharp paring knife, cut a small X in the bottom of each tomato. Drop the tomatoes into the boiling water and leave for 5 to 10 seconds to loosen their skins. Using a slotted spoon, transfer the tomatoes to the ice-water bath. After 30 seconds, transfer the tomatoes to a bowl. Working over another bowl to capture any juices, peel the tomatoes and discard the skins.",
    "3   Add the olive oil and garlic to the bowl with the tomato juices. Then add the peeled tomatoes and salt and stir to mix. Set aside.",
    "4   To finish, following the instructions for corzetti on this page, make 80 pieces with the pasta dough.",
    "5   Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "6   Add the corzetti to the water and cook for 1 to 2 minutes, until tender but not soft.",
    "7   While the pasta is cooking, place a large sauté pan over low heat. Add the contents of the bowl holding the tomatoes and cook for 1 to 2 minutes, lightly mashing the tomatoes with the back of a spoon to release their juices.",
    "8   Add the butter and 1 ladle (55g / ¼ cup) pasta cooking water. Swirl the contents of the pan to emulsify.",
    "9   Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Swirl the pasta in the sauce for 1 to 2 minutes to marry, using a spoon to gently turn the pasta over and coat all sides. If the sauce begins to tighten, add more pasta cooking water to loosen and continue swirling to marry. When the pasta is properly married, it will cling to the sauce and have a glossy sheen.",
    "10   Divide the pasta among plates in a single layer. Spoon the sauce remaining in the pan over each plate. Garnish with the pecorino, chervil, basil, and marjoram."
  ]
}