{
  "title": "Crab Cake Muffs",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes 4",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "Crab Cakes",
    "1egg",
    "¼cup mayo (Duke’s or bust)",
    "1tablespoon Old Bay Seasoning",
    "1tablespoon chopped tarragon",
    "½teaspoon kosher salt (Diamond Crystal or about half as much Morton)",
    "10saltine crackers, crushed real small (like coarse bread crumbs)",
    "1pound fresh jumbo lump crabmeat, picked through for lingering hard stuff",
    "1tablespoon vegetable oil",
    "Muffs",
    "¼cup Big Zesty Buttermilk Dressing (this page)",
    "2tablespoons finely chopped tarragon",
    "2tablespoons unsalted butter, room-temp so it’s mayo-soft",
    "4English muffins, split",
    "1juicy lemon",
    "1cup shrettuce (see this page)",
    "Louisiana-style hot sauce for serving"
  ],
  "directions": [
    "To make the crab cakes: About an hour before you start to cook, whisk together the egg, mayo, Old Bay, tarragon, and salt in a small bowl. In a medium bowl, use your hands to gently toss together the crackers and crab. Fold in the mayo mixture with a delicate touch to keep those lovely crab lumps intact the best you can. Fridge it for at least an hour (so the saltines turn into food glue) or up to a day.",
    "Separate the crab mixture into four blobs, then lightly pack them into 1-inch-or-so-thick patties that are about as wide as the English muffins, and put them on a plate.",
    "Get a large heavy skillet hot over high heat, then add the oil and give it a swirl. When it smokes, add the patties with a little space between each one. Lower the heat to medium and cook until these babies are pancake brown on both sides and hot through, about 4 minutes per side. Move them to a plate. Scrape up any stuck, crispy bits of crab cake and eat them.",
    "To assemble the muffs: Mix the buttermilk dressing and tarragon in a little bowl and let it hang out.",
    "Put the skillet back over medium heat. Generously butter the cut sides of the English muffins, then cook them in batches, cut-side down, until they’re nice and toasty, 2 to 3 minutes. Set them aside.",
    "Squeeze the whole lemon all over the crab cakes, then make sandwiches on the English muffins with the crab cakes, tarragon sauce, and shrettuce. Eat with the hot sauce handy, in case anyone’s feeling spicy."
  ]
}