{
  "title": "Cranberry-Pomegranate Mousse Pie",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 9-inch pie plate, stand or hand mixer (optional)",
    "2wide strips orange zest, removed with a vegetable peeler",
    "1cinnamon stick or ¼ teaspoon ground cinnamon",
    "Pinch of kosher salt",
    "10ounces (283g) fresh cranberries (about 2½ cups), plus 20 or so for garnish ①",
    "1½cups granulated sugar (10.6 oz / 300g), plus more for garnish",
    "4tablespoons pomegranate molasses (3.5 oz / 100g) ②",
    "2cups heavy cream (16 oz / 453g), chilled",
    "1½teaspoons unflavored gelatin powder (0.17 oz / 5g)",
    "Graham Cracker Crust, Speculoos Variation (this page), fully baked in a 9-inch pie plate and cooled ③",
    "2tablespoons powdered sugar"
  ],
  "directions": [
    "Cook the cranberry compote: In a small saucepan, combine the orange zest, cinnamon, salt, cranberries, 1 cup of the granulated sugar (7 oz / 200g), 3 tablespoons of the pomegranate molasses (2.5 oz / 72g), and 1 cup water (8 oz / 227g). Bring the mixture to a boil and cook, stirring often with a heatproof spatula, until the cranberries have burst and the mixture is very thick and reduced to a jammy consistency, 10 to 15 minutes (it shouldn’t immediately cover the line left by the spatula as you scrape it across the bottom of the pot). Remove from the heat.",
    "Strain the mixture and stir in some cream: Set a fine-mesh sieve over a medium bowl and scrape the compote into the sieve. Set the saucepan aside to use again later. Use the spatula to force the mixture through the mesh into the bowl below, pressing on the solids (discard the solids). Whisk ⅓ cup of the heavy cream (2.7 oz / 76g) into the compote until the mixture is completely smooth. Cover with plastic wrap and refrigerate just until the cranberry mixture is cool, 25 to 30 minutes.",
    "Soften the gelatin: Rinse and dry the reserved saucepan. Pour 3 tablespoons cold water (1.5 oz / 43g) into the saucepan and sprinkle the gelatin over it (don’t stir). Set aside to allow the gelatin to soften, about 10 minutes.",
    "Whip some of the cream to firm peaks: Meanwhile, pour 1 cup of the heavy cream (8 oz / 227g) into a stand mixer fitted with the whisk attachment (or into a large bowl if using a hand mixer) and beat, starting on medium-low and increasing the speed to medium-high as the cream thickens, until you have firm peaks. You can also do this by hand with a whisk. Refrigerate the cream until it’s time to assemble the mousse.",
    "Melt the gelatin and whisk into the compote: Remove the cooled cranberry mixture from the refrigerator, uncover, and whisk to smooth it out. Place the saucepan with the gelatin over low heat and warm, swirling often, until the gelatin is melted into a clear liquid free of granules—you want to make sure it’s completely melted or the mousse won’t fully set. Whisk the gelatin into the cranberry mixture.",
    "Assemble the cranberry mousse and chill in the crust: Remove the whipped cream from the refrigerator and scrape half of it into the bowl with the cranberry mixture. Fold until just a few streaks remain. Fold in the remaining whipped cream until you have a light, uniform mixture, then scrape into the prepared crust. Smooth the top and refrigerate until the mousse is set, at least 4 hours. After the first hour in the refrigerator, cover the pie with plastic wrap to prevent a skin from forming.",
    "Make the sugared cranberries: While the pie is setting, in a small saucepan, combine the remaining ½ cup sugar (3.5 oz / 100g), 1 tablespoon pomegranate molasses (0.9 oz / 25g), and ⅓ cup water (2.7 oz / 76g). Bring to a very gentle simmer over low heat, stirring to dissolve the sugar, and add the 20 cranberries. Simmer very gently just until the cranberries are softened and a few have burst, about 3 minutes. With a slotted spoon, remove the cranberries from the saucepan and transfer to a wire rack (discard any that have collapsed or lost their shape). Let sit until the cranberries are slightly tacky to the touch, about 1 hour. Toss the cranberries in some granulated sugar to coat them and return to the wire rack to continue drying at room temperature until the pie is set.",
    "Whip the remaining cream and top the pie: Just before serving, remove the pie from the refrigerator and uncover. Whip the remaining ⅔ cup heavy cream as before until you have soft peaks. Beat in the powdered sugar and scrape the whipped cream on top of the pie. Spread over the filling, making swooshes and swirls, and dot with the sugared cranberries. Cut into wedges and serve."
  ]
}