{
  "title": "Creamy Cole Slaw",
  "source": "Unknown",
  "servings": "",
  "categories": [
    "Salads"
  ],
  "ingredients": [
    "1Head of Green Cabbage",
    "1Small Head of Red Cabbage",
    "2Large Carrots",
    "1 1/2Cup of Mayo",
    "3Tablespoons of White or Apple Cider Vinegar",
    "1 1/4Tablespoon of Dijon Mustard",
    "1/2Tablespoon Celery Seed",
    "2Tablespoon of Honey",
    "Salt and Pepper to Taste"
  ],
  "directions": [
    "To prepare the coleslaw dressing, add all the ingredients into a bowl and whisk to combine. You want it thick enough to hold to your finger. If you need to add some more mayo to thicken it back up. Set in the fridge to let the flavors come together.",
    "To cut the cabbage with a knife for coleslaw, first cut the cabbage in half and remove the core by cutting out the triangular core that holds the cabbage together.",
    "Once the core is removed, cut each of the pieces of cabbage in half. Then take the layers apart so they can lay flat. Then with your knife, cut as thin of strips as you can. Repeat with the red cabbage. They place the sliced cabbage in a colander over a large bowl and salt the cabbage, a few pinches should do and then mix it all up. The reason a lot of coleslaws are runny is they are made with raw cabbage, and as the coleslaw site, all the water inside the cabbage releases into the coleslaw cause it to become runny. This process gets the water out of the cabbage first, softening the cabbage, seasoning it, but still maintaining the crunch of the veggies. Let that drain.",
    "Grate the carrots in a box grater and then add to the cabbage. Place a heavy bowl on top of the veggies and let the salt pull out the moisture for about 30 minutes. You can go longer but 30 minutes is as long as I’m willing to wait for this.",
    "Then get a big bowl and then grab handfuls of the veggies at a time and squeeze the excess water out and get them as dry as you can and add them to the bowl. The dryer the veggies, the better the dressing with coat them. The wetter they are, the less it will coat the veggies. Once you have all the veggies dry and in the bowl, taste them and season them one more time if they are a little bland. Then add the dressing, a little at a time to make sure you don’t overdress the coleslaw. Then mix well with your hands. Check for seasoning again. Let it hang out now for like 10-15 minutes at least in the fridge to let the flavors really come together and the veggies to marinate in the dressing before serving. Enjoy.",
    ""
  ]
}