{
  "title": "Creamy Tomato Soup with Peppery Parmesan Crisps",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "4",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "3tablespoons olive oil",
    "1medium onion, cut into ½-inch dice",
    "4cloves garlic, chopped",
    "1(28-ounce) can whole peeled tomatoes in juice, roughly chopped (see Note)",
    "1cup low-sodium chicken broth or vegetable broth",
    "½teaspoon sugar, plus more to taste",
    "Kosher salt and freshly ground black pepper",
    "¼cup heavy cream, or more to taste",
    "Parmesan Crisps (recipe follows), for serving",
    "Parmesan Crisps",
    "¾cup finely grated Parmigiano-Reggiano cheese",
    "Freshly ground black pepper",
    ""
  ],
  "directions": [
    "In a large saucepan, heat the oil over medium heat. Add the onion and cook, stirring, until translucent and golden, about 10 minutes. Add the garlic and cook 1 additional minute.",
    "Add the tomatoes, their juice, the broth, sugar, 1 teaspoon salt, and ½ teaspoon pepper. Bring to a boil, reduce the heat to medium-low or low, and simmer gently until the liquid reduces slightly, about 15 minutes.",
    "Let the soup cool for a few minutes, then pour it into a blender or food processor and blend on high speed (make sure to leave a little vent so steam can escape from the blender) until smooth, 1 to 2 minutes. Add the cream and blend a few seconds more. Season to taste with more salt, pepper, and/or sugar.",
    "Divide among bowls and serve with the Parmesan crisps.",
    "Parmesan CrispsPreheat the oven to 375°F. Line a large baking sheet with parchment paper or a silicone baking mat.",
    "Measure out a heaping tablespoon of cheese at a time and pile it on the baking sheet, spreading it out a little until it’s about 3 inches in diameter—it doesn’t have to be a perfect round! Grind fresh pepper onto each pile and bake until lightly golden and crisped, 5 to 6 minutes. Remove from the oven and transfer the whole sheet of crisps to the counter to cool (they will continue to crisp as they cool)."
  ]
}