{
  "title": "Creamy Cauliflower Soup With Hawaij",
  "source": "Modern Bistro - ATK",
  "servings": "4 to 6",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "1head cauliflower (2 pounds)",
    "¼cup extra-virgin olive oil, divided, plus extra for serving",
    "1leek, white and light green parts only, halved lengthwise, sliced thin, and washed thoroughly",
    "1small onion, halved and sliced thin",
    "1½teaspoons table salt",
    "1tablespoon Hawaij",
    "4½cups water",
    "1recipe Green Zhoug, divided",
    "1teaspoon white wine vinegar"
  ],
  "directions": [
    "1  Pull off outer leaves of cauliflower and trim stem. Using paring knife, cut around core to remove; slice core thin and reserve. Cut heaping 1 cup of ½-inch florets from head of cauliflower; set aside. Cut remaining cauliflower crosswise into ½-inch-thick slices.",
    "2  Heat 3 tablespoons oil in large saucepan over medium-low heat until shimmering. Add leek, onion, and salt and cook, stirring often, until leek and onion are softened but not browned, about 7 minutes. Stir in hawaij and cook until fragrant, about 30 seconds. Stir in water, reserved sliced core, and half of sliced cauliflower. Increase heat to medium-high and bring to simmer. Reduce heat to medium-low and simmer gently for 15 minutes. Add remaining sliced cauliflower and simmer until cauliflower is tender and crumbles easily, 15 to 20 minutes.",
    "3  Meanwhile, heat remaining 1 tablespoon oil in 8-inch skillet over medium heat until shimmering. Add reserved florets and cook, stirring often, until golden brown, 6 to 8 minutes. Transfer to bowl, add ¼ cup zhoug, and toss until well coated. Working in batches, process soup in blender until smooth, about 45 seconds. Return pureed soup to clean pot and bring to brief simmer over medium heat. Off heat, stir in vinegar and season with salt to taste. Spoon browned florets and remaining zhoug over individual serving bowls. Serve."
  ]
}