{
  "title": "Crème Brûlée",
  "source": "Modern Bistro - ATK",
  "servings": "Serves: 6",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "1Vanilla Bean",
    "3Cups Heavy Cream, Divided",
    "½Cup (3½ Ounces) Granulated Sugar",
    "Pinch Table Salt",
    "9Large Egg Yolks",
    "9Teaspoons Turbinado Sugar or Demerara Sugar"
  ],
  "directions": [
    "1. Adjust oven rack to lower-middle position and heat oven to 300 degrees. Cut vanilla bean in half lengthwise. Using tip of paring knife or spoon, scrape out vanilla seeds. Combine vanilla bean pod and seeds, 2 cups cream, granulated sugar, and salt in medium saucepan. Bring mixture to boil over medium heat, stirring occasionally to dissolve sugar. Off heat, cover and let steep for 15 minutes.",
    "2. Stir remaining 1 cup cream into cream mixture. Whisk egg yolks in large bowl until uniform. Whisk about 1 cup cream mixture into yolks, then repeat with 1 cup more cream mixture. Whisk in remaining cream mixture until thoroughly combined. Strain mixture through fine-mesh strainer into 8-cup liquid measuring cup, discarding solids.",
    "3. Meanwhile, place dish towel in bottom of large baking dish or roasting pan. Set six 4- or 5-ounce ramekins (or shallow fluted dishes) on towel. Bring kettle of water to boil.",
    "4. Divide cream mixture evenly among ramekins. Set baking dish on oven rack. Taking care not to splash water into ramekins, pour enough boiling water into dish to reach two-thirds up sides of ramekins. Bake until centers of custards are just barely set and register 170 to 175 degrees, 25 to 35 minutes depending on ramekin type, checking temperature 5 minutes early.",
    "5. Transfer ramekins to wire rack and let custards cool completely, about 2 hours. Set ramekins on rimmed baking sheet, cover tightly with plastic wrap, and refrigerate until cold, about 4 hours.",
    "6. Uncover ramekins and gently blot tops dry with paper towels. Sprinkle each custard with 1 to 1½ teaspoons turbinado sugar (depending on ramekin type). Tilt and tap each ramekin to distribute sugar evenly, then dump out excess sugar and wipe rims of ramekins clean. Caramelize sugar with torch until deep golden brown, continually sweeping flame about 2 inches above ramekin. Serve."
  ]
}