{
  "title": "Crispy-Skinned Salmon with Harissa & Citrusy Fennel Salad",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "Produce",
    "- 1 grapefruit",
    "- 1 orange",
    "- 1 lemon",
    "- 2 medium fennel bulbs",
    "Seafood",
    "- 4 (6-ounce) salmon fillets",
    "Pantry",
    "- 2 tablespoons harissa paste, plus more",
    "- 1 1/2 teaspoons toasted sesame oil",
    "- 2 tablespoons extra-virgin olive oil",
    "- Kosher salt"
  ],
  "directions": [
    "Prep and assemble the salad- In a large bowl, whisk together 2 tablespoons harissa, 1 1/2 teaspoons sesame oil, 2 tablespoons olive oil, and 1/2 teaspoon salt until incorporated.- Use a knife to cut away the peel and any white pith from 1 grapefruit and 1 orange. Discard.- Remove the segments from between the membranes and tear them in half into irregular 1-inch pieces. Add them to the harissa vinaigrette.- Cut 1 lemon in half, squeeze the juice from one half into the bowl, and stir to combine. Cut the remaining half into wedges for serving.- Trim and discard the stalks and fronds of 2 medium fennel bulbs. Quarter the bulbs through the root end and slice them lengthwise as thinly as possible.- Add the sliced fennel to the bowl but don’t toss yet. Chill the salad until ready to serve.",
    "Cook the salmon- Pat the salmon fillets dry with paper towels.- Season all over with 2 teaspoons salt.- Place skin-side down in a large, dry nonstick skillet.- Set the skillet over medium heat. Cook undisturbed, pressing each fillet firmly so the skin contacts the pan evenly, until the skin is very crispy and releases easily, 10 to 12 minutes.- Flip the salmon and cook just 1 minute longer, until almost cooked through. The sides should appear mostly opaque with a small area of translucency in the middle.- Transfer to a plate, skin-side up to keep it crisp.",
    "Serve- Toss the fennel and citrus to coat in the dressing.- Taste and add more harissa if desired.- Pile the salad alongside the salmon, drizzle extra vinaigrette over the top, and serve with lemon wedges."
  ]
}