{
  "title": "Crispy Rice Salad with Spicy Tahini Dressing",
  "source": "Bonappetit.com",
  "servings": "Yield 4 servings",
  "categories": [],
  "ingredients": [
    "¼cup tahini (such as Seed and Mill)",
    "2Tbsp. fresh lime juice",
    "1Tbsp. chile crisp (such as Lao Gan Ma)",
    "1Tbsp. soy sauce",
    "1Tbsp. unseasoned rice vinegar",
    "2tsp. honey",
    "1tsp. toasted sesame oil",
    "Kosher salt",
    "½small head of purple cabbage (about 10 oz.), cored, thinly sliced",
    "1Tbsp. fresh lime juice",
    "Kosher salt",
    "6oz. frozen shelled edamame",
    "3cups chilled cooked sushi rice",
    "1Tbsp. soy sauce",
    "2Tbsp. vegetable oil",
    "1avocado, cut into ½\" pieces",
    "1Champagne or honey mango, cut into ½\" pieces",
    "3Persian cucumbers, halved lengthwise, sliced on a diagonal ¼\" thick",
    "1bunch red radishes (about 5 oz.), trimmed, cut into matchsticks",
    "3scallions, thinly sliced on a diagonal",
    "1cup (lightly packed) mint leaves"
  ],
  "directions": [
    "Whisk ¼ cup tahini, 2 Tbsp. fresh lime juice, 1 Tbsp. chile crisp, 1 Tbsp. soy sauce, 1 Tbsp. unseasoned rice vinegar, 2 tsp. honey, 1 tsp. toasted sesame oil, and ¼ cup room-temperature water in a small bowl until smooth; season with a large pinch of kosher salt. Set dressing aside.Do Ahead: Dressing can be made 2 days ahead. Cover and chill. Whisk just before using, adding a few spoonfuls of water to thin out if needed.",
    "Combine ½ small head of purple cabbage (about 10 oz.), cored, thinly sliced, 1 Tbsp. fresh lime juice, and a large pinch of kosher salt in a large bowl and massage leaves until cabbage begins to soften slightly, about 2 minutes.",
    "Cook 6 oz. frozen shelled edamame in a small pot of boiling salted water until thawed and warmed through, about 4 minutes; drain well and add to cabbage. Set aside.",
    "Using your hands, toss 3 cups chilled cooked sushi rice and 1 Tbsp. soy sauce in a medium bowl to coat. Heat 2 Tbsp. vegetable oil in a large nonstick skillet over medium-high. Add seasoned rice mixture and, using a spatula, press into an even layer. Cook undisturbed until golden and crisp underneath, 6–8 minutes. Turn disk of rice over and cook until light golden on other side, about 4 minutes. Remove pan from heat.",
    "Add 1 avocado, cut into ½\" pieces, 1 Champagne or honey mango, cut into ½\" pieces, 3 Persian cucumbers, halved lengthwise, sliced on a diagonal ¼\" thick, 1 bunch red radishes (about 5 oz.), trimmed, cut into matchsticks, 3 scallions, thinly sliced on a diagonal, and 1 cup (lightly packed) mint leaves to reserved cabbage mixture and gently toss to combine. Add rice and reserved dressing; toss well to combine, taking care to leave some larger pieces of rice. Taste and season with more salt if needed. Transfer salad to a platter to serve."
  ]
}