{
  "title": "Crispy Lentil And Herb Salad",
  "source": "Modern Bistro - ATK",
  "servings": "4 servings",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "1teaspoon table salt for brining",
    "½cup dried lentilles du Puy, picked over and rinsed",
    "⅓cup vegetable oil for frying",
    "½teaspoon ground cumin",
    "¼teaspoon plus pinch table salt, divided",
    "1cup plain Greek yogurt",
    "3tablespoons extra-virgin olive oil, divided",
    "1teaspoon grated lemon zest plus 1 teaspoon juice",
    "1garlic clove, minced",
    "½cup fresh parsley leaves",
    "½cup torn fresh dill",
    "½cup fresh cilantro leaves",
    "¼cup dried cherries, chopped",
    "Pomegranate molasses",
    "Pitas, warmed"
  ],
  "directions": [
    "1. Dissolve 1 teaspoon salt in 1 quart water in bowl. Add lentils and let sit at room temperature for at least 1 hour or up to 24 hours. Drain well and pat dry with paper towels.",
    "2. Heat vegetable oil in large saucepan over medium heat until shimmering. Add lentils and cook, stirring constantly, until crispy and golden in spots, 8 to 12 minutes (oil should bubble vigorously throughout; adjust heat as needed). Carefully drain lentils in fine-mesh strainer set over bowl, then transfer lentils to paper towel–lined plate. Discard oil. Sprinkle with cumin and ¼ teaspoon salt and toss to combine; set aside. (Cooled lentils can be stored in airtight container at room temperature for up to 24 hours.)",
    "3. Whisk yogurt, 2 tablespoons olive oil, lemon zest and juice, and garlic together in bowl and season with salt and pepper to taste. Spread yogurt mixture over serving platter.",
    "4. Toss parsley, dill, cilantro, remaining pinch salt, and remaining 1 tablespoon olive oil together in bowl, then gently stir in lentils and cherries and arrange on top of yogurt mixture, leaving 1-inch border.",
    "5. Drizzle with pomegranate molasses. Serve with pitas."
  ]
}