{
  "title": "Crispy Bacon and Hash Brown Quesadillas",
  "source": "Mesa Grill - Bobby Flay",
  "servings": "4",
  "categories": [
    "Mesa Grill - Bobby Flay"
  ],
  "ingredients": [
    "Hash Browns:",
    "- 2 large Idaho potatoes, scrubbed",
    "- ¼ cup canola oil",
    "- 2 large Spanish onions, halved and thinly sliced",
    "- Kosher salt and freshly ground black pepper",
    "- 1 poblano chile, roasted, peeled, seeded and finely diced",
    "- 1 tablespoon ancho chile powder",
    "Quesadillas:",
    "- 8 ounces thick-cut bacon, diced",
    "- 12 (6-inch) flour tortillas",
    "- 2½ cups grated Monterey Jack cheese (10 ounces)",
    "- 2 tablespoons canola oil",
    "- 2 teaspoons ancho chile powder",
    "- 2 tablespoons unsalted butter",
    "- 4 large eggs",
    "- Kosher salt and freshly ground black pepper",
    "- Mixed tomato salsa",
    "- Grated cotija cheese, for garnish (optional)",
    "- Thinly sliced green onion, white and green parts, for garnish (optional)"
  ],
  "directions": [
    "1. To make the hash browns, put the potatoes in a medium pot of cold, salted water, bring to a boil, and cook until nearly tender but a knife inserted into the centers still meets a little resistance, 15 to 20 minutes. Drain, let cool slightly, and then peel. Grate the potatoes on a grater using the large holes.",
    "2. Heat 2 tablespoons of the oil in a large, preferably nonstick, sauté pan over medium heat. Add the onions, season with salt and pepper, and cook, stirring occasionally, until golden brown and caramelized, 15 to 20 minutes. Scrape the onions out of the pan and onto a plate.",
    "3. Return the pan to the stove over high heat and add the remaining 2 tablespoons oil. Add the potatoes and cook, stirring occasionally, until golden brown, 12 to 15 minutes. Stir in the onions, poblano, ancho powder, and salt and pepper to taste. Remove from the heat.",
    "4. Preheat the oven to 425 degrees F.",
    "5. Place the bacon in a large nonstick sauté pan over medium-high heat and cook, turning once, until crisp, 8 to 10 minutes. Using a slotted spoon, transfer the bacon to a plate lined with paper towels to drain. Discard the bacon fat and wipe out the pan with paper towels.",
    "6. To assemble the quesadillas, place 8 of the tortillas on a work surface. Divide the cheese, hash browns, and bacon among the tortillas. Stack the tortillas to make four 2-layer quesadillas and cover each with one of the remaining 4 tortillas. Brush the tops with the oil and sprinkle with the ancho powder.",
    "7. Transfer to a baking sheet (you may need 2). Bake until golden brown and the cheese has melted, 8 to 10 minutes.",
    "8. While the quesadillas are baking, fry the eggs. Return the nonstick sauté pan that you cooked the bacon in to the stove over medium heat, add the butter, and heat until melted. Carefully crack the eggs into the pan, season with salt and pepper, and cook until the whites are completely firm but the yolks are still soft, about 2 minutes.",
    "9. Transfer the quesadillas to plates and top each with a fried egg, add some of the mixed tomato salsa, and garnish with cotija cheese and green onion."
  ]
}