{
  "title": "Crispy Cauliflower with Bamba and Peanut Tahini Sauce",
  "source": "Shuk From Market to Table",
  "servings": "Serves 6",
  "categories": [
    "Israel",
    "Shuk - From Market to Table"
  ],
  "ingredients": [
    "2cups (320 g) rice flour",
    "1cup (240 ml) water",
    "Vegetable oil, for deep-frying",
    "1large head cauliflower, cored and cut into 1-inch (2.5 cm) florets",
    "½cup Peanut Tahini Sauce (page 117), plus more as needed",
    "One 5.6-ounce (160 g) bag Bamba, broken into pieces or sliced into coins"
  ],
  "directions": [
    "Whisk the rice flour with the water in a medium bowl to make a thin batter. Set aside.",
    "Line a tray with paper towels. Fill a large wide pan with vegetable oil to a depth of about 2 inches (5 cm) (make sure the pan is at least 4 inches/10 cm deep, or deep enough to contain the oil once you add the cauliflower). Heat the oil over medium-high heat until it registers between 350° and 375°F (175° and 190°C) on a deep-fry thermometer. If you don’t have a thermometer, give the oil a few minutes to get hot and then test it by adding a small drop of batter to the oil: If you see lots of small rapid bubbles, you’re ready to go. Repeat this test throughout frying to make sure your oil is consistently hot.",
    "Dip the cauliflower florets in the batter, making sure they’re evenly coated. Working in batches to avoid overcrowding the pan, use a slotted spoon to slide the florets into the hot oil (frying too much at once can lower the oil temperature, which would make the cauliflower greasy). Give the florets a quick stir to make sure they don’t stick together and fry until golden brown and just tender when poked with a paring knife, 3 to 4 minutes. Use the slotted spoon to transfer the fried cauliflower to the paper towels to drain. Repeat to cook the remaining cauliflower.",
    "Transfer the hot cauliflower to a large serving bowl. Add the peanut tahini and toss to coat. Taste and add more tahini or salt if desired. Sprinkle with the Bamba pieces and serve at once."
  ]
}