{
  "title": "Crispy Orange Beef",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 1/2 pounds beef flap meat, trimmed",
    "- 3 tablespoons soy sauce, divided",
    "- 6 tablespoons cornstarch",
    "- 10 (3-inch) strips orange zest, sliced thin lengthwise (1/4 cup), plus 1/4 cup juice (from 2 oranges)",
    "- 2 tablespoons water",
    "- 2 tablespoons Shaoxing wine",
    "- 4 teaspoons sugar",
    "- 1 tablespoon Chinese white rice vinegar",
    "- 1 tablespoon dark soy sauce",
    "- 1 1/2 teaspoons toasted sesame oil",
    "- 2 quarts peanut or vegetable oil for frying",
    "- 1 serrano chile, stemmed, seeded, and sliced thin lengthwise",
    "- 2 tablespoons grated fresh ginger",
    "- 3 garlic cloves, minced",
    "- 1/2 teaspoon Sichuan chili flakes",
    "- 2 scallions, sliced thin"
  ],
  "directions": [
    "1. Cut beef with the grain into 2 1/2- to 3-inch-wide strips. Transfer to a plate and freeze until firm, about 15 minutes. Slice strips crosswise against the grain into 1/8-inch thick slices. Toss beef with 1 tablespoon soy sauce in a bowl. Add cornstarch and toss until evenly coated. Spread beef in a single layer on a wire rack set in a rimmed baking sheet and freeze until beef is very firm but not completely frozen, about 45 minutes.",
    "2. Whisk orange juice, water, Shaoxing wine, sugar, vinegar, dark soy sauce, sesame oil, and remaining 2 tablespoons soy sauce together in a bowl; set aside.",
    "3. Line a second rimmed baking sheet with a triple layer of paper towels. Add peanut oil to a large Dutch oven until it measures about 1 1/2 inches deep and heat over medium-high heat to 375째F. Using a spider skimmer or slotted spoon, carefully add one-third of the beef to the oil. Using tongs or cooking chopsticks, separate pieces so they fry individually. Fry beef, stirring occasionally, until golden brown, about 1 1/2 minutes. Adjust burner, if necessary, to maintain oil temperature between 350째F and 375째F. Using the spider skimmer, transfer beef to the towel-lined sheet. Return oil to 375째F and repeat with the remaining beef in 2 batches; transfer to the sheet.",
    "4. Measure out and reserve 2 tablespoons of frying oil; discard the remaining oil or save for another use. Heat an empty 14-inch flat-bottomed wok over high heat until just beginning to smoke. Reduce heat to medium-high, drizzle reserved frying oil around the perimeter of the wok, and heat until just smoking. Add orange zest and serrano and cook, stirring frequently, until about half of the orange zest is golden brown, about 2 minutes. Add ginger, garlic, and chili flakes and cook, stirring frequently, until garlic is beginning to brown, about 45 seconds. Add the orange juice mixture and cook, stirring frequently, until slightly thickened, about 45 seconds. Add scallions and beef and toss to coat. Serve."
  ]
}