{
  "title": "Crispy Tofu And Broccoli With Sesame-Peanut Pesto",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 2 giant servings or 4 smaller ones",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "tofu and broccoli",
    "1block (12 to 15 ounces or 340 to 425 grams) extra-firm tofu",
    "1pound (455 grams) broccoli",
    "3tablespoons (45 ml) olive, peanut, or neutral oil such as sunflower/safflower",
    "Salt and freshly ground black pepper",
    "1tablespoon (15 ml) low-sodium soy sauce or tamari",
    "1tablespoon (10 grams) cornstarch",
    "pesto",
    "1tablespoon (10 grams) toasted sesame seeds",
    "¼cup (35 grams) shelled peanuts (salted are fine), roasted",
    "1½teaspoons (10 grams) minced fresh ginger",
    "1small garlic clove",
    "2tablespoons (30 ml) low-sodium soy sauce",
    "2tablespoons (30 ml) toasted sesame oil",
    "1tablespoon (15 ml) unseasoned rice vinegar",
    "¼teaspoon granulated sugar, dark-brown sugar, or honey",
    "to finish",
    "3scallions, thinly sliced",
    "Chile-garlic or another hot sauce (optional)"
  ],
  "directions": [
    "prepare the tofu Drain the tofu, and place it on a few paper towels; place a few more towels over it. Place a heavy object—like a big frying pan—over the tofu, and let it rest for 10 minutes (and up to 30, if you have the time), to press out as much excess liquid as you can.",
    "Meanwhile, heat the oven to 400 degrees. Line one large baking sheet with parchment; leave another one bare. (Tofu really wants to stick; for broccoli, you’ll miss out on crunchy bits if you use parchment, which would be a travesty.)",
    "prepare the broccoli Trim and chop the broccoli into chunky florets. Don’t let the stems go to waste: I peel off the tough outer skin and knots and cut the stems into ½-inch segments. Drizzle 1 tablespoon oil over the parchment-paper-free baking sheet, and brush or roll it around so the sheet is evenly coated. Scatter the broccoli chunks over it, drizzle with a second tablespoon of oil, and season it well with salt and pepper.",
    "Remove the tofu from the towels, and cut into 1-inch cubes. Toss the tofu with the remaining tablespoon of oil, the soy sauce, and the cornstarch until evenly coated, and spread out on the parchment-lined baking sheet.",
    "cook the tofu and broccoli Place both baking sheets in the oven and roast for 20 minutes, then toss the pieces around for even coloring and roast another 10 minutes. At this point, the tofu is usually done, which is to say golden at the edges and lightly crisp; remove the pan from the oven. I like to toss the broccoli around and roast it for another 10 minutes to get an extra char on it.",
    "while the broccoli and tofu roast, make the pesto Pulse all the ingredients together in a food processor until ground. Adjust the flavors to taste.",
    "to finish In a large bowl, combine the broccoli and tofu, and toss with the sauce. Garnish with the scallions and with hot sauce, if using. Don’t forget to share."
  ]
}