{
  "title": "Crispy Short Rib Carnitas With Sunset Slaw",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 8 small tacos, serving 3 or 4",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "carnitas",
    "2teaspoons kosher salt",
    "1teaspoon chile powder, or to taste",
    "3pounds (1⅓ kilograms) meaty short ribs, with bone",
    "Juice of 1 orange",
    "Juice of 1½ limes; save the last ½ lime for garnish",
    "5garlic cloves, unpeeled",
    "sunset slaw",
    "3cups (190 grams) finely shredded red cabbage (from about ½ large cabbage)",
    "1carrot, coarsely grated",
    "Coarse salt",
    "Juice of ½ lime",
    "2scallions, thinly sliced",
    "Dollop of mayonnaise, sour cream, or plain yogurt",
    "Dash of hot sauce (optional)",
    "¼cup (10 grams) roughly chopped fresh cilantro or flat-leaf parsley leaves",
    "to serve",
    "Corn tortillas",
    "Minced white onion or thinly sliced scallions",
    "Chopped fresh cilantro",
    "Pickled jalapeños",
    "Hot sauce"
  ],
  "directions": [
    "Heat the oven to 275 degrees. Combine the salt and chile powder in a dish. Spread the short ribs out on the butcher paper they came in or on a tray, then rub them all over with the salt mixture. Arrange them in a deep roasting pan (the walls should be higher than the ribs; it doesn’t matter which side is down), and pour the orange and lime juice into the bottom. Scatter the garlic cloves throughout. Cover the dish tightly with foil, and slow-bake it for 2 to 2½ hours. The meat should be tender and beginning to separate from the bone but pretty ugly-looking (it’s been steam-roasting, after all). Remove the foil, and increase the heat to 425 degrees. Basting the meat with the pan juices once or twice, roast the meat for 15 to 20 more minutes, until the edges are crispy and browned and the residents of your home are pawing at the oven door, asking what time dinner is.",
    "when the ribs are almost done roasting, make the slaw Toss the cabbage, carrot, salt, and lime juice together in a bowl; set aside for 5 minutes, during which the slaw will shrink down a bit and become easier to season. Stir in the scallions, then the mayo and hot sauce (if using). Adjust the seasonings or other ingredients to taste, then stir in the cilantro leaves.",
    "Discard the bones, pick off any large chunks of visible fat, then lightly shred the meat right into a dish, pouring the extra pan juices over it. You can squeeze out the garlic cloves from their skin and keep them on the side for those who want to eat them.",
    "Heat the corn tortillas in a dry skillet for 20 to 30 seconds per side. Pile a small amount of shredded short-rib meat on top, then season with your desired fixings—minced white onion and chopped cilantro are the most traditional, followed by hot sauce or pickled jalapeños. Serve with slaw on the side."
  ]
}