{
  "title": "Crispy McCrisperson Chicken Thighs with Herby Peas & Fennel",
  "source": "Molly Baz Cook this Book",
  "servings": "4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1large fennel bulb (about 1 pound)",
    "6scallions",
    "3garlic cloves",
    "2lemons",
    "1cup mint, dill, and/or basil leaves",
    "DAIRY",
    "3tablespoons unsalted butter",
    "MEAT",
    "2½pounds bone-in, skin-on chicken thighs (about 6)",
    "PANTRY",
    "Kosher salt and coarsely ground black pepper",
    "½teaspoon red pepper flakes",
    "FROZEN",
    "1(10-ounce) bag frozen or fresh English peas"
  ],
  "directions": [
    "① Position a rack in the bottom third of the oven. Preheat the oven to 425°F.",
    "② Prep the fennel: Trim off the tough root end and any stalks or fronds of 1 large fennel bulb. Cut in half lengthwise and slice into ½-inch-thick wedges. Never handled a fennel before? Watch this video, it’s super simple.",
    "③ Crisp up that chicken skin:",
    "✦Pat 2½ pounds of bone-in, skin-on chicken thighs dry with paper towels to remove any surface moisture. Season the chicken all over with 2½ teaspoons salt and a few good cranks of coarsely ground black pepper. Arrange the thighs skin-side down in a dry, unheated 12-inch cast-iron skillet. Set over medium heat and cook, undisturbed, until the skin releases easily from the pan and is light golden brown, 12 to 14 minutes.",
    "✦Once released, move the chicken thighs around a bit to ensure even browning. Parts of your skillet will get hotter than others. Continue to cook until the skin is very crisp and deep golden brown, 4 to 6 minutes longer. Use tongs to transfer the thighs to a plate, skin-side up.",
    "④ Add the fennel: Using tongs, add the fennel wedges to the skillet, turning them to coat in some of the rendered chicken fat. Season with ½ teaspoon salt. Return the chicken to the skillet, skin-side up. Transfer the skillet to the oven and roast 10 to 15 minutes, flipping the fennel halfway through for even browning, until the chicken meat is no longer pink and the fennel is caramelized.",
    "⑤ Finish your mise:",
    "✦Meanwhile, thinly slice 6 scallions and 3 garlic cloves.",
    "⑥ Finish the chicken:",
    "✦Remove the skillet from the oven and transfer the thighs to a plate, skin-side up to stay nice and crisp.",
    "✦Add 3 tablespoons butter, the scallions, and the garlic to the fennel in the skillet. Cook over medium heat until the scallions and garlic have softened but not browned, 1 to 2 minutes.",
    "✦Stir in 10 ounces peas, ½ teaspoon red pepper flakes, ½ cup water, and ½ teaspoon salt, scraping up any browned bits from the bottom of the skillet (that’s flavor!), and cook until the peas are bright green and just cooked through, 3 to 4 minutes. Turn off the heat.",
    "✦Stir in the juice of ½ lemon. Taste the peas and add more salt or lemon juice as needed until it tastes super lemony and really tasty.",
    "⑦ Serve: Cut whatever lemon remains into wedges for serving. Divide the peas and fennel among 4 shallow bowls and top each with a chicken thigh or two, a lemon wedge, and some torn mint."
  ]
}