{
  "title": "Crispy Roast Pork Belly",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 8 to 10",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 (3-pound) skin-on center-cut fresh pork belly, about 1 1/2 inches thick",
    "- 2 tablespoons kosher salt, plus extra as needed",
    "- 2 tablespoons packed dark brown sugar",
    "- 1 teaspoon five-spice powder",
    "- Vegetable oil"
  ],
  "directions": [
    "1. Using a sharp chef’s knife, slice the pork belly lengthwise into 2- to 2 1/2-inch-wide strips, then make 1/4-inch-deep crosswise cuts, spaced 1/2 inch apart, through the skin and into the fat. Combine the salt, sugar, and five-spice powder in a bowl. Rub the salt mixture into the bottom and sides of the pork belly (do not rub into the skin). Season the skin of each strip evenly with extra salt. Place the pork belly skin side up in a 13 by 9-inch baking dish and refrigerate, uncovered, for at least 12 hours or up to 24 hours.",
    "2. Adjust the oven rack to the middle position and heat the oven to 250 degrees. Line a rimmed baking sheet with aluminum foil, set a wire rack in the sheet, and spray the rack with vegetable oil spray. Transfer the pork belly, skin side up, to the prepared wire rack and roast until the pork registers 195 degrees and a paring knife inserted into the pork meets little resistance, about 3 to 3 1/2 hours, rotating the sheet halfway through roasting.",
    "3. Transfer the pork belly, skin side up, to a large plate. (The pork belly can be held at room temperature for up to 1 hour.) Pour the fat from the sheet into a 1-cup liquid measuring cup. Add vegetable oil as needed to equal 1 cup and transfer to a 12-inch skillet. Arrange the pork belly skin side down in the skillet (the strips can be sliced in half crosswise if the whole strips won’t fit) and place over medium heat until bubbles form around the pork belly. Continue to fry, tilting the skillet occasionally to even out hot spots, until the skin puffs, crisps, and turns golden, about 6 to 10 minutes. Transfer the pork belly, skin side up, to a carving board and let rest for 5 minutes. Flip the pork belly on its side and slice 1/2 inch thick (being sure to slice through the original score marks). Reinvert the slices and serve."
  ]
}