{
  "title": "Crispy Tofu",
  "source": "Thekitchn.com",
  "servings": "",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "1(14- to 16-ounce) block extra-firm tofu",
    "1teaspoon kosher salt",
    "3tablespoons cornstarch",
    "2tablespoons vegetable oil",
    "2-3Tbsp Soy Sauce",
    "1Tbsp Sesame Oil",
    "2tsp rice wine vinegar or black vinegar"
  ],
  "directions": [
    "Press the tofu. Remove the tofu from its packaging and any liquid. Line a plate with a folded paper towel and set the tofu on top. Set a small plate on top of the tofu and weigh it down with something heavy, like a 28-ounce can of tomatoes. Press for 15 to 30 minutes. You will see liquid collect around the tofu.",
    "Cut the tofu into pieces. Remove the weight and drain off the excess liquid. Pat the tofu dry with more towels. Slice the pressed tofu into cubes, thick rectangles, or sticks, depending on how you plan to use the tofu.",
    "Season with salt. Transfer the tofu to a shallow dish and sprinkle with the salt. Toss to evenly season the tofu.",
    "Marinated tofu cubes: For extra flavor, toss the sliced tofu in a mixture of soy sauce, rice wine vinegar, and sesame oil and let stand for 20 minutes before coating with cornstarch. Mix tofu with marinade about halfway through to make sure all pieces are getting marinade",
    "Coat with cornstarch. Sprinkle 1 tablespoon of the cornstarch over the tofu, then toss to evenly coat. Continue sprinkling and tossing until all the cornstarch is used. This is most easily done with a small strainer, but can also be done by sprinkling with your hands. After adding all the cornstarch, the tofu should be evenly coated with a sticky, gummy layer of cornstarch.",
    "Put Tofu on baking sheet (preferably on a baking rack over sheet) and cook in oven on 450F for 15-20 minutes or once crispy. (I kinda lost track of time and went till I thought they were really crispy before burnt)",
    "Transfer to cooling rack. Transfer the browned tofu to a cooling rack while you finish your recipe. Eat the tofu immediately. It will remain crispy for a few hours, but will become chewy and lose its crispness if refrigerated."
  ]
}