{
  "title": "Crispy Chocolate Cake with Hazelnut and Sour Cream",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 8 to 10",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "FOR THE CAKE",
    "½cup (1 stick) unsalted butter, plus more for greasing the pan",
    "¾cup plus 2 tablespoons granulated sugar, plus more for the pan",
    "8ounces bittersweet chocolate, at least 67% cacao, finely chopped",
    "½cup Nutella, hazelnut spread, almond butter, or tahini (see Note)",
    "6large eggs",
    "½cup hazelnut or almond flour",
    "2tablespoons unsweetened cocoa powder",
    "1teaspoon kosher salt",
    "FOR THE TOPPING/ACCOMPANIMENT",
    "1cup heavy cream",
    "¼cup confectioners’ sugar",
    "Pinch of kosher salt",
    "1cup sour cream",
    "¼cup Nutella",
    "Brandied, maraschino, or Luxardo cherries (optional)"
  ],
  "directions": [
    "1 Preheat the oven to 350°F. Lightly grease a 9-inch springform pan with softened butter or nonstick cooking spray. (You can use any 9-inch cake pan, but line it with parchment paper with some overhang so you can easily remove the finished cake.) Sprinkle the inside with sugar and rotate the pan to coat the bottom and sides evenly; tap out excess.2 Make the cake. Combine the chocolate, Nutella, and butter in a large heatproof bowl. Set the bowl over a small pot of simmering water and heat, stirring often, until the chocolate and butter have melted and you can stir everything together to a smooth, creamy mixture. Remove from the heat and set aside. (Alternatively, microwave in 30-second increments until evenly melted.)3 Separate 4 of the eggs, placing the whites in a large mixing bowl (either a bowl fitted for a stand mixer or a bowl large enough to handle a hand mixer). Place the yolks in another large bowl and add the hazelnut flour, cocoa powder, salt, and the remaining 2 whole eggs and whisk to blend well. Using a spatula, gently and gradually mix the egg yolk mixture into the melted chocolate mixture (don’t use a whisk here; the batter is quite thick and will get stuck in the wires).4 With the mixer on high, beat the egg whites. When they start to get light and foamy, gradually add ¾ cup sugar, a tablespoon or two at a time, and continue to beat until egg whites have tripled in volume and are light, fluffy, opaque, and hold stiff peaks. They should look like a very good meringue that you could frost a cake with (that’s not what you’ll be doing, but just saying).5 Using a spatula, gently fold the egg whites into the chocolate mixture until just combined and no obvious white streaks remain (this will look cool—maybe take a picture!); avoid overmixing (that would deflate all that air you worked so hard to build into those egg whites).6 Pour the batter into the prepared pan and smooth the top. Sprinkle with the remaining 2 tablespoons granulated sugar and bake until the edges begin to pull away from the sides of the pan and the top looks puffed and lightly cracked, like a soufflé (it should still have a little jiggle), 35 to 40 minutes.7 Let cool completely (if you have a wire rack, use it). During this time, something seemingly tragic will happen—the center of the cake will collapse, causing further cracking around the edges. This is the intended effect, so don’t worry—it’s where those crispy edges come from, the reason we are all here.8 Prepare the topping/accompaniment. Using an electric mixer (or a good old-fashioned whisk and elbow grease), whip the cream, confectioners’ sugar, and salt in a medium bowl until you’ve got medium-stiff peaks, then whisk in the sour cream. For a streaky effect, fold in the Nutella using a spatula or if, you know, who cares, just whisk it in. Use this mixture to top the cake, but I prefer to eat it on the side (so as to not ruin the cake’s crispy texture) with some delicious cherries for snacking on in between bites."
  ]
}