{
  "title": "Crispy Kimchi Pancakes with Shrimp",
  "source": "Seriouseats.com",
  "servings": "About fifteen 4-inch pancakes",
  "categories": [
    "Korean"
  ],
  "ingredients": [
    "1cup (125g) all-purpose flour",
    "1/2cup (65g) rice flour",
    "1 1/2cups (350ml) ice cold water, plus more as needed",
    "1/4cup (60ml) kimchi brine plus 1 cup drained kimchi (8 ounces, 225g), coarsely chopped",
    "1large egg, lightly beaten",
    "3scallions, white and light green parts only, cut into 1/2-inch lengths, plus more chopped scallions for garnish",
    "8ounces (225g) raw shrimp, peeled, de-veined, and roughly chopped into 1/4-inch pieces",
    "1/2teaspoon (3g) kosher salt",
    "3tablespoons (45ml) soy sauce",
    "3tablespoons (45ml) rice vinegar",
    "1teaspoon (5ml) toasted sesame oil",
    "1teaspoon (4g) sugar or honey",
    "1teaspoon (3g) toasted sesame seeds",
    "Peanut, grapeseed, or other neutral oil, for frying",
    "Quick-Pickled Watermelon Radishes, for serving"
  ],
  "directions": [
    "1. In a large bowl, stir together the all-purpose flour, rice flour, water, kimchi brine, and egg; the mixture should be the consistency of slightly lumpy pancake batter. Stir in the chopped kimchi, scallion segments, shrimp, and salt. Add a little more water if needed. Set batter aside.",
    "2. In a small bowl, stir together soy sauce, rice vinegar, sesame oil, sugar or honey, and sesame seeds. Set dipping sauce aside.",
    "3. Preheat oven to its lowest heat setting. In a large skillet, heat about 1 tablespoon oil over medium-high heat until shimmering. Pour 1/4 cup of batter into the skillet and spread it into a 4-inch circle. Repeat until pan is full but not crowded. (Alternatively, you can make one large 8-inch pancake per batch). Cook until the edges turn golden and crispy, 2 to 4 minutes. Flip pancakes, add a little more oil, if needed, and cook for about another 2 to 3 minutes until cooked through. Repeat with the remaining batter, adding oil as needed.",
    "4. Arrange cooked pancakes in a single layer on a baking sheet and keep in warm oven until ready to serve. Serve whole or cut into wedges, garnished with scallions, and with dipping sauce and quick-pickled radishes on the side."
  ]
}