{
  "title": "Crispy Coconut Chicken Tenders with Pineapple-Chili Sauce",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "4 to 6",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "For the Chicken and Marinade",
    "¼cup Thai sweet chili sauce",
    "¼cup full-fat coconut milk, shaken",
    "¼cup pineapple juice (drained from a small can of crushed pineapple)",
    "Grated zest and juice of 1 lime",
    "3cloves garlic, minced",
    "½teaspoon kosher salt",
    "1½pounds chicken tenders",
    "For the Sweet Chili Pineapple Sauce",
    "¼cup Thai sweet chili sauce",
    "¼cup canned crushed pineapple",
    "Grated zest and juice of 1 lime",
    "½clove garlic, finely minced",
    "½teaspoon Sriracha",
    "For Breading and Frying",
    "1½cups cornstarch (or flour if you don’t have any cornstarch)",
    "3eggs",
    "1⅓cups unsweetened shredded coconut",
    "⅔cup panko bread crumbs",
    "½teaspoon cayenne pepper",
    "Kosher salt and freshly ground black pepper",
    "Vegetable oil, for shallow-frying",
    "2scallions, chopped, for garnish"
  ],
  "directions": [
    "MARINATE THE CHICKEN: In a large bowl, whisk together the sweet chili sauce, coconut milk, pineapple juice, lime zest, lime juice, garlic, and salt. Add the chicken and smush it around to coat. Cover and refrigerate for at least 30 minutes and up to 4 hours.",
    "MAKE THE SAUCE: In a small bowl, stir together the sweet chili sauce, pineapple, lime zest, lime juice, garlic, and Sriracha.",
    "BREAD AND FRY THE CHICKEN: Remove the chicken from the marinade, shaking off the excess liquid (discard the marinade). Set up three shallow bowls. Spread out the cornstarch in one, beat the eggs in the second, and mix together the coconut, panko, cayenne, and 1 teaspoon salt and some black pepper in the third. Dip each chicken tender in the cornstarch, then in egg, shaking off the excess between each step. Press all sides of each tender into the coconut-panko mixture, pressing well to adhere, and place the breaded tenders on a plate or tray.",
    "Heat ¼ inch of oil in a large heavy skillet over medium-high heat until hot. Working in batches, fry the tenders until golden and crisp, about 1½ minutes per side. Drain on paper towels and season to taste with salt. (You may need to add a little oil to the skillet between batches of chicken to maintain the ¼-inch depth.)",
    "Arrange the tenders on a serving platter and either serve with the sauce as a dip or drizzle them with the sauce. Garnish with scallions and serve immediately."
  ]
}