{
  "title": "Crunk Chunks on Ice Cream",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Serves 2 to 8",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "Crunk Chunks",
    "One 14.4-ounce box graham crackers (ground to fine bread crumb size)",
    "2sticks (16 tablespoons) plus 3 tablespoons unsalted butter, melted",
    "½cup white sugar",
    "1tablespoon kosher salt (Diamond Crystal or about half as much Morton), or more if you like",
    "¾cup plus 2 tablespoons sweetened condensed milk",
    "¼cup bottled key lime juice (like Nellie and Joe’s)",
    "2egg yolks",
    "For Serving",
    "2pints vanilla, coconut, or Creole cream cheese (a Louisiana thing) ice cream",
    "Flaky sea salt"
  ],
  "directions": [
    "To make the crunk chunks: Get your oven to 350°F.",
    "In a medium mixing bowl, combine the graham cracker crumbs, butter, sugar, and kosher salt and mix it with your hands until it’s all like wet sand.",
    "Line a loaf pan with parchment paper so the paper hangs over the sides by an inch or two. Put the graham sand in there and give it a firm press onto the bottom so you have an even packed layer that’s a smidge more than an inch. Bake, rotating the pan once, until the edges start to darken a shade but the center isn’t quite done, 12 to 15 minutes.",
    "While you’re waiting, whisk together the condensed milk, key lime juice, and egg yolks so they’re well mixed. When the crust is done, pour on the lime mixture, give the pan a couple of taps on the counter so the lime stuff settles evenly, then bake again until the lime mixture is just barely set in the center, 10 to 12 minutes.",
    "Let this bad boy come to room temperature, then pop it in the fridge until it’s cold and it’s good to go. It keeps, covered, in the fridge for a week or the freezer for two.",
    "To serve: Run a knife along the edges of the crunk daddy to loosen him from the pan, then use the parchment paper to lift out and cut him into roughly 1-inch crunk chunk babies. Scoop the ice cream into bowls (or just leave in the carton), top with the crunk chunks, and garnish with a pinch of flaky salt. Eat."
  ]
}