{
  "title": "Dan Dan Mian",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "Sauce:",
    "1/4cup vegetable oil",
    "1tablespoon Sichuan chili flakes",
    "2teaspoons Sichuan peppercorns, ground fine",
    "1/4teaspoon ground cinnamon",
    "2tablespoons soy sauce",
    "2teaspoons Chinese black vinegar",
    "2teaspoons tianmianjiang (sweet wheat paste)",
    "1 1/2teaspoons Chinese sesame paste",
    "Noodles:",
    "8ounces ground pork",
    "2teaspoons Shaoxing wine",
    "1teaspoon soy sauce",
    "2small heads baby bok choy (about 3 ounces each)",
    "1tablespoon vegetable oil, divided",
    "3garlic cloves, minced",
    "2teaspoons grated fresh ginger",
    "1pound fresh thick white wheat noodles",
    "1/3cup yacai",
    "2scallions, sliced thin"
  ],
  "directions": [
    "1. For the sauce: Heat oil, chili flakes, peppercorns, and cinnamon in 14-inch flat-bottomed wok over low heat for 10 minutes. Using rubber spatula, transfer oil mixture to bowl (do not wash wok). Whisk soy sauce, vinegar, tianmianjiang, and sesame paste into oil mixture. Divide evenly among 4 shallow bowls.",
    "2. For the noodles: Combine pork, Shaoxing wine, and soy sauce in medium bowl and toss with your hands until well combined; set aside. Working with 1 head bok choy at a time, trim base (larger leaves will fall off) and halve lengthwise through core; rinse well.",
    "3. Heat 2 teaspoons oil in now-empty wok over medium-high heat until shimmering. Add reserved pork mixture and use rubber spatula to smear into thin layer across surface of wok. Break up meat into 1/4-inch chunks with edge of spatula and cook, stirring frequently, until pork is firm and well browned, about 5 minutes. Push pork mixture to far side of wok and add garlic, ginger, and remaining 1 teaspoon oil to cleared space. Cook, stirring constantly, until garlic mixture begins to brown, about 1 minute. Stir to combine pork mixture with garlic mixture. Off heat, cover to keep warm.",
    "4. Meanwhile, bring 4 quarts water to boil in large pot. Add bok choy and cook until leaves are vibrant green and stems are crisp-tender, about 1 minute. Using spider skimmer or slotted spoon, transfer bok choy to plate; set aside. Return water to boil. Add noodles and cook, stirring often, until almost tender (center should still be firm with slightly opaque dot). Drain noodles. Rinse under hot running water, tossing with tongs, for 1 minute; drain well.",
    "5. Divide noodles evenly among prepared bowls. Return wok with pork mixture to medium heat. Add yacai and cook, stirring frequently, until warmed through, about 2 minutes. Spoon pork mixture over noodles. Divide bok choy evenly among bowls, shaking to remove excess moisture as you portion. Top with scallions. Serve warm or at room temperature."
  ]
}