{
  "title": "Dan Stein as a Hot Dog",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes 4",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "4hot dogs (I love Hebrew National all-beef), or Corned Dog Upgrade (this page)",
    "1½cups drained sauerkraut",
    "1white onion, cut into thin half-moons",
    "1teaspoon kosher salt (Diamond Crystal or about half as much Morton)",
    "4tablespoons unsalted butter, room-temp so it’s mayo-soft",
    "2ounces sliced Swiss cheese",
    "4slices soft rye bread (preferably marble or seeded)",
    "¼cup Spicy Russian Dressing (this page)",
    "Ketchup (there is only Heinz) for serving",
    "Heaping ¼ cup chopped hot pickled cherry peppers"
  ],
  "directions": [
    "Cook the dogs however you like to cook your dogs (microwave, grill, skillet) or do what we do at Turkey and the Wolf (see Corned Dog Upgrade, this page). Keep them warm.",
    "Combine the sauerkraut, onion, salt, and 1 tablespoon of the butter in a medium nonstick pan or well-seasoned cast-iron skillet and put it over medium heat. Cook, stirring with a wooden spoon, occasionally at first and more frequently near the end, until the kraut and onion turn golden brown, about 5 minutes. Add the cheese and let it melt, about 1 minute. Turn off the heat and stir well. Cover to keep warm.",
    "Get a well-seasoned cast-iron skillet or griddle good and hot over medium heat. Swipe the remaining 3 tablespoons butter generously on the rye slices. Working in batches, if necessary, toast the bread in the skillet until it’s golden brown but still soft enough to fold like a bootleg bun, 30 seconds or so. Move the bread to plates or a platter.",
    "Spoon a nice long stripe of the Russian dressing along the center of each slice of rye and squeeze on a thin stripe of ketchup right next to it. Top with the hot dogs, the cheesy sauerkraut, and the pickled peppers. Eat it like a hot dog."
  ]
}