{
  "title": "Deli Rye English Muffins",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 12 miniature or 8 standard-sized muffins",
  "categories": [
    "Cookbooks"
  ],
  "ingredients": [
    "2¼teaspoons (from a 7-gram or ¼-ounce packet) active dry yeast",
    "¼cup (60 ml) lukewarm water",
    "¾cup (175 ml) milk or buttermilk",
    "2tablespoons (30 grams) unsalted butter, plus more for the bowl",
    "1tablespoon (15 grams) granulated sugar",
    "⅔cup (80 grams) dark rye flour",
    "1⅓cups (175 grams) all-purpose or bread flour, plus more for your work surface",
    "1½teaspoons coarse or kosher salt",
    "2teaspoons (5 grams) whole or 1 teaspoon ground caraway seeds",
    "Oil, for greasing bowl and coating skillet",
    "Cornmeal, for sprinkling"
  ],
  "directions": [
    "Combine the yeast and water in the bowl of a stand mixer fitted with a dough hook. Let rest 5 minutes; the yeast should dissolve and look slightly foamy. Gently warm the buttermilk, butter, and sugar to lukewarm (not hot), and add it to the yeast mixture, followed by the flours, salt, and caraway. Use the dough hook to combine until a shaggy, uneven dough forms; knead it on the lowest speed for 5 minutes, until the dough is stretchy and cohesive. Butter or oil a large bowl (or do as I do and remove the dough long enough to oil the mixing bowl, then return the dough to it), and let the dough proof at room temperature, covered with a dishcloth or plastic, for 1 hour. (Until it has risen by at least one-third.)",
    "Lightly spray a large baking sheet with oil, then generously sprinkle it with cornmeal. Lightly flour your counter, turn the dough out onto it, flour the top, and gently deflate it with your hands. Divide the dough into pieces; twelve pieces for minis, eight for standard muffins. Roll them gently into balls, and place on the cornmealed baking sheet, pressing gently to flatten them into discs (about ¾-inch thick). Spray the tops lightly with oil, and sprinkle them with cornmeal, too. Cover loosely, and proof at room temperature for 30 minutes more or up to 3 days in the fridge. If chilled, let them warm up for 30 minutes at room temperature before cooking.",
    "Heat the oven to 250 degrees.",
    "Let a cast-iron skillet warm over the lowest heat for 5 to 7 minutes, then lightly coat the inside with neutral cooking oil for insurance against sticking, but not enough that the muffins will fry. Dust off the excess cornmeal from the muffins. Let the bottom of each muffin brown slowly and very gently in the pan, about 5 minutes. (If yours are taking longer, you can bump up the heat to medium-low.) Flip them, and cook for another 4 to 5 minutes. You can flip back and forth again if needed for even cooking.",
    "Shake the excess cornmeal off the baking sheet, and transfer pan-toasted muffins to the oven. Bake for 20 to 25 minutes until the sides are firm to the touch. Cool to almost room temperature, then fork-split."
  ]
}