{
  "title": "Dim Sum Go Go Fried Rice",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Serves 4",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "FOR THE PARSLEY OIL",
    "- ½ bunch flat-leaf parsley, trimmed and roughly chopped (1 cup packed)",
    "- ¼ cup extra-virgin olive oil",
    "- ⅛ teaspoon kosher salt",
    "FOR THE DISH",
    "- 2 medium bunches cilantro, bottom couple inches trimmed, plus 1 cup packed roughly chopped cilantro",
    "- ¼ cup Chinkiang vinegar",
    "- 1-inch knob ginger, peeled and cut into very thin matchsticks",
    "- 1½ teaspoons Mushroom Seasoning Powder, homemade or store-bought",
    "- ½ teaspoon kosher salt",
    "- ½ teaspoon granulated sugar",
    "- 2 scallions, trimmed",
    "- 2 tablespoons extra-virgin olive oil",
    "- 4 cups freshly cooked jasmine rice"
  ],
  "directions": [
    "1. COMBINE all the parsley oil ingredients in a blender and pulse until the parsley is mostly submerged in the oil.",
    "2. BLEND on high speed until smooth, about 45 seconds. Stop, scrape down the sides, and blend again until the oil is deep green and slightly warm, about 45 seconds more.",
    "3. REFRIGERATE to cool it down. Use right away or store in the fridge for up to 1 week.",
    "4. BRING a medium pot of water to a boil. Prepare a big bowl of ice water.",
    "5. ADD the cilantro to the boiling water, cook for 5 seconds, then transfer it to the ice water with a strainer.",
    "6. ONCE cool, drain well and squeeze out as much liquid as you can. Roughly chop the blanched cilantro and set aside.",
    "7. COMBINE the vinegar and ginger in a small serving bowl and stir. In another small bowl, mix the mushroom seasoning powder, salt, sugar, and 1 tablespoon warm water. Stir to dissolve and set aside.",
    "8. SMASH the scallions using the flat side of a chef’s knife and thinly slice them.",
    "9. COMBINE the scallions and oil in a large nonstick skillet over medium-high heat and let it sizzle. Cook, stirring occasionally, until the scallions are dark brown and crispy, about 2 minutes.",
    "10. TURN off the heat. Add the rice and stir gently to coat it in the oil, breaking up any clumps but not smashing the grains.",
    "11. STIR in the sugar mixture, the blanched cilantro, and 2 tablespoons of the parsley puree. Turn the heat to high and cook, stirring occasionally, just until the rice is heated through, about 30 seconds.",
    "12. SERVE in bowls topped with the chopped cilantro. Offer the vinegar mixture on the side for seasoning."
  ]
}