{
  "title": "Dim Sum Steamed Beef Short Ribs with Black Pepper",
  "source": "Thewoksoflife.com",
  "servings": "Serves: 4",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "1pound beef short ribs",
    "(450g, cut flanken style across the bone about ¼ inch thick)",
    "FOR THE MARINADE:",
    "½teaspoon salt",
    "¼teaspoon baking soda",
    "¼teaspoon sugar",
    "1tablespoon Shaoxing wine",
    "1teaspoon light soy sauce",
    "¼teaspoon dark soy sauce",
    "1teaspoon oyster sauce",
    "½teaspoon sesame oil",
    "½clove garlic (grated or smashed to a pulp)",
    "1small red onion (thinly sliced)",
    "TO ADD BEFORE STEAMING THE SHORT RIBS:",
    "1teaspoon oil",
    "2teaspoons cornstarch",
    "½teaspoon coarsely ground/cracked fresh black pepper"
  ],
  "directions": [
    "Rinse the beef short ribs and trim off any visible fibrous membranes, as these will make your ribs tough. Mix all of the marinade ingredients in a large bowl. Add the short ribs and onions, making sure that the short ribs are evenly coated. Cover and refrigerate overnight.",
    "The next day, take the ribs out of the refrigerator, and let them come to room temperature. Add the oil, cornstarch, and freshly ground black pepper. Mix well.",
    "Set up your wok or steamer pot over high heat. Place your bamboo steamers in your wok if that’s what you’re using. Heat until the water is bubbling. If you’re using a steamer pot, heat the water to a gentle boil.",
    "While you’re waiting for the water, arrange the ribs on small heat-proof plates if you’re going to serve them dim sum style, or a large plate if you’re going to serve them family style. Top off with some additional fresh ground pepper to taste.",
    "When the steamers are sufficiently preheated, turn off the heat, and carefully add the plate(s) to the steamer. Turn the heat back on, cover the ribs, and steam for 10 minutes. Remove from the heat and serve immediately!"
  ]
}