{
  "title": "Ditalini and Peas in Parmesan Broth",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 to 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Parmesan Broth",
    "4ounces (113 g) bacon (about 3 thick slices), chopped",
    "1medium fennel bulb, roughly chopped (fronds and all)",
    "1large yellow onion, roughly chopped",
    "5garlic cloves, smashed",
    "6cups (1.4 L) unsalted chicken or vegetable broth, homemade or store-bought",
    "12ounces (about 2 cups/340 g) Parmesan rinds",
    "1⁄2 bunch (11⁄2 ounces/43 g) fresh parsley",
    "1tablespoon black peppercorns",
    "2dried bay leaves",
    "2dried shiitake mushrooms",
    "3⁄4 cup (80 g) finely grated Parmesan, plus more for serving",
    "Ditalini and Peas",
    "8ounces (227 g) dry ditalini",
    "8ounces (227 g) fresh or frozen peas",
    "Extra virgin olive oil, for coating the pasta and peas and to garnish",
    "Zest of 1 lemon",
    "Kosher salt and freshly cracked black pepper, to taste"
  ],
  "directions": [
    "1. Make the broth: Place the bacon in a large pot, set over medium heat, and cook, stirring occasionally, until the bacon starts to render and brown, 5 or 6 minutes.2. Add the fennel, onion, and garlic, and cook, stirring occasionally, until the vegetables start to brown and soften, 5 to 7 minutes.3. Add the broth, Parmesan rinds, parsley, peppercorns, bay leaves, and mushrooms. Bring to a boil and then reduce the heat to low. Simmer, uncovered and stirring occasionally (see Note), for 1 hour. Be sure to maintain a bare simmer through the cooking so you don’t boil away your lovely broth!4. After the broth has simmered for 1 hour, bring another large pot of water to a boil over high heat.5. Strain the broth through a fine-mesh strainer into a large bowl. Transfer about one-third of the broth to a blender. Add the grated Parmesan, and carefully (the mixture will be hot), with the blender vented, blend on low until the Parmesan is emulsified into the broth.6. Stir the blended broth into the rest of the broth, and keep warm, stirring often to keep it emulsified, while you boil the pasta.7. Make the ditalini and peas: Generously salt the boiling water from step 4, and drop in the ditalini. When the pasta is about 4 minutes from being al dente, drop in the fresh peas and cook until both the pasta and peas are cooked. If you’re using frozen peas, drop them in just 1 minute shy of the pasta being done.8. Strain the pasta and peas, and return them to the pot. Toss with olive oil to coat and then stir in the lemon zest and season with salt.9. Divide the pasta and peas among serving bowls. Top with the hot Parmesan broth, a drizzle of extra virgin olive oil, pepper, and more grated Parmesan, and serve."
  ]
}