{
  "title": "Dolsot-Bibimbap with Grapefruit Gochujang",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Serves 4",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "- ⅓ cup dried tot or hijiki",
    "- 2 tablespoons granulated sugar",
    "- 2 tablespoons soy sauce",
    "- 1 medium zucchini (about 9 ounces), cut into thin matchsticks",
    "- Kosher salt",
    "- 2 medium carrots (about 7 ounces total), peeled and cut into thin matchsticks",
    "- 6 large Napa cabbage leaves",
    "- 12 ounces baby spinach",
    "- 1 tablespoon extra-virgin olive oil",
    "- 1½ ounces dried shiitake (about 5 large), soaked and trimmed, sliced ¼ inch thick",
    "- 1 cup roughly chopped gosari (Korean fern shoots), rinsed",
    "- ½ teaspoon toasted sesame oil",
    "FOR THE DISH",
    "- 3 tablespoons toasted sesame oil",
    "- 6 cups freshly cooked short-grain white rice",
    "- 1 cup finely chopped spicy cabbage kimchi, homemade or store-bought",
    "- ¼ cup Cashew Cream or Whipped Garlic Sauce",
    "- ½ cup Grapefruit Gochujang",
    "- 1 teaspoon toasted sesame seeds"
  ],
  "directions": [
    "1. PUT the tot in a medium mixing bowl, cover with warm water, and soak for 20 minutes. Drain and return to the bowl.",
    "2. COMBINE the sugar, soy sauce, and 2 tablespoons water in a small pan. Heat until the sugar dissolves, then pour over the tot. Stir and let sit for at least 10 minutes.",
    "3. COMBINE the zucchini with ¾ teaspoon salt in a bowl, toss, and let sit for 10 minutes. Squeeze to drain and set aside.",
    "4. BRING a large pot of water to a boil and salt it. Fill a bowl with ice water.",
    "5. BLANCH the carrots for 10 seconds, transfer to ice water, then drain on a kitchen towel.",
    "6. BLANCH the cabbage for 45 seconds, transfer to ice water, then drain. Chop into 1-inch pieces.",
    "7. BLANCH the spinach for 5 seconds, transfer to ice water, then drain. Squeeze out all excess water and set aside.",
    "8. HEAT olive oil in a skillet over high heat. Add mushrooms in a single layer and cook without stirring for 2 minutes. Stir and continue cooking until golden brown. Add ⅛ teaspoon salt and set aside.",
    "9. TOSS the gosari with sesame oil in a small bowl and set aside.",
    "To Serve",
    "1. HEAT a large cast-iron skillet over medium for 5 minutes. Add sesame oil and swirl to coat.",
    "2. ADD the rice and gently flatten into an even layer.",
    "3. ARRANGE the vegetables—mushrooms, tot, zucchini, carrot, cabbage, spinach, and kimchi—on top in piles, starting from the outside.",
    "4. COOK until the rice develops a crust on the bottom, about 1 more minute if needed.",
    "5. DOLLOP the cashew cream or garlic sauce and the grapefruit gochujang over the top.",
    "6. SPRINKLE with sesame seeds and serve immediately.",
    "7. STIR just before eating, making sure to scrape up the crispy rice from the bottom."
  ]
}