{
  "title": "Don Angie's Lasagna Pinwheels",
  "source": "Today.com",
  "servings": "Servings: 2-4",
  "categories": [
    "Italian",
    "Italian Pasta"
  ],
  "ingredients": [
    "PASTA",
    "1½cups plus 1 tablespoon all-purpose flour",
    "8egg yolks",
    "2whole eggs",
    "BÉCHAMEL",
    "1pound (4 sticks) unsalted butter, cut into cubes",
    "2shallots, sliced",
    "2bay leaves",
    "4sprigs thyme",
    "1teaspoon black peppercorns",
    "2cups all-purpose flour",
    "2quarts whole milk, cold",
    "Salt",
    "BOLOGNESE",
    "2Spanish onions, coarsely chopped",
    "4cloves garlic",
    "5ribs celery, coarsely chopped",
    "2carrots, peeled and coarsely chopped",
    "1pound sweet Italian sausage, casings removed",
    "4ounces pancetta, ground or processed in food processor",
    "1pound ground veal",
    "2tablespoons olive oil",
    "1/2cup tomato paste",
    "1cup white wine",
    "2cups whole milk",
    "2pods star anise",
    "2small cans crushed tomatoes, preferably San Marzano DOP Tomatoes",
    "Salt",
    "TOMATO SAUCE",
    "2cans crushed tomatoes, preferably San Marzano DOP tomatoes",
    "3cloves garlic, smashed",
    "2leaves basil",
    "4tablespoons olive oil",
    "Salt",
    "Cooked pasta sheets (recipe above)",
    "Béchamel (recipe above)",
    "Mozzarella cheese, shredded",
    "Parmesan, grated",
    "Bolognese (recipe above)",
    "Tomato Sauce (recipe above)",
    "Robiola cheese",
    "Parsley, chopped"
  ],
  "directions": [
    "For the pasta:",
    "1. Mix all the ingredients in a food processor until it comes together into a ball. Wrap with plastic wrap and let rest for 30 minutes.",
    "2. Roll dough into large square sheets with a pasta roller to desired thickness.",
    "3. Bring a large pot of salted water to a boil and set up a bowl of ice water.",
    "4. Cook pasta sheets, submerging in the water for one minute then immediately placing into the ice bath. Remove from ice bath and set aside to cool.",
    "For the béchamel:",
    "Melt butter in a heavy-bottomed pot over medium heat. Add shallots, bay leaves, thyme and peppercorns. Cook over low heat until shallots are translucent. Add flour and stir well. Cook over medium heat for five minutes, stirring constantly. Add milk and stir. Cook for 10 minutes, stirring constantly. Season with salt to taste.",
    "Remove from heat and strain through very fine mesh sieve. Place, covered in the refrigerator to cool.",
    "For the Bolognese:",
    "1. Process onions, garlic, celery and carrots together in a food processor. Set aside.",
    "2. In a heavy-bottomed pot over high heat, sear the sausage and ground veal in olive oil. Remove from pot and set aside.",
    "3. Add pancetta to the pot and cook over medium heat until crispy. Add processed vegetables and cook over medium heat until soft. Add tomato paste and stir. Cook for five minutes. Add wine and let cook until fully evaporated. Add veal and sausage back into the pot. Add milk, star anise pods and San Marzano tomatoes. Stir well and cook over medium-low heat for about two hours. Remove and discard star anise pods. Season with salt to taste. Remove from heat and place, covered in refrigerator to cool.",
    "For the tomato sauce:",
    "Heat olive oil in a heavy-bottomed pot. Add garlic and cook over low heat until soft. Add tomatoes, increase heat to medium high and bring to a boil. Immediately remove from heat and add basil. Season with salt to taste. Remove basil and garlic. Place, covered in the refrigerator to cool.",
    "To assemble:",
    "1. Preheat oven to 400°F.",
    "2. Lay out a pasta sheet on a clean countertop. Spread a thin layer of béchamel evenly across the pasta sheet.",
    "3. Sprinkle parmesan and mozzarella over the béchamel. Place another sheet of pasta on top. Spread a layer of Bolognese evenly across the second pasta sheet, leaving one edge uncovered with sauce in order to seal the roll closed. Roll the layered pasta into a log. Place in refrigerator to cool.",
    "4. When cool, slice the lasagna log into pinwheels. Ladle the tomato sauce into a casserole to cover the entire bottom of the dish. Lay lasagna pinwheels into the casserole dish, with the cut sides facing up, until the dish is full. Add dollops of robiola cheese in between the pinwheels.",
    "5. Place in the oven and and bake for about fifteen minutes or until pasta edges are golden brown. Top with chopped parsley and serve."
  ]
}