{
  "title": "Don Angie Pinwheel Lasagna",
  "source": "Italian American Don Angie Book",
  "servings": "MAKES 16 PINWHEELS (SERVES 8 TO 10)",
  "categories": [
    "Italian",
    "Italian American - Don Angie",
    "Italian Pasta"
  ],
  "ingredients": [
    "Kosher salt, for the pasta water (see Note)",
    "Northern-Style Egg Yolk Pasta (this page) or 8 store-bought fresh pasta sheets (12 × 7 inches)",
    "1cup plus 3 tablespoons Besciamella (this page), chilled",
    "4cups shredded whole-milk mozzarella cheese",
    "1cup finely grated Parmigiano-Reggiano cheese",
    "4cups Italian Sausage Bolognese (this page), chilled",
    "2cups 10-Minute San Marzano Tomato Sauce (this page), chilled",
    "½cup robiolina cheese (see this page) or whipped cream cheese",
    "2tablespoons roughly chopped parsley",
    "3tablespoons extra-virgin olive oil, for finishing"
  ],
  "directions": [
    "In a large pot, bring 4 quarts water and 1 cup kosher salt to a boil over high heat. Meanwhile, set up an ice bath in a large bowl. Line a sheet pan with parchment paper.Working with one sheet at a time, place a pasta sheet in the boiling water for 15 seconds, then immediately remove and chill in the ice bath for 15 seconds. Transfer to the lined sheet pan and pat dry with a paper towel. Cover with another layer of parchment paper and repeat with the remaining pasta, creating a stack of sheets, each patted dry and each layer separated by parchment.",
    "On a clean countertop, lay out one pasta sheet with a short side facing you (the sheet should look like a portrait shot). Spread ¼ cup of the besciamella in a thin layer evenly across the sheet. Sprinkle 1 cup of the mozzarella and ¼ cup of parmesan over the besciamella.",
    "Place another sheet of pasta on top. Spread 1 cup of the Bolognese evenly across the second pasta sheet, leaving a 2-inch border uncovered at the top short edge. Spoon 2 teaspoons of the besciamella onto the uncovered edge (this will act like your “glue” to seal the roll closed).",
    "Starting at the bottom, roll up the layered pasta into a thick log (like a jelly roll). Transfer to a small sheet pan seam-side down. Place in the refrigerator to chill for at least 1 and up to 2 hours, which will firm it up and make it easier to slice.",
    "Repeat the process with the remaining pasta sheets to make a total of 4 rolls, transferring to the refrigerator as you finish each roll. (The rolls can be tightly wrapped in plastic at this point and refrigerated for up to 2 days, or frozen for up to 3 months, before cooking. If frozen, thaw in the refrigerator before slicing.)",
    "Preheat the oven to 400°F.",
    "Transfer the rolls to a cutting board. Using a serrated knife, slice each log in half crosswise, then slice each half in half to give you 4 slices per roll, each about 1¾ inches thick.Ladle all of the tomato sauce into a 9 × 13-inch baking dish, covering the entire bottom of the dish. Arrange the lasagna pinwheels cut-side down in the baking dish, 4 pinwheels across in one direction and 4 across in the other. (All 16 pieces should fit in one layer, gently staggered to fit.)",
    "Bake until the pasta edges are golden brown, 20 to 25 minutes. Remove the baking dish from the oven and add tablespoon-sized dollops of robiolina in between the pinwheels in a random pattern. Return to the oven and bake until the robiolina is warm and melted, an additional 2 to 3 minutes. Top with chopped parsley and olive oil.Serve immediately. Leftovers keep, refrigerated, for up to 4 days."
  ]
}