{
  "title": "Double-Apple Crumble Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 10 to 12",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 9-inch springform pan ①",
    "3tablespoons unsalted butter (1.5 oz / 43g)",
    "4medium Pink Lady apples (about 1¾ lb / 794g), peeled, halved, cored, and cut into ¼-inch-thick slices ②",
    "Butter for the pan",
    "2cups all-purpose flour (9.2 oz / 260g)",
    "1½teaspoons ground cinnamon",
    "1½teaspoons baking powder (0.21 oz / 6g)",
    "½teaspoon baking soda",
    "½teaspoon Diamond Crystal kosher salt",
    "1cup apple butter (7.8 oz / 220g) ③",
    "1cup sugar (7 oz / 200g)",
    "½cup crème fraîche or sour cream (4.2 oz / 120g)",
    "¼cup neutral oil, such as vegetable or grapeseed (2 oz / 57g)",
    "2large eggs (3.5 oz / 100g)",
    "2teaspoons vanilla extract",
    "All-Purpose Crumble Topping (this page)"
  ],
  "directions": [
    "Precook the apples: In a medium skillet, heat the 3 tablespoons butter over medium heat. When the butter starts to foam, add the apples and cook, tossing often, just until the slices have begun to soften and turn slightly translucent, 10 to 15 minutes (it’s okay if some of them start to brown, which could happen if you’re using drier, cold-storage apples). Remove the skillet from the heat and set aside to cool.",
    "Preheat the oven and prepare the pan: Meanwhile, arrange an oven rack in the center position and preheat the oven to 350°F. Lightly coat the bottom and sides of the springform pan with room temperature butter, then line the bottom with a round of parchment paper, smoothing to eliminate air bubbles. Set the pan aside.",
    "Mix the dry ingredients: In a large bowl, whisk the flour, cinnamon, baking powder, baking soda, and salt to combine. Set aside.",
    "Mix the wet ingredients: In a medium bowl, whisk the apple butter, sugar, crème fraîche, oil, eggs, and vanilla until smooth.",
    "Mix the wet ingredients into the dry: Make a well in the center of the flour mixture and pour in the apple butter mixture. Whisking from the center of the bowl outward, incorporate the dry ingredients into the wet just until you have an evenly mixed batter.",
    "Fold in the apples: Using a large flexible spatula, fold the cooled apples into the batter, leaving any liquid behind in the skillet and mixing thoroughly to distribute the apples evenly.",
    "Fill the pan and top with the crumble: Scrape the batter into the prepared pan and smooth the top. Sprinkle the crumble topping evenly over the batter, breaking up any pieces larger than a marble.",
    "Bake and cool: Bake until the crumble is browned and a cake tester or toothpick inserted into the center of the cake slides easily through the apple slices and comes out clean, 1 hour 20 minutes to 1 hour 30 minutes. Transfer to a wire rack and let cool completely.",
    "Serve: Cut around the cake with a paring knife, then remove the ring. Use a serrated knife to cut the cake into slices."
  ]
}