{
  "title": "Double Coconut Meltaways",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 24 (1¼-inch round) cookies",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "¾cup (60 grams) dried unsweetened coconut (in large or medium flakes)",
    "1½cups (195 grams) all-purpose flour",
    "½teaspoon kosher salt",
    "6tablespoons (45 grams) powdered sugar, for cookie dough, plus 1¼ cups (150 grams) sifted, to finish",
    "¾cup (170 grams) virgin coconut oil, firm (not melted)",
    "½teaspoon vanilla extract"
  ],
  "directions": [
    "in a food processor Blend together the coconut flakes, flour, and salt until the coconut is finely ground. Add the 6 tablespoons powdered sugar, and blend again. Add the coconut oil and vanilla, and run the machine until the mixture balls together.",
    "without a food processor You’ll want to start with ½ cup (40 grams) finely ground coconut or coconut flour and stir it together with the flour and salt. Beat the coconut oil with the 6 tablespoons powdered sugar and vanilla. Stir in the dry mixture until just combined.",
    "both methods Should the dough seem too soft to scoop and hold a shape, transfer to the fridge for 5 to 10 minutes.",
    "Heat the oven to 350 degrees. Line two baking sheets with parchment paper.",
    "Scoop the dough into 1-tablespoon-sized balls (I use a #70 scoop and then roll them in my palms briefly), and arrange on the prepared baking sheets an inch or so apart. Then transfer the trays to the freezer until the dough is firm to the touch, about 10 minutes. Bake for 15 to 16 minutes, until the cookies are golden brown underneath and relatively pale on top, but dry to the touch. Let them cool on the baking sheets just until you can pick them up; then, while they’re still quite warm, roll them in the 1¼ cups sifted powdered sugar. Let cool completely on racks. I like to refresh the finish with powdered sugar—either roll the cookies one more time in it, or sprinkle it over the tops, once the cookies are cool."
  ]
}