{
  "title": "Drippy Harissa Eggplant With Spoon-Over Sauce",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "4",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "1large eggplant (1¾ pounds)",
    "⅓cup spicy harissa paste (I love Mina or New York Shuk)",
    "2tablespoons soy sauce",
    "1tablespoon Worcestershire sauce",
    "1tablespoon light brown sugar",
    "Extra-virgin olive oil",
    "4thick slices sourdough bread",
    "⅔cup Sourdough Bread Crumbs (this page)",
    "Diamond Crystal kosher salt",
    "¼cup fresh dill, finely chopped",
    "¼cup fresh chives, finely chopped",
    "1lemon, for squeezing (optional)"
  ],
  "directions": [
    "1. Position a rack in the center of the oven and preheat it to 425°F. Line a sheet pan with parchment paper.",
    "2. Halve the eggplant lengthwise. Score the flesh of the eggplant diagonally, then place the halves flesh-side down on the lined sheet pan. Roast the eggplant until the skin is charred and it looks a bit collapsed, 40 to 45 minutes.",
    "3. While the eggplant is roasting, in a small bowl, whisk together the harissa, soy sauce, Worcestershire sauce, brown sugar, and ⅓ cup water. Set aside.",
    "4. Set a deep sauté pan over medium heat and add 1 tablespoon olive oil. Pan-fry the bread slices, toasting until golden, 2 to 3 minutes on each side. Remove the bread and add the bread crumbs to the pan, toasting them for 3 to 4 minutes, stirring occasionally so as not to burn. Season with salt and transfer the bread crumbs to a small bowl and carefully wipe out the pan.",
    "5. When the eggplant is finished roasting, scrape the flesh out of the skin into a bowl (discard the skin and stem). Place the sauté pan back over medium heat and add 1 tablespoon olive oil. Add the eggplant flesh and the harissa mixture and mix everything together with a spatula to coat. Bring the sauce to a simmer and simmer for 5 to 6 minutes to thicken slightly. Remove the pan from the heat. Scatter the bread crumbs evenly over the eggplant but don’t mix them in.",
    "6. To serve, scoop a generous helping of crumb-topped eggplant onto each slice of bread and spoon over any remaining sauce in the pan. Sprinkle with the chopped dill, chives, and a squeeze of lemon juice (if using) and serve."
  ]
}