{
  "title": "Easy Rough Puff Pastry",
  "source": "Thewoksoflife.com",
  "servings": "Serves: 12",
  "categories": [
    "Other",
    "Other"
  ],
  "ingredients": [
    "6ounces unsalted butter",
    "(170g or 1 1/2 sticks, frozen or very cold)",
    "6 to 7tablespoons ice water",
    "1 ¼cups all-purpose flour (175g)",
    "¼teaspoon salt"
  ],
  "directions": [
    "PREPARE YOUR ROUGH PUFF PASTRY INGREDIENTS:",
    "If using frozen butter, take it out of the freezer to let it warm up just a bit while preparing other ingredients.",
    "Prepare a cup of cold water and add a few ice cubes to it so it gets ice cold.",
    "Place your mixing bowl into the refrigerator for a few minutes to cool it down.",
    "It’s really important to keep the ingredients (especially the butter) cold so the butter and flour do not mix and meld together. The butter should be distributed throughout the dough Keeping the butter and flour separate creates the lamination, or layers, in the puff pastry.",
    "MAKE THE ROUGH PUFF PASTRY DOUGH:",
    "Mix together the flour and salt in your chilled bowl.",
    "Use a hand grater to grate your cold butter on top of the flour and salt. Work quickly so the butter stays cold.",
    "Mix flour, salt, and grated butter together until the mixture turns coarse and crumbly.",
    "Add 6 tablespoons ice water one tablespoon at a time and mix with a rubber spatula before adding the next one until the dough comes together. Add another tablespoon of ice water if you see there is an excess of flour in the bowl and the dough is dry.",
    "Now you can use your hands to press the dough together into a ball and quickly form a rough disk. At this stage, the puff pastry dough will be a little shaggy and streaky which is ok. Make sure you do not overwork the dough.",
    "Immediately wrap your rough puff pastry dough in plastic wrap and chill it in the refrigerator for at least 30 minutes or in the freezer for 15 minutes.",
    "Flour a surface, preferably a stone countertop to keep the dough cool and flour your rolling pin thoroughly as well.",
    "After the dough has chilled, transfer it to a floured surface (reserve the plastic wrap for use again) and use a rolling pin to roll it out into a 6x15 inch rectangle (15x38 cm). Use the rolling pin or your hands to push the edges of the dough inward if they begin to crack; keep your rectangle’s edges straight and not rounded. No need to be obsessive, but neatness does matter to creating uniform layers.",
    "When rolling out the dough, it is important to work quickly to keep the dough cool.",
    "Fold one side of the puff pastry dough over the top of the middle third of the dough and fold the remaining third of the dough on top of that.",
    "Brush off any excess flour from the dough, re-wrap the pastry in the piece of plastic wrap you saved, and chill in the refrigerator for at least 30 minutes or in the freezer for 15 minutes.",
    "I suggest keeping the same rolling surface untouched and ready for the next “turn.”",
    "Roll the dough out again into a 6x15 inch rectangle (15x38 cm).",
    "Fold one side of the puff pastry dough over the top of the middle third of the dough and fold the remaining third of the dough on top of that.",
    "Rotate the dough 90 degrees and repeat the same process, rolling out the dough again into another 6x15 inch rectangle and folding the pastry into thirds.",
    "Brush off any loose flour, wrap the pastry again in plastic, and chill in the refrigerator for another 30 minutes or in the freezer for 15 minutes.",
    "For your third and final turn, repeat the same steps you performed in the second turn. Wrap and return to the refrigerator.",
    "The pastry can be used 90 minutes after the last time you rolled it. You can also leave the pastry in the freezer for up to a month as long as it is sealed tightly in plastic wrap."
  ]
}