{
  "title": "Eggplant Caponata",
  "source": "The Food of Sicily - Fabrizia Lanza",
  "servings": "Serves 8 to 10 as a side dish",
  "categories": [
    "Italian",
    "The Food of Sicily - Fabrizia Lanza"
  ],
  "ingredients": [
    "- Fine sea salt",
    "- 1 small head celery, tough outer stalks discarded, strings removed, sliced",
    "- Vegetable oil, for frying",
    "- 2¼ pounds (1 kg) firm eggplant, peeled and cut into 1-inch (2.5 cm) cubes",
    "- 1 large onion, halved and sliced lengthwise",
    "- ¼ cup (60 ml) olive oil",
    "- 1 cup (180 g) green olives, pitted and cut into thirds",
    "- ⅓ cup (40 g) salt-packed capers, rinsed",
    "- 1½ cups (360 ml) good-quality tomato sauce, homemade (here) or store-bought",
    "- ¼ cup (60 ml) red or white wine vinegar",
    "- 1 tablespoon sugar, plus more as needed",
    "- Chopped fresh flat-leaf parsley, for garnish"
  ],
  "directions": [
    "1. Bring a small saucepan of salted water to a boil. Add the celery and cook until bright green, 1 to 2 minutes. Drain.2. Pour at least 2 inches (5 cm) of vegetable oil into a wide heavy-bottomed pot and heat over medium-high heat until it is hot enough to fry in (see Deep-Frying, here). Line a large plate with paper towels.3. Once the oil is ready, carefully lower as many eggplant cubes as will fit without crowding into the hot oil. Fry, flipping occasionally, until golden brown and tender, 5 to 6 minutes. Use a slotted spoon to transfer the fried eggplant to the paper towels to drain. Sprinkle with salt. Repeat to fry the remaining eggplant cubes.4. In a large pan, sauté the onion in the olive oil over medium heat until just golden, about 5 minutes. Add the blanched celery, olives, capers, tomato sauce, vinegar, and sugar. Taste and season with salt and another pinch of sugar if the mixture is too tart.5. Gently fold in the eggplant, being careful not to smash the cubes. Simmer for 2 to 3 minutes, then transfer to a large bowl or platter and let cool.6. Sprinkle chopped parsley over the caponata and serve at room temperature or chilled."
  ]
}