{
  "title": "Eggplant Polpette",
  "source": "Italian American Don Angie Book",
  "servings": "",
  "categories": [
    "Italian",
    "Italian American - Don Angie"
  ],
  "ingredients": [
    "Polpette",
    "2pounds Japanese eggplants (about 3 large)",
    "¾cup extra-virgin olive oil",
    "½yellow onion, coarsely chopped",
    "¼cup pine nuts, lightly toasted",
    "2tablespoons flat-leaf parsley, finely chopped",
    "¼cup Roasted Garlic Puree (this page)",
    "¼cup Oven-Dried Tomatoes (optional; this page), or store-bought oil-packed sun-dried tomatoes, drained and finely chopped",
    "1large egg",
    "1cup Italian seasoned bread crumbs, store-bought or homemade (this page)",
    "½cup finely grated pecorino cheese (preferably Pecorino Toscano)",
    "¼cup finely grated Parmigiano-Reggiano cheese",
    "2teaspoons kosher salt",
    "¼teaspoon freshly ground black pepper",
    "Breading and frying",
    "1cup all-purpose flour",
    "3large eggs, beaten",
    "1cup Italian seasoned bread crumbs, store-bought or homemade (this page)",
    "Neutral oil, such as vegetable, for deep-frying (about 6 cups)",
    "Kosher salt"
  ],
  "directions": [
    "Preheat the oven to 400°F. Line a sheet pan with parchment paper.",
    "Make the polpette: Halve the eggplants lengthwise and drizzle evenly with the olive oil. Place on the lined sheet pan cut-side up. Roast until the eggplant is fully softened and slightly golden brown, about 20 minutes. Once cool enough to handle, scrape the roasted eggplant flesh into a medium bowl, discarding the skin. Place the flesh in a fine-mesh sieve and let drain for 20 minutes. You should have about 2 cups of eggplant.",
    "In a food processor, puree the chopped onion until smooth. Place the onion puree in a clean towel and wring it to remove all extra moisture. You should have about ¼ cup of wrung onion.Roughly chop the roasted eggplant and place in a medium bowl. Add the onion, pine nuts, parsley, garlic puree, dried tomatoes, egg, bread crumbs, pecorino, parmesan, salt, and pepper and mix with your hands until well incorporated. Chill in the refrigerator for 20 minutes.",
    "Roll the eggplant mixture into 1½-inch balls (about 2 tablespoons each) and arrange on a sheet pan. Return to the refrigerator for another 20 minutes.",
    "Bread the polpette: Set up three bowls for dredging, one with the flour, one with the eggs, and one with the bread crumbs. Working with one ball at a time, roll in the flour to coat evenly and shake off the excess. Dip the ball in the eggs, allowing the excess to drip off. Roll again in the bread crumbs to coat evenly, shaking off the excess. Set aside on the sheet pan and repeat until all of the polpette have been dredged. (The polpette can be held like this for up to 2 days in the refrigerator, and fried just before serving.)",
    "Fry the polpette: Pour 3 or 4 inches oil into a large heavy-bottomed pot or Dutch oven and heat over medium-high heat until it reaches about 325°F.",
    "Working in batches to avoid overcrowding, fry the polpette until golden brown and crispy, 2 to 3 minutes. Drain on paper towels and season with salt while still warm. Repeat the process with the remaining polpette, making sure the oil comes back up to temperature before frying the next batch.",
    "Serve as is or as part of one of the suggestions in the Serving Note.",
    "Leftover polpette will keep, tightly covered in the refrigerator, for up to 4 days. Reheat in a 400°F oven for about 10 minutes before serving."
  ]
}