{
  "title": "Eggplant-Filled Mezzelune with Simple Sauce and Ricotta Salata",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 6 to 8 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Filling",
    "10(1.6 to 1.8kg / 3½ to 4 lb) Japanese eggplants",
    "174g / ¾ cup ricotta",
    "5.5g / 1½ tsp salt, plus more q.b.",
    "To Finish",
    "1batch egg dough (this page)",
    "500g / 2 cups simple red sauce (this page)",
    "Ground red chile, q.b.",
    "120g / 4¼ oz ricotta salata",
    "20 to 25small basil leaves"
  ],
  "directions": [
    "1   To make the filling, heat a grill to medium or preheat your broiler and position an oven rack closest to the heat source.",
    "2   Place the eggplants on the grill or under the broiler. If using the broiler, be sure to arrange the eggplants on a broiler pan or wire rack set in a sheet pan so that air is circulating around them. Grill or broil the eggplants, rotating and flipping them every 5 to 10 minutes, until charred on all sides and very soft in the center, 30 to 45 minutes.",
    "3   Let the eggplants cool at room temperature until cool to the touch.",
    "4   Cut the eggplants open and, using a spoon, scrape out the interior from each one. It should come away from the skins easily. Discard the skins.",
    "5   Line a chinois with cheesecloth or place a fine-mesh strainer over a bowl. Place the eggplant flesh in the chinois or strainer and weight it down with a plate. Transfer to the refrigerator for a minimum of 2 hours or up to 24 hours to allow the excess liquid to seep out. This will prevent the filling from being watery and loose.",
    "6   After the eggplant flesh has drained, transfer it to the bowl of a food processor and puree until smooth, stopping once or twice to scrape down the sides of the bowl to ensure it’s well processed.",
    "7   Place a tamis or fine-mesh strainer over a bowl. Pass the ricotta through the tamis. Add the eggplant to the ricotta and fold until well integrated. Mix in the salt, then taste and add more q.b. It should taste well seasoned. Cover and refrigerate until ready to use.",
    "8   To finish, following the instructions for mezzelune on this page, make 80 to 100 pieces with the pasta dough and filling.",
    "9   Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "10   Place a large sauté pan over low heat. Add the red sauce. Add 1 to 2 ladles (55g to 115g / ¼ to ½ cup) pasta cooking water to the sauté pan and stir to combine.",
    "11   Add the mezzelune to the water and turn down the heat to bring the water to a gentle simmer instead of a rolling boil. It is important to cook these gently at a simmer instead of a boil. The filling is delicate and can break if cooked over high heat. Cook for 1 to 2 minutes, until tender at the thickest closure point.",
    "12   Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Swirl the pasta in the sauce for 30 seconds to 1 minute to marry, using a spoon to gently turn the pasta over and coat all sides. If the sauce begins to tighten, add a splash of pasta cooking water to loosen and continue swirling to marry.",
    "13   Transfer the pasta to a serving platter or divide onto plates and garnish with the ground chile q.b. Coarsely grate the ricotta salata over the top and garnish with the basil leaves."
  ]
}