{
  "title": "Eggplant with Black Bean Sauce",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 1/2 pounds Chinese or Japanese eggplant, cut into 1 1/2-inch pieces",
    "- 1 teaspoon kosher salt",
    "- 1/3 cup plus 3 tablespoons vegetable oil, divided",
    "- 2 garlic cloves, sliced thin",
    "- 1 1/2 tablespoons Sichuan chili flakes",
    "- 1 (1/2-inch) piece ginger, peeled and sliced thin",
    "- 1 star anise pod",
    "- 1/4 cup hoisin sauce",
    "- 1/4 cup douchi (fermented black beans), rinsed",
    "- 1/4 cup plus 2 tablespoons Shaoxing wine, divided",
    "- 1 tablespoon sugar",
    "- 1 green bell pepper, stemmed, seeded, and cut into 1-inch pieces",
    "- 1/4 cup water",
    "- 6 scallions, white parts sliced thin, green parts cut into 1-inch pieces",
    "- 12 sprigs fresh cilantro, cut into 2-inch pieces"
  ],
  "directions": [
    "1. Toss eggplant with salt in a medium bowl. Line a large plate with a double layer of coffee filters and lightly spray with vegetable oil spray. Spread eggplant in an even layer over the prepared plate. Microwave until eggplant feels dry and pieces shrink to about 1 inch, about 10 minutes, flipping eggplant halfway through microwaving. Transfer immediately to a paper towel–lined plate.",
    "2. Cook 1/3 cup oil, garlic, chile flakes, ginger, and star anise in a 14-inch flat-bottomed wok over medium-high heat until sizzling. Reduce heat to low and gently simmer until garlic and ginger are softened but not browned, about 5 minutes. Transfer oil mixture to a medium bowl and let cool for 5 minutes. Stir in hoisin, douchi, 2 tablespoons Shaoxing wine, and sugar. Wipe wok clean with paper towels.",
    "3. Heat the now-empty wok over high heat until just beginning to smoke. Drizzle 2 tablespoons oil around the perimeter of the wok and heat until just smoking. Add eggplant and cook, tossing eggplant slowly but constantly, until pieces are charred on most sides, 5 to 7 minutes. Add remaining 1 tablespoon oil and bell pepper and cook, tossing slowly but constantly, until bell pepper is lightly charred, about 3 minutes.",
    "4. Reduce heat to medium and add remaining 1/4 cup Shaoxing wine and water, scraping up any browned bits. Cook, tossing constantly, until liquid is reduced by half, about 15 seconds. Stir in scallion greens and cook, tossing constantly, until slightly wilted, about 15 seconds. Off heat, stir in garlic–black bean sauce until combined. Top with scallion whites and cilantro and serve."
  ]
}