{
  "title": "Escarole with Anchovy Vinaigrette, Ricotta Salata, and Crispy Garlic",
  "source": "Pasta - Missy Robbins",
  "servings": "4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Vinaigrette",
    "85g / 15 to 18 oil-packed anchovy fillets, finely chopped",
    "3g / 1½ tsp dried red chile flakes",
    "14g / 1 Tbsp red wine vinegar",
    "20g / 1 Tbsp plus 1½ tsp olive oil",
    "Crispy Garlic",
    "224g / 1 cup olive oil",
    "50g / 10 cloves garlic, very thinly sliced on a mandoline",
    "To Finish",
    "1large head escarole",
    "56g / ¼ cup olive oil",
    "Salt, q.b.",
    "20g / 1 Tbsp plus 1 tsp red wine vinegar",
    "1small (20g / ¾ oz) piece ricotta salata"
  ],
  "directions": [
    "1. To make the vinaigrette, combine the anchovies, chile flakes, vinegar, and olive oil in a bowl and mix well. Set aside until ready to use.2. To make the crispy garlic, line a plate with paper towels. Place a sauté pan over low heat and add the olive oil. Add the garlic and cook, stirring occasionally, until the slices begin to turn golden and harden slightly, 3 to 5 minutes. They will curl up a bit and cluster together as they cook, so be sure to stir occasionally to ensure even coloring.3. Using a slotted spoon, remove the garlic and place in one layer on the paper towels to drain. If they aren’t fully crispy, do not worry. They will crisp up as they drain and dry.4. To finish, discard any bruised outer leaves from the escarole, then cut the escarole in half lengthwise and rinse well to remove any dirt from the inner leaves. Pat dry with a kitchen towel.5. Place a large sauté pan over high heat. Add the olive oil.6. Season the cut side of the escarole with salt q.b., making sure to open the leaves to get inside. (The anchovy and ricotta salata are both salty, so don’t go too heavy.)7. Add the escarole, cut side down, to the pan. Place another heavy pan on top of the escarole to weight it down and get the most possible surface contact.8. Cook the escarole until it is golden on the cut surface and wilted but still has a bit of bite, 3 to 5 minutes.9. Turn off the heat and flip the escarole over in the pan. Add the vinegar to the pan. It will create a bit of steam and evaporate rather quickly.10. Using tongs, transfer the escarole, seared side up, to a serving platter. Spoon the vinaigrette over the escarole, shave the ricotta salata over the top, and garnish with the crispy garlic."
  ]
}