{
  "title": "Extremely Fried Eggs with Frizzled Shallots & Rice",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 4 large shallots",
    "DAIRY",
    "- 4 large eggs",
    "PANTRY",
    "- 2 cups sushi rice or other short-grain rice",
    "- Kosher salt",
    "- 1 tablespoon unseasoned rice vinegar",
    "- 5 tablespoons extra-virgin olive oil",
    "- Shichimi togarashi and/or chile oil, hot sauce, or red pepper flakes, for serving (optional)"
  ],
  "directions": [
    "1. Start the rice:",
    "- Rinse 2 cups sushi rice in a fine-mesh strainer, swirling the rice vigorously as you rinse it, until the water runs clear, 1 to 2 minutes.- Combine the rinsed rice with 2½ cups cold water and ½ teaspoon salt in a medium saucepan. Bring to a simmer over medium-high heat. As soon as it does, cover the pot with a tight-fitting lid and reduce the heat to very low. Cook for 16 minutes (set a timer), then turn off the heat and let the rice steam, covered, for 10 more minutes. Stir in 1 tablespoon rice vinegar and fluff with a fork. Cover to keep warm.",
    "2. Meanwhile, frizzle the shallots:",
    "- Thinly slice 4 large shallots crosswise to create lots of thin rings.- In a large nonstick skillet, combine 3 tablespoons olive oil and the shallots and cook over medium heat, stirring often, until they turn deep golden brown, even charred and crispy around the edges, 10 to 14 minutes. Transfer the frizzled shallots to a small plate and season with a pinch of salt. Wipe out the skillet.",
    "3. Fry the eggs:",
    "- Add 2 tablespoons olive oil to the nonstick skillet and set over medium heat for 2 minutes, to allow the oil to get hot. Crack 4 eggs into the skillet (be careful, they may spatter a bit!) and cook, spooning some of the oil up over the whites, until the edges are brown and lacy and the whites are set, 3 to 5 minutes. This is called basting, and it’s a technique you can apply to many ingredients. Season with salt.",
    "4. Assemble and serve:",
    "- Put a scoop of rice into each bowl. Top each with a fried egg, some frizzled shallots, and shichimi togarashi and/or chile oil (or any other fun spicy condiment you have on hand)."
  ]
}