{
  "title": "Fall-Toush Salad With Delicata Squash And Brussels Sprouts",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 2 large or 4 small servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "salad",
    "3tablespoons (45 ml) olive oil",
    "1¼pounds (565 grams) delicata squash (about 1 medium squash)",
    "Kosher salt and freshly ground black pepper or Aleppo-pepper flakes to taste",
    "½pound (225 grams) brussels sprouts",
    "1large pita bread",
    "2scallions, thinly sliced",
    "About 1 tablespoon finely chopped mint leaves",
    "About 1 tablespoon finely chopped flat-leaf parsley or cilantro leaves",
    "Ground sumac or paprika, to finish",
    "dressing",
    "2teaspoons (10 grams) ground sumac or paprika",
    "2teaspoons (10 ml) warm water",
    "1 to 2tablespoons (15 to 30 ml) lemon juice",
    "1small garlic clove, minced",
    "1teaspoon (5 ml) white wine vinegar",
    "¼cup (60 ml) olive oil",
    "Salt and freshly ground black pepper or Aleppo pepper flakes"
  ],
  "directions": [
    "prepare the vegetables Heat the oven to 400 degrees. Coat two baking sheets with a tablespoon or so of olive oil each.",
    "Cut the ends from the delicata squash, and scrape out the seeds with a spoon. (Did you know you can toast these like pumpkin seeds for a crispy garnish? You can!) Slice the squash into ½-inch-thick rings, then cut each ring into 1-to-2-inch chunks. Spread them on the first baking sheet in one layer; sprinkle with salt and pepper. Roast for 20 to 25 minutes, until bronzed underneath; then flip and roast for another 8 to 10 minutes, until browned at the edges and tender in the center. Set aside to cool slightly.",
    "Meanwhile, trim the ends and any discolored leaves from the brussels sprouts, and halve them lengthwise. Spread, cut side down, on the second baking sheet; sprinkle with salt and pepper. Roast for 15 minutes, then flip the sprouts and roast them for another 5 to 10 minutes, until toasty and crisp. Set aside to cool slightly.",
    "prepare the pita chips Split the pita into two layers, and cut or tear into large bite-sized chunks. Toss in a bowl with the remaining olive oil and a couple pinches of salt. Spread on a baking sheet, and toast in oven with vegetables for 5 to 8 minutes, until golden and crisp.",
    "make the dressing Soak the sumac in water for 5 minutes, then whisk in the remaining dressing ingredients. Adjust the seasonings to taste; you may find you need more lemon juice or vinegar.",
    "assemble the salad In a medium-large bowl, combine the warm roasted vegetables and scallions. Toss with half to two-thirds of the dressing, or to taste. Stir in the chopped herbs, then the pita chips; add more dressing, and adjust the salt and pepper levels if needed. Sprinkle with sumac to finish, and serve.",
    "do ahead Keep the roasted vegetables separate from the pita chips until ready to serve, so the chips don’t get soggy."
  ]
}