{
  "title": "Feta-Za’atar Flatbread with Charred Eggplant Dip",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves: Makes eight 8-inch flatbreads and 3½ cups dip",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "Charred Eggplant Dip",
    "2large eggplants (about 1 lb / 454g each)",
    "1cup labneh or plain whole-milk Greek yogurt (8.5 oz / 240g)",
    "½cup finely chopped fresh flat-leaf parsley",
    "2tablespoons fresh lemon juice",
    "1medium garlic clove, finely grated",
    "2teaspoons Diamond Crystal kosher salt (0.21 oz / 6g)",
    "½teaspoon ground cumin",
    "¼cup extra-virgin olive oil (2 oz / 57g), plus more for drizzling",
    "½teaspoon hot smoked paprika, plus more for serving",
    "Flatbread",
    "8pieces Soft and Pillowy Flatbread dough, prepared through the second rise",
    "¼cup za’atar",
    "¼cup extra-virgin olive oil (2 oz / 57g), plus more for rolling out",
    "8ounces (227g) feta cheese, crumbled (about 1½ cups)"
  ],
  "directions": [
    "Preheat the grill for the eggplant: Turn the burners of a gas grill to medium-high or prepare a charcoal grill for medium-high heat. (Alternatively, position an oven rack directly underneath the broiler and preheat the broiler.)",
    "Char the eggplant: Poke several holes in the eggplants and cook on the grill grates, turning once, until the flesh is collapsed, the skin is charred and brittle, and the eggplants are releasing water, 20 to 25 minutes. (Alternatively, place the eggplants on a foil-lined baking sheet and broil, turning once.) Remove the eggplants from the heat and set aside to cool.",
    "Scoop and drain the flesh: When the eggplants are cool enough to handle, use a spoon to scoop the soft flesh and seeds into a sieve, discarding the blackened skins and stems. You should have about 1 cup. Allow the flesh to drain for 10 minutes so it gives off some of its liquid.",
    "Mix the eggplant dip: In a food processor, combine the drained eggplant, labneh, parsley, lemon juice, garlic, salt, cumin, olive oil, and hot smoked paprika and process, scraping down the sides once, until the mixture is very smooth and almost whipped, about 1 minute. (Alternatively, you can mash all the ingredients together in a bowl by hand, but the dip will be a bit coarse.) Cover and set the dip aside.",
    "Have the dough ready: Set up the flatbread dough through its second rise (portioned into balls, covered with a damp towel, and risen on the baking sheet), then transfer to the refrigerator.",
    "Make the za’atar oil: In a small bowl, stir together the za’atar and olive oil to combine. Set aside.",
    "Stuff the flatbreads: Remove a piece of dough from the baking sheet (keeping the rest covered and in the refrigerator) and place it on an unfloured work surface. Roll out the dough to a squarish shape about 8 inches across. The dough will be very relaxed and should only require a small amount of pressure with the pin, but don’t add any flour since the friction with the surface will help the dough extend.",
    "Sprinkle 3 tablespoons (about 1 oz) of feta cheese all across the surface of the dough.",
    "Starting at one end, roll the dough into a thin log like a jelly roll.",
    "Starting from one end, coil the log into a spiral so it looks like a snail shell.",
    "Place the spiral flat on the baking sheet in the refrigerator and tuck it under the towel.",
    "Repeat the stuffing and coiling process with the remaining feta and pieces of dough until you’ve formed all 8 snails.",
    "Preheat the skillet: Heat a griddle or a large, dry skillet (preferably cast-iron) over medium heat for several minutes.",
    "Roll the stuffed flatbreads and cook: Lightly oil two 10-inch pieces of parchment paper. Remove one piece of dough at a time from the refrigerator and lay it between the oiled sides of the parchment. Roll it into a thin round about 8 inches in diameter (roundish is okay; the shape isn’t important!).",
    "Peel off the top piece of parchment, then use the other piece to transfer the flatbread to the preheated griddle or skillet, placing it dough-side down and peeling away the second piece of parchment (you’ll reuse both sheets for the other pieces of dough). Cook until the bottom is lightly charred all over and the surface of the dough has bubbled up and gone from shiny and sticky to matte and dry, about 2 minutes. Adjust the heat as needed if the dough isn’t taking on color or is charring very quickly.",
    "Turn and top with the za’atar oil: Use a pair of tongs to flip the flatbread and drizzle the first side with about 1 tablespoon of the za’atar oil, spreading with the back of a spoon to cover the entire surface. Continue to cook until the second side is lightly charred all over and the dough is cooked through, another minute. Transfer to a cooling rack.",
    "Roll and cook the remaining flatbreads: Repeat the rolling and cooking process with the remaining dough and za’atar oil, one flatbread at a time if you’re cooking in a skillet, until they’re all cooked.",
    "Serve: Transfer the eggplant dip to a serving bowl and make a swirl on the top with a spoon. Drizzle with more olive oil and top with a few extra pinches of paprika. Serve with the flatbreads."
  ]
}