{
  "title": "Fettuccine al Ragù",
  "source": "My Kitchen in Rome - Rachel Roddy",
  "servings": "Serves 4 generously",
  "categories": [
    "Italian",
    "My Kitchen in Rome - Rachel Roddy"
  ],
  "ingredients": [
    "1white onion",
    "1carrot",
    "1celery stalk",
    "2ounces pancetta or unsmoked bacon",
    "3tablespoons extra-virgin olive oil",
    "4tablespoons butter",
    "1bay leaf",
    "14ounces ground beef",
    "10½ounces ground pork",
    "¾cup red or white wine",
    "1tablespoon tomato paste dissolved in 6 tablespoons warm water",
    "salt and freshly ground black pepper",
    "⅔cup whole milk",
    "1pound egg fettuccine, tagliatelle, or farfalle, ideally fresh (here), but best-quality dried if not",
    "5tablespoons grated Parmesan"
  ],
  "directions": [
    "Finely chop the onion and carrot along with the celery and pancetta. Some people like to do this in a food processor. In a large, heavy-bottomed saucepan or deep frying pan with a lid, heat the olive oil and butter, add the vegetables and pancetta with the bay leaf and cook over low heat until they are soft and fragrant and the pancetta has rendered much of its fat and is starting to color. This will take about 8 minutes.",
    "Increase the heat slightly, then crumble the ground meat into the pan and cook, stirring pretty continuously, until the meat has lost all its pink color and has browned evenly. Add the wine, turn up the heat, and let it evaporate for a couple of minutes before adding the tomato. Simmer, covered, over low heat for 30 minutes, by which time the sauce should have deepened in color and have very little liquid. Add a teaspoon of salt, lots of black pepper, and a little of the milk. Cook slowly, covered, for another hour over low heat, every so often lifting the lid and adding a little of the milk until it is used up. The sauce should be rich and thick with no liquid, but not dry either, so keep a careful eye on it.",
    "When you’re ready to eat, bring a large pot of water to a fast boil and, if it isn’t already hot, gently reheat the ragù. Warm a serving bowl. Once the water has come to a fast boil, add salt, stir, gently drop in the pasta, and cook, stirring every now and then, until it is al dente. For fresh fettuccine or tagliatelle this will only take a few minutes, but farfalle will take slightly longer. For dried pasta, check the timing on the package and start tasting 2 minutes earlier. Drain the pasta and turn it into the serving bowl (reserving a little pasta-cooking water), sprinkle over the cheese, then add the sauce. Stir carefully, lifting the pasta from below with two wooden spoons, so it is well coated with sauce. If it seems a bit dry, cautiously add a little of the reserved pasta-cooking water and toss again. Serve."
  ]
}