{
  "title": "Fileja alla ’Nduja (Pasta with ’Nduja and Tomato Sauce)",
  "source": "Pasta - Missy Robbins",
  "servings": "Servings: 4 to 6",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Sauce:",
    "42g / 3 Tbsp olive oil",
    "25g / 5 garlic cloves, finely chopped",
    "½tsp fennel seed, coarsely ground in a spice mill or with a mortar and pestle",
    "1large (794g / 28 oz) can San Marzano tomatoes, crushed by hand",
    "200g / 7 oz ’nduja, casing removed and discarded and finely chopped",
    "To Finish:",
    "1batch semolina dough (this page)"
  ],
  "directions": [
    "1. To make the sauce, place a large, heavy sauce pot or Dutch oven over low heat. Add the oil and garlic and gently cook until aromatic but without color, 15 to 30 seconds.",
    "2. Add the fennel seed and tomatoes and their juice and stir to combine. Turn the heat up to medium-low and cook at a slow simmer until the rawness of the tomatoes is cooked out and the flavors have melded, 15 to 20 minutes. You are not looking to reduce the sauce.",
    "3. Gradually add the ’nduja while stirring to break it up as you incorporate it.",
    "4. Remove from the heat. Measure out 342g / 1¼ cups sauce and set aside. Transfer the remainder to an airtight container and refrigerate for up to 5 days or freeze for up to 1 month for another use.",
    "5. To finish, following the instructions for fileja on this page, make 624g / 1 lb 6 oz from the pasta dough.",
    "6. Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "7. Place a large sauté pan over low heat. Add the sauce.",
    "8. Add the fileja to the water and cook until tender, 3 to 5 minutes.",
    "9. Using a pasta basket or spider, remove the pasta from the pot and transfer to the sauté pan. Toss for 1 to 2 minutes to marry the pasta and the sauce. If the sauce begins to tighten, add a splash of pasta cooking water to loosen and continue tossing to marry. The sauce should evenly coat the pasta.",
    "10. Transfer the pasta to a serving platter or divide into bowls."
  ]
}