{
  "title": "Flat Hand-Pulled Noodles",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Servings: 4",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "Dough",
    "- 21/3 cups (123/4 ounces) bread flour",
    "- 3/4 teaspoon table salt",
    "- 1 cup (8 ounces) water",
    "- 1 tablespoon vegetable oil",
    "Chili Oil Vinaigrette",
    "- 1/4 cup Sichuan chili flakes",
    "- 1/2 cup vegetable oil",
    "- 2 garlic cloves, sliced thin",
    "- 1 (1-inch) piece ginger, peeled and sliced thin",
    "- 1 tablespoon Sichuan peppercorns",
    "- 1/2 cinnamon stick",
    "- 1 star anise pod",
    "- 2 tablespoons soy sauce",
    "- 2 tablespoons Chinese black vinegar",
    "- 1 tablespoon toasted sesame oil",
    "- 1 teaspoon sugar",
    "- 1 tablespoon table salt",
    "- 12 sprigs fresh cilantro, trimmed and cut into 2-inch pieces",
    "- 6 scallions, sliced thin"
  ],
  "directions": [
    "1. For the dough: Whisk flour and salt together in bowl of stand mixer. Add water and oil. Fit stand mixer with dough hook and mix on low speed until all flour is moistened, 1 to 2 minutes. Increase speed to medium and knead until dough is smooth and satiny, 10 to 12 minutes. Transfer dough to counter, knead for 30 seconds, and shape into 9-inch log. Wrap log in plastic wrap and refrigerate for at least 12 hours or up to 48 hours.",
    "2. For the chili oil vinaigrette: Place chili flakes in large heatproof bowl. Place fine-mesh strainer over bowl and set aside. Combine vegetable oil, garlic, ginger, peppercorns, cinnamon stick, and star anise in small saucepan and heat over medium-high heat until sizzling. Reduce heat to low and gently simmer until garlic and ginger are slightly browned, 10 to 12 minutes. Pour through strainer into bowl with chili flakes; discard solids in strainer. Stir chili oil to combine and let cool for 5 minutes. Stir in soy sauce, vinegar, sesame oil, and sugar until combined; set aside.",
    "3. Unwrap dough, transfer to lightly oiled counter, and, using bench scraper or knife, divide into 6 equal pieces (each 11/2 inches wide). Cover with plastic and let rest for 5 minutes. Meanwhile, bring 4 quarts water and salt to boil in large pot; reduce heat to low and cover to keep hot. Working with 1 piece at a time, oil both sides of dough and flatten into 7 by 3-inch rectangle, with long side parallel to edge of counter. With both hands, gently grasp short ends of dough. Stretch dough and slap against counter until noodle is 32 to 36 inches long (noodle will be between 1/16 and 1/8 inch thick). Place noodle on counter. Pinch center of noodle with forefinger and thumb of each hand and pull apart with even pressure in both directions to rip seam in middle of noodle and create 1 continuous loop. Cut loop to create 2 equal-length noodles. Set noodles aside on lightly oiled counter (do not let noodles touch) and cover with plastic. Repeat stretching and cutting with remaining pieces of dough.",
    "4. Return water to boil over high heat. Add half of noodles to water and cook, stirring occasionally, until noodles float and turn chewy-tender, 45 to 60 seconds. Using wire skimmer, transfer noodles to bowl with chili vinaigrette; toss to combine. Return water to boil and repeat with remaining noodles. Divide noodles among individual bowls, top with cilantro and scallions, and serve."
  ]
}