{
  "title": "Flourless Chocolate Wave Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 10",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 9-inch springform pan, stand or hand mixer",
    "Neutral oil and sugar for the pan",
    "10ounces (283g) semisweet chocolate (preferably 66 to 68% cacao), coarsely chopped (1⅔ cups)",
    "½cup neutral oil, such as vegetable or grapeseed (4 oz / 112g)",
    "3tablespoons amaretto or dark rum (1.5 oz / 43g)",
    "6large eggs (10.6 oz / 300g), separated",
    "½cup almond flour (2.1 oz / 60g), sifted if needed to break up lumps",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "½cup plus 2 tablespoons sugar (4.4 oz / 125g)",
    "1teaspoon vanilla extract"
  ],
  "directions": [
    "Preheat the oven and prepare the pan: Arrange an oven rack in the center position and preheat the oven to 350°F. Brush the bottom and sides of the springform pan with oil, making sure to coat it all the way to the rim. Dust the inside of the pan with sugar, rotating the pan to coat the entire surface, then tap out the excess. Set the pan aside.",
    "Melt the chocolate mixture: In a large heatproof bowl, combine the chocolate, oil, amaretto, and ¼ cup of water (2 oz / 57g). Fill a medium saucepan with about 1 inch of water and bring to a simmer over medium-low heat. Reduce the heat to maintain a gentle simmer and set the bowl over the pan (the bottom of the bowl shouldn’t touch the water). Stir often with a heatproof spatula just until the chocolate is melted and the mixture is completely smooth. Remove from the heat and set aside to cool slightly.",
    "Whisk in the yolks and almond flour: Thoroughly whisk the yolks into the cooled chocolate mixture. It might look separated, which is normal. Whisk in the almond flour until the mixture comes back together and looks smooth and glossy. Set the bowl aside.",
    "Whip the egg whites: In a stand mixer fitted with the whisk attachment (or in a large bowl if using a hand mixer), beat the egg whites and salt on low speed to just to break up the whites. Increase the speed to medium-high and beat until the whites form soft peaks. Gradually add ½ cup of the sugar (3.5 oz / 100g) in a slow, steady stream, beating constantly. Once all the sugar is added, increase the mixer to high and continue to beat just until the meringue is very dense and glossy and forms a stiff peak off the end of the whisk. Beat in the vanilla.",
    "Fold the meringue into the chocolate mixture: Transfer about one-quarter of the meringue to the bowl with the chocolate mixture and whisk until a few streaks remain. Add the remaining meringue in 2 additions, gently folding it into the chocolate mixture each time with a large flexible spatula in order to maintain the airiness of the meringue. Don’t worry if a few streaks remain in the batter; it’s preferable to mix it less rather than more.",
    "Fill the pan and bake: Gently pour the batter into the prepared pan and smooth the top. Sprinkle the surface with the remaining 2 tablespoons sugar. Bake until the top is crisp, the cake has dramatically risen, and a cake tester or toothpick inserted into the center comes out with a few moist crumbs, 30 to 35 minutes. Remove the pan from the oven and let the cake cool completely on a wire rack. It will gradually fall and slump in places, making wavy lines all the way around."
  ]
}