{
  "title": "Fluffy Popovers with Melted Brie & Blackberry Jam",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "12 Popovers",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "2tablespoons butter, melted, plus more for the muffin tin",
    "1¾cups milk",
    "4eggs, beaten",
    "1¾cups all-purpose flour",
    "½teaspoon salt",
    "6ounces Brie cheese, rind removed",
    "Blackberry Jam (recipe follows), or any jam you like",
    "Blackberry Jam",
    "Makes 1¼ cups",
    "3cups blackberries",
    "¾cup sugar",
    "3tablespoons lemon juice",
    "½teaspoon finely grated lemon zest",
    ""
  ],
  "directions": [
    "Preheat the oven to 425°F. Generously butter 12 cups of a standard muffin tin.",
    "Place the milk in a large microwave-safe bowl and warm in the microwave just to get the chill off of it, about 1 minute. Whisk in the eggs, 2 tablespoons melted butter, flour, and salt until smooth. Place the muffin tin in the oven to preheat for 2 to 3 minutes (if you go much more, the butter could start to smoke or burn).",
    "Remove the pan from the oven and, working fasssssst (but don’t burn yourself!), add ¼ cup batter to each muffin cup. Bake until puffed and dark golden (they will be in no way symmetrical and will have puffed out in all sorts of directions), 20 to 25 minutes.",
    "During the last minute of cooking, place the Brie in a microwave-safe bowl and microwave until melted, about 30 seconds.",
    "Remove the popovers from the oven and immediately poke the tops open and drop some of the melted Brie inside each popover. Top with a dollop of jam.",
    "Blackberry Jam",
    "In a smallish, wide saucepan, combine the blackberries, sugar, and 2 tablespoons of the lemon juice. Bring to a boil over medium-high heat, reduce the heat, and cook at a simmer, stirring often and mashing the fruit (use a potato masher if you’ve got one!), until the mixture has thickened and is glossy, about 20 minutes. Remove from the heat and stir in the remaining 1 tablespoon lemon juice and the zest. (It may look like the jam loosens too much when the lemon juice is added, but it firms back up as it cools so don’t sweat it.) You can keep it in a jar in the fridge for a couple weeks."
  ]
}