{
  "title": "Focaccia with Black Olives and Rosemary",
  "source": "The Food of Sicily - Fabrizia Lanza",
  "servings": "Serves 8 to 10",
  "categories": [
    "Italian",
    "The Food of Sicily - Fabrizia Lanza"
  ],
  "ingredients": [
    "For the Dough:",
    "- 1 tablespoon active dry yeast",
    "- ½ teaspoon sugar",
    "- 1½ cups (360 ml) lukewarm water",
    "- 6¼ cups (1 kg) semolina flour",
    "- 1 tablespoon fine sea salt",
    "- 1 cup (240 ml) olive oil, plus more for the bowl, pan, and hands",
    "- 1 cup (240 ml) white wine",
    "For the Topping:",
    "- ¾ cup (100 g) black olives, pitted",
    "- Leaves from 2 sprigs of fresh rosemary",
    "- Big pinch of flaky sea salt",
    "- Olive oil, for drizzling"
  ],
  "directions": [
    "1. Make the dough: In a small bowl, mix together the yeast, sugar, and 2 tablespoons of the water. Set aside at room temperature until creamy, about 5 minutes. If the yeast doesn’t bubble at all, throw it out and start over with new yeast.2. In a large bowl, combine the semolina, fine salt, and yeast mixture. Add about half of the remaining water and mix with your hands. Mix in the olive oil and wine until incorporated, then add enough of the remaining water to make a shaggy dough.3. Turn the dough out onto a work surface and knead until smooth but still quite sticky, about 8 minutes. Shape the dough into a ball and transfer to a large oiled bowl. Cover the bowl with a clean kitchen towel and let the dough rise in a warm, draft-free place until doubled in size, about 1 hour.4. Preheat the oven to 400°F (200°C). Oil an 18-by-13-inch (46 by 33 cm) sheet pan.5. With oiled hands, press and stretch the dough to fill the prepared pan, adding more olive oil as needed to keep the dough from sticking. Let rise for another 10 minutes.6. Top the dough: Pat the dough with your fingertips to make dimples all over it. Scatter the olives on top, sprinkle with rosemary and flaky salt, and drizzle with olive oil.7. Bake until golden, about 30 minutes. Let cool slightly before cutting into squares."
  ]
}