{
  "title": "Foolproof Tarte Tatin",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "7Medium Or 8 Small Pink Lady Or Any Sweet-Tart, Firm Baking Apples (About 3 Lb / 1.36Kg)",
    "⅔Cup Maple Syrup (7 Oz / 200G)",
    "⅓Cup Brandy (2.6 Oz / 74G), Preferably Apple Brandy",
    "2Teaspoons Apple Cider Vinegar (0.3 Oz / 8G)",
    "½Teaspoon Plus A Pinch Of Diamond Crystal Kosher Salt",
    "1Cup Sugar (7 Oz / 200G)",
    "3Tablespoons Unsalted Butter (1.5 Oz / 43G), Cut Into ½-Inch Pieces",
    "½Recipe Rough Puff Pastry (This Page) Or 1 Sheet Thawed Frozen Puff Pastry",
    "All-Purpose Flour, For Rolling Out",
    "Vanilla Ice Cream, For Serving"
  ],
  "directions": [
    "Preheat The Oven:Arrange An Oven Rack In The Center Position And Preheat The Oven To 275°F.",
    "Roast The Apples:Shave Off A Layer Of Flesh From The Stem And Bottom Ends Of The Apples So They Stand Upright. Peel The Apples, Then Cut Them In Half Through The Stem. Use A Melon Baller Or Round Teaspoon Measure To Scoop Out The Cores And Seeds, Then Slice Out Any Remaining Areas Of Core Or Stem. Stand The Apple Halves Upright In A 10-Inch Ovenproof Skillet (It Will Be A Tight Fit). Pour The Maple Syrup, Brandy, And 1 Teaspoon Of The Vinegar Over The Apples And Add A Pinch Of Salt. Cover The Skillet With Foil And Crimp Around The Edges To Create A Steam-Tight Seal.",
    "Transfer To The Oven And Roast The Apples Just Until A Cake Tester Or Toothpick Slides Easily Through The Flesh, 1 Hour 15 Minutes To 1 Hour 45 Minutes, Depending On Firmness. They Should Be Cooked Just Beyond “Al Dente,” But Not So Much That They Break Apart And Turn Into Mush. (If You’re Unsure, Err On The Side Of Slightly Less Cooked, But Even Slightly Overcooked Apples Will Still Make A Great Tart.) The Apples Will Turn Brown During Roasting, Which Is Fine Because They’re Going To Caramelize In The Tart.",
    "Chill The Apples:Leaving The Juices In The Skillet, Carefully Transfer The Hot Apples To A Large Plate And Refrigerate Uncovered Until Cold, At Least 20 Minutes And Up To Overnight (If Chilling Longer Than 20 Minutes, Cover The Apples). Don’t Clean The Skillet—You’ll Use It In The Next Step.",
    "Cook Down The Apple Juices To Make The Glaze:Place The Skillet With The Apple Juices Over Medium-Low Heat And Bring The Juices To A Vigorous Simmer. Cook, Swirling The Skillet Often, Until The Liquid Is Thick And Syrupy, About 2 Minutes. Transfer The Syrup To A Heatproof Cup Or Container (You Should Have Between ⅓ And ½ Cup) And Set Aside For Glazing. Rinse And Dry The Skillet.",
    "Make The Caramel:Sprinkle A Few Tablespoons Of The Sugar Across The Bottom Of The Skillet In An Even Layer. Cook Undisturbed Over Medium Heat Until Most Of The Granules Are Melted Into A Clear Liquid, About 4 Minutes. Sprinkle Another Layer Of Sugar On Top Of The First And Cook, Stirring Around The Sides Of The Skillet With A Heatproof Spatula To Move The Melted Sugar Toward The Center, Until Mostly Melted, Another Minute Or So. Repeat A Few More Times Until You’ve Used The Entire 1 Cup Sugar (7 Oz / 200G) And All Of It Is Mostly Melted (There May Be A Solid Clump Here And There), 6 To 8 Minutes. Continue To Cook The Sugar, Stirring Occasionally, Until It Turns A Deep Amber Color, Moves Very Fluidly, And Releases Wisps Of Smoke, About 5 Minutes. Remove The Skillet From The Heat And Slowly Stir In The Butter One Piece At A Time, Taking Care Because The Caramel Will Sputter, Until The Mixture Is Smooth. Stir In The Salt And Remaining 1 Teaspoon Vinegar And Set The Skillet Aside To Cool Until The Caramel Is Hardened, 10 To 15 Minutes.",
    "Arrange The Apples In The Skillet:Place The Chilled Apples Rounded-Side Down In The Skillet, Overlapping Them As Needed To Minimize Gaps. Depending On The Size Of Your Apples, You Might Have An Extra Half Left Over, But Try To Fit Them Very Tightly As They’ll Shrink Some During Baking. Refrigerate The Skillet While You Roll Out The Pastry.",
    "Preheat The Oven:Arrange An Oven Rack In The Center Position And Preheat The Oven To 425°F.",
    "Roll Out And Cut The Pastry:Remove The Pastry From The Refrigerator And Let It Soften At Room Temperature For About 5 Minutes. Unwrap The Dough And Place It On A Lightly Floured Surface. Use A Rolling Pin To Beat The Dough All Across The Surface To Make It More Pliable. Dust Over Top And Underneath The Dough With More Flour, Then Roll Out, Dusting With More Flour As Needed, To A 12-Inch Round. If Using Thawed Frozen Puff Pastry, Gently Roll Out The Pastry On A Lightly Floured Surface To Smooth Any Creases And Widen So It’s About 12 Inches Across In All Directions. Set An 11-Inch Dinner Plate (Or An 11-Inch Parchment Round) On Top Of The Dough And Cut Around It With A Sharp Knife Or A Wheel Cutter To Create An 11-Inch Pastry Round. Prick It All Over With A Fork.",
    "Cover The Apples With The Pastry And Chill:Drape The Pastry Over The Apples And Use A Large Spoon To Tuck The Edges Of The Pastry Down Between The Apples And The Sides Of The Skillet. Refrigerate The Skillet For 10 To 15 Minutes To Firm Up The Pastry.",
    "Bake The Tart:Transfer The Skillet To The Oven And Bake The Tart For 20 Minutes, Then Reduce The Temperature To 350°F And Bake Until The Pastry Is Puffed, Golden Brown All Over, And The Caramel Is Bubbling Around The Sides, Another 35 To 45 Minutes. Carefully Remove The Skillet From The Oven And Set It Aside To Rest For 5 To 10 Minutes.",
    "Invert The Tart:Working Over A Sink To Catch Any Flowing Juices, Carefully Invert The Skillet Onto A Wire Cooling Rack. Remove The Skillet And Scrape Off Any Apples That May Have Stuck, Pressing Them Back Into Place On The Tart.",
    "Glaze The Tart And Serve:While The Tart Is Still Warm, Use A Pastry Brush To Dab The Reserved Reduced Juices Over The Apples To Give Them A High Gloss (Don’t Feel The Need To Use All The Glaze). If The Glaze Is Very Thick, Warm It Briefly Until It’s More Fluid. Slide The Tart Off The Rack Onto A Plate, Slice, And Serve Warm Or At Room Temperature With Vanilla Ice Cream."
  ]
}