{
  "title": "Fragrant Chili Fried Rice with Herbs",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Serves 4",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "For the Sauce:",
    "- ½ cup thinly sliced serrano chilies (about 6)",
    "- 2 tablespoons soy sauce",
    "- 1 tablespoon granulated sugar",
    "- ½ teaspoon kosher salt",
    "- ½ teaspoon gochugaru (Korean chili flakes)",
    "For the Dish:",
    "- ¼ cup plus 1 tablespoon extra-virgin olive oil",
    "- 2 tablespoons thinly sliced garlic",
    "- 12 drained oil-cured Calabrian chilies, stemmed and halved lengthwise",
    "- 4 cups freshly cooked jasmine rice",
    "- 1 tablespoon Mushroom Seasoning Powder, homemade or store-bought",
    "- ½ cup sliced (½-inch half-moons) red onions",
    "- ½ cup sliced (½ inch) seeded red, yellow, or orange bell peppers",
    "- Big handful torn mixed herbs like basil, mint, and perilla leaves or shiso leaves",
    "- 1 cup thinly sliced or crumbled roasted seaweed"
  ],
  "directions": [
    "1. MAKE THE SAUCE:- COMBINE all the ingredients with 2 tablespoons water in a blender and blend on high speed until very smooth.",
    "2. MAKE THE DISH:- COMBINE ¼ cup of the oil and the garlic in a large skillet, set it over high heat, and let it start to sizzle. Cook, stirring, until the garlic is fragrant but not colored, about 30 seconds. Stir in the Calabrian chilies and turn off the heat. Fold in the rice to coat it in the oil.",
    "3. COMBINE the mushroom seasoning powder and 1 tablespoon warm water in a bowl, stir to dissolve, and add the mixture to the skillet. Keep folding to gently mix well and eliminate any rice clumps. Turn the heat back to high and cook, stirring gently, just until hot all the way through. Turn off the heat and set aside.",
    "4. SET a large cast-iron skillet or fajita platter over medium heat for 3 to 5 minutes, so it gets really hot. Toss the onions and peppers with the remaining 1 tablespoon olive oil in a small mixing bowl. When the skillet is hot, add the onions and peppers in a single layer and watch them sizzle and smoke. Add the rice on top of the vegetables in a more or less even layer, turn off the heat, then pour the sauce evenly over the rice.",
    "5. SPRINKLE on the herbs and roasted seaweed and serve."
  ]
}