{
  "title": "Freekeh with Crunchy Seeds, Charred Eggplant, and Yogurt-Tahini Sauce",
  "source": "Shuk From Market to Table",
  "servings": "Serves 4 to 6",
  "categories": [
    "Israel",
    "Shuk - From Market to Table"
  ],
  "ingredients": [
    "1cup (155 g) freekeh",
    "2quarts (2 L) boiling water",
    "1teaspoon kosher salt, plus more as needed",
    "3tablespoons extra-virgin olive oil",
    "3tablespoons hulled pumpkin seeds (pepitas)",
    "2tablespoons pine nuts",
    "2tablespoons hulled sunflower seeds",
    "2tablespoons dried barberries or coarsely chopped unsweetened dried cranberries",
    "4tablespoons fresh lemon juice",
    "1large or 2 small eggplants, charred (see page 97)",
    "1jalapeño chile, roasted, cored, peeled, seeded, and chopped (see page 155)",
    "½cup (120 ml) Yogurt-Tahini Sauce (page 114)",
    "Cilantro leaves"
  ],
  "directions": [
    "Rinse the freekeh a few times in a bowl of cool water until the water runs clear. Transfer to a medium pot, pour in the boiling water, and add the salt. Bring the water back to a rapid boil and cook until the grains are tender but still have a little bit of bite, 20 to 25 minutes. Transfer to a colander and rinse under cold water to stop the cooking. Set aside.",
    "Line a plate with paper towels. Heat about 1½ tablespoons of the oil in a small skillet over medium heat. Add the pumpkin seeds, reduce the heat to medium-low, and fry, shaking the skillet and stirring frequently, for 2 minutes. Add the pine nuts and sunflower seeds and fry for another minute. Remove from the heat as soon as the pine nuts start to change their color to golden. Spread the contents of the skillet over the paper towels to drain. Strain the oil and set aside.",
    "Combine the freekeh with the nuts and seeds in a large bowl. Pour in the remaining 1½ tablespoons oil and the oil reserved from frying the seeds. Add the barberries and 3 tablespoons of the lemon juice, season with salt, and toss to combine. Taste again and adjust the seasoning.",
    "Peel the eggplant or slit it open and scoop out the flesh. Coarsely chop the flesh and pile it into a large bowl. Sprinkle with the remaining 1 tablespoon lemon juice (this will make the color lighter) and add the jalapeño and sauce. Mix thoroughly.",
    "Spread the eggplant on a serving plate, leaving a well in the center. Mound the freekeh salad in the well, and scatter on some cilantro leaves. Serve right away."
  ]
}