{
  "title": "French Toast with Whipped Honey Ricotta Topping",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "Serves 6",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "FOR THE WHIPPED RICOTTA TOPPING",
    "- scant 2 cups whole-milk ricotta cheese (1 pound)",
    "- 6 tablespoons heavy cream",
    "- ¼ cup honey",
    "- ½ teaspoon vanilla extract",
    "- ¼ teaspoon ground cinnamon",
    "FOR THE HONEY BUTTER SYRUP",
    "- ¼ cup honey",
    "- 4 tablespoons butter",
    "- ¼ teaspoon vanilla extract",
    "- Kosher salt",
    "FOR THE FRENCH TOAST",
    "- 1 (12-inch) loaf day-old challah or brioche (¾ to 1 pound)",
    "- 4 eggs",
    "- 1¾ cups whole milk",
    "- ¼ cup heavy cream or half-and-half",
    "- 1 teaspoon vanilla extract",
    "- Kosher salt",
    "- Dash of grated nutmeg",
    "- Butter, for the skillet"
  ],
  "directions": [
    "In a large bowl, combine the ricotta, cream, honey, vanilla, and cinnamon and whisk until everything fluffs up a bit, 30 seconds to 1 minute. Cover and chill.",
    "In a small saucepan, combine the honey, butter, vanilla, and a few pinches of salt and heat over low heat until the mixture begins to bubble. Remove from the heat. Stir to recombine, if necessary, and cover to keep warm.",
    "Cut the bread into slices 2 inches thick. In an 8-inch square baking dish, whisk the eggs, milk, cream, vanilla, a few pinches of salt, and nutmeg. Dip each piece of bread in the egg mixture for 10 seconds per side if you want lighter, fluffier French toast, or 20 to 30 seconds per side for creamier, more custardy and undercooked-in-a-good-way centers. Put the slices of bread on a baking sheet to hold.",
    "Heat a large skillet or griddle over medium-low heat. Grease the skillet generously with butter and add as many slices of bread as will fit comfortably in one layer. Cook until the bread is golden and toasty, about 5 minutes per side. Repeat with remaining bread, greasing the skillet again between batches.",
    "Divide the French toast among plates, dollop with ricotta, and drizzle with syrup."
  ]
}