{
  "title": "French Onion Soup",
  "source": "Modern Bistro - ATK",
  "servings": "6",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "4tablespoons unsalted butter",
    "4pounds onions, halved and sliced thin",
    "1¾teaspoons table salt, divided",
    "1teaspoon sugar",
    "1cup dry red wine",
    "8cups beef broth",
    "4sprigs fresh thyme",
    "2bay leaves",
    "¾teaspoon pepper, divided",
    "6ounces baguette, cut into 1-inch cubes",
    "3tablespoons extra-virgin olive oil",
    "8ounces Gruyère cheese, shredded (2 cups), divided",
    "1½ounces Parmesan cheese, shredded (½ cup)"
  ],
  "directions": [
    "1  Melt butter in Dutch oven over medium-high heat. Stir in onions, 1 teaspoon salt, and sugar. Cover and cook, stirring occasionally, until onions release their liquid and are uniformly translucent, about 20 minutes.",
    "2  Uncover and cook until liquid has evaporated and browned bits start to form on bottom of pot, 5 to 10 minutes. Reduce heat to medium and continue to cook, uncovered, until onions are caramel colored, 30 to 40 minutes longer, stirring and scraping with wooden spoon as browned bits form on bottom of pot and spreading onions into even layer after stirring. (If onions or browned bits begin to scorch, reduce heat to medium-low.)",
    "3  Stir in wine, scraping up any browned bits, and cook until nearly evaporated, about 1 minute. Stir in broth, thyme sprigs, bay leaves, ½ teaspoon pepper, and ½ teaspoon salt. Increase heat to high and bring to boil. Reduce heat to medium-low and simmer, uncovered, for 30 minutes.",
    "4  While onions simmer, adjust oven rack to middle position and heat oven to 350 degrees. Toss baguette, oil, remaining ¼ teaspoon salt, and remaining ¼ teaspoon pepper together in bowl. Transfer to rimmed baking sheet and bake until golden and crisp, 15 to 18 minutes. Remove sheet from oven and set aside. Increase oven temperature to 500 degrees.",
    "5  Set six 12-ounce ovensafe crocks on second rimmed baking sheet. Discard thyme sprigs and bay leaves and season soup with salt and pepper to taste. Divide soup evenly among crocks (about 1½ cups each). Divide 1 cup Gruyère evenly among crocks, top with croutons, and sprinkle with remaining Gruyère, then Parmesan. Bake until cheeses are melted and soup is bubbly around edges, 5 to 7 minutes. Let cool for 5 minutes before serving."
  ]
}