{
  "title": "French Onion Soup",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "6",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "3tablespoons olive oil",
    "7tablespoons butter",
    "10cups thinly sliced onions (from about 3 pounds)",
    "5thyme sprigs, tied into a bundle with kitchen twine",
    "8cloves garlic, thinly sliced",
    "2tablespoons all-purpose flour",
    "1¼cups dry red wine",
    "6cups beef broth",
    "1½tablespoons soy sauce (see Note)",
    "Kosher salt",
    "4large croissants, cut into 1½-inch cubes",
    "¾pound Gruyère or Swiss cheese, grated (about 3 cups)"
  ],
  "directions": [
    "In a really big (at least 8-quart) heavy-bottomed pot, heat the oil and 7 tablespoons of the butter over high heat. Add the onions and the thyme bundle and cook, stirring often, until the onions begin to shrink but are still light in color, about 15 minutes. Reduce the heat to medium-low, add the garlic, and cook, stirring often, until the onions are golden and meltingly tender, another 20 minutes, but really watch the color more than the clock. If some of the onions are getting brown before the others are turning golden, stir more. You want all the onions to be beautifully, evenly golden brown.",
    "Add the flour and cook, stirring, until it coats all the onions and makes them look kinda dull, about 3 minutes. Add the wine, increase the heat to medium, bring to a boil, and cook until the onions are purple and the wine has evaporated, about 5 minutes. Discard the thyme bundle. Add the broth, soy sauce, and 1 teaspoon salt. Bring to a boil over high heat, reduce the heat again, and cook at a gentle simmer until the soup has thickened and the onions are no longer purple, about 45 minutes. Season to taste with salt.",
    "Preheat the oven to 350°F. Arrange the croissant pieces on a large baking sheet and bake until golden, about 9 minutes. Remove from the oven and raise the heat to broil.",
    "Arrange six 10- or 12-ounce ovenproof soup crocks on a rimmed baking sheet. Mound ¼ cup of the Gruyère on the bottom of each crock. Ladle soup over the cheese, almost to the top. Top each soup with a few croissant croutons, then mound ¼ cup more Gruyère on top, mostly covering the croutons. Broil until the cheese is bubbling and slightly browned and the croutons are nice and toasty on the edges, 3 to 4 minutes (this time can depend on your broiler, so check early and often!)."
  ]
}