{
  "title": "Fried Pork Chop with Kale Laing",
  "source": "Chuckycruz.substack.com",
  "servings": "",
  "categories": [],
  "ingredients": [
    "Laing:",
    "6oz bacon, cut into ¼ inch pieces",
    "8oz leeks, white tender parts only, washed and sliced",
    "4garlic cloves, peeled and chopped",
    "1-inch piece of ginger, peeled and chopped",
    "3birds eye chiles, destemmed and split",
    "1Tbsp shrimp paste, (substitute with 2 Tbsp fish sauce)",
    "113.5-oz can of coconut milk, unsweetened",
    "16-oz can of cream of coconut cream, unsweetened",
    "1bunch of kale (~1 lb), cleaned and chopped in to 1-inch pieces. stems included",
    "Pork Chop",
    "2pork chops, or cutlets. pounded to about ½-inch thick.",
    "Kosher and black pepper, to season",
    "1tsp smoked paprika",
    "1tsp garlic powder",
    "1tsp onion powder",
    "1tsp chili flake",
    "All-purpose flour, for breading",
    "Whisked eggs, for breading",
    "Panko breadcrumbs, for breading",
    "Neutral oil, for frying",
    "Flake salt, for finishing",
    "Steamed rice, for serving"
  ],
  "directions": [
    "In a cold pot add in sliced bacon and cook over medium low heat until crispy. Add a touch of oil to get it going, if you’d like. About 7-10 minutes.",
    "Once bacon is rendered, add in leeks, garlic, ginger, and chiles. Cook, stirring occasionally until leeks have softened. About 10-12 minutes.",
    "Add in shrimp paste and toast until aromatic, about 1 minute.",
    "Pour in coconut milk and coconut cream and bring to a boil.",
    "Add in kale and bring to a simmer. Mix occasionally to prevent burning. Cook until kale has softened and stems can break with the back of your spoon. The color of the kale should be a deep dull green. There shouldn’t be a lot of liquid, reduce if necessary. If sauce is too thick add in water 1 Tbsp at a time. Season with salt or fish sauce at the end to prevent it from being too salty.",
    "As laing cooks, prepare your pork chops.",
    "Pat pork chops dry with a paper towel. Season pork with salt and pepper.",
    "In three separate bowls, prepare your breading station.",
    "Add spices to flour bowl and whisk.",
    "Evenly coat pork in flour, then eggs, and finally panko breadcrumbs. Be sure pork is fully coated with each component before moving to the next. Shake off any excess between each station.",
    "In a skillet, pour in about a ¼-inch of oil. Heat up oil to about 350F.",
    "Fry pork chops until golden brown on each side. About 3-5 minutes each side.",
    "Drain onto a wired rack and sprinkle with flake salt.",
    "Serve with rice and kale laing."
  ]
}