{
  "title": "Fried Squash Blossoms With Ricotta, Roasted Corn, And Sweet And Hot Yellow Pepper Sauce",
  "source": "Mesa Grill - Bobby Flay",
  "servings": "4",
  "categories": [
    "Mesa Grill - Bobby Flay"
  ],
  "ingredients": [
    "- 1½ cups whole milk ricotta",
    "- ½ cup roasted corn kernels",
    "- 3 tablespoons grated cotija cheese",
    "- 3 tablespoons finely chopped fresh basil",
    "- Kosher salt and freshly ground black pepper",
    "- 16 squash blossoms",
    "- 1 cup rice flour",
    "- 2 cups vegetable oil",
    "- 1½ cups baby greens",
    "- Citrus vinaigrette",
    "- Sweet and hot yellow pepper sauce"
  ],
  "directions": [
    "1. Line a fine-mesh strainer with cheesecloth or a coffee filter. Scrape the ricotta into the strainer and set it over a bowl. Place the ricotta in the refrigerator for at least 4 hours or up to 8 hours to allow the excess liquid to drain and the ricotta to thicken.",
    "2. Transfer the drained ricotta to a medium bowl and stir in the corn, cheese, and basil and season with salt and pepper. Carefully spoon about 2 tablespoons of the mixture into each squash blossom. Gently press the filling into the base of the flower. Cover with the petals and pinch the top to seal. Refrigerate for at least 30 minutes or up to 2 hours.",
    "3. In a small bowl, whisk the rice flour with ½ cup of cold water. Add up to ¼ cup of additional cold water, if needed, to make a thin batter with the consistency of heavy cream. Let the batter sit for 15 minutes.",
    "4. Heat the oil in a large high-sided sauté pan or shallow pot until it reaches 375 degrees F as measured on a deep-frying thermometer. Holding each squash blossom by the stem, dip into the batter, making sure to coat completely. Let any excess batter drip off. Place the blossoms in the oil in batches of 4 and fry, turning to brown evenly, until golden brown, 1 to 2 minutes. Remove to a paper-towel-lined plate.",
    "5. Put the baby greens in a large bowl, toss with ¼ cup of the citrus vinaigrette, and season with salt and pepper. Spread 3 to 4 tablespoons of the yellow pepper sauce on the bottom of each of 4 plates, top with the blossoms, and place some of the baby greens in the center."
  ]
}