{
  "title": "Fried Squash Blossom “Mozzarella Sticks”",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Tomato Sauce",
    "3tablespoons olive oil",
    "4garlic cloves, finely grated",
    "1⁄2 teaspoon red pepper flakes",
    "One 24-ounce (680 g) jar passata",
    "Kosher salt and freshly cracked black pepper, to taste",
    "2Parmesan rinds (about 5 ounces/142 g), optional but encouraged",
    "Squash Blossoms",
    "12large or 16 small squash blossoms",
    "8ounces (227 g) low-moisture whole-milk mozzarella, shredded",
    "3⁄4 cup (6 ounces/170 g) whole-milk ricotta",
    "1⁄2 teaspoon kosher salt",
    "1⁄2 teaspoon freshly cracked black pepper, plus more for serving",
    "Canola oil, for frying",
    "3eggs",
    "3tablespoons all-purpose flour",
    "2cups (180 g) panko breadcrumbs",
    "Freshly grated Parmesan, for serving"
  ],
  "directions": [
    "1. Make the sauce: Heat the olive oil and garlic in a small saucepan over medium heat. Cook, stirring constantly, until the garlic is lightly golden, 2 or 3 minutes. Add the red pepper flakes and passata, and season with salt and black pepper. Bring to a simmer and then reduce the heat to low.2. Add the Parmesan rinds, if using, and let the sauce simmer for 45 minutes to 2 hours (depending on how much time you have) to develop the flavor. Remove and discard the Parmesan rinds, and season with more salt and black pepper before serving.3. Meanwhile, make the squash blossoms: Clean each blossom by gingerly tearing off the spiky leaves at the bottom and then snipping off the pistil inside with kitchen shears.4. Mix the mozzarella, ricotta, salt, and black pepper in a medium bowl.5. Carefully, without tearing the blossoms, spoon the filling into each blossom, leaving about 1⁄2 inch (1 cm) of space at the top. Gently pinch the top of the blossom to enclose the filling and ensure none is exposed.6. Heat about 11⁄2 inches (4 cm) of canola oil in a large pot over medium heat to 325°F (165°C).7. While the oil heats, bread the blossoms. Add the eggs and flour to a small, shallow dish and whisk until combined (a few small lumps are okay!). Add the panko to another small, shallow dish.8. Cover each blossom in the egg mixture and then the panko, being sure to fully coat in each step.9. Working in batches, gently add the blossoms to the hot oil and fry, flipping them as needed, until golden brown all over, 2 or 3 minutes. Using a slotted spoon, transfer the fried blossoms to a wire rack–lined sheet tray or paper towel–lined plate. Immediately season with a small pinch of salt. Repeat the frying process until all blossoms are fried. This should take 2 or 3 batches, depending on the size of the blossoms.10. Serve immediately, topped with a generous amount of grated Parmesan and more black pepper and the warm tomato sauce on the side for dipping."
  ]
}