{
  "title": "Fudgy Tahini Date Chocolate Bars",
  "source": "Minimalistbaker.com",
  "servings": "Serving: 1",
  "categories": [
    "Other",
    "Other"
  ],
  "ingredients": [
    "1/2cup cacao or unsweetened cocoa powder, sifted (we used half cocoa, half cacao for a mix of flavor)",
    "2 ½Tbsp tahini (DIVIDED)",
    "1Tbsp melted coconut oil (if oil-free, sub more tahini and play with texture as needed)",
    "3Tbsp raw and/or local honey (if vegan, sub maple syrup, but use slightly less as it’s sweeter and thinner in texture)",
    "1healthy pinch sea salt",
    "5-6medjool dates, pitted and finely chopped"
  ],
  "directions": [
    "To a small mixing bowl add sifted cacao or cocoa powder, 2 Tbsp (30 g) tahini (adjust amount if altering default number of servings), melted coconut oil, raw honey, salt, and about half of your chopped dates. Gently stir with a spoon to combine into a thick paste. NOTE: If doubling recipe, you can try combining your ingredients in a small food processor. Otherwise, a mixing bowl is easiest / quickest for making a single batch.",
    "Depending on your tahini consistency, type of sweetener, and if you use oil, you may need to play with your ratios. If too thin, add more cacao or cocoa powder. If too thick, thin with more honey or oil. You’re going for a fudge-like dough with some tackiness to it.",
    "Next, plop half the mixture onto one side of a piece of parchment paper, fold the parchment paper over, and use a rolling pin to roll into a flat bar (~1/4 to 1/2 inch thick). Then unfold parchment paper and sprinkle the remaining chopped dates over the rolled-out chocolate, and drizzle the remaining 1/2 Tbsp of tahini over the dates. Add the remaining fudge mixture on top of the dates and tahini, fold the parchment paper back over the chocolate, and roll again to create a date and tahini sandwich! Once the top layer of fudge is fairly even, lift up the parchment and fold in any exposed edges (you want to hide the tahini and dates)! Roll once more to even out the bar, and straighten the edges with a spatula (if desired).",
    "Enjoy your bar as is (fudgy style!), roll into “truffles,” or transfer to the freezer to firm up for 20-30 minutes (we prefer ours cold).",
    "To serve, cut bar(s) into squares or desired shapes. We also recommend dusting with a little cocoa or cacao powder at this time to prevent sticking. They are firm when refrigerated or frozen, but the longer they sit out at room temperature, the softer they’ll become.",
    "Store leftovers covered in the refrigerator for up to 1-2 weeks, or in the freezer for 1 month or more."
  ]
}