{
  "title": "Galettes Complètes",
  "source": "Modern Bistro - ATK",
  "servings": "4 (Makes 4 crêpes)",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "For the crêpes:",
    "½teaspoon vegetable oil",
    "¾cup (3⅜ ounces) buckwheat flour",
    "¼cup (1¼ ounces) all-purpose flour",
    "½teaspoon table salt",
    "2cups milk",
    "3large eggs",
    "4tablespoons salted butter, melted and cooled",
    "For the filling:",
    "4thin slices deli ham (2 ounces), divided",
    "5½ounces Gruyère cheese, shredded (1⅓ cups), divided",
    "4large eggs, divided",
    "1tablespoon salted butter, melted",
    "4teaspoons chopped fresh chives, divided"
  ],
  "directions": [
    "1 For the crêpes: Adjust oven rack to middle position and heat oven to 450 degrees. Heat oil in 12-inch nonstick skillet over low heat for at least 5 minutes. While skillet heats, whisk buckwheat flour, all-purpose flour, and salt together in medium bowl. In second bowl, whisk together milk and eggs. Add half of milk mixture to flour mixture and whisk until smooth. Add melted butter and whisk until incorporated. Whisk in remaining milk mixture until smooth.",
    "2 Using paper towel, wipe out skillet, leaving thin film of oil on bottom and sides. Increase heat to medium and let skillet heat for 1 minute. Test heat of skillet by placing 1 teaspoon batter in center and cooking for 20 seconds. If mini crêpe is golden brown on bottom, skillet is properly heated; if it is too light or too dark, adjust heat accordingly and retest.",
    "3 Lift skillet off heat and pour ⅓ cup batter into far side of skillet; swirl gently in clockwise direction until batter evenly covers bottom of skillet, gently shaking skillet as needed. Return skillet to heat and cook crêpe, without moving it, until top surface is dry and crêpe starts to brown at edges, loosening crêpe from sides of skillet with heat-resistant rubber spatula, about 35 seconds. Gently slide spatula underneath edge of crêpe, grasp edge with your fingertips, and flip crêpe. Cook until second side is lightly spotted, about 20 seconds. Transfer crêpe to wire rack. Return skillet to heat for 10 seconds before repeating with remaining batter. As crêpes are done, stack on wire rack. (Crêpes can be wrapped tightly in plastic wrap and refrigerated for up to 3 days or stacked between sheets of parchment paper and frozen for up to 1 month. Allow frozen crêpes to thaw completely in refrigerator before using.)",
    "4 For the filling: Line rimmed baking sheet with parchment paper and spray with vegetable oil spray. Arrange 4 crêpes spotty side down on prepared sheet (they will hang over edge). (Reserve remaining crêpes for another use.) Working with 1 crêpe at a time, place 1 slice of ham in center of crêpe, followed by ⅓ cup Gruyère, covering ham evenly. Make small well in center of cheese. Crack 1 egg into well. Fold in the 4 sides to make a square, pressing to adhere.",
    "5 Brush crêpe edges with melted butter and transfer sheet to oven. Bake until egg whites are uniformly set and yolks have filmed over but are still runny, 8 to 10 minutes. Using thin metal spatula, transfer each crêpe to plate and sprinkle with 1 teaspoon chives. Serve immediately."
  ]
}