{
  "title": "Garlic Coriander Pork Chops with Crunchy Iceberg Salad",
  "source": "By Heart - Hailee Catalano",
  "servings": "SERVES 2",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Pork",
    "1teaspoon black peppercorns",
    "1teaspoon coriander seeds",
    "2bone-in center-cut pork chops (11⁄2 to 2 pounds/680 to 907 g), about 1 inch (2.5 cm) thick",
    "Kosher salt, to taste",
    "2tablespoons Worcestershire sauce",
    "1tablespoon plus 1 teaspoon soy sauce",
    "1tablespoon maple syrup",
    "1tablespoon mirin",
    "1⁄4 cup (60 ml) plus 2 tablespoons canola oil",
    "4garlic cloves, thinly sliced on a mandoline",
    "3tablespoons unsalted butter",
    "Dressing",
    "2inches (5 cm) ginger, peeled and thinly sliced",
    "2scallions, whites only, roughly chopped",
    "1small carrot, thinly sliced",
    "2tablespoons maple syrup",
    "2tablespoons soy sauce",
    "2tablespoons unseasoned rice vinegar",
    "1⁄2 teaspoon ground turmeric",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Salad",
    "1small head iceberg lettuce, cored and cut into small wedges (leaves separated slightly)",
    "2scallions, greens only, thinly sliced",
    "1medium carrot, julienned"
  ],
  "directions": [
    "Make the pork:1. Use a mortar and pestle or spice grinder to crush the peppercorns and coriander into a coarse powder. Season the pork all over with salt and then the spice mix.2. Mix the Worcestershire sauce, soy sauce, syrup, and mirin in a small bowl. Set aside.3. Add the canola oil and garlic to a large skillet, set over medium-low heat, and fry the garlic, stirring often, until lightly golden brown, 3 to 5 minutes. The garlic won’t seem very crisp at this point, but it will crisp up when fully cool. Transfer the garlic to a paper towel to drain, and sprinkle with a touch of salt.4. Remove all but about 1 tablespoon of the garlic oil from the pan, and reserve the rest (about 1⁄4 cup/60 ml) to use in the dressing. You’ll use this pan to cook the pork, so don’t get rid of it! (But do turn off the heat.)5. Make the dressing: Place the ginger, scallion whites, carrot, the reserved 1⁄4 cup (60 ml) garlic oil, and the syrup, soy sauce, vinegar, and turmeric in a blender, and blend until very smooth. Season with salt and pepper.6. Cook the pork: Heat the skillet over medium heat. Add the pork chops, and sear the first side until golden brown, 4 or 5 minutes. Flip the chops onto the fat cap, and sear until they are golden and the fat has rendered a bit, 1 or 2 minutes.7. Flip over and cook the second side until the chops are golden and the internal temperature is about 125°F (52°C), 3 or 4 minutes. Transfer the pork chops to a plate. (They will not be fully cooked at this point.)8. Remove all the oil from the skillet. Reduce the heat to low, and add the reserved Worcestershire sauce mixture and butter. Cook, stirring to scrape up any fond, until the butter is melted and everything is combined and bubbly, 1 or 2 minutes.9. Return the pork to the skillet, and cook, basting with the sauce, until the internal temperature is about 140°F (60°C), 1 or 2 minutes. Turn off the heat.10. Make the salad: Arrange the iceberg on a platter, and drizzle with the ginger dressing. Top with the scallion greens and carrots.11. Slice the pork off the bone, top with more sauce from the pan and the fried garlic, and serve with the salad on the side."
  ]
}