{
  "title": "Garlic Focaccia",
  "source": "Italian American Don Angie Book",
  "servings": "MAKES ONE 18 × 13-INCH PAN (SERVES 8 TO 10)",
  "categories": [
    "Bread",
    "Italian American - Don Angie"
  ],
  "ingredients": [
    "2⅓cups lukewarm (105° to 110°F) water",
    "2¼teaspoons (1 envelope) active dry yeast",
    "2teaspoons sugar",
    "1½cups extra-virgin olive oil",
    "6⅓cups bread flour",
    "2tablespoons plus ½ teaspoon kosher salt",
    "¼cup Garlic & Chile Soffritto (this page)",
    "½teaspoon crushed Calabrian chiles in oil",
    "4garlic cloves, finely chopped",
    "½teaspoon dried oregano (ideally home-dried, this page)",
    "1teaspoon flaky sea salt, such as Maldon"
  ],
  "directions": [
    "In the bowl of a stand mixer, whisk together the warm water, yeast, and sugar until the yeast is dissolved. Allow the mixture to sit until bubbling and foamy, 10 to 15 minutes.Add ½ cup of the olive oil and whisk to combine. Attach the dough hook. Add the flour and salt and mix well on medium speed for 7 to 8 minutes to activate the gluten. The dough should be smooth and pull away cleanly from the sides of the bowl. Add the garlic and chile soffritto. Mix well on medium speed to combine, about 2 minutes.Line a large (18 × 13-inch) sheet pan with parchment paper and coat the paper with ¼ cup of the olive oil. Place the dough on the pan. Drizzle ¼ cup of the olive oil over the dough and cover loosely with plastic wrap. Let rise in a warm place until doubled in size, about 3 hours.",
    "Preheat the oven to 400°F.",
    "Using your fingers, gently press the dough across the surface of the pan. Use your fingertips to create divots (being careful not to puncture the dough) across the surface of the dough. Set aside, uncovered, in a warm place for 30 to 45 minutes, until the dough has risen again and is puffy in appearance.",
    "Place the pan in the oven and bake until the bread is lightly golden brown on top and starting to set in the pan, about 15 minutes.Meanwhile, in a small bowl, stir together the remaining ½ cup olive oil, the Calabrian chiles, garlic, and oregano.",
    "Remove the bread from the oven and spread the garlic-oil mixture evenly across the top, then sprinkle evenly with the flaky sea salt. Rotate the pan and return to the oven until the garlic is lightly toasted and aromatic and the focaccia is evenly golden and pulling away from the side of the pan, another 15 to 18 minutes. Cool completely in the pan.",
    "To serve, cut into 1½-inch-wide strips (if freezing to serve later, do not cut into strips). Leftover focaccia keeps, tightly sealed in the refrigerator, for up to 3 days, or up to 3 months in the freezer. Leftovers are best served toasted."
  ]
}