{
  "title": "General Tso's Tofu",
  "source": "Thewoksoflife.com",
  "servings": "Serves: 4 servings",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "For the tofu:",
    "1½tablespoons honey",
    "2teaspoons Louisiana hot sauce, such as Crystal",
    "1block of regular or firm tofu, drained, pat dry, and cut into 1-inch squares",
    "1 ½tablespoons sesame seeds",
    "2 to 3tablespoons cornstarch (depending on how wet the tofu is)",
    "⅓cup peanut or canola oil, for shallow frying",
    "For the rest of the dish:",
    "½teaspoon minced ginger",
    "2cloves minced garlic",
    "7whole dried Chinese red chili peppers (optional)",
    "½of a red bell pepper, cut into large pieces",
    "½tablespoon Shaoxing wine",
    "1cup water or vegetable stock",
    "2cups broccoli florets",
    "1½tablespoons light soy sauce",
    "1teaspoon dark soy sauce",
    "2teaspoons rice vinegar",
    "¼teaspoon salt",
    "1tablespoon sugar",
    "½teaspoon sesame oil",
    "1½tablespoons cornstarch, mixed with 1 tablespoon water"
  ],
  "directions": [
    "Mix the honey and Louisiana hot sauce in a bowl until well combined. Add the tofu to the bowl, and toss together gently with a spatula until the tofu is well-coated.",
    "Next, sprinkle the sesame seeds over the tofu, and toss until evenly distributed. Next, sprinkle the cornstarch over the tofu until lightly coated. If the tofu is still too wet, add a little more cornstarch.",
    "Heat ⅓ cup oil in a medium-sized frying pan (we like to use a cast iron skillet) until the oil is about 350F, or when a bamboo chopstick bubbles when inserted into the oil. If you want to make the tofu frying easier, use more oil to achieve a deep fry.",
    "Carefully place the tofu pieces into the pan, ensuring that the pieces are not touching, and let fry for about 2 minutes. Turn them over to continue frying on the other side. Work quickly and turn the heat down if you need more time for turning, or if you see they are starting to burn. Continue to cook the tofu until a nice crust is formed, and they turn golden brown (about 4-5 minutes time in total). Transfer the tofu pieces to a sheet pan with a slotted spoon.",
    "Heat your wok over medium heat, and add 1 tablespoon of the oil left from tofu-frying, and add the ginger. After 10 seconds, add the garlic and the whole dried chili peppers, and stir for 15 seconds. Next, stir in the red bell peppers and Shaoxing wine.",
    "Now add the water or vegetable stock, and let the mixture come up to a boil. Add the broccoli florets.",
    "Immediately add the soy sauces, rice vinegar, salt, sugar, and sesame oil. Let the mixture come up to a boil. Immediately add the cornstarch mixture slowly while stirring.",
    "The sauce should be thick enough to coat a spoon. Feel free to add more or less of the cornstarch mixture depending on how thick you like your sauce, but give it 30 seconds to 1 minute between additions, as it does take some time for the sauce to thicken.",
    "Toss in your fried tofu and give everything a quick stir to make sure the tofu is coated. Serve with steamed rice!"
  ]
}