{
  "title": "General Tso’s Chicken",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 1/2 cups water",
    "- 1/2 cup hoisin sauce",
    "- 1/4 cup distilled white vinegar",
    "- 3 tablespoons soy sauce",
    "- 3 tablespoons sugar",
    "- 1 1/2 cups plus 2 tablespoons cornstarch, divided",
    "- 1 1/2 pounds boneless, skinless chicken thighs, trimmed and cut into 1-inch pieces",
    "- 3 large egg whites",
    "- 1/2 cup all-purpose flour",
    "- 1/2 teaspoon baking soda",
    "- 2 quarts peanut or vegetable oil for frying",
    "- 2–4 small dried Sichuan chiles, stemmed and halved lengthwise",
    "- 2 tablespoons grated fresh ginger",
    "- 4 garlic cloves, minced"
  ],
  "directions": [
    "1. Whisk water, hoisin sauce, vinegar, soy sauce, sugar, and 2 tablespoons cornstarch together in a bowl. Toss chicken with 6 tablespoons of the hoisin mixture in a separate bowl. Cover and refrigerate for 30 minutes.",
    "2. Whisk egg whites in a shallow dish until foamy. In a second shallow dish, mix the remaining 1 1/2 cups cornstarch, flour, baking soda, and 2 tablespoons of hoisin mixture until it resembles coarse meal. Remove chicken from marinade and pat dry with paper towels. Toss half of the chicken with egg whites until well coated, then dredge in the cornstarch mixture, pressing gently to adhere. Repeat with remaining chicken.",
    "3. Line a rimmed baking sheet with triple layers of paper towels. Add oil to a large Dutch oven until it measures about 1 1/2 inches deep. Heat over medium-high heat to 350°F. Working quickly, use a spider skimmer or slotted spoon to lower half of the chicken pieces into the hot oil. Separate pieces so they fry individually. Fry until golden brown and crispy, about 4 minutes. Adjust the burner to maintain the oil temperature between 325°F and 350°F. Use the skimmer to transfer chicken to the prepared sheet. Return oil to 350°F and repeat with remaining chicken.",
    "4. Measure out and reserve 1/4 cup of frying oil; discard the rest or save for another use. Heat an empty 14-inch flat-bottomed wok over medium-high heat until just beginning to smoke. Reduce heat to medium-low, drizzle reserved oil around the perimeter, and heat until just smoking. Add chiles, ginger, and garlic, and cook until fragrant, about 1 minute. Add remaining hoisin mixture, bring to a simmer, and cook, stirring constantly, until dark brown and thickened, about 2 minutes. Add chicken and cook, tossing constantly, until well coated with sauce, about 1 minute. Serve."
  ]
}