{
  "title": "Ginger-Scallion Chicken",
  "source": "Nomnompaleo.com",
  "servings": "Serves 4",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "¼cup softened duck fat, ghee, avocado oil, or fat of choice",
    "½cup thinly sliced scallions (about 3 scallions)",
    "1tablespoon grated fresh ginger (use a microplane for best results!)",
    "Diamond Crystal brand kosher salt",
    "4bone-in, skin-on chicken breasts (10-12 ounces each)",
    "1tablespoon melted duck fat, ghee, or fat of choice"
  ],
  "directions": [
    "Preheat the oven to 450°F with the rack in the middle position. In a small bowl, add the fat, scallions, ginger, and 2 teaspoons of Diamond Crystal brand kosher salt (use half the amount if you are using a fine grain salt or Morton’s kosher salt).",
    "Mix well.",
    "Using your fingers, carefully separate the skin of each chicken breast away from the meat to form a pocket.",
    "Add 1 tablespoon of the “pesto” under the skin of each breast.",
    "Carefully press and massage the skin to evenly distribute the ginger-scallion pesto. At this point, you can proceed with cooking the chicken, or you can refrigerate it for up to a day and roast it later.",
    "When you’re ready to cook, put the chicken skin-side up on a wire rack atop a foil-lined baking sheet. (No foil? No problem. You can leave it unlined as long as you don’t mind using extra elbow grease when you clean up later.)",
    "Brush the melted fat on the chicken breasts…",
    "…and season with more salt.",
    "Oven-roast for 30 to 35 minutes or until an instant-read thermometer stuck into the thickest part of the chicken registers 150°F.",
    "Rest the chicken for 5 to 10 minutes.",
    "Debone the breasts, slice, and serve!",
    "If you have leftovers, they can be kept in the fridge for up to 3 days. But that’s a big “if”!",
    "Preheat the oven to 450°F with the rack in the middle position. In a small bowl, add the fat, scallions, ginger, and 2 teaspoons of Diamond Crystal brand kosher salt (use half the amount if you are using a fine grain salt or Morton's kosher salt). Mix well.",
    "Using your fingers, carefully separate the skin of each chicken breast away from the meat to form a pocket. Add 1 tablespoon of the “pesto” under the skin of each breast.",
    "Carefully press and massage the skin to evenly distribute the pesto. At this point you can proceed with cooking the chicken, or refrigerate it for up to a day and roast it later.",
    "Put the chicken skin-side up on a wire rack atop a foil-lined baking sheet. You can leave it unlined if you don’t mind using extra elbow grease when you clean up later.",
    "Brush the melted fat on the chicken breasts, and season with more salt.",
    "Oven-roast for 30 to 35 minutes or until an instant-read thermometer inserted into the thickest part of the chicken registers 150°F.",
    "Rest the chicken for 5 to 10 minutes. Then, debone the breasts, slice, and serve!"
  ]
}