{
  "title": "Gnocchi à la Parisienne with Pistou",
  "source": "Modern Bistro - ATK",
  "servings": "4",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "For the gnocchi",
    "3large eggs",
    "7tablespoons unsalted butter, divided",
    "¾teaspoon table salt",
    "¾cup (3¾ ounces) all-purpose flour",
    "2ounces Gruyère cheese, shredded (½ cup)",
    "⅛teaspoon pepper",
    "For the pistou",
    "1¼cups fresh basil leaves",
    "1½ounces Parmesan cheese, grated (¾ cup), plus extra for serving",
    "½cup extra-virgin olive oil",
    "2garlic cloves, minced",
    "2anchovy fillets, rinsed, patted dry, and minced",
    "1teaspoon grated lemon zest plus 2 teaspoons juice"
  ],
  "directions": [
    "1 For the gnocchi, fit pastry bag with ½-inch round tip. Beat eggs in 2-cup liquid measuring cup.",
    "2  Bring ¾ cup water, 4 tablespoons butter, and salt to boil in small saucepan over medium heat, stirring occasionally. As soon as mixture boils, remove saucepan from heat and stir in flour until incorporated. Return saucepan to low heat and cook, stirring constantly, using smearing motion, until mixture looks like shiny, wet sand, about 2 minutes.",
    "3  Immediately transfer mixture to food processor. Add Gruyère and pepper and process, with feed tube open, for 10 seconds. With processor running, gradually add eggs in steady stream. When all eggs have been added, scrape down sides of bowl with rubber spatula. Continue to process until smooth, thick, sticky paste forms, about 30 seconds longer. Fill prepared pastry bag with warm mixture. Twist top of bag to close and let rest at room temperature for 30 minutes.",
    "4 For the pistou, while dough rests, add all ingredients to clean, dry processor and process until smooth, about 15 seconds, scraping down sides of bowl as needed.",
    "5  Lightly grease rimmed baking sheet. Bring 4 quarts water to boil in large Dutch oven. Reduce heat to maintain gentle simmer. Using 1 hand, hold pastry bag at 45-degree angle so tip is about 3 inches away from surface of water and squeeze bag to force dough out of tip. Using paring knife, cut off ¾-inch lengths and let them fall into water. Continue to pipe until 20 to 30 gnocchi are in pot. Simmer until gnocchi float and are slightly firm, about 2 minutes. Using spider skimmer or slotted spoon, transfer gnocchi to prepared sheet. Repeat until all dough is cooked (4 to 6 batches). (If not serving immediately, allow gnocchi to cool completely. Transfer to airtight container and refrigerate for up to 3 days. Alternatively, freeze on sheet until solid, then transfer to zipper-lock bag and freeze for up to 2 months; sauté from frozen, adding 1 to 2 minutes to cooking time.)",
    "6 To serve, melt remaining 3 tablespoons butter in 12-inch nonstick skillet over medium heat. Add all gnocchi and shake skillet gently until gnocchi fall into single layer. Cook, tossing every 2 minutes, until gnocchi are golden brown and slightly puffed, about 6 minutes. Remove skillet from heat.",
    "7  Divide pistou evenly among wide, shallow pasta bowls and spread to coat bottoms of bowls. Top pistou with gnocchi and serve with extra Parmesan."
  ]
}