{
  "title": "Go-To Cabbage Kimchi",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Makes about 2 quarts",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "- One 3-pound Napa cabbage",
    "- 17 grams (2 tablespoons) Diamond Crystal kosher salt",
    "- 2 tablespoons glutinous rice flour",
    "- 2 tablespoons granulated sugar",
    "- 8 ounces yellow or white onion (1 medium), roughly chopped",
    "- 1½ ounces ginger (4-inch knob), scrubbed and roughly sliced against the grain",
    "- ½ ounce garlic cloves (5 medium), peeled",
    "- 8½ ounces gochugaru (Korean chili flakes), about 2 cups",
    "- 6 tablespoons homemade Mushroom Seasoning Powder or 2 ounces store-bought (½ cup)",
    "- ½ cup sambal oelek",
    "- ½ cup unseasoned rice vinegar",
    "- 3 ounces scallions (about 6), trimmed and chopped into 1-inch pieces"
  ],
  "directions": [
    "1. Remove any bruised leaves from the cabbage and trim any brown spots, but leave the visible core intact. Halve the cabbage through the core, then make three 1-inch-deep slits in the bottom of the core of each half.",
    "2. Tear each half into quarters lengthwise by hand. Place the cabbage in a large bowl.",
    "3. Add the salt in stages, rubbing it between the leaves and onto the cabbage. Let sit for about 4 hours, flipping every 30 minutes, until wilted and releasing liquid.",
    "4. Drain well and return the cabbage to the bowl.",
    "5. In a small saucepan, whisk the rice flour and 2 cups water over high heat until boiling. Add the sugar, stir, and transfer to a heatproof bowl to cool.",
    "6. Once cooled, blend the rice mixture with onion, ginger, and garlic until smooth. Transfer to a mixing bowl.",
    "7. Add gochugaru, mushroom seasoning, sambal, vinegar, scallions, and ¼ cup water. Stir well.",
    "8. Use gloved hands or a spoon to spread a thin layer of the chili mixture between each cabbage leaf.",
    "9. Transfer the cabbage to a wide-mouth 2-quart glass jar and pour in any remaining chili mixture.",
    "10. Press down with a spoon so the liquid rises to (or nearly) cover the vegetables.",
    "11. Cover with plastic wrap pressed to the surface, add a small weight, and seal with a lid.",
    "12. Let ferment at room temperature for 3 to 5 days, burping after 3 days, until bubbles form and it sours slightly.",
    "13. Once fermented to your liking, store in the fridge for up to 6 weeks."
  ]
}