{
  "title": "Goat Cheese Cake with Honey and Figs",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 10",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 9-inch springform pan, roasting pan large enough to fit the springform pan, stand or hand mixer",
    "Extra-virgin olive oil for the pan",
    "10.5ounces (297g) fresh goat cheese, at room temperature",
    "8ounces (227g) full-fat cream cheese, preferably Philadelphia, at room temperature",
    "⅔cup sugar (4.6 oz / 130g)",
    "Seeds scraped from 1 vanilla bean or 1 teaspoon vanilla paste",
    "½cup heavy cream (4 oz / 113g)",
    "4large eggs (7 oz / 200g), at room temperature",
    "1tablespoon finely grated lemon zest",
    "2tablespoons fresh lemon juice (1 oz / 28g)",
    "1pound (454g) fresh figs, quartered ①",
    "Honey, extra-virgin olive oil, and a lemon wedge, for serving"
  ],
  "directions": [
    "Preheat the oven: Arrange an oven rack in the center position and preheat the oven to 325°F. Tightly wrap the outside of the springform pan (with the cooled baked Graham Cracker Crust) in a double layer of foil, making sure the foil extends at least 3 inches up the sides and all the way around to create a watertight seal. Set the pan aside.",
    "Make the filling: In a stand mixer fitted with the paddle attachment (or in a large bowl if using a hand mixer), combine the goat cheese, cream cheese, sugar, and vanilla seeds and beat on medium-high until completely smooth. Add the heavy cream and beat on medium-low until smooth. Add the eggs, lemon zest, and lemon juice and mix until incorporated. Increase the speed to medium-high and beat, scraping down the sides of the bowl occasionally, until the filling is very light and smooth, about 3 minutes. Turn off the mixer.",
    "Prepare the water bath: Bring 2 quarts of water to a boil on the stovetop. Place a roasting pan in the oven and carefully fill it with the boiling water to a depth of about 1 inch. This is your water bath for baking the cheesecake.",
    "Fill the crust and bake: Pour the batter into the graham cracker crust and smooth the top. Lightly tap the pan on the counter to pop any air bubbles, then carefully place the springform pan inside the roasting pan so it’s partially submerged in the water. Bake until the filling is set around the edges and slightly wobbly in the center, 30 to 35 minutes.",
    "Turn off the oven and let the cheesecake cool in the water bath inside the oven with the door ajar for at least 2 hours (this will allow it to finish setting and to cool down gently, which helps prevent cracking on the surface).",
    "Chill the cheesecake: Remove the cooled cheesecake from the water bath and peel away the foil. Transfer the pan to the refrigerator and chill the cheesecake for at least 2 hours (if chilling longer, cover the top of the pan with plastic wrap).",
    "Arrange the figs on top: Before serving, remove the cheesecake from the refrigerator and use a paring knife or small offset spatula to cut between the edges of the pan and the cheesecake to loosen it (the filling may have naturally shrunk away from the sides during cooling). Remove the outer ring. Place the cheesecake, still on the springform base, on a serving plate. Arrange the figs over the top and drizzle lightly with honey and extra-virgin olive oil. Squeeze the lemon wedge over the top and serve."
  ]
}