{
  "title": "Gochujang Stir-Fried Brussels Sprouts",
  "source": "Minimalistbaker.com",
  "servings": "8",
  "categories": [
    "Korean"
  ],
  "ingredients": [
    "SAUCE",
    "1/2cup Korean Gochujang Sauce (or store-bought - just ensure it’s vegan/gluten-free)",
    "1Tbsp sesame oil (sub water if avoiding oil // plus more for sautéing)",
    "1/3cup coconut aminos (or sub tamari, but reduce amount slightly as it’s saltier)",
    "2-3Tbsp maple syrup",
    "1Pinch sea salt",
    "1 1/2Tbsp chili garlic sauce (for more heat // I like Huy Fong Foods brand)",
    "BRUSSELS SPROUTS",
    "1Tbsp sesame oil or avocado oil (sub water if avoiding oil // plus more for sautéing)",
    "7heaped cups halved Brussels sprouts (as consistent in size as possible)",
    "3Tbsp coconut aminos (or sub tamari, but reduce amount slightly as it’s saltier)",
    "Thinly sliced shallot or green onion",
    "Chopped roasted salted peanuts"
  ],
  "directions": [
    "Prepare sauce by adding Gochujang sauce, sesame oil (or water), coconut aminos, maple syrup, sea salt, and chili garlic sauce to a small mixing bowl and mix to combine. Taste and adjust flavor as needed, adding more chili garlic sauce for heat, maple syrup for sweetness, or coconut aminos for depth of flavor / saltiness. Set aside.",
    "Make sure your Brussels sprouts are rinsed, dried, and halved and any large stem portions are removed.",
    "Heat a large cast-iron or metal skillet over medium-high heat. Depending on the size of your skillet (ours was a 12-inch cast iron), you may need to cook the Brussels in two batches so they get evenly cooked and don’t crowd the pan.",
    "Once hot, add sesame or avocado oil (or water) to the pan and Brussels sprouts (know that oil is better for frying and caramelizing the sprouts). Season with the coconut aminos and toss to combine. Then evenly spread the Brussels sprouts in the pan so each one is touching the surface of the pan (remove any that are crowded).",
    "Cover and cook for 2 minutes. Then remove lid and stir-fry uncovered for 2 minutes more, stirring occasionally to brown all sides. Turn down heat if needed if any are appearing too brown.",
    "Once the Brussels sprouts appear to be caramelized, add the sliced shallot or green onion (optional) and the prepared sauce and stir-fry for 1-2 minutes more to coat and caramelize the sprouts even more. Then turn off heat and transfer to a serving platter. Garnish with crushed peanuts if desired (optional). Enjoy hot.",
    "Store cooled leftovers in the refrigerator up to 3-4 days. Reheat over medium heat in a cast-iron skillet until hot. Not especially freezer friendly. These are delicious on their own but would also pair well with our Gochujang Cauliflower, Easy Vegan Kimchi, Quinoa Fried Rice, Sesame Eggplant and Almond Butter Tofu Bowls."
  ]
}