{
  "title": "Gochujang-Ranch Crispy Chicken Bowl",
  "source": "Bonappetit.com",
  "servings": "6 servings",
  "categories": [
    "Korean"
  ],
  "ingredients": [
    "¾cup mayonnaise",
    "½cup buttermilk",
    "2tablespoons gochujang (Korean hot pepper paste)",
    "2tablespoons seasoned rice vinegar",
    "2teaspoons finely grated peeled ginger",
    "1½teaspoons onion powder",
    "1teaspoon toasted sesame oil",
    "2garlic cloves, finely grated",
    "2¼teaspoons kosher salt, divided, plus more",
    "¼small head of red cabbage, thinly sliced",
    "Freshly ground black pepper",
    "½cup (1 stick) unsalted butter",
    "2cups panko (Japanese breadcrumbs)",
    "¼cup raw sesame seeds",
    "6skinless, boneless chicken thighs (about 1½ pounds total)",
    "1large egg, beaten to blend",
    "1tablespoon honey",
    "Cooked rice, sliced scallions, quartered avocado, Sambal Cashews, and lime wedges (for serving)",
    "Gochujang, a mixture of miso and hot chiles, can be found at Korean markets and online."
  ],
  "directions": [
    "Place a rack in middle of oven; preheat to 450°. Whisk mayonnaise, buttermilk, gochujang, vinegar, ginger, onion powder, oil, garlic, and ½ tsp. salt in a medium measuring glass. Taste and season dressing with more salt, if needed. Transfer ½ cup dressing to a medium bowl. Add cabbage and toss to coat; season slaw with salt and pepper. Set aside until ready to serve.",
    "Heat butter in a large skillet over medium-high heat. As soon as butter begins to foam, add panko, sesame seeds, and ¼ tsp. salt and toss to coat. Cook, tossing often, until golden brown, 5–7 minutes. Let cool in pan 10 minutes.",
    "Meanwhile, place a wire rack inside a rimmed baking sheet. Set chicken on rack and pat dry with paper towels. Whisk egg, honey, ¼ cup dressing, and 1½ tsp. salt in a medium bowl.",
    "Toss chicken in egg mixture to coat. Lift chicken from bowl, letting excess drip back into bowl. Coat in panko mixture, pressing to adhere, then return to rack, spacing evenly apart.",
    "Bake chicken until cooked through, juices run clear when thighs are pierced with a knife, and panko mixture is slightly darkened in color, 15–20 minutes. Let chicken cool 10 minutes, then slice ½\" thick.",
    "Divide chicken, slaw, and rice among bowls. Top with scallions, avocado, and cashews. Drizzle with remaining dressing. Serve with lime wedges for squeezing over."
  ]
}