{
  "title": "Golden Fried Rice",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Serves 4",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "FOR THE MUSHROOM FLOSS",
    "- 2 teaspoons Mushroom Seasoning Powder, homemade or store-bought",
    "- 1 teaspoon Japanese curry powder",
    "- ½ teaspoon granulated sugar",
    "- ½ teaspoon kosher salt",
    "- 1 tablespoon extra-virgin olive oil",
    "- 14 ounces enoki mushrooms, bottom 1 inch trimmed",
    "FOR THE DISH",
    "- 2 tablespoons extra-virgin olive oil",
    "- 2 tablespoons thinly sliced fresh red Thai bird chilies",
    "- 1½ teaspoons finely chopped garlic",
    "- 4 cups freshly cooked jasmine rice",
    "- 2 tablespoons finely chopped pickled sushi ginger",
    "- 2 tablespoons yellow or green chives",
    "- 1 tablespoon golden or brown flax seeds",
    "- 1 tablespoon toasted sesame seeds"
  ],
  "directions": [
    "1. PREHEAT the oven to 250ºF.",
    "2. GRIND the mushroom seasoning powder, curry powder, sugar, and salt in a spice grinder to a fine powder.",
    "3. IN a medium mixing bowl, combine 1 teaspoon of the powder with the olive oil and stir well. Add the mushrooms and toss to coat. Reserve the remaining powder.",
    "4. SPREAD the mushrooms on two parchment-lined sheet pans in a single layer. Bake until shriveled and chewy like jerky, 40 to 45 minutes.",
    "5. LET cool, then chop the mushrooms fairly finely.",
    "6. IN a small bowl, combine the remaining mushroom seasoning powder mixture with 1 tablespoon warm water and stir to dissolve.",
    "7. HEAT the oil in a large heavy skillet over medium-high heat until shimmering. Stir in the chilies and garlic and cook until fragrant but not colored, about 30 seconds.",
    "8. TURN off the heat and add the rice, pickled ginger, dissolved seasoning mixture, and mushroom floss. Gently stir to coat the rice, breaking up clumps without smashing the grains.",
    "9. TURN the heat back to high and cook, stirring occasionally, just until heated through, 30 seconds to 1 minute.",
    "10. SERVE in bowls topped with the chives, flax seeds, and sesame seeds."
  ]
}