{
  "title": "Golden Brown & Delicious Chicken Breasts with Crispy Bread Salad",
  "source": "Molly Baz - Cook This Book",
  "servings": "4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1medium head radicchio (about 8 ounces)",
    "3garlic cloves, unpeeled",
    "DAIRY",
    "2ounces Piave, Parmesan, or pecorino cheese",
    "3tablespoons unsalted butter",
    "MEAT",
    "2large bone-in, skin-on chicken breasts (about 2 pounds)",
    "PANTRY",
    "Kosher salt and freshly ground black pepper",
    "5tablespoons extra-virgin olive oil",
    "1cup Castelvetrano olives",
    "¼baguette (about 3 ounces)",
    "3oil-packed anchovy fillets",
    "3tablespoons sherry vinegar",
    "Honey, for drizzling"
  ],
  "directions": [
    "① Preheat the oven to 425°F.",
    "② Season the chicken: Pat the chicken dry and season it evenly all over with 2½ teaspoons salt and lots of black pepper.",
    "③ Cook the chicken:",
    "✦Heat 2 tablespoons olive oil in a 12-inch cast-iron skillet over medium-high heat until just beginning to smoke. Place the chicken breasts skin-side down in the skillet and reduce the heat to medium. Cook, undisturbed, until the skin is golden brown, 6 to 8 minutes. Move the breasts around the pan if the chicken seems to be browning more quickly in some parts than others.",
    "✦Transfer to the oven (skin-side down). Roast until an instant-read thermometer registers 145°F when inserted into the thickest part of the breast, 25 to 30 minutes.",
    "④ Prep the salad:",
    "✦Meanwhile, tear 1 medium radicchio head into large pieces and transfer to a large bowl.",
    "✦Using a vegetable peeler, shave 2 ounces Piave cheese right into the radicchio.",
    "✦Smash 1 cup Castelvetrano olives with the bottom of a mug or glass measuring cup. Discard the pits and add the olives to the salad.",
    "✦Tear ¼ of a baguette into irregular 1-inch pieces. Set aside.",
    "⑤ Baste the chicken:",
    "✦Smash 3 garlic cloves but don’t peel them.1",
    "✦When the chicken is done, remove the skillet from the oven and transfer it to the stovetop. Keep the oven on.",
    "✦Flip the chicken breasts skin-side up. Add 3 tablespoons butter, the garlic, and 3 anchovy fillets to the skillet and set over medium heat. Tilt the pan slightly toward you, let the melted butter collect at the side of the pan, and, using a large spoon, continuously baste the chicken breasts with the butter for 2 minutes. Need a quick butter-basting tutorial? See here. Transfer the chicken to a cutting board to rest, leaving the anchovy-garlic butter behind.",
    "✦Add the torn bread to the butter and stir the pieces around to coat. Return the skillet to the oven and bake until the croutons are crisp and golden brown, 8 to 10 minutes.",
    "⑥ Dress the salad:",
    "✦Add the croutons and garlic to the bowl of salad.",
    "✦Drizzle 3 tablespoons sherry vinegar and 3 tablespoons olive oil over the radicchio; toss well. Season with salt and black pepper. Lightly drizzle the salad with honey, tossing once to create pockets of sweetness.",
    "⑦ Serve: Carve the chicken breasts off the bone, slice them crosswise, and serve with the salad."
  ]
}