{
  "title": "Gougères",
  "source": "Modern Bistro - ATK",
  "servings": "10–12 servings (makes 24 puffs)",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "2large eggs plus 1 large white",
    "¼teaspoon table salt",
    "½cup water",
    "2tablespoons unsalted butter, cut into 4 pieces",
    "Pinch cayenne pepper",
    "½cup (2½ ounces) all-purpose flour",
    "4ounces Gruyère cheese, shredded (1 cup)"
  ],
  "directions": [
    "1. Adjust oven rack to upper-middle position and heat oven to 425 degrees. Line rimmed baking sheet with parchment paper and set in second rimmed baking sheet. In 2-cup liquid measuring cup, beat eggs and white and salt until well combined. (You should have about ½ cup egg mixture. Discard excess.) Set aside.",
    "2. Heat water, butter, and cayenne in small saucepan over medium heat. When mixture begins to simmer, reduce heat to low and immediately stir in flour using wooden spoon. Cook, stirring constantly, using smearing motion, until mixture is very thick, forms ball, and pulls away from sides of saucepan, about 30 seconds.",
    "3. Immediately transfer mixture to food processor and process with feed tube open for 5 seconds to cool slightly. With processor running, gradually add reserved egg mixture in steady stream, then scrape down sides of bowl and add Gruyère. Process until paste is very glossy and flecked with coarse cornmeal–size pieces of cheese, 30 to 40 seconds. (If not using immediately, transfer paste to bowl, press sheet of greased parchment directly on surface, and store at room temperature for up to 2 hours.)",
    "4. Scoop 1 level tablespoon of dough. Using second small spoon, scrape dough onto prepared sheet into 1½-inch-wide, 1-inch-tall mound. Repeat, spacing mounds 1 to 1¼ inches apart. (You should have 24 mounds.) Using back of spoon lightly coated with vegetable oil spray, smooth away any creases and large peaks on each mound.",
    "5. Bake until gougères are puffed and upper two-thirds of each are light golden brown (bottom third will still be pale), 14 to 20 minutes. Turn off oven; leave gougères in oven until uniformly golden brown, 10 to 15 minutes (do not open oven for at least 8 minutes). Transfer gougères to wire rack and let cool for 15 minutes. Serve warm. (Cooled gougères can be stored in airtight container at room temperature for up to 24 hours or frozen in zipper-lock bag for up to 1 month. To serve, crisp gougères in 300-degree oven for about 7 minutes.)"
  ]
}