{
  "title": "Granola Biscotti",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 36 biscotti",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "1cup (130 grams) all-purpose flour, plus more for your work surface",
    "1½cups plus 2 tablespoons (130 grams) rolled oats",
    "1teaspoon baking powder",
    "¼teaspoon baking soda",
    "½teaspoon table or fine sea salt",
    "6tablespoons (85 grams) unsalted butter, melted, or virgin coconut oil, warmed until liquefied",
    "¼cup (50 grams) granulated or raw (turbinado) sugar",
    "¼cup (50 grams) light- or dark-brown sugar",
    "2large eggs",
    "½teaspoon vanilla extract (optional)",
    "½cup (45 grams) thinly sliced almonds",
    "½cup (40 grams) shredded unsweetened coconut",
    "1cup (about 150 grams) dried fruit of your choice, such as raisins, cranberries, cherries, or chopped dried apricots or figs, or a mix thereof",
    "1egg white"
  ],
  "directions": [
    "Mix the flour, rolled oats, baking powder, baking soda, and salt in a small bowl. Whisk the melted butter and sugars in the bottom of a large bowl. Whisk in the eggs and vanilla. Stir in the dry ingredients, nuts, coconut, and dried fruit. Expect a stiff batter.",
    "Position a rack in the center of the oven, and heat to 325 degrees. Line a baking sheet with parchment paper.",
    "On a floured counter, using floured hands roll half the dough into a log a little shy of the length of your baking sheet, 12 to 14 inches. Transfer the dough log to the baking sheet, and pat lightly until it becomes more oval-shaped. Repeat with the second half of the dough. Beat the egg white until foamy, and brush it over logs. Bake the logs for 20 minutes, until they are lightly golden brown and beginning to form cracks.",
    "Let cool almost completely (it’s okay if the centers are still lukewarm), about 1 hour. With a serrated knife, cut the logs on the bias into ½-inch-thick slices. They will be crumbly; cut as gently as possible. Transfer the slices back to the parchment-lined baking sheet, and lay flat in a single layer. Bake for another 20 minutes, until toasted and crisp. (If you like, you can flip them halfway for more even browning, but you will have good color on them either way.)",
    "Cool the biscotti on the baking sheet, or transfer to a rack.",
    ""
  ]
}