{
  "title": "Grand Marnier Soufflé",
  "source": "Modern Bistro - ATK",
  "servings": "Serves: 6 to 8",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "1Tablespoon Unsalted Butter, Softened",
    "¼Cup Sugar",
    "2Teaspoons Sifted Cocoa Powder"
  ],
  "directions": [
    "1. Prepare soufflé dish: Adjust oven rack to upper-middle position and heat oven to 400 degrees. Grease 1½-quart porcelain soufflé dish with butter, making sure to coat all interior surfaces. Stir sugar and cocoa together in small bowl; pour into buttered soufflé dish and shake to coat bottom and sides with thick, even coating. Tap out excess and set dish aside.",
    "2. For the soufflé: Whisk flour, ¼ cup sugar, and salt in small saucepan. Gradually whisk in milk, whisking until smooth and no lumps remain. Bring mixture to boil over high heat, whisking constantly, until thickened and mixture pulls away from sides of pan, about 3 minutes. Scrape mixture into medium bowl; whisk in butter until combined. Whisk in yolks until incorporated; stir in orange zest and Grand Marnier.",
    "3. Using stand mixer fitted with whisk attachment, whip egg whites, cream of tartar, and 1 teaspoon more sugar on medium-low speed until combined, about 10 seconds. Increase speed to medium-high and whip until frothy and no longer translucent, about 2 minutes. With mixer running, sprinkle in half of remaining sugar; continue whipping until whites form soft, billowy peaks, about 30 seconds. With mixer still running, sprinkle in remaining sugar and whip until just combined and soft peaks form, about 10 seconds.",
    "4. Using rubber spatula, immediately stir one-quarter of beaten whites into soufflé base to lighten until almost no white streaks remain. Scrape remaining whites into base and fold in whites with balloon whisk until mixture is just combined, gently flicking whisk after scraping up sides of bowl to free any mixture caught in whisk. Gently pour mixture into prepared dish and run your index finger through mixture, tracing circumference about ½ inch from side of dish, to help soufflé rise properly. Bake until surface of soufflé is deep golden brown, it has risen 2 to 2½ inches above rim of dish, and interior registers 170 degrees, 20 to 25 minutes. Serve immediately.",
    "Making and Baking a Soufflé",
    "1. Grease soufflé dish and coat it evenly with cocoa mixture.2. Gently pour soufflé batter into prepared dish, leaving 1 inch headroom so batter can set before it rises above top of dish.3. Bake soufflé until surface is deep golden brown and it has risen 2 to 2½ inches above rim of dish.4. To test for doneness, use instant-read thermometer to check that interior registers 170 degrees."
  ]
}