{
  "title": "Grandma-Style Chicken Noodle Soup",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 8 hearty servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "broth",
    "1tablespoon (15 ml) oil of your choice or butter",
    "2large onions, unpeeled, quartered",
    "2medium carrots, cut into 1-to-2-inch segments",
    "2celery stalks, cut into 1-to-2-inch segments",
    "2garlic cloves, unpeeled and lightly smashed",
    "A handful of parsley stems (save the leaves for garnish)",
    "2teaspoons peppercorns",
    "1bay leaf",
    "One 3¼-to-4-pound (about 1¾-kilogram) chicken, either whole or cut into halves so it fits better in your pot",
    "3½quarts (14 cups or 3⅓ liters) water",
    "to finish",
    "8ounces (225 grams) dried egg noodles",
    "5celery stalks, in ½- to-1-inch chunks",
    "5medium carrots, in ½- to-1-inch chunks",
    "Kosher salt and freshly ground black pepper, to taste",
    "Chopped fresh parsley leaves, to finish"
  ],
  "directions": [
    "make the broth Heat the oil or butter in the bottom of your largest pot (8 quarts is ideal here; see note) over medium heat, and add the onions, carrots, and celery. Cook, stirring occasionally, until they’re browned in spots and a little soft, 10 to 15 minutes. Add the garlic, parsley stems, peppercorns, bay leaf, and chicken, then the water, and bring to a boil. Reduce the heat to a simmer and cook, mostly covered, for 25 minutes, then use tongs to remove the chicken from the broth, leaving the broth covered on the lowest heat. As soon as the chicken is cool enough to handle, discard the skin and pick the meat from the bones, covering it and setting it aside until needed. Return the bones to the stock and bring it back to a simmer. Cook, mostly covered, for 1 to 2 hours; less time will make a fine pot of soup; a longer amount of time will make an even more developed flavor.",
    "Pour the soup through a fine-mesh strainer, wipe out your stockpot, and return the broth to it. (You should have about 3 quarts of stock.)",
    "cook the noodles Bring a separate pot of well-salted water to a boil and cook the noodles according to package directions; drain when finished.",
    "finish the soup Meanwhile, bring the soup broth back to a simmer and add salt and pepper to taste—I usually need at least 1 tablespoon kosher salt and ½ to 1 teaspoon of pepper adds a nice warmth—then add the additional celery and cook for 5 minutes; then the additional carrots, and cook everything together for 7 to 10 minutes more, or until the vegetables are tender. Add the reserved chicken and noodles, taste again for seasoning and adjust as needed, and heat just to warm through. Ladle into bowls and finish with fresh herbs."
  ]
}