{
  "title": "Grapefruit & Burrata Salad with Chile Crisp",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 3 garlic cloves",
    "- 1 medium shallot",
    "- 2 grapefruit (about 2 pounds total)",
    "DAIRY",
    "- 8 ounces burrata cheese",
    "PANTRY",
    "- ⅓ cup extra-virgin olive oil",
    "- 1 cinnamon stick",
    "- Kosher salt",
    "- 2 teaspoons red pepper flakes",
    "- Flaky sea salt, for serving",
    "- Crusty bread, for serving (optional)"
  ],
  "directions": [
    "1. Make the chile crisp:- Thinly slice 3 garlic cloves.- Thinly slice 1 shallot crosswise into rings.- Set a fine-mesh strainer over a small heatproof bowl.- In a small saucepan set over medium-low heat, combine ⅓ cup olive oil, 1 cinnamon stick, the garlic and shallot, and ½ teaspoon kosher salt. Cook, stirring, until the oil comes to a simmer, about 2 minutes. Continue to cook, stirring with a fork to separate the shallot rings and swirling the pan occasionally, until the shallots and garlic are golden brown, 13 to 15 minutes. Keep a close eye on them in the last few minutes; they can turn from light golden brown to burnt pretty quickly.- Pour the shallot oil into the prepared strainer. Discard the cinnamon stick and let the shallots and garlic cool in the strainer for 2 to 3 minutes, then stir them back into the oil they were cooked in, along with 2 teaspoons red pepper flakes.",
    "2. Prep the citrus:- Trim both ends of 2 grapefruit. Use your knife to follow the contours of each piece of fruit, cutting away the peel and pith and leaving behind only the flesh. Cut about half of the citrus crosswise into ½-inch-thick rounds. Tear the remaining citrus into segments with your fingers, discarding the membrane that holds them all together. You’re looking for a mix of irregular shapes, which will vary the texture and look of the dish. It honestly doesn’t matter how you get there.",
    "3. Serve:- Tear an 8-ounce ball of burrata into large pieces, arranging them on a large rimmed platter or plate followed by the grapefruit pieces.- Spoon the chile crisp over everything. Season well with flaky sea salt—it’ll need quite a bit to make all of that creamy burrata really pop. Serve with crusty bread, if desired."
  ]
}