{
  "title": "Grated Tomato Linguine",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 to 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "31⁄2 pounds (1.5 kg) beefsteak or heirloom tomatoes",
    "1⁄4 cup (60 ml) olive oil, plus more for serving",
    "6garlic cloves, minced",
    "3oil-packed anchovy fillets",
    "Kosher salt and freshly cracked black pepper, to taste",
    "1pound (454 g) dry linguine",
    "1⁄2 cup (55 g) finely grated pecorino Romano",
    "1cup (15 g) torn fresh basil leaves, plus more for serving",
    "4ounces (113 g) burrata, at room temperature, optional"
  ],
  "directions": [
    "1. Grate the tomatoes on the large holes of a box grater into a large bowl, discarding the skin when you get down to the end.2. Place the olive oil, garlic, and anchovies in a large pot. Set over medium heat, and cook, stirring, until the anchovies melt into the oil and the garlic is slightly golden, 2 or 3 minutes.3. Add the grated tomatoes, and season with a small pinch of salt and a few grinds of pepper.4. Reduce the heat to medium-low, and cook, uncovered and stirring occasionally, until the tomatoes cook down and the sauce thickens, 45 to 55 minutes. Season with a small pinch of salt and a few grinds of pepper.5. When the tomato sauce is close to being finished, bring a large pot of water to a boil over high heat. Generously season with salt.6. Drop in the linguine, and cook according to the package directions until it’s about 1 minute under al dente. Drain the pasta, reserving 1 mugful of pasta water.7. Add the pasta to the pot with the tomato sauce, toss to coat, and reduce the heat to low.8. Add the pecorino Romano, and toss again. Add a small splash of pasta water if needed to create a nice cohesive sauce that coats the pasta evenly. (This pasta dish may not need any pasta water, depending on the water content of your tomatoes.) Drizzle in a bit more olive oil, and season with salt and pepper.9. Turn off the heat, and toss in the basil to wilt slightly.10. Divide the pasta among serving bowls. Top with more fresh basil, torn burrata, if using, a drizzle of olive oil, and pepper, and serve."
  ]
}