{
  "title": "Graziella’s Pasta al Pomodoro",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 12 garlic cloves",
    "- 3½ pounds cherry or Sungold tomatoes",
    "- 1 small bunch basil",
    "DAIRY",
    "- 2 ounces grated Parmesan cheese (about ½ cup), plus more for serving",
    "PANTRY",
    "- Kosher salt",
    "- ⅔ cup extra-virgin olive oil, plus more for drizzling",
    "- Pinch of sugar, if needed",
    "- 1 pound dried short pasta, such as orecchiette, fusilli, rigatoni, cavatappi"
  ],
  "directions": [
    "1. Bring a large pot of heavily salted water to a boil.",
    "2. Make the sauce:- Firmly smash 12 garlic cloves, then peel them.- In a large Dutch oven, heat 2/3 cup olive oil over medium heat for 2 minutes. Add the garlic cloves and cook, stirring often, until very fragrant but not browned, about 1 minute. Immediately add 1¾ pounds cherry tomatoes to the oil and cook until they begin to burst and release some juices, 7 to 9 minutes.- Add an additional 1¾ pounds cherry tomatoes and 1½ teaspoons salt, along with 2 large sprigs of basil.- Bring the sauce to a simmer over medium-high heat, then reduce the heat to medium to maintain a simmer and cook until very saucy, thickened, and almost all the tomatoes have burst, 20 to 25 minutes. Remove from the heat. Pluck out and discard the basil sprigs. Taste the sauce and if it’s quite acidic, add a small pinch of sugar. Cover to keep warm.",
    "3. Cook the pasta: Cook the pasta according to the package directions until al dente. Scoop out and reserve 1 cup of the pasta water, then drain.",
    "4. Finish the sauce: Return the tomato sauce to medium heat. Add the pasta along with half of the reserved pasta water. Add 2 ounces grated Parmesan cheese (½ cup) in several handfuls, tossing the pasta with tongs until very well coated; the sauce should cling to the pasta. If it seems like the sauce is a little tight and thick, continue to add some of the reserved pasta water, a splash at a time, until the consistency is right.",
    "5. Serve: Divide the pasta among 4 bowls. Tear the leaves of the remaining basil over top of each bowl and finish with more grated Parmesan and a drizzle of olive oil."
  ]
}