{
  "title": "Green Chicken with Rice",
  "source": "Chuckycruz.substack.com",
  "servings": "",
  "categories": [],
  "ingredients": [
    "2 1/2lbs. bone in, skin on chicken thighs (4-6 pieces)",
    "Salt & pepper, to taste",
    "1inch fresh ginger, peeled and chopped",
    "4garlic cloves",
    "2jalapeños, chopped",
    "13.5oz can of coconut milk, unsweetened",
    "1Tbsp ground coriander",
    "1tsp ground cumin",
    "1/2tsp ground cardamom",
    "1bunch of cilantro",
    "1/2cup pepitas, soaked for at least 2 hours",
    "1/4cup water",
    "For topping:",
    "Fried shallots",
    "Black sesame seeds",
    "Toasted pepitas",
    "Cilantro leaves",
    "Cooked rice"
  ],
  "directions": [
    "Preheat oven to 350 F.",
    "Season chicken thighs all over with salt and black pepper. Add oil to a large pot over medium heat. Once hot, add chicken thighs skin side down, and sear until deeply golden, about 8-12 minutes.",
    "Meanwhile, in a blender or immersion blender, puree ginger, garlic, jalapeños and coconut milk until smooth. Set aside.",
    "Flip chicken and cook the second side about 3 minutes more.",
    "Transfer chicken to a plate and carefully (it will be hot) peel off skin and place on a lined sheet tray.",
    "Transfer the skins to the oven and cook until very crispy, about 30 minutes. Flip skins over half way through the cooking process. Set aside to cool.",
    "While chicken skins crisp, braise the thighs.",
    "In the same pan you seared the chicken, over medium heat, toast the coriander, cumin, and cardamom until aromatic, about 1 minute.",
    "Pour in coconut milk mixture and bring to boil.",
    "Reduce to simmer and add back in chicken thighs. Cook until tender. About 45 minutes.",
    "While chicken is cooking, blanch cilantro in boiling water and shock in an ice bath.",
    "Add soaked pepitas and blanched cilantro to blender with 1/4 cup water.",
    "Blend until smooth. Once chicken is done, stir in pepita mixture and cook until sauce has thickened. About 5 minutes.",
    "Crumble reserved chicken skins and mix with fried shallots**, sesame seeds and toasted pepitas.",
    "Taste sauce for salt and pepper, and adjust seasoning accordingly. Maybe add a squeeze of lime if you’d like. Serve with rice and top with chicken skin topping.",
    "** For fried shallots, I used about 3-4 medium sized shallots. Sliced thin (about 1/8 in) on a mandoline. Add to pot and cover with just enough oil. Cook on medium low to low heat until very light brown (they will not seem crispy but crisp up when cooled) and strain. About 15-20 minutes. Drain on a paper towel and immediately season with salt. You can make this ahead of time, just store in a dry airtight container."
  ]
}