{
  "title": "Grilled Yogurt Flatbreads",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 4 large flatbreads",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "¾cup (175 ml) warm water",
    "Heaped 1 teaspoon (about ½ of one ¼-ounce or 7-gram packet) active dry yeast",
    "2tablespoons (30 ml) olive oil, plus more for bowl and brushing",
    "½cup (115 grams) Greek or other thick plain yogurt",
    "2½cups plus 2 tablespoons (340 grams) flour, all-purpose (or blended; see note), plus more for your work surface",
    "1½teaspoons coarse or kosher salt",
    "flavoring ideas: 1 tablespoon finely chopped fresh herbs (such as parsley, thyme, basil, mint, oregano, or dill); zest of ½ lemon, 1 minced garlic clove; Indian or Middle Eastern spices, such as za’atar, and/or a little crumbled cheese.",
    ""
  ],
  "directions": [
    "",
    "Place the warm water in the bottom of a medium bowl. Sprinkle the yeast over the top, and let it dissolve for 10 minutes. Stir in the olive oil and yogurt, then 2 cups flour and all the salt plus flavorings of choice (except za’atar, which is best at the end). Combine with a wooden spoon until everything is incorporated. Add ½ cup flour, and stir it in—the dough will be getting stiff, so flex those guns—and then the remaining 2 tablespoons. Bash it around in the bowl, then scrape it onto the counter while you roll 1 tablespoon olive oil around in the bowl. Return the dough immediately to the bowl, cover it with plastic wrap, and set it aside until it has about doubled in size, 60 to 70 minutes.",
    "Flip the dough out onto a floured counter, and divide it into quarters (or more pieces, for smaller breads). Flour a baking tray. Roughly stretch each dough piece flat on the tray with your equally floured fingers. Repeat with the remaining pieces. Brush the bread tops with olive oil.",
    "Heat your outdoor grill or a stove top grill pan to medium-high. Once it’s hot, place the dough, oiled side down, on it and grill until dark grill marks appear underneath, about 5 minutes. Brush the tops of flatbreads with more oil, then flip the breads over and cook until the second side is dark, too.",
    ""
  ]
}