{
  "title": "Grilled Pork Bánh Mì Sandwiches with Quick Pickles",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "4",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "For the Pickles",
    "1large carrot, shredded",
    "2small cucumbers, sliced into ribbons with a vegetable peeler",
    "½small onion, sliced into thin rings",
    "½cup unseasoned rice vinegar",
    "⅓cup granulated sugar",
    "1teaspoon kosher salt",
    "5black peppercorns",
    "1fresh chile, halved lengthwise",
    "For the Pork",
    "1¼pounds pork tenderloin",
    "½cup (packed) light brown sugar",
    "3tablespoons soy sauce",
    "3tablespoons canola oil",
    "Grated zest of 1 lime",
    "2tablespoons fresh lime juice",
    "1tablespoon fish sauce",
    "1shallot, thinly sliced",
    "2cloves garlic, very thinly sliced",
    "1tablespoon Sriracha",
    "¼teaspoon ground white pepper",
    "For the Sandwiches",
    "4individual baguettes, split and toasted",
    "Mayonnaise",
    "Sriracha",
    "2cups loosely packed fresh cilantro leaves"
  ],
  "directions": [
    "MAKE THE PICKLES: In a heatproof medium bowl, combine the carrot, cucumbers, and onion. In a small saucepan, bring the vinegar, granulated sugar, salt, peppercorns, and chile to a boil. Reduce the heat and simmer for 3 minutes, then remove from the heat and let cool for 5 minutes. Pour over the vegetables and toss to coat. Cover and refrigerate for at least 1 hour. Pickles will keep, chilled in the brine, for 1 week.",
    "MAKE THE PORK: Using a very sharp knife, cut the pork into ¼-inch-thick medallions. In a medium bowl, combine the brown sugar, soy sauce, oil, lime zest, lime juice, fish sauce, shallot, garlic, Sriracha, and white pepper. Add the pork and toss to coat. Cover and refrigerate for at least 1 hour and up to 4 hours. Drain the pork.",
    "Heat a heavy skillet or grill pan over medium-high heat until super hot. Add the pork, spreading it out as best you can, and sear until dark and caramelized, 2 to 3 minutes (try not to move the meat around a lot!), then flip it to finish cooking, another 2 to 3 minutes.",
    "ASSEMBLE THE SANDWICHES: Spread a generous amount of mayo on both sides of each baguette and squiggle with some Sriracha. Pile about ⅓ cup of pickles (shake ’em dry!) on the bottom half of each baguette. Top each sandwich with one-quarter of the grilled pork and ½ cup cilantro leaves. Close the sandwiches and cut in half."
  ]
}