{
  "title": "Grilled Chicken Toasts with Mashed Peas & Ricotta",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "2",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "For the Mashed Peas and Ricotta",
    "½cup frozen peas, well thawed",
    "½cup whole-milk ricotta cheese",
    "Finely grated zest of ½ lemon",
    "1tablespoon Shallot Oil (this page)",
    "1tablespoon finely shredded fresh mint",
    "Kosher salt and freshly ground black pepper",
    "For the Dressing",
    "3tablespoons Shallot Oil (this page)",
    "1tablespoon fresh lemon juice",
    "½teaspoon Dijon mustard",
    "Kosher salt and freshly ground black pepper",
    "For the Chicken and Toasts",
    "1(6-ounce) boneless, skinless chicken breast",
    "3tablespoons Shallot Oil (this page)",
    "Kosher salt and freshly ground black pepper",
    "2big slices French bread",
    "For Serving",
    "Kosher salt and freshly ground black pepper",
    "Crispy Shallots (this page)",
    "A big pinch fresh mint, for garnish",
    "A big pinch grated lemon zest, for garnish"
  ],
  "directions": [
    "MAKE THE MASHED PEAS AND RICOTTA: In a medium bowl, combine the peas, ricotta, lemon zest, shallot oil, mint, and salt and pepper to taste. Mash with a potato masher until chunky-creamy.",
    "MAKE THE DRESSING: In a screw-top jar, combine the shallot oil, lemon juice, mustard, and salt and pepper to taste. Shake to combine.",
    "GRILL THE CHICKEN AND TOASTS: Preheat a grill or grill pan over medium-high heat.",
    "Brush the chicken with 1 tablespoon of the shallot oil and season with salt and pepper. Grill until cooked through, 4 to 5 minutes per side. Remove to a plate, cool slightly, and slice against the grain into ¼-inch-thick slices.",
    "Brush each slice of bread with 1 tablespoon of the shallot oil and grill the toasts until golden, 2 to 3 minutes, flipping occasionally so the bread doesn’t burn. Season the oiled side with salt and pepper.",
    "TO SERVE: Divide the mashed peas between the 2 grilled toasts, then fan half the chicken on top of each toast. Season with more salt and pepper. Drizzle with the dressing, top with crispy shallots, and garnish with mint and lemon zest."
  ]
}