{
  "title": "Grilled Chicken Fajitas",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "6tablespoons vegetable oil, divided",
    "⅓cup lime juice (3 limes)",
    "1jalapeño chile, stemmed, seeded, and minced",
    "1½tablespoons minced fresh cilantro",
    "3garlic cloves, minced",
    "1tablespoon Worcestershire sauce",
    "1½teaspoons packed brown sugar",
    "2⅛teaspoons table salt, divided",
    "¾teaspoon plus ⅛ teaspoon pepper, divided",
    "1½pounds boneless, skinless chicken breasts, trimmed",
    "2large red, green, and/or yellow bell peppers, quartered, stemmed, and seeded",
    "1large red onion, sliced into ½-inch-thick rounds",
    "12(6-inch) flour tortillas"
  ],
  "directions": [
    "1. Whisk ¼ cup oil, lime juice, jalapeño, cilantro, garlic, Worcestershire, sugar, 1 teaspoon salt, and ¾ teaspoon pepper together in large bowl. Measure out ¼ cup marinade and set aside for serving. Whisk 1 teaspoon salt into remaining marinade. Pound chicken breasts to uniform thickness. Add chicken to marinade, cover, and refrigerate, turning occasionally, for 30 minutes.",
    "2. Brush bell peppers and onion with remaining 2 tablespoons oil and sprinkle with remaining ⅛ teaspoon salt and remaining ⅛ teaspoon pepper. Remove chicken from marinade, let excess marinade drip off, and transfer to plate.",
    "3A. For a charcoal grill Open bottom vent completely. Light large chimney starter filled with charcoal briquettes (6 quarts). When top coals are partially covered with ash, pour coals over two-thirds of grill. Set cooking grate in place, cover, and open lid vent completely. Heat grill until hot, about 5 minutes.",
    "3B. For a gas grill Turn all burners to high, cover, and heat grill until hot, about 15 minutes. Leave primary burner on high and turn other burner(s) to medium.",
    "4. Clean and oil cooking grate. Place chicken on hotter side of grill and vegetables on cooler side of grill. Cook (covered if using gas), turning chicken and vegetables as needed, until chicken is well browned and registers 160 degrees and vegetables are tender and slightly charred, 10 to 15 minutes. Transfer chicken and vegetables to cutting board and tent with aluminum foil.",
    "5. Working in batches, grill tortillas, turning as needed, until warm, about 30 seconds; wrap tightly in foil to keep soft.",
    "6. Slice bell peppers into ¼-inch strips, separate onion into rings, and toss together with 2 tablespoons reserved marinade. Slice chicken on bias into ¼-inch-thick slices and toss with remaining 2 tablespoons marinade in separate bowl. Transfer chicken and vegetables to serving platter and serve with tortillas."
  ]
}