{
  "title": "Grilled Jerk Chicken",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "4scallions",
    "¼cup vegetable oil",
    "¼cup soy sauce",
    "2tablespoons cider vinegar",
    "2tablespoons packed brown sugar",
    "1–2habanero chiles, stemmed",
    "10sprigs fresh thyme",
    "5garlic cloves, peeled",
    "2½teaspoons ground allspice",
    "1½teaspoons table salt",
    "½teaspoon ground cinnamon",
    "½teaspoon ground ginger",
    "3pounds bone-in chicken pieces (split breasts halved crosswise, drumsticks, and/or thighs), trimmed",
    "Lime wedges"
  ],
  "directions": [
    "1. Process scallions, oil, soy sauce, vinegar, sugar, habanero(s), thyme sprigs, garlic, allspice, salt, cinnamon, and ginger in blender until smooth, about 30 seconds, scraping down sides of blender jar as needed. Measure out ¼ cup marinade and refrigerate until ready to use.",
    "2. Place chicken and remaining marinade in 1-gallon zipper-lock bag. Press out air, seal bag, and turn to coat chicken in marinade. Refrigerate for at least 1 hour or up to 24 hours, turning occasionally.",
    "3A. For a charcoal grill Open bottom vent completely. Light large chimney starter mounded with charcoal briquettes (7 quarts). When top coals are partially covered with ash, pour evenly over half of grill. Set cooking grate in place, cover, and open lid vent completely. Heat grill until hot, about 5 minutes.",
    "3B. For a gas grill Turn all burners to high, cover, and heat grill until hot, about 15 minutes. Leave primary burner on high and turn off other burner(s). (Adjust primary burner [or, if using 3-burner grill, primary burner and second burner] as needed to maintain grill temperature between 450 and 500 degrees.)",
    "4. Clean and oil cooking grate. Place chicken skin side up on cooler side of grill, with breast pieces farthest away from heat. Cover and cook until breasts register 160 degrees and drumsticks/thighs register 175 degrees, 22 to 30 minutes, transferring pieces to plate, skin side up, as they come to temperature. (Re-cover grill after checking pieces for doneness.)",
    "5. Brush skin side of chicken with half of reserved marinade. Place chicken skin side down on hotter side of grill. (Turn all burners to high if using gas.) Brush with remaining reserved marinade and cook until lightly charred, 1 to 3 minutes per side. Check browning often and move pieces as needed to avoid flare-ups.",
    "6. Transfer chicken to platter, tent with aluminum foil, and let rest for 5 to 10 minutes. Serve with lime wedges."
  ]
}