{
  "title": "Grilled Summer Beans and Garlic Vinaigrette",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 6 to 8 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Garlic Vinaigrette",
    "25g / 1 small shallot, finely diced",
    "150g / ⅔ cup olive oil",
    "125g / 25 cloves garlic, finely chopped",
    "6g / 2 Tbsp finely chopped marjoram",
    "15g / 3 Tbsp finely chopped parsley",
    "¼tsp dried red chile flakes",
    "55g / ¼ cup red wine vinegar",
    "To Finish",
    "794g / 1¾ lb summer beans, trimmed",
    "42g / 3 Tbsp olive oil",
    "½tsp salt",
    "¼tsp dried red chile flakes",
    "Flaky sea salt, q.b."
  ],
  "directions": [
    "1   To make the vinaigrette, put the shallot and the olive oil in a small saucepan over very low heat and cook until the shallot starts to soften and becomes completely translucent, 5 to 8 minutes. Add the garlic and continue to cook, stirring frequently, until the shallots are totally softened and the garlic is softened but without color, 2 to 3 minutes.",
    "2   Transfer the contents of the pan to a heatproof bowl and let cool.",
    "3   Once cooled, add the marjoram, parsley, and chile flakes. This is your vinaigrette base. Measure out 80g / ⅓ cup and set aside. Transfer the remainder to an airtight container and refrigerate for up to 5 days for another use.",
    "4   To finish, preheat your grill to high or place a grill pan over high heat on the stove top.",
    "5   Place the beans in a large bowl. Add the olive oil and salt and mix well. (You will finish with flaky sea salt, so you don’t need to go too heavy now.)",
    "6   Use a grill topper or grill basket on the grill to prevent the beans from falling through the bars of the grate. Arrange the beans in an even layer on the topper or basket. If using a grill pan, cook in batches to avoid crowding the pan. Cook, turning once, until they begin to char and soften but still have some crunch, 2 to 4 minutes on each side.",
    "7   While the beans are cooking, pour your vinaigrette base into a small measuring cup or bowl. Add the vinegar and stir to combine.",
    "8   When the beans are ready, transfer them to a large bowl. Add the vinaigrette and chile flakes and stir to combine.",
    "9   Transfer to a serving platter and garnish with sea salt q.b."
  ]
}