{
  "title": "Grilled Tuna With Apricot-Mustard-Mint Glaze",
  "source": "Mesa Grill - Bobby Flay",
  "servings": "4",
  "categories": [
    "Mesa Grill - Bobby Flay"
  ],
  "ingredients": [
    "Apricot-Mustard-Mint Glaze:",
    "- 2 tablespoons canola oil",
    "- 1 small Spanish onion, coarsely chopped",
    "- 3 cloves garlic, chopped",
    "- 2 Fresno chiles or jalapeño chiles, chopped",
    "- 1 cup chopped dried apricots",
    "- 2 cups dry white wine",
    "- 3 tablespoons light brown sugar",
    "- ¼ cup red wine vinegar",
    "- 2 tablespoons Dijon mustard",
    "- Kosher salt and freshly ground black pepper",
    "- 3 tablespoons finely chopped fresh mint",
    "Grilled Tuna:",
    "- 1 tablespoon ground cumin",
    "- 1 tablespoon ancho chile powder",
    "- 1 tablespoon light brown sugar",
    "- ¼ teaspoon ground cloves",
    "- ¼ teaspoon ground allspice",
    "- ¼ teaspoon ground cinnamon",
    "- Four (8-ounce) tuna steaks (each about 1 inch thick)",
    "- 2 tablespoons canola oil",
    "- Kosher salt and freshly ground black pepper",
    "Chopped fresh chives, for garnish (optional)",
    "Red Chile Oil for garnish (optional)",
    "Cilantro Oil for garnish (optional)"
  ],
  "directions": [
    "1. To make the glaze, heat the oil in a medium saucepan over high heat. Add the onion and cook until soft, 3 to 4 minutes. Add the garlic and chiles and cook for 1 minute. Add the apricots, wine, ¼ cup of water, and the sugar and bring to a boil. Reduce the heat to low and simmer, stirring occasionally, until the apricots are soft and most of the liquid has been absorbed, about 20 minutes. Remove from the heat and let cool slightly.",
    "2. Transfer the apricot mixture to a blender, add the vinegar and mustard, and season with salt and pepper; blend until smooth. Add the mint, pulse a few times to incorporate, and transfer the glaze to a bowl. The glaze can be made up to 1 day ahead and refrigerated. Bring to room temperature before using.",
    "3. Preheat a grill to high or a grill pan over high heat.",
    "4. Whisk together the cumin, ancho powder, sugar, cloves, allspice, and cinnamon in a bowl.",
    "5. Brush the tuna on both sides with the oil and season with salt and pepper. Rub one side of each steak with the spice rub. Place the tuna on the grill, rub side down, and cook until golden brown and a crust has formed, 2 to 3 minutes. Flip over, brush with some of the glaze, and continue cooking for 2 to 3 minutes for medium-rare. The tuna will be red in the center.",
    "6. Remove from the grill and brush or drizzle with more of the glaze before serving. Garnish with chives, red chile oil, and cilantro oil."
  ]
}