{
  "title": "Grilled Pineapple and Shrimp Salad",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 4 to 6",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "Dressing:",
    "2red Thai chilies, thinly sliced",
    "2garlic cloves, finely chopped",
    "¼cup granulated sugar",
    "¾cup freshly squeezed lime juice (about 6 limes)",
    "½cup Red Boat fish sauce",
    "⅓cup Scallion Oil",
    "Salad:",
    "24large shrimp (21–25), shelled and deveined",
    "1small ripe pineapple, sliced lengthwise into ½-inch-thick slices, core discarded",
    "¼cup canola oil",
    "½cup Pickled Cucumbers",
    "1small red onion, halved and thinly sliced",
    "1cup torn fresh cilantro leaves",
    "½cup torn fresh mint leaves",
    "½cup whole roasted unsalted peanuts",
    "⅓cup coconut flakes, lightly toasted",
    "2tablespoons Crispy Garlic",
    "2tablespoons Crispy Fried Shallots"
  ],
  "directions": [
    "1. Make the dressing: Combine the chilies and garlic in a mortar and pestle and pound to a coarse paste. Add the sugar and lime and pound until the sugar is dissolved. Stir in the fish sauce. Whisk in the scallion oil.",
    "2. Let the dressing sit while you prepare the salad to allow the flavors to meld. The dressing can be made up to 3 days in advance and stored, covered, in the refrigerator.",
    "3. Make the salad: Prepare an ice bath in a large bowl. Bring a large pot of water to a boil over high heat, add the shrimp, remove from the heat, and poach for about 2 minutes, until just cooked through. Remove the shrimp with a slotted spoon and transfer to the ice bath. Let cool for about 5 minutes. Drain well and pat dry. Remove the tail and slice each shrimp in half lengthwise.",
    "4. Heat a grill to high heat or a grill pan over high heat. Brush the pineapple on both sides with some of the oil. Grill on both sides for about 2 minutes per side, until just slightly charred but not cooked through. Remove and let cool, then cut crosswise into thin slices.",
    "5. Combine the shrimp, pineapple, cucumbers, onion, cilantro, and mint in a large bowl. Add ½ cup of the dressing and toss well to combine. Transfer to a serving bowl or platter and garnish the top with the peanuts, coconut, crispy garlic, and shallots."
  ]
}