{
  "title": "Grilled and Marinated Baby Artichokes with Bay Leaf and Orange",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 6 to 8 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Artichokes",
    "3lemons, cut in half",
    "1.1kg / 2½ lb baby artichokes (about 32)",
    "367g / 1½ cups plus 3 Tbsp dry white wine",
    "380g / 1½ cups olive oil",
    "357g / 1½ cups water",
    "45g / 3 Tbsp fresh orange juice",
    "25g / 5 garlic cloves",
    "Peel of 1 orange, pith removed",
    "4fresh bay leaves",
    "15g / ¼ bunch parsley",
    "38g / ¼ cup plus ½ tsp salt",
    "Salmoriglio",
    "280g / 1¼ cups olive oil",
    "75g / 15 cloves garlic, finely chopped",
    "Peels of 2 oranges, pith removed and peels finely chopped",
    "20g / ¼ cup finely chopped parsley",
    "2g / 1 tsp dried red chile flakes",
    "60g / ¼ cup fresh orange juice",
    "To Finish",
    "Olive oil, q.b.",
    "2lemons, cut in half and seeds removed",
    "Flaky sea salt, q.b.",
    "6g / ½ cup loosely packed parsley leaves",
    "3g / ¼ cup loosely packed mint leaves"
  ],
  "directions": [
    "1   To make the artichokes, fill a large bowl half full with cold water. Squeeze the juice from the lemon halves into the bowl. Reserve the lemon halves.",
    "2   Remove the tough outer leaves from an artichoke. Using a small knife, cut off about ½ inch from the top and pare the stem to remove the tough outer fibers. Once trimmed, rub the artichoke with a reserved lemon half and transfer to the bowl of lemon water. This will prevent the artichoke from discoloring. Repeat with the remaining artichokes.",
    "3   Drain the artichokes and add them to a large Dutch oven. Add the wine, olive oil, water, and orange juice. The liquid should nearly cover the artichokes. Add more water if needed. Add the garlic, orange peel, bay leaves, parsley, and salt. Stir to combine.",
    "4   Place the Dutch oven over medium heat and bring to a simmer. Turn the heat down to low and cook, stirring occasionally, until the artichoke stems are just fork-tender and you can easily pull an outer leaf from the body, 20 to 30 minutes.",
    "5   Turn off the heat. Using a slotted spoon, transfer the artichokes to a sheet pan and spread in a single layer in order to cool more rapidly. Set them aside until ready to use.",
    "6   To make the salmoriglio, place a small saucepan over low heat. Add 112g / ½ cup of the oil and the garlic and gently cook until aromatic but without color, 10 to 15 seconds. Transfer to a small bowl and set aside to cool.",
    "7   Once cooled, add the remaining 168g / ¾ cup oil, the orange peels, parsley, and chile flakes. Set aside.",
    "8   To finish, heat a grill to medium or place a grill pan over medium-high heat on the stove top.",
    "9   Gently open the artichokes so they resemble an open flower. Drizzle with olive oil q.b. and place, face down, on the grill or grill pan. Cook for 1 minute or so, then rotate the artichokes onto their sides and cook for a total of 1 to 2 minutes, turning as needed to allow them to heat through and become slightly charred on all sides.",
    "10   Transfer the artichokes to a serving platter and squeeze the juice from the lemon halves over the top. Add the orange juice to your salmoriglio, stir to combine, and spoon over the artichokes. Garnish with sea salt q.b. and with the parsley and mint."
  ]
}