{
  "title": "Gyoza",
  "source": "The Gaijin Cookbook - Ivan Orkin",
  "servings": "Makes about 60 gyoza (enough to serve 4 or 5 hungry people)",
  "categories": [
    "Japanese",
    "The Gaijin Cookbook - Ivan Orkin"
  ],
  "ingredients": [
    "1pound green cabbage",
    "1tablespoon plus 1 teaspoon kosher salt",
    "12ounces ground pork",
    "1tablespoon plus 1 teaspoon minced or grated ginger",
    "1tablespoon plus 1 teaspoon minced garlic",
    "1cup garlic chives (nira) or regular chives, cut into ¼-inch pieces",
    "1tablespoon soy sauce",
    "1tablespoon toasted sesame oil",
    "60gyoza wrappers (as thin as you can find)",
    "Cornstarch or potato starch for sprinkling",
    "Lattice Net (optional)",
    "All-purpose flour",
    "For Serving",
    "Gyoza Dipping Sauce"
  ],
  "directions": [
    "1. Chop the cabbage (or process in a food processor) into confetti-size bits and place in a colander or sieve. Toss with 2 teaspoons of the salt and let sit for 20 minutes in the sink. Gently press the cabbage to squeeze out as much water as you can.",
    "2. Combine the drained cabbage, pork, ginger, garlic, chives, soy sauce, sesame oil, and the remaining 2 teaspoons salt in a large bowl and mix thoroughly so that everything is evenly distributed, but don’t overdo it. Too much handling and the fat in the pork will begin to melt.",
    "3. Here’s where you want to employ some extra hands to help you. Have your filling and wrappers near at hand. Fill a small bowl with water and sprinkle a baking sheet with cornstarch or potato starch to receive the finished dumplings. For each gyoza, place a wrapper in the palm of your hand and spoon about 1½ teaspoons filling onto the center. Use the back of the spoon to smoosh it lightly. You don’t want the filling to run to the edges, but you also don’t want it sitting in a fat clump in the middle. Dip your finger in the bowl of water and run it along the perimeter of one half of the wrapper. Now you’re going to fold the wet edge of the wrapper over to meet the dry edge, but you also want those nice signature gyoza pleats: Start by crimping the edges together at one corner, then proceed around the dumpling, using your finger to push the dough into little pleats on one side and pressing them against the other side to seal it. Place the dumplings on the tray as you finish them and sprinkle with starch to prevent sticking.",
    "4. To cook the gyoza, you will need a 10-inch nonstick pan or an incredibly well-seasoned carbon steel pan (otherwise, they will really stick), either one with a lid. Arrange 10 to 15 gyoza in a circle in the pan and set over medium heat. Add enough water to come a quarter of the way up the sides of the gyoza, cover, and let the water cook away, about 5 minutes.",
    "5. Meanwhile, if you want to make the lattice net: Whisk together 1 teaspoon flour with 5 tablespoons water in a bowl.",
    "6. Once the water has evaporated from the pan, remove the lid and add the lattice batter, if using. Swirl the pan to distribute the batter evenly and cook until the batter has browned, about 3 minutes. If you don’t want the lattice, simply continue to cook until the bottoms of the gyoza are browned. If you make the net, remove the pan from the heat and, while holding a plate on top of the gyoza, flip the pan over and give it a good downward shake. This should dislodge the gyoza and lattice net onto the plate. If the net sticks or falls apart, don’t despair. The dumplings will still be delicious, and you’ll have another shot at it the next time around. Serve with the dipping sauce."
  ]
}