{
  "title": "Hainanese Chicken Rice",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- Chicken:",
    "- 1 (3 1/2- to 4 1/2-pound) whole chicken, head, feet, and giblets removed",
    "- 1 tablespoon table salt",
    "- 1/4 teaspoon white pepper",
    "- 10 cups water",
    "- 6 scallions, cut into 1-inch pieces",
    "- 6 garlic cloves, lightly crushed and peeled",
    "- 1 (4-inch) piece ginger, sliced into thin rounds",
    "- 1 tablespoon soy sauce",
    "- 1 tablespoon toasted sesame oil",
    "- Rice:",
    "- 1 tablespoon vegetable oil",
    "- 1 shallot, minced",
    "- 1 teaspoon table salt",
    "- 3 garlic cloves, minced",
    "- 1 tablespoon minced fresh ginger",
    "- 2 cups jasmine rice, rinsed",
    "- 2 pandan leaves, folded in half crosswise and tied in knot (optional)",
    "- 1 English cucumber, halved lengthwise and sliced thin on bias",
    "- 1 cup coarsely chopped cilantro",
    "- Ginger-Scallion Sauce (this page)",
    "- Chili-Garlic Sauce (this page)",
    "- Sweet soy sauce"
  ],
  "directions": [
    "1. For the chicken: Trim excess fat from chicken and reserve. Season chicken with salt and pepper. Bring water, scallions, garlic, ginger, and soy sauce to a boil in a large Dutch oven over medium-high heat. Place chicken in pot breast side up. Cover, reduce heat to medium-low, and simmer gently for 15 minutes. Off heat, let chicken sit for 15 minutes.",
    "2. Using tongs, gently flip chicken and continue to let sit, covered, until breasts register 160°F and thighs register at least 175°F, 15 to 30 minutes.",
    "3. Fill a large pot halfway with ice and water. Using tongs and a spatula, transfer chicken to ice bath and fully submerge, being careful not to tear the skin. Let chicken cool for 10 minutes, then transfer to a cutting board and gently pat dry with paper towels. Rub chicken with sesame oil and set aside while preparing rice.",
    "4. Strain broth through a fine-mesh strainer set over a large bowl or container. Let broth settle for 10 minutes. Measure out and reserve 2 1/2 cups of broth, including as much fat that has risen to the surface as possible. Return remaining broth to the now-empty Dutch oven; set aside.",
    "5. For the rice: Heat oil and reserved chicken fat trimmings in a large saucepan over medium-low heat until fat is mostly rendered, about 3 minutes. Increase heat to medium, add shallot and salt, and cook until shallot is softened, about 2 minutes. Stir in garlic and ginger and cook until fragrant, about 30 seconds. Discard rendered chicken trimmings.",
    "6. Add rice and cook, stirring frequently, until edges begin to turn translucent, about 2 minutes. Stir in reserved broth and bring to a boil. Reduce heat to low and nestle pandan leaves, if using, into rice. Cover and simmer gently until rice is tender and liquid has been fully absorbed, about 18 minutes. Off heat, lay a clean dish towel underneath the lid and let sit for 10 minutes. Remove pandan leaves and fluff rice with a fork.",
    "7. Return broth to simmer and divide among small serving bowls. To carve chicken, slice breasts from bone and slice each crosswise into 1/2-inch pieces. Remove thigh meat and slice or shred. Leave legs and wings whole.",
    "8. Arrange chicken on a platter with rice, cucumber, and cilantro. Serve with broth, passing ginger-scallion sauce, chili-garlic sauce, and sweet soy sauce separately."
  ]
}