{
  "title": "Halo-Halo",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 4",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "FLAN",
    "1cup granulated sugar",
    "10large egg yolks",
    "One 12-ounce can evaporated milk",
    "One 14-ounce can sweetened condensed milk",
    "1tablespoon pure vanilla extract",
    "CARAMELIZED PLANTAINS",
    "½cup canola oil",
    "4ripe (blackened skins) plantains cut in half lengthwise",
    "¼cup (½ stick) unsalted butter",
    "1cup (packed) light brown sugar",
    "HALO-HALO MILK",
    "One 14-ounce can condensed milk",
    "Three 12-ounce cans evaporated milk",
    "Shaved ice (super fine; see Note)",
    "Shredded macapuno",
    "1quart ube ice cream",
    "Toasted pinipig or Rice Krispies, for garnish"
  ],
  "directions": [
    "1. At least 8 hours before you intend to eat or serve the halo-halo: Pour the sugar into a medium saucepan and cook over high heat, stirring just until it begins to melt. Stop stirring and continue cooking for about 8 minutes, until it turns a deep amber color. Immediately pour the caramel into a 9-inch round ceramic or glass baking dish or a metal cake pan that’s at least 2 inches deep. Tilt the dish to coat the bottom (use caution—the dish will be hot). Cool until hardened, 10 to 15 minutes.",
    "2. Make the flan: Fill a large saucepan with 3 inches water and bring to a simmer over medium heat. Whisk together the yolks in a large bowl until smooth. Add the evaporated milk, condensed milk, and vanilla and whisk until smooth. Pour the custard through a fine mesh sieve over the caramel in the dish, tightly cover with foil, put the pan in a steamer basket and then put the steamer basket over the simmering water and put the top on. Steam the flan until the custard is set but still wobbly in the center when gently shaken, 45 minutes to 1 hour. Begin testing for doneness at 45 minutes by removing the foil and jiggling the dish. If not done, cover tightly and continue cooking. Transfer the dish to a rack to cool completely, about 40 minutes. Chill the flan, covered, until cold, at least 8 hours and up to 48 hours.",
    "3. Caramelize the plantains: Heat the oil in a large high-sided sauté pan over medium heat until the oil begins to shimmer. Cook the plantains, in batches, if needed, until golden brown on both sides. Carefully remove and transfer to a plate lined with paper towels.",
    "4. In a large nonstick sauté pan, add the butter and cook over high heat until melted. Add the brown sugar and ½ cup of water and cook for about 5 minutes, until the sugar has melted and the sauce has thickened. Add the plantains to the sauce and cook until tender (a skewer inserted meets with no resistance) but still holding their shape, about 5 minutes.",
    "5. Transfer to a cutting board, let cool, and cut into 1-inch dice.",
    "6. Make the halo-halo milk: Whisk together the condensed milk and evaporated milk in a large bowl until combined.",
    "7. Unmold the flan: Run a thin knife around the edge of the dish to loosen the custard. Invert a large platter with a lip over the baking dish. Holding the dish and platter securely together, quickly invert and turn out the flan onto the platter. Caramel will pour out over and around the flan. Cut the flan into 1-inch dice.",
    "8. For individual servings: Place a heaping cup of shaved ice in a large bowl, top with 6 pieces of the flan, 3 spoonfuls of the macapuno, ¼ cup caramelized plantains, 1 scoop of ube ice cream, and ½ cup of halo-halo milk. Garnish with a few tablespoons of pinipig. Serve immediately."
  ]
}