{
  "title": "Hayashi Rice",
  "source": "The Gaijin Cookbook - Ivan Orkin",
  "servings": "Serves 4 to 6",
  "categories": [
    "Japanese",
    "The Gaijin Cookbook - Ivan Orkin"
  ],
  "ingredients": [
    "2pounds boneless beef chuck roast, cut into 2-inch cubes",
    "3tablespoons all-purpose flour",
    "2tablespoons vegetable oil, or as needed",
    "1onion, sliced thick",
    "½cup dry red wine",
    "1tablespoon tomato paste",
    "¾cup diced tomatoes",
    "2tablespoons ketchup",
    "2tablespoons Bull-Dog tonkatsu sauce",
    "1teaspoon kosher salt",
    "½teaspoon freshly ground black pepper",
    "1tablespoon honey"
  ],
  "directions": [
    "1 Place the beef in a bowl. Sprinkle the flour over it and toss to coat.",
    "2 Heat a large, deep skillet or Dutch oven over medium-high heat, then coat with 1 tablespoon of the vegetable oil. Working in batches to avoid crowding the pan, brown the beef pieces thoroughly on all sides. Take your time and add more oil as needed. Crowding will cause the meat to steam rather than brown. Spend 15 to 20 minutes getting the pieces to a handsome shade of brown, transferring them to a plate or tray as they finish.",
    "3 If there’s a lot of fat in the pan, pour off all but about 1 tablespoon and return the pan to the stove. Add the onion and sauté until slightly softened, about 3 minutes. Add the wine to the pan and use a spatula to dislodge any browned bits from the bottom, then let the wine reduce until the pan is almost completely dry. Stir in the tomato paste and cook, stirring constantly, for 2 minutes.",
    "4 Return the meat and any accumulated juices to the pan and add the diced tomatoes, ketchup, Bull-Dog sauce, salt, pepper, and 1 cup water. Stir to combine and bring to a simmer, then drop the heat to low, cover, and cook for 1½ to 2 hours, until the meat is fork-tender. I like to give things a stir at the 30- and then the 60-minute mark, then check for doneness every 15 minutes thereafter.",
    "5 Use a slotted spoon or tongs to transfer the meat to a bowl or plate, doing your best to leave the tomatoes and onion behind. Add the honey to the pan and use a handheld blender to puree the vegetables and liquid into a smooth sauce. (If you don’t have a handheld blender, you can do this in batches in a regular blender, then return the sauce to the pan.) Once the sauce is smooth, stir the meat back in.",
    "6 You can serve the stew over steamed rice at this point, but if you let it cool and store it in the fridge, it’ll taste even better after a day or two. It will keep in the fridge for a week."
  ]
}