{
  "title": "Herbes De Provence Roast Chicken With Fennel",
  "source": "Modern Bistro - ATK",
  "servings": "4",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "2tablespoons vegetable oil, divided",
    "4teaspoons herbes de Provence",
    "1½teaspoons table salt, divided",
    "¼teaspoon pepper",
    "1(3½- to 4-pound) whole chicken, giblets discarded",
    "3fennel bulbs, stalks discarded, bulbs halved, cored, and sliced ½ inch thick",
    "1tablespoon minced fresh parsley",
    "1teaspoon sherry vinegar"
  ],
  "directions": [
    "1  Adjust oven rack to lower-middle position and heat oven to 450 degrees. Combine 1 tablespoon oil, herbes de Provence, 1 teaspoon salt, and pepper in bowl. With chicken breast side down on cutting board, use kitchen shears to cut through bones on either side of backbone. Discard backbone and trim away excess fat and skin around neck. Flip chicken, press firmly on breastbone to flatten, then pound breast to same thickness as legs and thighs.",
    "2  Pat chicken dry with paper towels. Gently loosen skin covering breast and thighs. Rub 2 teaspoons spice mixture underneath skin, then rub remaining spice mixture all over chicken. Tuck wingtips underneath.",
    "3  Toss fennel with remaining 1 tablespoon oil and ½ teaspoon salt and arrange in 12-inch ovensafe skillet. Place chicken skin side up on top of fennel. Transfer skillet to oven and roast chicken until breast registers 160 degrees and drumsticks/thighs register 175 degrees, 45 minutes to 1 hour. (If chicken begins to get too dark, cover loosely with aluminum foil.)",
    "4  Using potholders, carefully remove skillet from oven. Transfer chicken to carving board and let rest while finishing fennel. Being careful of hot skillet handle, return skillet to oven and roast fennel until softened, 12 to 16 minutes. Using slotted spoon, transfer fennel to serving bowl. Add 1 tablespoon fat from skillet, parsley, and vinegar and toss gently to coat. Season with salt and pepper to taste. Carve chicken and serve with fennel."
  ]
}