{
  "title": "Hilly’s Pumpkin Caramel Pie Recipe",
  "source": "Milk Bar",
  "servings": "",
  "categories": [],
  "ingredients": [
    "Pumpkin Ganache",
    "2standard 15oz. cans of pumpkin puree (not pumpkin pie filling or mix)",
    "1 ¼cup heavy cream (277g)",
    "⅓cup glucose (or substitute a scant ⅓ cup corn syrup) (129g)",
    "5Tbsp unsalted butter (71g)",
    "16oz or 2 ½ cups chopped white chocolate or white chocolate (443g)",
    "2tsp cinnamon",
    "1tsp cardamom",
    "½tsp allspice",
    "½tsp ginger",
    "pinch nutmeg",
    "pinch clove",
    "(or: replace above spices with 3 tsp pumpkin pie spice)",
    "½tsp kosher salt",
    "Chewy Caramel",
    "1C white sugar (220g)",
    "⅓C heavy cream (79g)",
    "6Tbsp unsalted butter (85g)",
    "¼C water (59g)",
    "2Tbsp corn syrup",
    "2tsp kosher salt (not iodized or table salt)",
    "2tsp vanilla extract",
    "Pie Crust",
    "1 ½C all purpose flour (188g) + extra for dusting surface",
    "12Tbsp unsalted butter (1 ½ sticks) (170g)",
    "½C fine ground cornmeal (60g)",
    "1Tbsp white sugar (heaping)",
    "1tsp kosher salt",
    "-",
    "¼ -⅓C ice water",
    "1Tbsp apple cider vinegar",
    "Streusel",
    "½cup all purpose flour (63g)",
    "⅓cup light brown sugar (73g)",
    "⅓cup rolled oats (28g)",
    "6Tbsp unsalted butter (room temp) (86g)",
    "1tsp cinnamon",
    "½tsp cardamom",
    "big pinch salt",
    ""
  ],
  "directions": [
    "You will need:1 recipe Pie Crust1 recipe Chewy Caramel1 recipe Pumpkin Ganache1 recipe Streusel1 pint (2 cups) Heavy Cream for whipped cream(optional: sweeten your whipped cream with 2 Tbsp confectioners sugar, and a dash ofvanilla extract, if desired)",
    "Overall Directions● Pour room temp (or slightly reheated) caramel into the base of the pre-baked pie shell sothe base is fully covered and level. Place the filled shell into the fridge to firm up for 20 -25 minutes.",
    "● Pour ganache over caramel and quickly spread using offset spatula or spoon to makesure all caramel is covered with ganache.",
    "● Place pie in the fridge ASAP, covered, overnight (8 hours minimum). Ganache shouldfeel firm to the touch, should not stick to your fingers, and feel solid all the way through.",
    "● Serve pie cold, directly out of the fridge. Top with fresh whipped cream and streusel toserve.",
    "Pumpkin Ganache● Spread both cans of pumpkin on a parchment lined baking sheet and roast at 325 forabout 20 - 30 minutes. Color should darken by two shades and be well reduced. Thepuree should reduce to about 2 cups or 500g — if your puree is not at this amount, keeproasting! Let cool before use.",
    "● Add white chocolate to a large heat safe bowl, set aside.",
    "● Add cream, glucose, and butter to a small pot, and bring to boil.",
    "● Once boiling, pour hot cream mixture over white chocolate, making sure all chocolate iscovered. Let sit for 1 minute",
    "● Add roasted pumpkin, spices, and salt to white chocolate mixture, stir.",
    "● Using an immersion blender, blend all ingredients until totally smooth and silky.",
    "● Ganache can be made 1 - 2 days ahead, stored in the fridge. Reheat 20 seconds at atime in the microwave to achieve pourable consistency before filling your pie.",
    "Chewy Caramel",
    "● Measure out the heavy cream and butter (cut into rough tablespoons) in separatecontainers and place back in the fridge, it’s best to keep these cold before use.",
    "● Measure the salt and vanilla into small vessels and keep close by.",
    "● Keep a whisk nearby.",
    "● Add the following to a medium saucepan: water, white sugar, and corn syrup. Mix wellwith heat proof spatula so all the sugar is hydrated, then set over medium heat.",
    "● You can stir this mixture until the sugar dissolves IE: it turns clear, once it turns clear andis bubbling all over, only swirl the pan (this will help prevent crystallization of the sugar.)You can also begin brushing down the sides of the pan with a wet pastry brush toprevent crystallization along the edges, if you wish.",
    "● Continue cooking the sugar over medium heat. This is a nothing-then-all-at-once sort ofthing -- your mixture will stay clear for a million years, then seemingly out of nowhere itwill start to turn golden. This is the point where you need to pay close attention or riskburning all of your hard work. This may take 8 - 10 minutes, maybe more.",
    "● Once the mixture begins to take on a golden color, make sure to gently swirl the panoften, so the sugar does not caramelize all in one place. At this point, bring your butterand cream out of the fridge and keep nearby.",
    "● Watch the caramel closely, keep cooking to bring it to a deep, rich golden brown. Whenyou see the first small whisps of smoke arise from the pan, that’s the moment you wantto halt the cooking.",
    "● Turn off the heat, and remove the pan from the heat.",
    "● Carefully add the butter one tablespoon at a time, whisking well in between each Tbspuntil fully incorporated — watch your hands as this will foam up and produce a lot ofsteam.",
    "● Slowly stream in your cream, whisking well and quickly.",
    "● Add the vanilla, whisk.",
    "● Add the salt, whisk.",
    "● Pour into a heat safe container and allow to come to room temp, then place in the fridgeto fully cool.",
    "● Caramel can be made 1-2 days ahead, stored in the fridge. reheat in 20 secondincrements in the microwave to achieve pourable consistency to fill the pie.",
    "Pie Crust● This pie crust is sized for a 9 ½” wide by 1 ½” deep pie tin.",
    "● Measure out all dry ingredients into your largest bowl. Mix together until wellincorporated.",
    "● Cut cold butter into vague tablespoons and add to your bowl. Toss with hands until allthe butter is coated in flour mixture.",
    "● Smash, squeeze, and break cold butter chunks with your fingers until some of themixture resembles a coarse meal but there are still plenty of pieces of butter about thesize of blueberries in the mix.",
    "● If butter has gone soft and melty, place the entire bowl into the fridge for 15 minutes tofirm up, otherwise, proceed.",
    "● Mix vinegar and ice water together, then add to the flour mixture one tablespoon at atime, tossing with hands in between additions.",
    "● The amount of water you will need varies — so add water until the mixture holdstogether when pressed into a ball, but is still a little crumbly, and isn’t sticky to the touch.",
    "● Form into a disc, wrap tightly in plastic wrap and refrigerate for at least 30 minutes.",
    "● Once firmed up, proceed. If your dough is too hard to roll out, allow it to sit at room tempfor 5 - 10 minutes.",
    "● Dust the surface, rolling pin, and both sides of the pie crust lightly with flour.",
    "● Roll out the dough into a long rectangle-ish shape — short side facing you. The sides ofthe dough may have cracked a little, and the dough might be a little crumbly, that istotally fine at this stage.",
    "● Fold the dough like a letter: fold the far side down towards you, then the side closest toyou on top of that folded down side.",
    "● Press it all back together, rotate the dough 90 degrees, then repeat the roll and fold,making sure to dust the surface and rolling pin with more flour as needed.",
    "● If your dough has become sticky, or too stretchy that it is hard to work with, throw it backin the fridge for 20 - 30 minutes to firm up.",
    "● Once folded and dough has become cohesive and not shaggy, roll out dough into acircle that is at least two inches wider than the base of your pie tin.",
    "● Carefully transfer your rolled out dough to your tin, draping, rather than stretching it intoplace.",
    "● Fold excess dough underneath itself to create a lip, and crimp as desired.",
    "● Return to the fridge to firm up, again.",
    "● Preheat the oven to 350F.",
    "● Now, to blind bake: place the tin on a baking sheet and line the inside of the pie with foilor parchment. Fill with your chosen weights. I like to tent the edges of my crust with foilto prevent burning.",
    "● Place in the oven and allow to bake for about 30-40 minutes, checking occasionally toensure the edges of your crust have not taken on too much color (tent with foil ifneeded.)",
    "● When the edges of your pie are lightly browned, remove weights from inside of the pie toproperly cook the center — prick the bottom of the pie crust with a fork to preventballooning.",
    "● Continue to cook for an additional 15 - 20 minutes, until your pie is golden brown incolor.",
    "● Cool for at least 1 hour before filling. Pie crust can be made several days ahead of time,pre-baked, and stored in the fridge. Or, store unbaked pie crust in the freezer for up to amonth.",
    "Streusel● Add all ingredients to a medium bowl.",
    "● Mash and mix with hands until a loose crumb forms, and there are no dry spots orchunks of butter.",
    "● Spread on a parchment lined sheet pan.",
    "● Bake at 325 for 15 minutes, agitating every five minutes or so until golden brown.",
    "● Streusel can be made up to a week ahead, stored at room temp in an airtight container."
  ]
}