{
  "title": "Hoagie Rolls",
  "source": "Ethanchlebowski.com",
  "servings": "",
  "categories": [
    "Bread"
  ],
  "ingredients": [
    "INGREDIENTS (Four 10\" rolls)",
    "260g 1% Milk*",
    "6g Instant Dry Yeast (about 1 packet)",
    "8g Diastatic Malt powder (optional)",
    "400g Bread Flour (all-purpose works too)",
    "10g Honey (or sugar)",
    "20g Olive Oil",
    "8g Salt",
    "Egg wash: 1 egg white + spoonful of water",
    "Cornmeal for sprinkling"
  ],
  "directions": [
    "Mix the Dough - 5:00 pm to 5:20 pm",
    "Warm 260 g milk in the microwave for about 50 seconds. Ideally, the temperature is between 105-110 F to optimize yeast activity. Add 6 g of yeast along with 8 g diastatic malt powder and stir to combine. Let stand for 3-5 minutes until light foam surfaces and bubbles are visible.",
    "Note: Resting will allow the flour to start hydrating all on its own, and make the dough a little bit easier to work with when we start kneading.",
    "Kneading (Gluten development) - 5:20 pm to 5:30 pm",
    "Once rested, turn the dough out onto a clean counter and knead for 8-10 minutes. I advise setting a timer to make sure ample time is spent kneading. Knead the dough until it is completely smooth and no longer sticky.",
    "After kneading the dough, cut off a piece and test for gluten development by carefully stretching the dough very thin to check for a see-through 'window' before tearing.",
    "Once done kneading, add the dough to the mixing bowl and cover with plastic wrap. Let rise until doubled in size, about 45-60 minutes though it could take longer depending on the yeast, room/dough temperature..",
    "Divide dough + Shape Rolls + Proof (2nd Ferment) - 6:30 pm to 7:40 pm",
    "Once doubled in size, punch the dough down and divide into 4 equal portions, roughly 175 grams each.",
    "Using your fingertips lightly press and stretch and piece of dough into a rectangle about 8 inches wide and 1 inch thick. Tightly roll the rough from the bottom to the top. Press and seal the seam created on the bottom of the roll. Now, you should have a log of dough with the seam side down. Applying even pressure with the palm of your hands in the center of the dough begin gently rolling the log out into a cylinder, about 10 inches long.",
    "Note: For shaping, just take a look at the video, it's hard to explain in words.",
    "Evenly sprinkle cornmeal on two baking sheets. Shape each hoagie roll and place 2 on each baking sheet. Cover lightly with plastic wrap or a towel and let the rolls proof until about 1.5 to 2 times in size, another 45-60 minutes.",
    "Oven set up - 7:25 pm to 7:40 pm",
    "With 15 minutes of proofing left, preheat the oven to 375 F. Place an oven-safe pan or another baking sheet on the bottom rack of the oven.",
    "Note: Ice will be dropped on the hot pan to help create a steamy environment for better oven spring.",
    "Bake - 7:40 pm to 8:00 pm",
    "Using a razor or really sharp knife, score the hoagie rolls with one long slash at a 45-degree angle to allow for oven spring.",
    "Whisk the egg white and spoonful of water together. Using a brush, lightly spread the egg wash on the exterior to gives us a better crust. Sprinkle a little cornmeal over top.",
    "Note: At this point, you can sprinkle on toppings like sesame seeds, or herbs and spices if you would like.",
    "Place the rolls into the oven on the middle rack and toss in 4 to 5 ice cubes on the hot pan on the preheated pan which will create steam.",
    "Bake for 10 minutes then rotate the pan. Continue baking for another 8-10 minutes until the crust is golden brown and the internal temperature reaches 200 F.",
    "Let cool completely on a wire rack. I actually like to store these in a plastic bag for 1 day before making a hoagie."
  ]
}