{
  "title": "Holy Mole Sauce",
  "source": "Gimmesomeoven.com",
  "servings": "Yield: about 3 cups",
  "categories": [
    "Sauce"
  ],
  "ingredients": [
    "2tablespoons oil",
    "1cup diced white onion",
    "4cloves garlic, peeled and minced",
    "(optional) 1 jalapeño, cored and diced",
    "1/4cup chili powder*",
    "2tablespoons all-purpose flour",
    "1teaspoon ground cinnamon",
    "1teaspoon ground cumin",
    "1/2teaspoon dried oregano",
    "2 1/2cups vegetable stock",
    "2tablespoons smooth almond butter (or your preferred nut or seed butter)",
    "1tablespoon tomato paste",
    "1tablespoon unsweetened cocoa powder",
    "1teaspoon sea salt"
  ],
  "directions": [
    "Heat oil in a medium saucepan over medium-high heat. Add onion and sauté for 5 minutes, stirring occasionally, until soft and translucent. Add garlic and jalapeño (if using) and sauté for 1-2 more minutes, stirring occasionally, until fragrant. Add chili powder, flour, cinnamon, cumin, and oregano, and stir until everything is evenly mixed. Continue sautéing for 1 more minute, stirring occasionally.",
    "Remove pan from heat. Add vegetable stock, and stir until combined.",
    "Use an immersion blender to puree the mixture until smooth. Or transfer it in two small batches to a traditional blender, and purée until smooth, being very careful (**see note below) since warm liquids expand when they are blended.",
    "Return the saucepan to medium-high heat. Add almond butter, tomato paste, cocoa powder and sea salt, and whisk until combined. Continue cooking until the mixture reaches a simmer and the sauce as thickened.",
    "Reduce heat to medium-low. Taste, and season the sauce with more salt if needed.",
    "Serve warm. Or let the sauce cool to room temperature, then refrigerate in a sealed container for up to 3 days, or freeze for up to 3 months.",
    "*I used American-style chili powder, which is not the same as cayenne chili powder.",
    "**Since the mixture should still be pretty lukewarm at this point, it should be ok to blend in small batches. But if it feels hot, let the mixture cool for 10 minutes before blending. As an extra precaution when blending warm liquids, I always recommend covering the tiny cap opening on the lid of the blender with a kitchen towel or paper towel, instead of the cap.)"
  ]
}