{
  "title": "Homestyle Tofu",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 14 ounces firm tofu",
    "- 2 teaspoons soy sauce",
    "- 2 teaspoons cornstarch",
    "- 1 teaspoon sugar",
    "- 1 teaspoon oyster sauce",
    "- 1 cup vegetable oil",
    "- 1 green bell pepper, stemmed, seeded, and cut into 1-inch pieces",
    "- 1 carrot, peeled and sliced 1/4 inch thick on bias",
    "- 1/2 cup canned sliced bamboo shoots, drained, rinsed, and patted dry",
    "- 3 garlic cloves, sliced",
    "- 2 scallions, white and green parts separated and sliced thin",
    "- 1 (1-inch) piece ginger, peeled and sliced into thin matchsticks",
    "- 1 tablespoon doubanjiang (broad bean chile paste)",
    "- 3/4 cup water"
  ],
  "directions": [
    "1. Halve tofu lengthwise, then cut crosswise into 3/4-inch-thick slabs. Spread tofu on a paper towel–lined rimmed baking sheet and gently pat dry with additional paper towels. In a small bowl, combine soy sauce, cornstarch, sugar, and oyster sauce; set aside.",
    "2. Line a large plate with a triple layer of paper towels. Heat oil in a 14-inch flat-bottomed wok over medium-high heat to 375°F. Using a spider skimmer or slotted spoon, carefully add tofu in an even layer and cook until crisp and well browned on both sides, about 10 minutes, flipping tofu halfway through. Transfer tofu to the prepared plate to drain.",
    "3. Pour off all but 3 tablespoons of oil from the wok. Heat remaining oil over medium-high heat until just smoking. Add bell pepper, carrot, and bamboo shoots and cook, tossing slowly but constantly, until crisp-tender, about 3 minutes.",
    "4. Push vegetables to one side of the wok and add garlic, scallion whites, ginger, and doubanjiang to the clearing. Cook, mashing the garlic mixture into the wok, until fragrant, about 30 seconds. Stir garlic mixture into the vegetables.",
    "5. Add water and tofu to the wok and cook, tossing slowly but constantly, until tofu has warmed through and absorbed some liquid, 3 to 5 minutes.",
    "6. Whisk soy sauce mixture to recombine, then add to the wok and cook, tossing gently, until sauce has thickened, about 30 seconds. Sprinkle with scallion greens and serve."
  ]
}