{
  "title": "Homemade Rice Noodles",
  "source": "Thewoksoflife.com",
  "servings": "Serves: 6",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "1¼cups rice flour",
    "2tablespoons tapioca starch (or cornstarch)",
    "1/2teaspoon salt",
    "1¼cups water",
    "1teaspoon vegetable oil (plus more for brushing)"
  ],
  "directions": [
    "Add the rice flour, tapioca starch (or cornstarch), salt and water to a mixing bowl. Mix and dissolve everything together well. Add 1 teaspoon of oil, and strain the liquid through a fine-mesh strainer into another bowl. Cover the liquid and let rest for 30 minutes.",
    "While the mixture is resting, fill your wok (make sure that your flat-bottomed pan fits comfortably inside first!) with water. If you don’t have a wok, use a large, deep cooking vessel with a wide opening and a lid. Bring the water to a boil. (You might need to add more water throughout the cooking process. The goal is to have the pan float on top of the boiling water.)",
    "Brush a light coating of oil on the bottom of the flat-bottom pan, put the pan on top of the boiling water, and add a 1/4 cup of the rice liquid to the pan. Tilt it a little so the rice liquid covers the bottom of the pan.",
    "Now, cover with the pot/wok lid and cook on high heat for 5 minutes. If the flat bottom pan you use has a thicker bottom, e.g., Pyrex, increase the cooking time to 7 or 8 minutes. While it’s cooking, brush the second pan lightly with oil.",
    "After 5 minutes, remove the lid, take out the 1st pan, and set aside. Put the 2nd pan on top of the water in the wok, add a ¼ cup of the rice mixture. Tilt it a little so the rice liquid evenly covers the bottom, cover, and let cook.",
    "While it's cooking, attend to the first pan. We're going to lift the noodle sheet out and place it onto a cutting board. Brush the cutting board with a thin layer of oil to prevent sticking. Then, use a rubber spatula to loosen all sides of the sheet of noodle, and slowly lift it up and off the pan. Lay it flat on your cutting board. By now, your second pan is probably ready. Remember to brush the first layer with a thin layer of oil before layering the second sheet on top to prevent sticking.",
    "Now brush the bottom of the 1st pan with some oil and get ready to make your 3rd batch. Repeat the above steps until all of the noodle batter is gone. Once all of the noodle sheets are made, I cut the noodle sheets into 1/3-inch wide pieces, but feel free to cut them in whatever sizes and shapes you like. I then toss the noodles, loosening each layer to separate them. Now the rice noodles are ready to be used!",
    "You can store these noodles in the refrigerator for a day or two. They might harden slightly, but they should bounce back nicely once heated. Enjoy your homemade noodles!",
    "TIPS & NOTES:",
    "Approximately 5 sheets of noodles."
  ]
}