{
  "title": "Honey Mustard Chicken in the Instant Pot {Paleo, Whole30 Option}",
  "source": "Paleorunningmomma.com",
  "servings": "Servings 6",
  "categories": [
    "Instant Pot"
  ],
  "ingredients": [
    "Chicken:",
    "2lbs bone in skin on chicken thighs 4-6",
    "4cloves garlic minced",
    "Sea salt and black pepper",
    "2Tbsp ghee or other cooking fat",
    "Chopped parley for garnish if desired",
    "Sauce:",
    "2Tbsp coconut aminos",
    "1/4cup + 2 Tbsp chicken bone broth",
    "3Tbsp raw honey melted, OR date paste for Whole30*",
    "1/4cup spicy brown mustard",
    "1 1/2Tbsp fresh lemon juice",
    "To Thicken Sauce:",
    "1tsp arrowroot starch",
    "2Tbsp bone broth"
  ],
  "directions": [
    "Whisk together all sauce ingredients in a bowl until smooth, set aside",
    "Turn your Instant Pot to “saute” and allow it to heat meanwhile, sprinkle chicken with sea salt and black pepper on both sides.",
    "After pot reads “hot”, swirl ghee around the bottom to let it heat. It’s important to add the ghee AFTER the pot heats to prevent the chicken from sticking!",
    "Add chicken, skin side down, and cook until golden brown (about 2-3 mins) then flip chicken with tongs and repeat on second side.",
    "When both sides are golden brown, sprinkle garlic around the chicken and allow it to cook about 30-45 seconds, until softened, then press “cancel”.",
    "Pour sauce mixture over the chicken, secure the lid, place steam release to “sealing” and set on high pressure for 10 mins.",
    "Once time is up, quick release the pressure and remove lid. Using tongs, remove chicken to a plate and set aside while you thicken the sauce.",
    "Cancel the pressure cook, press “saute” and whisk together the 2 Tbsp broth and arrowroot, then add to sauce and stir. Cook about 3-5 more minutes or until sauce is thickened to preference. Return chicken to pot with its juices and coat with sauce. Turn off pot and serve chicken with desired sides, enjoy!"
  ]
}