{
  "title": "Honey-Walnut Shrimp",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1/2 cup walnuts",
    "- 2 tablespoons water",
    "- 2 tablespoons sugar",
    "- 1/4 teaspoon plus 1/8 teaspoon table salt, divided",
    "- 1 pound jumbo shrimp (16 to 20 per pound), peeled and deveined",
    "- 1 large egg white",
    "- 1 teaspoon Shaoxing wine",
    "- 1/4 teaspoon white pepper",
    "- 1/4 cup Kewpie mayonnaise",
    "- 1 tablespoon lemon juice",
    "- 1 tablespoon sweetened condensed milk",
    "- 1 teaspoon honey",
    "- 2 quarts peanut oil for frying",
    "- 1/2 cup cornstarch"
  ],
  "directions": [
    "1. Line a rimmed baking sheet with parchment paper. Toast walnuts in an 8- or 10-inch nonstick skillet over medium heat until fragrant and spotty brown, about 3 minutes.",
    "2. Quickly add water, sugar, and 1/8 teaspoon salt to the skillet and stir with a rubber spatula to coat the nuts evenly. Cook, stirring often, until the sugar caramelizes and the nuts begin to clump together, 2 to 3 minutes. Transfer nuts to the prepared sheet, spread in an even layer, and let cool completely, about 30 minutes. Break apart with hands; set aside.",
    "3. Pat shrimp dry with paper towels. In a large bowl, whisk egg white, Shaoxing wine, pepper, and remaining 1/4 teaspoon salt. Add shrimp and toss to coat. Refrigerate for 15 minutes. In a separate large bowl, combine mayonnaise, lemon juice, condensed milk, and honey; set aside.",
    "4. Set a wire rack in a rimmed baking sheet lined with a triple layer of paper towels. Add peanut oil to a 14-inch flat-bottomed wok or large Dutch oven to a depth of about 1 1/2 inches. Heat over medium-high heat to 425 degrees.",
    "5. Add cornstarch to a medium bowl. Working with 1 shrimp at a time, dredge in cornstarch, pressing firmly to adhere, then shake off excess and transfer to a large plate.",
    "6. Using tongs or cooking chopsticks, carefully add half of the shrimp to the hot oil, moving them as needed so they fry individually. Fry until light golden brown and crisp, about 4 minutes. Adjust heat to keep oil between 400 and 425 degrees. Use a spider skimmer or slotted spoon to transfer shrimp to the prepared rack. Repeat with remaining shrimp.",
    "7. Add shrimp and candied walnuts to the bowl with the mayonnaise mixture and gently toss to coat. Serve."
  ]
}