{
  "title": "Honey Tahini Challah",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves: Makes 2 medium challahs",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "1½teaspoons active dry yeast (0.18 oz / 5g)",
    "½cup honey (6 oz / 170g)",
    "½cup tahini (4.5 oz / 128g)",
    "3large egg yolks (1.8 oz / 50g), at room temperature",
    "⅓cup extra-virgin olive oil (2.6 oz / 73g), plus more for the bowl",
    "3large eggs (5.3 oz / 150g), at room temperature",
    "4⅓cups bread flour (19.9 oz / 563g), plus more for kneading",
    "2teaspoons Diamond Crystal kosher salt (0.21 oz / 6g)",
    "Sesame seeds, for sprinkling the top"
  ],
  "directions": [
    "Dissolve the yeast: In a small saucepan, gently warm ¼ cup water (2 oz / 57g) over low heat, swirling the pan, just until it’s lukewarm but not hot (if you have an instant-read thermometer, it should register about 105°F). You can warm the water in the microwave, too, but beware of overheating. Pour the water into a medium bowl and whisk in the yeast to dissolve. Set aside until the mixture is cloudy and slightly puffed, about 5 minutes.",
    "Make the dough: To the bowl with the yeast mixture, add the honey, tahini, egg yolks, olive oil, 2 of the whole eggs, and ½ cup room temperature water (4 oz / 113g) and whisk to combine. In a large bowl, whisk 4⅓ cups of the flour (22.2 oz / 630g) and salt just to combine. Make a well in the center of the flour and pour in the egg mixture. Mix with a wooden spoon, starting in the center and working outward to incorporate the flour, until you have a shaggy dough. Knead the mixture inside the bowl several times until you have a cohesive dough with a few floury spots. Turn the dough out onto a generously floured work surface and knead, adding more as necessary to prevent sticking, until the dough is very soft, smooth, supple, and just a little bit tacky, 5 to 10 minutes (when you poke a finger into the ball of dough and remove it, the dough should cling to it gently and then release).",
    "Let the dough rise one time: Form the dough into a tight ball. Lightly coat the inside of a large bowl with olive oil and place the dough inside. Cover the bowl with a damp towel and let the dough rise in a warm place until it is about doubled in size, 1½ to 3 hours. When you poke it with a finger, the dough should feel very airy and spring back, holding a slight impression. (At this point, the dough can be covered with plastic wrap and refrigerated up to 12 hours.)",
    "Portion the dough: Uncover the dough and use your fist to punch it down lightly to expel some of the gases that built up during the first rise. Turn the dough out onto a clean, unfloured surface. Divide the dough in half and then divide each half into 3 equal pieces to get 6 portions.",
    "Roll out the dough: Working with one piece of dough at a time and keeping the other pieces covered, roll it into a ball, flatten it slightly, then poke a thumb through the center and out the other side. Work and stretch the dough outward to widen the hole, maintaining an even thickness all the way around, until you have a ring measuring about 4 inches across. Place the ring on the surface and flatten it slightly with the heel of your hand, then place it on one of the prepared baking sheets and cover with plastic wrap. Repeat until you’ve formed all the pieces of dough into rings and spaced them out evenly across both baking sheets. Make sure the sheets are covered and transfer to the refrigerator to chill for at least 8 hours and up to 12.",
    "The next morning, do the float test: Fill a large, wide Dutch oven about halfway with room-temperature water. Remove one of the baking sheets from the refrigerator—the bagels will have puffed slightly. Uncover the sheet and gently transfer one of the bagels to the Dutch oven. If it floats, the bagels are ready to go. Gently pat the test bagel dry, return it to the baking sheet, cover, and place the baking sheet back in the refrigerator until ready to cook. However, if it doesn’t float, take the second baking sheet out of the refrigerator and let both sheets of bagels sit at room temperature until a test bagel floats (repeat the test every 15 minutes). At that point, return the covered baking sheets to the refrigerator. Reserve the Dutch oven of water for boiling the bagels.",
    "Preheat the oven: While the dough is rising, arrange two oven racks in the highest and lowest positions and preheat the oven to 350°F.",
    "Finish the challahs and bake: Uncover the dough and brush the surfaces of both loaves with the egg. Sprinkle generously with sesame seeds and bake the challahs until the surfaces are shiny and deep golden brown, 25 to 35 minutes, switching racks and rotating the pans front to back after 20 minutes. Let cool completely on the baking sheets."
  ]
}