{
  "title": "Honey Mustard–Glazed Chicken With Roasted Sweet Potato Salad",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "⅓cup honey",
    "¼cup soy sauce",
    "¼cup yellow mustard",
    "2teaspoons cornstarch",
    "4(6- to 8-ounce) boneless, skinless chicken breasts, trimmed",
    "1pound sweet potatoes, peeled and cut into ¾-inch pieces",
    "¼cup extra-virgin olive oil, divided",
    "½teaspoon smoked paprika",
    "¾teaspoon table salt, divided",
    "3tablespoons cider vinegar",
    "¼teaspoon pepper",
    "5ounces (5 cups) baby arugula",
    "½fennel bulb, stalks discarded, bulb halved, cored, and sliced thin",
    "¼cup dried cranberries"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 450 degrees. Line rimmed baking sheet with aluminum foil and spray with vegetable oil spray. Combine honey, soy sauce, mustard, and cornstarch in medium bowl and microwave, whisking occasionally, until slightly thickened, 3 to 5 minutes. Let glaze cool slightly, then reserve half for serving.",
    "2. Pound chicken breasts to uniform thickness. Pat chicken dry with paper towels. Add to bowl with remaining glaze and toss to coat. Arrange chicken breasts, side by side (and alternating thicker end to thinner end), on 1 side of prepared sheet. Drizzle any remaining glaze in bowl over top.",
    "3. Toss sweet potatoes in separate bowl with 2 tablespoons oil, paprika, and ¼ teaspoon salt. Spread potatoes evenly over opposite side of sheet from chicken. Roast until chicken registers 160 degrees and potatoes are well browned and tender, 20 to 25 minutes, rotating sheet halfway through roasting.",
    "4. Whisk vinegar, pepper, remaining 2 tablespoons oil, and remaining ½ teaspoon salt together in large bowl. Transfer potatoes to bowl with dressing and let cool slightly. Tent chicken with aluminum foil and let rest while finishing salad. Add arugula, fennel, and cranberries to cooled potatoes and gently toss to combine. Season with salt and pepper to taste. Brush chicken with reserved glaze and serve with salad."
  ]
}