{
  "title": "Honey-And-Garlic Roasted Chicken With Pearl Couscous Salad",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "¼cup extra-virgin olive oil, divided",
    "1½cups pearl couscous",
    "2cups water",
    "1¼teaspoons table salt, divided",
    "2tablespoons plus ½ teaspoon cider vinegar, divided",
    "2tablespoons honey",
    "¼teaspoon paprika",
    "3garlic cloves, minced, divided",
    "3pounds bone-in chicken pieces (split breasts halved crosswise, drumsticks, and/or thighs), trimmed",
    "½teaspoon pepper, divided",
    "2tablespoons minced fresh tarragon",
    "4ounces (4 cups) baby spinach",
    "2carrots, peeled and shredded"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 450 degrees. Heat 1 tablespoon oil and couscous in medium saucepan over medium heat, stirring frequently, until half of grains are golden, about 5 minutes. Stir in water and ¼ teaspoon salt and bring to boil over medium-high heat. Reduce heat to low, cover, and simmer until water is absorbed and couscous is tender, 9 to 12 minutes. Off heat, fluff with fork and cover to keep warm.",
    "2. Whisk ½ teaspoon vinegar, honey, paprika, and two-thirds of garlic together in small bowl. Pat chicken dry with paper towels and sprinkle with ½ teaspoon salt and ¼ teaspoon pepper.",
    "3. Heat 1 tablespoon oil in 12-inch ovensafe skillet over medium-high heat until just smoking. Cook chicken skin side down until well browned, 5 to 7 minutes. Flip chicken and brush with honey mixture. Transfer skillet to oven and roast until breasts register 160 degrees and drumsticks/thighs register 175 degrees, 15 to 20 minutes.",
    "4. Whisk tarragon, remaining 2 tablespoons oil, remaining ½ teaspoon salt, remaining 2 tablespoons vinegar, remaining garlic, and remaining ¼ teaspoon pepper together in large bowl.",
    "5. Using pot holder, remove skillet from oven. Transfer chicken to serving platter, tent with aluminum foil, and let rest, reserving pan juices in skillet. Being careful of hot skillet handle, measure out ¼ cup pan juices from skillet, then add to dressing in bowl and whisk to combine. Measure out ¼ cup dressing and set aside for serving.",
    "6. Add couscous, spinach, and carrots to large bowl with remaining dressing mixture and toss to coat. Drizzle chicken with reserved dressing mixture and serve with couscous salad."
  ]
}