{
  "title": "Hong Kong–Style Wonton Noodle Soup",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 teaspoon vegetable oil",
    "- 12 large shrimp (26 to 30 per pound), peeled and deveined, shells reserved",
    "- 4 cups chicken broth",
    "- 1/4 teaspoon plus 1/8 teaspoon table salt, divided",
    "- 1 teaspoon dried flounder fish powder, divided",
    "- 1 tablespoon soy sauce, divided",
    "- 1/4 teaspoon white pepper, divided",
    "- 4 ounces ground pork",
    "- 1 scallion, minced",
    "- 1 tablespoon Shaoxing wine",
    "- 1/2 teaspoon toasted sesame oil, plus extra for serving",
    "- 2 teaspoons oyster sauce",
    "- 24 (3-inch) square Hong Kong–style wonton wrappers",
    "- 2 heads baby bok choy (4 ounces each), greens separated",
    "- 6 ounces fresh thin wonton noodles"
  ],
  "directions": [
    "1. Heat vegetable oil in large saucepan over high heat until shimmering. Add reserved shrimp shells and cook, stirring frequently, until shells begin to turn spotty brown, about 2 minutes. Add broth, 2 cups water, and 1/4 teaspoon salt and bring to boil. Off heat, stir in 1/2 teaspoon flounder powder and let steep for 15 minutes. Strain broth through fine-mesh strainer and return to empty saucepan; discard shells. Stir in 2 teaspoons soy sauce and 1/8 teaspoon pepper. Cover to keep warm.",
    "2. Halve each shrimp crosswise; set aside. Using wooden spoon or 4 bundled chopsticks, vigorously stir pork in medium bowl until it has stiffened and started to pull away from sides of bowl and has slightly lightened in color, about 5 minutes. Stir in scallion, Shaoxing wine, sesame oil, oyster sauce, remaining 1 teaspoon soy sauce, remaining 1/2 teaspoon flounder powder, remaining 1/8 teaspoon salt, and remaining 1/8 teaspoon pepper until well combined.",
    "3. Lightly dust parchment paper–lined rimmed baking sheet with flour. Working with 6 wrappers at a time, place heaping 1/2 teaspoon pork filling in center of each square, then top with 1 piece shrimp and gently press into filling. Form wontons by gathering corners of wrapper around filling and pinching dough tightly just above filling to seal; leave ends of wrapper unsealed. Transfer wontons to prepared sheet, cover with damp dish towel, and repeat with remaining wrappers and filling in 3 batches. (Wontons can be refrigerated for up to 24 hours or frozen on sheet until solid, then transferred to zipper-lock bag and stored in freezer for up to 1 month. Do not thaw frozen dumplings before cooking; increase simmer time to about 6 minutes.)",
    "4. Meanwhile, bring 4 quarts water to boil in Dutch oven. Add bok choy and cook until tender, about 1 minute. Using spider skimmer or slotted spoon, transfer bok choy to plate. Return water to boil, add wonton noodles, and cook until just tender. Using spider skimmer, transfer noodles to colander and rinse thoroughly; divide noodles among serving bowls. Return water to boil, add wontons, and cook until wontons turn translucent and tender and float to top, about 4 minutes. Using spider skimmer, divide wontons among bowls and top with bok choy.",
    "5. Return broth to boil over high heat, then ladle over bok choy, noodles, and dumplings. Serve, passing extra sesame oil separately."
  ]
}