{
  "title": "Hot and Sour Soup",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 7 ounces extra-firm tofu, cut into 1/2-inch cubes",
    "- 1 (6-ounce) boneless pork chop, trimmed",
    "- 6 cups chicken broth",
    "- 3 tablespoons soy sauce, plus extra for seasoning",
    "- 1 (5-ounce) can bamboo shoots, sliced thin lengthwise",
    "- 4 ounces shiitake mushrooms, stemmed and sliced 1/4 inch thick",
    "- 3 tablespoons plus 1 teaspoon water, divided",
    "- 3 tablespoons plus 1/2 teaspoon cornstarch, divided",
    "- 5 tablespoons Chinese black vinegar",
    "- 1 teaspoon white pepper",
    "- 1 teaspoon toasted sesame oil",
    "- 1–3 teaspoons chili oil",
    "- 1 large egg",
    "- 3 scallions, sliced thin"
  ],
  "directions": [
    "1. Spread tofu over paper towel–lined plate and let drain for 20 minutes, then gently press dry with paper towels. Place pork chop on separate plate and freeze until firm, about 15 minutes. Transfer pork chop to cutting board and, holding knife parallel to cutting board, slice into 2 thin cutlets. Slice each cutlet crosswise into thin strips.",
    "2. Bring broth and soy sauce to simmer in large saucepan over medium heat. Add bamboo shoots and mushrooms and cook until mushrooms are just tender, about 2 minutes. Stir in tofu and pork and cook until pork is no longer pink, about 2 minutes.",
    "3. Whisk 3 tablespoons water, 3 tablespoons cornstarch, vinegar, and pepper together in bowl, then stir mixture into soup. Increase heat to medium-high and cook, stirring occasionally, until soup thickens and turns translucent, about 1 minute. Remove soup from heat, but do not let cool down. Stir in sesame oil and chili oil, and season with extra soy sauce to taste.",
    "4. Whisk remaining 1 teaspoon water and remaining 1/2 teaspoon cornstarch together in 2-cup liquid measuring cup, then whisk in egg until combined. Off heat, use 1 hand to stir soup with fork or chopsticks while using other hand to pour egg mixture in slow, steady stream into swirling soup. Continue stirring soup until cooked thin egg ribbons appear, about 1 minute. Sprinkle individual portions with scallions before serving."
  ]
}