{
  "title": "Hot ’n’ Crispy Chicken Cutlets with Kimchi Ranch",
  "source": "Molly Baz Cook This Book",
  "servings": "4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1garlic clove",
    "1lemon",
    "1small bunch chives",
    "DAIRY",
    "¾cup labneh or plain whole-milk Greek yogurt",
    "MEAT",
    "2large boneless, skinless chicken breasts or 4 chicken cutlets (about 2 pounds)",
    "PANTRY",
    "2cups kimchi, plus 3 tablespoons kimchi brine",
    "1tablespoon plus 2 teaspoons onion powder",
    "1¼teaspoons cayenne pepper",
    "Kosher salt",
    "½cup mayonnaise",
    "2cups neutral oil, such as canola, vegetable, or grapeseed",
    "2cups panko bread crumbs"
  ],
  "directions": [
    "① Marinate the chicken:",
    "✦In a medium bowl, whisk together ¼ cup labneh, 3 tablespoons kimchi brine, 1 tablespoon onion powder, and 1¼ teaspoons cayenne pepper.",
    "✦Pat 2 chicken breasts dry and slice each in half lengthwise to create 2 thin cutlets. Season the cutlets all over with 2 teaspoons salt and transfer to the marinade, turning to coat. Marinate the chicken at least 15 minutes at room temperature and up to 8 hours in the fridge.",
    "② Make the kimchi ranch:",
    "✦In a small bowl, whisk together ½ cup mayonnaise, 2 teaspoons onion powder, and ½ cup labneh.",
    "✦Finely grate 1 garlic clove and zest half of a lemon into the labneh-mayo mixture. Cut the lemon into wedges and set them aside for serving.",
    "✦Thinly slice half of the chives and stir them into the ranch. Slice the remaining chives on the bias into 1½-inch(ish)-long matchsticks for garnishing later.",
    "✦Finely chop ¾ cup kimchi and stir it into the ranch. If it looks a little thick, add a splash or two of water until it is swooshable and spreadable. Season with salt.",
    "③ Heat the oil: In a large Dutch oven, heat 2 cups neutral oil over medium heat; the oil should be about 1½ inches deep. It’s ultimately going to need to reach about 400°F, so use a deep-frying thermometer to check from time to time and adjust the heat as needed to maintain that temp. If you don’t have a thermometer, throw a few pieces of panko in the oil, and if they sizzle like cray, you’re in the right ballpark for frying.",
    "④ Bread the chicken:",
    "✦Place 2 cups panko in a medium bowl.",
    "✦Working one at a time, use tongs to dip each chicken cutlet into the panko and use your fingers to press and pack the panko onto the chicken until very well coated. Transfer to a plate.",
    "⑤ Fry the chicken:",
    "✦Line a rimmed baking sheet or a large plate with paper towels.",
    "✦Once the oil reaches 400°F, working in 2 batches, fry the chicken cutlets until deeply golden brown all over, flipping halfway through, 3 to 5 minutes per side.",
    "✦Transfer the cutlets to the paper-towel-lined baking sheet and season well with salt. Transfer the cutlets to a cutting board and slice across the grain (perpendicular to the point of the breast) into ½-inch-thick pieces.",
    "⑥ Plate ’em up: Spread some kimchi ranch on each plate, add the cutlets and the remaining 1¼ cups kimchi, top with the reserved chives, and serve extra ranch alongside.",
    ""
  ]
}