{
  "title": "Instant Pot Crispy Carnitas",
  "source": "Gimmesomeoven.com",
  "servings": "Yield: 6-8 servings",
  "categories": [
    "Instant Pot"
  ],
  "ingredients": [
    "INSTANT POT CRISPY CARNITAS INGREDIENTS:",
    "1(4-5 pound) lean boneless pork roast, excess fat trimmed, cut into 2-inch chunks",
    "salt and pepper",
    "1tablespoon avocado oil or olive oil",
    "1batch mojo sauce (see below)",
    "for serving: chopped fresh cilantro leaves and fresh salsa (I used the pineapple salsa below)",
    "MOJO SAUCE INGREDIENTS:",
    "1cup beer (or chicken stock)",
    "1head of garlic, cloves separated, peeled and minced",
    "1/2cup fresh orange juice",
    "1/4cup fresh lime juice",
    "1teaspoon dried oregano",
    "1teaspoon ground cumin",
    "1teaspoons salt",
    "1/2teaspoon freshly-cracked black pepper",
    "OPTIONAL: FRESH PINEAPPLE SALSA",
    "2cups finely-diced fresh pineapple",
    "1/2cup finely-chopped fresh cilantro",
    "1/2cup finely-diced red onion",
    "2tablespoons lime juice",
    "1/2teaspoon ground cumin",
    "1jalapeño, seeded and finely-diced",
    "salt and pepper"
  ],
  "directions": [
    "TO MAKE THE INSTANT POT CRISPY CARNITAS:",
    "In a medium mixing bowl, prepare the mojo sauce (see below).",
    "Season pork chunks on all sides with salt and pepper.",
    "Click the “Saute” setting on the Instant Pot. Add oil and half of the pork, and sear — turning every 45-60 seconds or so — until the pork is browned on all sides. Transfer pork to a separate clean plate, and repeat with the other half of the pork, searing until browned on all sides. Press “Cancel” to turn off the heat.",
    "Pour in the mojo sauce, and toss briefly to combine. Close lid securely and set vent to “Sealing”.",
    "Press “Meat”, then press “Pressure” until the light on “High Pressure” lights up, then adjust the up/down arrows until time reads 30 minutes. Cook. Then let the pressure release naturally, about 15 minutes. Carefully turn the vent to “Venting”, just to release any extra pressure that might still be in there. Then remove the lid.",
    "Turn on the oven broiler to High.",
    "Shred the pork with two forks. Then transfer it with a slotted spoon to a large baking sheet. Spoon about a third of the leftover juices evenly on top of the pork. Then broil for 4-5 minutes, or until the edges of the pork begin browning and crisping up. Remove the sheet from the oven, then ladle a remaining third of the juices from the Instant Pot evenly over the pork, and then give it a good toss with some tongs. Broil for an additional 5 minutes to get the meat even more crispy. Then remove and ladle the final third of the juices over the pork, and toss to combine.",
    "Sprinkle with chopped fresh cilantro, then serve immediately in tacos, burritos, salads, or whatever sounds good to you! Or, refrigerat pork in a sealed container for up to 3 days, or freeze for up to 3 months.",
    "TO MAKE THE MOJO SAUCE:",
    "Whisk all ingredients together in a medium mixing bowl until combined.",
    "TO MAKE THE PINEAPPLE SALSA:",
    "Toss all ingredients together in a medium mixing bowl until combined. Season with salt and pepper to taste, also adding in extra lime juice if desired."
  ]
}