{
  "title": "Instant Pot Split Pea Soup",
  "source": "Simplyhappyfoodie.com",
  "servings": "Servings: 6 - 8",
  "categories": [
    "Instant Pot"
  ],
  "ingredients": [
    "1Tbsp Olive Oil",
    "2Tbsp Butter",
    "1Onion, diced",
    "3Stalks of Celery, diced",
    "2Bay Leaves",
    "1/4tsp Thyme Leaves, dried",
    "3Carrots, chopped",
    "4cloves Garlic, pressed or finely minced",
    "1/4tsp Pepper",
    "6cups Chicken or Vegetable Broth low sodium (use only 5 cups for a thick soup, 7 cups for a thinner soup)",
    "1lb Green Split Peas, rinsed and sorted (unsoaked)",
    "1tsp Liquid Smoke (Optional) for vegetarian version",
    "1/2tsp Kosher Salt (add last, after cooking, if needed) (1/4 tsp table salt)",
    "6slices Bacon (Optional) chopped",
    "2small Ham Hocks (Optional) Not very meaty, but add a nice smoky flavor and richness.",
    "1Leftover Ham Bone (Optional) I like to use this with the diced ham",
    "2 - 3cups Diced Leftover Ham (Optional)"
  ],
  "directions": [
    "Turn the pressure cooker on to the Sauté function. Let it warm up and add the olive oil and butter.",
    "Add the onion, celery, bay leaves, and thyme. Cook, stirring occasionally, until onion starts to turn translucent.",
    "Add the carrots, garlic, bacon or ham, if using, and pepper. Cook for a minute.",
    "Add the broth and ham bone or ham hocks, if using (Add liquid smoke, if using, for vegetarian method). Let come to a simmer.",
    "Stir in the split peas.",
    "Place the lid on the pot and lock it in place. Set the steam release knob to the Sealing position.",
    "Cancel the sauté function and Choose Pressure Cook/Manual, and use the + or - or dial to choose 18 minutes. High pressure. It will take a few minutes for the pot to come to pressure.",
    "When the cooking time has finished, let the pot sit undisturbed for 15 minutes to naturally release some of the pressure. Then turn the steam release knob to Venting to quick release the remaining pressure.",
    "When the pin in the lid drops down, carefully open the lid, facing away from you. Remove the bay leaves and the bone or ham hocks, if you used them.",
    "Taste and add the salt as desired.",
    "Serve hot. The soup will thicken quite a bit when it cools, that is normal."
  ]
}