{
  "title": "Italian Sausage Bolognese",
  "source": "Italian American Don Angie Book",
  "servings": "MAKES 8 TO 10 CUPS (SERVES 8 TO 10 WITH PASTA)",
  "categories": [
    "Italian",
    "Italian American - Don Angie"
  ],
  "ingredients": [
    "2yellow onions, coarsely chopped",
    "4garlic cloves, peeled",
    "5celery ribs, coarsely chopped",
    "2carrots, coarsely chopped",
    "4ounces pancetta, cut into 1-inch cubes",
    "1pound sweet Italian sausage, casings removed",
    "1pound ground veal",
    "3tablespoons kosher salt",
    "2tablespoons extra-virgin olive oil",
    "½cup tomato paste",
    "1cup white wine",
    "2(28-ounce) cans whole tomatoes (preferably San Marzano DOP)",
    "2cups whole milk",
    "2whole star anise",
    "2teaspoons colatura or fish sauce, plus more to taste",
    "1tablespoon sugar",
    "2tablespoons fresh lemon juice",
    "To serve with pasta",
    "½cup kosher salt",
    "2pounds fresh egg pasta, such as pappardelle, tagliatelle, or linguine, store-bought or 2 batches homemade (this page)",
    "4tablespoons (½ stick) unsalted butter",
    "½cup finely grated Parmigiano-Reggiano cheese, plus ¼ cup (optional) for serving"
  ],
  "directions": [
    "In a food processor, working in batches if necessary, process the onions, garlic, celery, and carrots until chopped as finely as possible, similar in size to uncooked rice. Set aside. Rinse the food processor and process the pancetta until very finely chopped, the same size as the vegetables. Set aside.",
    "In a medium bowl, mix the Italian sausage and veal together and season with the salt.",
    "In a large heavy-bottomed pot, heat the olive oil over high heat. When it shimmers, add the meat, stirring frequently with a wooden spoon to break it up into small pieces, until evenly browned, about 15 minutes. Remove the meat with a slotted spoon and set aside. Drain any excess fat from the pot but keep the browned bits on the bottom (do not wash).",
    "Add the pancetta to the pot over medium heat and cook, stirring occasionally, until the fat is rendered and the pancetta is browned, 8 to 10 minutes. Add the processed vegetables and cook, stirring often, until the vegetables are very soft and have taken on a darker hue, 10 to 15 minutes.",
    "Add the tomato paste and cook, continuing to stir, for 5 minutes, until deep orange and caramelized. Stir in the wine and cook until fully evaporated, about 5 minutes.Meanwhile, using your hands, crush the tomatoes (including the liquid) over a medium bowl until completely broken up.",
    "Return the ground meat to the pot. Add the milk, star anise, and tomatoes. Stir well, bring to a simmer, and cook over medium-low heat, uncovered, stirring occasionally, until the sauce thickens and is bright orange, about 2 hours. If any fat separates, whisk it back in to emulsify. Discard the star anise. Remove the pot from the heat and add the colatura, sugar, and lemon juice and stir well to incorporate and re-emulsify the sauce.",
    "The sauce is ready to be used at this point, or it can be stored in an airtight container in the refrigerator for up to 1 week, or in the freezer for up to 3 months.",
    "To serve with pasta: In a large pot, bring 4 quarts water and the salt to a boil over high heat. Add the pasta and cook according to the package directions. Drain and add the pasta to the sauce, tossing to coat. Add the butter and parmesan and stir well to combine. Transfer to individual plates or a serving platter. Top with more cheese, if desired. Serve immediately."
  ]
}