{
  "title": "Jammy Eggs with Yogurt & Brown-Buttered Nuts",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 1 small garlic clove",
    "DAIRY",
    "- 8 large eggs",
    "- 1 cup plain whole-milk Greek yogurt or labneh",
    "- 5 tablespoons unsalted butter",
    "PANTRY",
    "- Kosher salt",
    "- ⅔ cup walnuts, blanched hazelnuts, or shelled pistachios",
    "- 2 teaspoons Aleppo pepper or other mild chile flakes",
    "- ¼ teaspoon ground turmeric",
    "- Flatbreads or pitas, for dragging"
  ],
  "directions": [
    "1. Cook the eggs:",
    "- Bring a medium pot of water to a boil. Using a slotted spoon, gently lower 8 eggs into the water; set a timer for 7 minutes.",
    "- Meanwhile, fill a medium bowl with ice water. Once the eggs have finished cooking, use a slotted spoon to transfer them to the ice bath to stop cooking. Let the eggs cool for at least 5 minutes, then peel them and set aside.",
    "2. Make the garlic yogurt: Finely grate 1 garlic clove into a small bowl, then stir in 1 cup plain whole-milk Greek yogurt. Season with salt.",
    "3. Make the brown-buttered nuts:",
    "- Chop ⅔ cup walnuts so that all pieces are about the size of a lentil.",
    "- Wipe out the saucepan used for the eggs so that it is completely dry, then add 5 tablespoons butter and cook over medium-low heat until just melted and foamy. Add the walnuts and cook, stirring occasionally, until very lightly toasted, 2 to 3 minutes.",
    "- Add 2 teaspoons Aleppo pepper and ¼ teaspoon turmeric and continue to cook until the walnuts are toasted and golden brown and the butter is very nutty and fragrant, about 1 minute longer. Remove from the heat and stir in ½ teaspoon salt.",
    "4. Serve: Divide the garlic yogurt among 4 shallow bowls. Nestle 2 peeled eggs in each bowl and drizzle the brown-buttered nuts over top. Season with more salt and serve with flatbread."
  ]
}