{
  "title": "Japanese Mayonnaise (Kewpie Mayo)",
  "source": "Justonecookbook.com",
  "servings": "Servings: 2",
  "categories": [
    "Sauce"
  ],
  "ingredients": [
    "AD",
    "2pasteurized egg yolks (at room temperature; if you cannot find a pasteurized egg, use the best, freshest eggs you can find for this recipe. You can pasteurize your eggs if you have an immersion circulator. Here's my tutorial)",
    "2tsp Dijon mustard (mustard adds flavor and helps to emulsify the mixture, reducing the risk of the mayonnaise breaking)",
    "1½cups neutral-flavored oil (vegetable, rice bran, canola, etc.)",
    "1tsp kosher salt (Diamond Crystal; use half for table salt)",
    "2tsp sugar (I added 2 more tsp at the end, but it depends on your preference)",
    "½tsp dashi powder",
    "2Tbsp rice vinegar (unseasoned)",
    "4tsp fresh lemon juice"
  ],
  "directions": [
    "Gather all the ingredients. Tip: If you reduce the recipe ingredients, there won’t be enough volume for the food processor or blender to do its work, so you may need to hand whisk the ingredients (or use a hand mixer or immersion blender). Make sure the egg yolks are at room temperature.",
    "Put the egg yolks and mustard into the bowl of a food processor or a blender (my food processor has a 3-cup bowl) and process for 20 seconds.",
    "With the food processor running, SLOWLY drizzle the canola oil in a thin, steady stream until you’ve added about ½ cup of the oil. The mixture will begin to thicken and emulsify. If you add the oil too fast, it won’t emulsify.",
    "Add the kosher salt, granulated sugar, and dashi powder and give everything a whirl again.",
    "Continue to add the oil in a thin, steady stream until you’ve added another ½ cup of oil. I use the Stir setting while adding the oil.",
    "Finally, add the rice vinegar, lemon juice, and remaining oil and process for an extra 10 seconds, just until the ingredients are combined and emulsified. Don’t blend the mayonnaise too long, as homemade mayonnaise comes together pretty quickly in the food processor or blender. When blended too long, the emulsion that brought the spread together is more likely to break, either from overprocessing or overheating.",
    "Taste the mayonnaise and adjust with salt, sugar, or lemon juice to your liking. I personally added 2 more teaspoons of sugar for a total of 4 teaspoons.",
    "To Store:",
    "You can keep the mayonnaise in an airtight container and store it in the refrigerator for about 4 days."
  ]
}