{
  "title": "Khao Soi",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 4 to 6",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "BROTH",
    "Yields: About 3½ cups",
    "2tablespoons canola oil",
    "½cup Red Curry Paste or store-bought",
    "2heaping tablespoons Thai Curry Powder",
    "2cans Chef’s Choice unsweetened coconut milk",
    "¼cup Red Boat fish sauce, plus more to taste",
    "2tablespoons palm sugar",
    "1½cups homemade Chicken Stock or low-sodium canned chicken stock or broth",
    "⅛ to ¼teaspoon Thai chili flakes",
    "1quart canola oil",
    "16ounces uncooked thin wonton noodles",
    "1pound skinless, boneless chicken thighs, diced",
    "Freshly squeezed lime juice, to taste",
    "½cup diced red onions",
    "½cup diced Fermented Mustard Greens, or 2 packed cups raw mustard greens, coarsely chopped",
    "¼cup fresh cilantro leaves"
  ],
  "directions": [
    "1. Make the broth: Heat the oil in a large saucepot over high heat until the oil begins to shimmer. Add the curry paste, curry powder, and 1 cup of the coconut milk and cook the paste for about 5 minutes, until it begins to look curdled. Deglaze with the fish sauce and cook for 1 minute. Add the palm sugar and cook a few minutes longer, until melted.",
    "2. Add the remaining coconut milk, chicken stock, and chili flakes and bring to a boil, reduce the heat to low, and cook for about 30 minutes, stirring occasionally, until thickened to a sauce consistency.",
    "3. Line a baking sheet with paper towels. Heat the oil in a large pot over medium heat until it registers 350 degrees F on a deep-fry thermometer. Remove a quarter of the noodles and fry them, in batches if necessary, in the oil for about 2 minutes, until golden brown and crispy. Drain on the baking sheet.",
    "4. Bring the khao soi base to a simmer, add the chicken thighs, and cook for about 5 minutes, until the chicken is just cooked through. Season to taste with lime juice and fish sauce.",
    "5. Put the cooked noodles in a bowl, ladle the broth on top, and add some of the cooked chicken. Garnish with the red onion, mustard greens, crispy noodles, and cilantro. Serve with a lime wedge. Traditionally, the mustard greens and red onion are served on the side."
  ]
}