{
  "title": "Khao Tod (Crispy Rice Salad) with Fried Eggs",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "4",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "For Frying:",
    "4cups peanut oil, for frying",
    "For the Rice Cakes:",
    "½cup plus 1 tablespoon all-purpose flour",
    "5eggs",
    "2teaspoons red chili paste or sambal oelek",
    "3cups cooked jasmine rice, cooled if you made it fresh for this*",
    "4dried chiles (such as chiles de árbol), or to taste",
    "¼cup peanuts",
    "For the Dressing:",
    "3tablespoons fresh lime juice (from about 1½ limes)",
    "1tablespoon fish sauce or soy sauce",
    "2teaspoons sugar",
    "1teaspoon Thai chile powder (see Tip), or to taste",
    "For the Salad:",
    "⅓cup loosely packed fresh cilantro leaves",
    "⅓cup loosely packed mint leaves",
    "⅓cup sliced scallions",
    "2shallots, sliced into very thin wedges",
    "1-inch piece fresh ginger, peeled and cut into thin matchsticks (julienne)"
  ],
  "directions": [
    "In a 9-inch cast-iron skillet, heat the oil over medium-high heat to 350°F. (Use a deep-fry thermometer or test the oil by dropping in a grain of rice; if it sizzles immediately but isn’t burning, you’re good.)",
    "While the oil is heating, make the rice cakes: Put the ½ cup flour in a shallow dish. In a large bowl, whisk together 1 egg, the chili paste, and the remaining 1 tablespoon flour. Add the rice and mix with your hands. Form the mixture into 8 patties 3 inches wide and 1 inch thick. Dredge the patties in the flour and set on a plate.",
    "Fry the dried chiles and peanuts in the oil just enough to darken them slightly, being careful not to burn them, 1 to 2 minutes. Remove with a slotted spoon and drain on paper towels; set aside for garnish.",
    "Working in two batches, use a Chinese spider or slotted spoon to gently lower the rice cakes into the oil and fry them until crispy and golden brown, flipping halfway, about 5 minutes per side. Remove the cakes from the oil and allow them to cool on paper towels.",
    "In a small bowl, whisk together the lime juice, fish sauce, sugar, and chile powder until the sugar is dissolved.",
    "Using your hands, crumble up the crispy rice cakes into different sizes into a bowl. Add the cilantro, mint, scallions, shallots, and ginger.",
    "Take a bit of the frying oil and heat it up in a separate skillet, then fry 4 eggs sunny-side-up style.",
    "Toss the salad with the dressing, divide the salad among four plates, and top each plate with a sunny-side-up egg. Garnish with the fried peanuts and chiles."
  ]
}