{
  "title": "Kimchi-Braised Pork with Sesame and Egg Yolk",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 6 to 8",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "FOR THE STEW",
    "2½–3pounds baby back ribs, separated into 2-rib segments, or 2 pounds boneless pork shoulder, cut into 2-inch pieces",
    "Kosher salt and freshly ground black pepper",
    "2tablespoons vegetable oil",
    "4garlic cloves, finely chopped",
    "2-inch piece fresh ginger, peeled and finely chopped",
    "¼cup gochujang (Korean chili paste)",
    "2(16-ounce) jars cabbage kimchi, coarsely chopped",
    "1bunch scallions, green and white parts, cut into 1-inch pieces",
    "8cups water",
    "FOR SERVING (OPTIONAL)",
    "2watermelon radishes or 4 regular radishes, thinly sliced",
    "1apple, thinly sliced",
    "2tablespoons rice wine vinegar",
    "1tablespoon toasted sesame oil",
    "Korean chili flakes or crushed red pepper flakes",
    "1(12–16 ounce) package silken tofu",
    "4scallions, green and white parts, thinly sliced",
    "¼cup toasted sesame seeds",
    "4cups watercress, tough stems removed",
    "6–8large egg yolks"
  ],
  "directions": [
    "1 Make the stew. Season the pork with salt and pepper. Heat the oil in a large pot over medium heat. Working in batches if needed, add the pork and cook until golden brown on all sides. (Time will vary depending if you’re doing ribs or shoulder, but all in all, should take 15 to 20 minutes to brown the meat all over.)2 Transfer the meat to a cutting board or large platter, leaving the drippings and fat in the pot (feel free to scrape out any obvious burned bits). Add the garlic and ginger and cook, stirring occasionally, until the garlic starts to brown, 2 to 3 minutes. Add the gochujang and cook just like you would tomato paste, until it’s caramelized and turned a sort of brick-red color, another 2 minutes or so.3 Add the kimchi, scallions, and water. Bring to a simmer and nestle the pork into the liquid, making sure it’s all submerged. Cover the pot and reduce the heat to medium-low. Gently simmer until the pork is falling apart and completely tender, 2 to 2½ hours.4 To serve, toss the radishes and apple with the vinegar, sesame oil, and chili flakes, and season with salt and pepper. Place the tofu in a medium bowl (I leave it whole so people can spoon out as much as they want) and top with a bit of scallion and sesame seeds.5 Let people DIY their own bowls. For reference, my dream bowl involves spooning a bit of tofu into the bottom of a bowl then ladling the stew over. From there, I top it with a little radish/apple mixture, a few sprigs of watercress, a sprinkling of sesame seeds and scallions, and last but not least: an egg yolk. But please design your own bowl of dreams, even if that means simply enjoying the stew on its own, as is."
  ]
}