{
  "title": "Kimchi Dumplings",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Makes 24 Dumplings",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "FOR THE FILLING:",
    "- 3 ounces dried sweet potato starch noodles (dangmyeon), soaked in cold water for 30 minutes and drained well",
    "- ¼ pound firm tofu",
    "- ½ cup finely chopped spicy cabbage kimchi, homemade or store-bought",
    "- ¼ cup thinly sliced garlic chives",
    "- 1½ teaspoons gochugaru (Korean chili flakes)",
    "- 1½ teaspoons toasted sesame oil",
    "- 1½ teaspoons Mushroom Seasoning Powder, homemade or store-bought",
    "FOR THE DUMPLINGS:",
    "- 24 square dumpling wrappers",
    "- 3 tablespoons extra-virgin olive oil",
    "- 1 tablespoon toasted sesame oil",
    "- No-Cook Hot Sauce"
  ],
  "directions": [
    "1. MAKE THE FILLING: Bring a large pot of water to a boil. Add the noodles and boil, stirring occasionally, until they’re tender but still chewy, about 8 minutes. Drain well and use scissors to snip them into 1-inch pieces.",
    "2. Cut the tofu in half horizontally and press it between paper towels or a clean kitchen towel to remove excess liquid. Give the kimchi a gentle squeeze to drain off its liquid. Crumble the tofu into a medium mixing bowl, then add the noodles, kimchi, chives, gochugaru, sesame oil, and mushroom seasoning powder and mix well.",
    "3. FORM THE DUMPLINGS: Put a heaping teaspoon of the kimchi mixture in the center of each dumpling wrapper. Dip two fingers in water and rub the edges of the wrapper. Fold the wrapper corner to corner to make a triangle, then firmly press the edges together so they stick together. Keep them in the fridge—in a single layer or with layers separated by parchment paper—until you’re ready to cook them, up to 12 hours.",
    "4. COOK THE DUMPLINGS: Combine the olive oil and sesame oil in a small mixing bowl and stir well. Bring a large pot of water to a boil. Add the dumplings and cook for 2 minutes. Taste a dumpling to be sure the wrapper is cooked. Drain the dumplings, drizzle with the sesame oil mixture and some hot sauce, and serve right away."
  ]
}