{
  "title": "Koji Turkey",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 10 to 12",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2cups Shio Koji (this page)",
    "4quarts water",
    "1½cups sugar for brining",
    "1½cups kosher salt for brining",
    "1(6- to 7-pound) bone-in whole turkey breast, trimmed",
    "2(1½- to 1¾-pound) turkey leg quarters",
    "2pounds small red potatoes, quartered",
    "1pound carrots, peeled and sliced on bias 2 inches thick",
    "10shallots, peeled and halved",
    "3tablespoons vegetable oil, divided",
    "1teaspoon kosher salt",
    "¾teaspoon pepper, divided",
    "1bunch thyme sprigs",
    "3tablespoons unsalted butter, melted"
  ],
  "directions": [
    "1. Process shio koji in blender until smooth, about 30 seconds. Reserve 3 tablespoons blended shio koji in airtight container in refrigerator. Transfer remaining blended shio koji to large stockpot or large plastic container and whisk in water, sugar, and 1½ cups salt until dissolved. Add turkey parts to brine, cover, and refrigerate for at least 12 hours or up to 16 hours.",
    "2. Remove turkey parts from brine and pat dry with paper towels; set aside at room temperature. Adjust oven rack to lower-middle position and heat oven to 400 degrees. Line rimmed baking sheet with aluminum foil.",
    "3. Toss potatoes, carrots, shallots, 2 tablespoons oil, salt, and 2 tablespoons reserved shio koji in large bowl to combine. Sprinkle with ¼ teaspoon pepper. Arrange vegetables on prepared sheet and top with wire rack (rack will rest on vegetables). Arrange thyme sprigs in single layer on rack. Whisk melted butter and remaining 1 tablespoon shio koji until combined; set aside.",
    "4. Place turkey parts on prepared rack, skin side up, and brush skin with remaining 1 tablespoon oil. Sprinkle with remaining ½ teaspoon pepper and cover loosely with foil. Roast for 30 minutes. Remove foil and continue to roast for 25 minutes. Rotate sheet, brush skin with shio koji–butter mixture (if butter mixture has solidified, reheat in microwave for 10 to 20 seconds), and roast until breast registers 155 degrees and thighs register 170 degrees, 25 to 45 minutes, removing pieces as they come to temperature. (If any portions of the turkey skin are browning too rapidly, re-cover them with foil.) Increase oven temperature to 450 degrees.",
    "5. Transfer turkey to carving board, tent with foil, and let rest for 30 minutes. Remove rack and continue to roast vegetables until vegetables are tender and potatoes are spotty brown, about 30 minutes, stirring halfway through. Transfer vegetables to serving bowl. Carve turkey and transfer to serving platter. Serve."
  ]
}