{
  "title": "Korean BBQ Pork Ribs",
  "source": "Koreanbapsang.com",
  "servings": "",
  "categories": [
    "Korean"
  ],
  "ingredients": [
    "For each marinade:",
    "2slabs baby back ribs (5 to 7 pounds)",
    "Sweet and Savory Marinade:",
    "1/2cup soy sauce",
    "1/2cup water",
    "1/4cup rice wine (or mirin or white wine)",
    "2tablespoons sesame oil",
    "4tablespoons honey",
    "2tablespoons brown sugar use regular sugar if unavailable",
    "3tablespoons minced garlic (8 or 9 plump cloves) See note 1",
    "2tablespoons finely grated ginger See note 1",
    "1/2medium onion, grated See note 1",
    "1/2medium sweet apple, grated See note 1",
    "1/2teaspoon black pepper",
    "Spicy Marinade:",
    "⅔cup Korean red pepper paste (gochujang, 고추장)",
    "1 to 3teaspoons Korean red chili pepper flakes (gochugaru, 고추가루)",
    "1/4cup soy sauce",
    "1/4cup rice wine (or mirin or white wine)",
    "2tablespoons sesame oil",
    "4tablespoons honey",
    "2tablespoons brown sugar Use regular sugar if unavailable",
    "3tablespoons minced garlic See note 1",
    "2tablespoons grated ginger See note 1",
    "1/2medium onion, grated See note 1",
    "1/2medium sweet apple, grated See note 1",
    "1/2teaspoon black pepper"
  ],
  "directions": [
    "For the marinade:",
    "Prepare the ingredients for the marinade of your choice. Mix all of the ingredients well.",
    "Preparing the ribs",
    "Pull off the membrane if it's not been removed (see note 2). Cut each slab of the ribs into two pieces for easier handling. Rinse the ribs and drain. Coat the ribs well with the marinade, and marinate them for a minimum of eight hours (preferably 24 hours to 48 hours). Turn them over once after half of the marinating time has passed. (You can use large zip lock bags for easier handling.)",
    "Cooking the ribs",
    "Preheat the oven to 325°F (300°F if using a convection oven). Line a baking sheet with aluminum foil. I used 2 baking dishes. Arrange the ribs, meat side down. If using the mild marinade, pour some marinade into the baking sheet or dish. Cover the baking sheet/dish tightly with aluminum foil. Bake them for 1.5 hour (2 hours if you want fall off the bones tenderness). Remove the foil cover.",
    "If used the mild marinade, you will have a lot of liquid in the baking sheet/dish. Pour it out into a sauce pan along with any reserved marinade, and bring the liquid to a boil and reduce by about half or until it turns into a thick consistency. You don't need to do this with the spicy marinade as it doesn't have as much liquid. Brush the sauce onto the ribs.",
    "Finishing the ribs",
    "Option 1: Change the oven setting to broil (500°F) and preheat for a few minutes. Then broil the ribs until the ribs are lightly caramelized and charred, about 5 minutes on each side. Baste the ribs with the sauce a couple of times while broiling.",
    "Option 2: Preheat the grill and grill the ribs over medium heat until the ribs are lightly caramelized and charred, about 5 minutes on each side. Baste the ribs with the sauce while grilling."
  ]
}