{
  "title": "Korean-Inspired Crispy Tofu Tacos with Cabbage-Lime Slaw",
  "source": "Seriouseats.com",
  "servings": "6 tacos",
  "categories": [
    "Korean"
  ],
  "ingredients": [
    "One 16-ounce block extra-firm tofu",
    "1cup shredded purple cabbage",
    "1cup shredded green cabbage",
    "1/2cup shredded carrots",
    "Juice of 2 limes, plus lime wedges for serving",
    "Kosher salt and freshly ground black pepper",
    "1cup thinly sliced mini cucumbers",
    "2tablespoons granulated sugar",
    "3/4cup rice wine vinegar, divided",
    "1/2teaspoon Korean red pepper flakes (gochugaru) or crushed red pepper flakes (optional)",
    "2tablespoons cornstarch",
    "Canola oil or vegetable oil, for sautéing",
    "1tablespoon grated peeled fresh ginger",
    "1tablespoon minced garlic (from about 3 or 4 medium cloves)",
    "1/2cup gochujang (Korean chili paste), or to taste",
    "1/2cup light brown sugar",
    "1/4cup soy sauce",
    "Toasted sesame seeds, for garnish",
    "6flour tortillas, warmed, for serving"
  ],
  "directions": [
    "1. Line a rimmed baking sheet with paper towels. Rinse the tofu, slice it into 1-inch-thick slabs, and lay them on the prepared baking sheet. Top with more towels. Press the tofu by placing a heavy book or cast iron skillet on top. Set aside for 30 minutes.",
    "2. Meanwhile, in a large bowl, combine the red and green cabbage with the carrots and toss with lime juice. Season with salt and pepper. In a separate small bowl, combine the cucumber slices, sugar, 1/4 cup of the rice vinegar, and red pepper flakes (if using). Cover both bowls and refrigerate for at least 30 minutes or until ready to serve.",
    "3. Using your hands, crumble the tofu into a medium bowl. Add cornstarch and toss until evenly coated. Heat a thin layer of oil in a large wok or skillet over medium-high heat until shimmering. Add the tofu and cook until browned and crispy all over, turning and breaking up the pieces with a wooden spoon as it cooks. Use a slotted spoon to transfer the tofu to a plate.",
    "4. Add more oil to the pan, if necessary, and briefly sauté the garlic and ginger until fragrant, about 30 seconds. Stir in the gochujang, brown sugar, soy sauce, and remaining 1/2 cup rice wine vinegar. Cook until the sauce is thick enough to coat the back of a spoon, about 2 minutes. Add tofu back to the pan and stir until well coated. Sprinkle sesame seeds on top.",
    "5. Top each tortilla with cabbage slaw. Spoon the tofu over the slaw and top with the pickled cucumbers. Serve."
  ]
}