{
  "title": "Korean Instant Pot Short Ribs (Galbi Jjim)",
  "source": "Omnivorescookbook.com",
  "servings": "Serving: 1",
  "categories": [
    "Korean"
  ],
  "ingredients": [
    "3lbs (1.4 kg) beef short ribs",
    "Sauce:",
    "1/2Asian pear , chopped (or 1 small red apple)",
    "1/2onion , chopped",
    "8cloves garlic",
    "1\" (2.5 cm) ginger , sliced",
    "1/2cup soy sauce",
    "1/3cup sugar",
    "1/4cup soju (or sake, or mirin)",
    "1teaspoon black pepper",
    "Optional:",
    "2carrots , peeled & trimmed into 1-inch ovals",
    "1/2daikon , peeled & trimmed into 1-inch ovals"
  ],
  "directions": [
    "Soak the short ribs in cold water",
    "This step will remove the blood from the short ribs and enhance the taste of the dish. The color of the ribs turn pink once soaked and drained.",
    "It’s possible to skip this step if you’re short on time, but I highly recommend it for the best result.",
    "Blend the ingredients",
    "I used the Vitamix to blend the ingredients into a very smooth sauce. If you’re using a less powerful blender, the sauce might not come out as smooth. But don’t worry – it won’t affect the taste.",
    "Cover the short ribs with cold water and allow them to soak, 20 minutes to a few hours. Bring a pot of water, enough to cover the short ribs, to a boil. Once the water begins to boil, rinse the soaked meat off and add it into the pot. Bring the pot back to a boil and then boil the meat for 5 minutes.",
    "Strain the short ribs off (reserving some of the resulting stock for later just in case) and rinse them to remove any residue and to cool them down. If any piece has a large amount of excess fat on it, you can trim that off now. Add them to the Instant Pot.",
    "Combine all the sauce ingredients in a blender and blend on high until the sauce is as smooth as possible. Pour the sauce over the short ribs and seal the Instant Pot. (*Footnote 1 – If you add the sauce and it doesn’t cover enough of the meat, you can add some of the blanching stock to increase the liquid level) Set to pressure cook for 45 minutes, and allow it to do the natural release for 15 minutes once done.",
    "At this point the short ribs are are ready to serve, but you can also take some additional steps to thicken the sauce and add vegetables:",
    "Remove the short ribs from the pot and cover them with foil.",
    "Add the vegetables (if desired) into the pot and turn on the saute function.",
    "Cook the sauce down, stirring occasionally, until your desired consistency is reached and the vegetables are fully cooked, 10 minutes for a crunchy texture or 12 minutes for a softer texture.",
    "Put the short ribs back into the pot and toss them until fully coated with the sauce."
  ]
}