{
  "title": "Korean Fried Cauliflower",
  "source": "Thewoksoflife.com",
  "servings": "Serves: 6",
  "categories": [
    "Korean"
  ],
  "ingredients": [
    "2pounds cauliflower",
    "(about 1 large head)",
    "canola or peanut oil (for frying)",
    "FOR THE BATTER:",
    "1/2cup potato starch",
    "10tablespoons cake flour",
    "1 1/2teaspoons baking soda",
    "1/2teaspoon salt",
    "1/8teaspoon white pepper",
    "3/4cup water",
    "1teaspoon sesame oil",
    "FOR THE SOY GARLIC GLAZE:",
    "2tablespoons oil",
    "(such as canola, peanut, or vegetable oil)",
    "1small shallot (finely minced)",
    "7cloves garlic (minced)",
    "3dried red chili peppers (optional)",
    "3tablespoons soy sauce",
    "2tablespoons water",
    "2/3cup mirin",
    "1 1/2tablespoons rice vinegar",
    "2tablespoons light brown sugar",
    "1tablespoon gochujang",
    "1tablespoon Dijon mustard"
  ],
  "directions": [
    "BATTER THE CAULIFLOWER:",
    "Wash and cut your cauliflower into very large florets, about the size of your palm. Shake off any excess moisture.",
    "Whisk together the potato starch, cake flour, baking soda, salt, and white pepper. Add the water and sesame oil, and whisk to combine.",
    "FIRST FRY:",
    "Heat 4-5 cups of oil in a deep pot to 325°F/163°C. The oil should ideally fill the pot about halfway, so hot oil won’t overflow or splatter too much while frying.",
    "Fry the cauliflower in batches until they’re golden brown and the batter is thoroughly set, about 2-3 minutes. If they brown too quickly, reduce the heat.",
    "Drain on a cooling rack placed over a sheet pan, and between batches, remove any particles left in the oil using a strainer. As the cauliflower sits, it will release steam that will later help the cauliflower get crispy during its second trip through the frying oil.",
    "MAKE THE GLAZE:",
    "In a saucepan over medium low heat, add 2 tablespoons vegetable oil, along with the shallot, garlic, and dried chili peppers (if using, for optional spice). Cook for 3-4 minutes, stirring occasionally, or until the shallots are translucent. If using the dried chili peppers, you can deseed them and chop them, or simply chop and include the seeds for an extra spicy kick. If you’d like to keep your sauce more mild, omit them entirely.",
    "Next, add the soy sauce, water, mirin, rice vinegar, light brown sugar, gochujang, and dijon mustard. Stir and bring the sauce to a simmer, stirring constantly (4-5 minutes). When the sauce has come to a simmer, remove from the heat, cover, and set aside to keep warm.",
    "FINAL FRY & TOSS IN SAUCE:",
    "For the second and final fry, bring the oil temperature again to 325°F/163°C. Fry the cauliflower in batches for another 1-2 minutes, until crunchy and golden. Drain on a cooling rack.",
    "Once you’ve fried all the cauliflower for the second time, add it to a large bowl, and pour the sauce over the top. Toss until the pieces are well-coated, and serve."
  ]
}