{
  "title": "Kung Pao Chicken",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "Chicken and Sauce",
    "1½pounds boneless, skinless chicken thighs, trimmed and cut into ½-inch pieces",
    "¼cup soy sauce, divided",
    "1tablespoon cornstarch",
    "1tablespoon Shaoxing wine or dry sherry",
    "½teaspoon white pepper",
    "1tablespoon Chinese black vinegar or sherry vinegar",
    "1tablespoon packed dark brown sugar",
    "2teaspoons toasted sesame oil",
    "Stir-Fry",
    "2tablespoons plus 1 teaspoon vegetable oil, divided",
    "1tablespoon minced garlic",
    "2teaspoons grated fresh ginger",
    "½cup dry-roasted peanuts",
    "10–15dried arbol chiles, halved lengthwise and seeded",
    "1teaspoon Sichuan peppercorns, ground coarse",
    "2celery ribs, cut into ½-inch pieces",
    "5scallions, white and light green parts only, cut into ½-inch pieces"
  ],
  "directions": [
    "1. For the chicken and sauce Combine chicken, 2 tablespoons soy sauce, cornstarch, Shaoxing wine, and white pepper in large bowl and toss to coat; set aside. Stir vinegar, sugar, oil, and remaining 2 tablespoons soy sauce together in small bowl; set aside.",
    "2. For the stir-fry Stir 1 tablespoon oil, garlic, and ginger together in second small bowl. Combine peanuts and 1 teaspoon oil in 12-inch nonstick skillet or 14-inch flat-bottomed wok over medium-low heat. Cook, tossing slowly but constantly, until peanuts just begin to darken, 3 to 5 minutes. Transfer peanuts to plate and spread into even layer to cool. Return now-empty pan to medium-low heat. Add remaining 1 tablespoon oil, arbols, and peppercorns and cook, tossing constantly, until arbols begin to darken, 1 to 2 minutes. Add garlic mixture and cook, tossing constantly, until all clumps are broken up and mixture is fragrant, about 30 seconds.",
    "3. Add chicken and spread into even layer. Cover pan, increase heat to medium-high, and cook, without stirring, for 1 minute. Stir chicken and spread into even layer. Cover and cook, without stirring, for 1 minute. Add celery and cook uncovered, tossing constantly, until chicken is cooked through, 2 to 3 minutes. Add soy sauce mixture and cook, tossing constantly, until sauce is thickened and shiny and coats chicken, 3 to 5 minutes. Stir in scallions and peanuts and serve."
  ]
}