{
  "title": "Kung Pao Chicken",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Servings: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 tablespoon water",
    "- 1/4 teaspoon baking soda",
    "- 11/2 pounds boneless, skinless chicken thighs, trimmed and cut into 1/2-inch pieces",
    "- 1/4 cup soy sauce, divided",
    "- 1 tablespoon cornstarch",
    "- 1 tablespoon Shaoxing wine",
    "- 1/2 teaspoon white pepper",
    "- 2 tablespoons plus 1 teaspoon vegetable oil, divided",
    "- 3 garlic cloves, minced",
    "- 2 teaspoons grated fresh ginger",
    "- 1 tablespoon Chinese black vinegar",
    "- 1 tablespoon packed dark brown sugar",
    "- 2 teaspoons toasted sesame oil",
    "- 1/2 cup dry-roasted peanuts",
    "- 10–15 small dried Sichuan chiles, stemmed, halved lengthwise, and seeded",
    "- 1 teaspoon Sichuan peppercorns, coarsely ground",
    "- 2 celery ribs, cut into 1/2-inch pieces",
    "- 5 scallions, white and light green parts only, cut into 1/2-inch pieces"
  ],
  "directions": [
    "1. Combine water and baking soda in medium bowl. Add chicken and toss to coat; let sit for 5 minutes. Add 2 tablespoons soy sauce, cornstarch, Shaoxing wine, and pepper to chicken and toss until well combined; let marinate for 15 minutes.",
    "2. Combine 1 tablespoon vegetable oil, garlic, and ginger in small bowl; set aside. Whisk vinegar, sugar, sesame oil, and remaining 2 tablespoons soy sauce in separate small bowl until sugar has dissolved; set aside.",
    "3. Cook peanuts and 1 teaspoon vegetable oil in 14-inch flat-bottomed wok over medium-low heat, stirring constantly, until peanuts just begin to darken, 3 to 5 minutes. Transfer peanuts to plate and spread into even layer to cool. Return now-empty wok to medium-low heat. Add remaining 1 tablespoon vegetable oil, chiles, and peppercorns and cook, stirring constantly, until chiles begin to darken, 1 to 2 minutes. Add reserved garlic mixture and cook, stirring constantly, until mixture is fragrant, about 30 seconds.",
    "4. Add chicken mixture and spread into even layer. Cover wok, increase heat to medium-high, and cook, without tossing, for 1 minute. Toss chicken and spread into even layer. Cover and cook, without tossing, for 1 minute. Add celery and cook uncovered, tossing slowly but constantly, until chicken is cooked through, about 3 minutes. Add reserved soy sauce mixture and cook, tossing constantly, until sauce has thickened, 3 to 5 minutes. Stir in scallions and peanuts. Serve."
  ]
}