{
  "title": "Kungpao Meatballs",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "4 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "- 1 lb / 450 g ground pork (30% fat, 70% lean)",
    "- ½ cup / 70g grated onion",
    "- 1 cup / 150g torn soft white bread",
    "- 1 egg",
    "- 2 garlic cloves, minced",
    "- ¼ cup / 8g grated Parmesan cheese",
    "- ¼ cup / 15g chopped flat-leaf parsley",
    "- ¾ tsp kosher salt",
    "- ¼ tsp black pepper",
    "- 3 Tbsp neutral oil for frying, or as needed",
    "- ¾ cup / 175ml Kungpao Sauce (this page)",
    "- Sesame seeds for garnish",
    "- Chopped scallions, green parts only, for garnish"
  ],
  "directions": [
    "1. To make the meatballs: In a large bowl, add the pork, onion, bread, egg, garlic, cheese, parsley, salt, and pepper. Using your hands to really get in there, mix well to combine and ensure there is an even distribution.",
    "2. To form the meatballs: Fill a small bowl with water—you’ll use this to wet your hands as you form the meatballs. Using wet hands, take a golf ball–size mixture and form meatballs. You should have about twelve to fourteen meatballs.",
    "3. In a large cast-iron skillet or nonstick frying pan over medium-high heat, heat about 2 Tbsp of the oil until sizzling. Add the meatballs and cook while turning until brown all over but not yet fully cooked, about 5 minutes. Transfer to a plate and set aside.",
    "4. In the same large skillet over medium heat, heat the remaining 1 Tbsp neutral oil and then add the meatballs, followed by the Kungpao sauce. Turn down the heat to low and simmer for about 10 minutes, tossing the meatballs occasionally so they are evenly coated in the sauce.",
    "5. Remove the skillet from the heat, place in serving vessel and garnish with the sesame seeds and scallions. Serve immediately. Store in an airtight container in the refrigerator for up to 1 week."
  ]
}