{
  "title": "Lamb Stuffed Shells with Smoked Mozzarella",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6 to 8",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Lamb Ragu",
    "1small fennel bulb, cored and roughly chopped",
    "1medium yellow onion, roughly chopped",
    "5garlic cloves, smashed",
    "Olive oil, for browning",
    "1pound (454 g) ground lamb (80/20)",
    "Kosher salt and freshly cracked black pepper, to taste",
    "1tablespoon tomato paste",
    "1⁄4 teaspoon red pepper flakes, plus more to taste",
    "2dried bay leaves",
    "1⁄2 cup (120 ml) dry red wine",
    "One 24-ounce (680 g) jar passata",
    "2Parmesan rinds (if you have them)",
    "1small bunch fresh thyme, tied together with butcher’s twine",
    "Ricotta Filling",
    "Two 15-ounce (425 g) containers whole-milk ricotta",
    "3⁄4 cup (83 g) freshly grated pecorino Romano",
    "1⁄4 cup (10 g) chopped fresh parsley",
    "Kosher salt and freshly cracked black pepper, to taste",
    "For Assembly",
    "One 12-ounce (340 g) box jumbo shells",
    "12ounces (340 g) fresh smoked mozzarella, grated",
    "1⁄4 cup (28 g) freshly grated pecorino Romano",
    "1⁄2 cup (14 g) fresh mint leaves, torn",
    "1⁄2 cup (14 g) fresh parsley leaves"
  ],
  "directions": [
    "1. Make the ragu: Add the fennel, onion, and garlic to a food processor, and pulse to a fine paste.2. Add a thin coating of olive oil to the bottom of a large pot, and set over medium heat. Add the lamb, in about 2-inch (5 cm) chunks, season with salt and black pepper, and cook, without disturbing or moving the meat, until browned on one side, 5 or 6 minutes. Continue to cook, fully breaking up the meat, until browned, 2 or 3 minutes more.3. Add the vegetable mixture from the food processor, and season with salt and black pepper. Cook, stirring occasionally and scraping up the fond, until all the liquid in the vegetables cooks out and the mixture becomes dry, 10 to 15 minutes.4. Add the tomato paste, and cook until slightly darkened in color, another 2 minutes. Stir in the red pepper flakes and bay leaves.5. Deglaze with the red wine, and cook for 1 minute. (The wine won’t really reduce here, but it will be absorbed by the tomato paste.)6. Stir in the passata, and add the Parmesan rinds, if using, and thyme.7. Bring the sauce to a simmer, reduce the heat to low, and cover. Cook for 1 hour. Uncover the sauce occasionally and stir to prevent scorching.8. Remove and discard the bay leaves, thyme, and rinds, and season the sauce with salt and black pepper. Remove from the heat, and set aside while you prep the rest of the dish. (The sauce can be made up to 3 days ahead, cooled, and stored in an airtight container in the refrigerator.)9. Bring a large pot of water to a boil over high heat.10. Meanwhile, make the filling: Mix the ricotta, pecorino Romano, and parsley in a large bowl. Season with salt and black pepper.11. Heavily season the boiling water from step 9 with salt. Drop in the jumbo shells, and cook until they just start to soften, about 8 minutes. They will finish cooking in the oven.12. Drain the shells in a colander, and toss with a drizzle of olive oil to prevent stickage.13. Preheat the oven to 400°F (200°C) with a rack positioned in the center. Grease a 9 × 13-inch (23 × 33 cm) baking dish with a bit of olive oil.14. Add about one-third of the lamb ragu to cover the bottom of the baking dish.15. Fill each shell with about 1 heaping tablespoon of the ricotta mixture, placing the shells snugly, seam side up, side by side as you fill, overlapping as needed if you have too many for one layer.16. Top the filled shells with the remaining lamb ragu, and sprinkle the mozzarella and pecorino Romano all over. Cover the dish tightly with foil.17. Bake for 40 minutes. Remove the foil and broil on high until the cheese is golden brown and bubbly, 2 to 5 minutes.18. Add the mint and parsley to a small bowl. Drizzle with a small touch of olive oil, season with salt and black pepper, and toss to coat. Top the entire dish of shells with the herb mixture, and serve."
  ]
}