{
  "title": "Lasagna",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 6 to 8 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Parmigiano Fonduta",
    "948g / 4 cups plus 2 Tbsp heavy cream",
    "450g / 5 cups finely grated parmigiano-reggiano",
    "Salt, q.b.",
    "54g / 2 to 3 egg yolks, stirred",
    "To Finish",
    "1batch egg dough (this page)",
    "1.75g / 7 cups simple red sauce (this page)",
    "30g / ⅓ cup finely grated parmigiano-reggiano",
    "30g / ⅓ cup finely grated pecorino romano",
    "Whole nutmeg, q.b.",
    "Black pepper, q.b.",
    "756g / 1 lb 11 oz fresh mozzarella, coarsely grated"
  ],
  "directions": [
    "1 - To make the fonduta, place a large saucepan over medium heat. Add the cream and bring to a very slow simmer. Decrease the heat to low and cook, stirring occasionally, until the cream has reduced by about one-third, 30 to 45 minutes, being very careful not to scorch the bottom of the pan. Remove from the heat and let cool for 5 minutes.",
    "2 - Transfer the warm cream to a high-speed blender. With the blender running on medium-low speed, slowly add the parmigiano, processing until the mixture has emulsified. Taste for seasoning and add salt q.b. (The parmigiano adds plenty of salinity, so you may not need to add much salt.)",
    "3 - With the blender running, gradually add the egg yolks, drizzling them in slowly so they temper and the mixture doesn’t break. Transfer to a bowl and set aside.",
    "4 - To finish, following the directions for lasagna sheets on this page, make 18 (12-inch) sheets with the pasta dough.",
    "5 - Bring a large pot of water to a boil over high heat. Generously salt the water. Line a sheet pan with parchment paper and lightly drizzle with olive oil.",
    "6 - Add the pasta sheets to the water in batches, cooking each batch for 20 to 30 seconds (because the pasta will be baked in the oven, there’s no need to cook it longer). Using a spider and/or tongs, transfer each batch to the prepared sheet pan in a single layer, separating the layers with lightly oiled pieces of parchment paper.",
    "7 - Preheat the oven to 325°F.",
    "8 - Add 188g / ¾ cup of the red sauce to a 9 by 13-inch metal or glass baking dish and spread it evenly along the bottom with the back of a spoon.",
    "9 - Pat two sheets of pasta dry with a clean kitchen towel and place them lengthwise side by side, in the dish, slightly overlapping their long edges in the middle.",
    "10 - Spoon or ladle 90g / scant ⅓ cup of the fonduta over the pasta sheets and spread it evenly. (If the fonduta has cooled too much, you may need to warm it slightly by placing the bowl in a warm-water bath.)",
    "11 - Sprinkle 3g / ½ Tbsp each of the parmigiano and pecorino over the top of the fonduta, followed by a few gratings of nutmeg and pepper q.b.",
    "12 - Add 167g / ⅔ cup of the red sauce and spread it evenly. Sprinkle 85g / packed ½ cup of the mozzarella over the top.",
    "13 - Repeat steps 8 through 12 until you have used all of the pasta sheets, leaving the final layer of pasta exposed.",
    "14 - Top the final pasta layer with the remaining fonduta, followed by nutmeg, pepper, and remaining red sauce. Finish by sprinkling 8g / 1 heaping Tbsp each of the parmigiano and pecorino evenly on top.",
    "15 - Cover the baking dish with a sheet of parchment paper, then top with aluminum foil, rolling the foil over the parchment to seal tightly.",
    "16 - Place the baking dish on a sheet pan and bake the lasagna for 40 minutes.",
    "17 - Uncover the lasagna. Insert a knife blade into the center. The lasagna should look slightly golden around the edges and the knife blade should be hot.",
    "18 - Turn up the oven to 400°F and bake uncovered until the lasagna is golden brown on top and crispy around the edges, 20 to 25 minutes longer, checking after the first 15 minutes of baking. If the lasagna is coloring too rapidly around the edges, cover loosely with a piece of foil for the remaining 5 to 10 minutes to prevent burning.",
    "19 - Let the lasagna cool for at least 20 to 30 minutes before serving. Portion onto plates and finish with grated nutmeg q.b."
  ]
}