{
  "title": "Lasagna Verde with Pistachio Pesto",
  "source": "Italian American Don Angie Book",
  "servings": "SERVES 6 TO 8",
  "categories": [
    "Italian American - Don Angie",
    "Sauce"
  ],
  "ingredients": [
    "Pesto",
    "2cups (3 ounces) tightly packed basil leaves",
    "2cups (3 ounces) tightly packed flat-leaf parsley leaves",
    "½cup (½ ounce) roughly chopped chives",
    "½cup pistachios",
    "Pinch of crushed red pepper flakes",
    "½cup finely grated Parmigiano-Reggiano cheese",
    "1tablespoon kosher salt",
    "¾cup neutral oil, such as vegetable",
    "3tablespoons fresh lemon juice",
    "To assemble",
    "1cup kosher salt (see Note)",
    "2recipes Northern-Style Egg Yolk Pasta (this page) or 16 store-bought fresh pasta sheets (12 × 7 inches)",
    "2cups shredded whole-milk mozzarella cheese",
    "2cups Besciamella (this page)",
    "2cups finely grated Parmigiano-Reggiano cheese, plus more for garnish",
    "Freshly ground black pepper"
  ],
  "directions": [
    "Make the pesto: Bring a medium pot with 4 cups of water to a boil over high heat. Meanwhile, fill a small bowl with ice water and set aside.",
    "Quickly submerge the basil, parsley, and chives in the boiling water, then, using a small fine-mesh sieve, scoop them immediately into the ice water until completely cool. Drain, then use a clean, dry kitchen towel to wring all of the water from the herbs. It’s important to get these herbs as dry as possible at this point—any excess water in the final product will cause the pesto to turn brown.",
    "In a blender, combine the blanched herbs, pistachios, pepper flakes, parmesan, and salt. Blend on high just until smooth, about 10 seconds, then add the oil and lemon juice and blend until the mixture forms a smooth, thick paste, about 30 seconds, pausing to scrape the sides of the blender with a rubber spatula as needed. You should have about 2 cups of pesto. Set aside. Pesto can be made up to 2 days in advance and kept, tightly covered, in the refrigerator.",
    "To assemble: Bring a large pot with 4 quarts water and the kosher salt to a boil over high heat. Meanwhile, set up an ice bath in a large bowl. Line a sheet pan with parchment paper.",
    "Working with one sheet at a time, place a pasta sheet in the boiling water for 15 seconds, then immediately remove and chill in the ice bath for 15 seconds. Transfer to the lined sheet pan and pat dry with a paper towel. Cover with another layer of parchment paper and repeat with the remaining pasta, creating a stack of sheets, each patted dry and each layer separated by parchment. Set aside.",
    "Preheat the oven to 400°F. Lightly spray a 9 × 13-inch baking dish with nonstick cooking spray.",
    "Place two lasagna sheets in the bottom of the dish, overlapping in the center by about 1 inch, and trim the sides of the sheets if necessary to create one flat, even layer. Spread with ⅓ cup of the pesto and sprinkle ½ cup of the mozzarella on top. Add 2 more sheets of pasta (trimming sheets as necessary to form an even single layer), then spread ½ cup of besciamella, followed by ½ cup of parmesan. Repeat the layering in this order 3 more times (2 sheets of pasta topped with pesto and mozzarella, then 2 sheets of pasta topped with besciamella and parmesan) for a total of 8 pasta layers, with the final layer being pasta, ½ cup of besciamella, and ½ cup of parmesan. You may have some leftover pesto, which can be reserved for another use (i.e., pasta). (The lasagna can be frozen at this point, tightly covered in plastic wrap, for up to 3 months; thaw it in the refrigerator before baking.)",
    "Cover with foil, tightly attaching the foil to the edges of the dish but being careful not to press it down on the top of the lasagna, or the cheese will stick. Bake for 15 minutes. Uncover, then bake until the top is golden brown and the center is set, 20 to 25 minutes.",
    "Allow the lasagna to cool in the pan for 15 minutes before cutting into squares and serving. Garnish each serving with freshly ground black pepper and a sprinkling of parmesan. Leftovers keep, tightly covered in the refrigerator, for up to 4 days."
  ]
}