{
  "title": "Lazi Chicken Wings",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "6 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "- Kosher salt, for salting the wings",
    "- 2 lb / 900g chicken wings",
    "- 4 cups plus 2 Tbsp / 950ml neutral oil (such as peanut or soybean)",
    "- Mala Spice Mix",
    "- ½ cup / 50g dried erjingtiao chilies, cut into 1-inch / 2.5cm segments",
    "- 1 Tbsp whole Sichuan pepper",
    "- 2 or 3 scallions, white parts only, cut into thin rounds",
    "- 1 bunch chopped cilantro leaves for garnish"
  ],
  "directions": [
    "1. Salt the wings liberally. Line a plate with paper towels.",
    "2. In a large wok, or other pot big enough to deep-fry, set over high heat, add 4 cups / 950ml of the oil and heat to 250°F / 120°C on an instant-read thermometer. Working in batches, add the wings to the wok and fry for 15 to 20 minutes, until cooked through and golden but not brown. Remove from the oil and drain on the paper towel–lined plate. Rest and refrigerate the fried wings overnight in a flat layer, uncovered. Reserve the oil to refry the wings when ready to serve.",
    "3. When ready to serve, in the same large wok over high heat, add the reserved 4 cups of oil and heat to 400°F / 200°C on an instant-read thermometer. Return the wings to the wok and fry for 5 to 10 minutes, until the wings are a golden-brown color. Remove from the oil and drain on paper towels.",
    "4. Transfer the wings to a cooling rack and dust them liberally with the spice mix.",
    "5. In the same large wok over medium-high heat, add the remaining 2 Tbsp oil and heat until hot but not smoking. Add the chilies, Sichuan pepper, and scallions and stir-fry until fragrant, about 2 minutes. Be careful not to burn the spices. Return the wings to the wok and add more spice mix to taste. Serve immediately, topped with a big bunch of the cilantro."
  ]
}