{
  "title": "Leeks Vinaigrette",
  "source": "Modern Bistro - ATK",
  "servings": "4",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "3leeks (1 to 1½ inches in diameter, with 8 to 9 inches of white and light-green parts), white and light-green parts only",
    "Table salt for simmering leeks",
    "2teaspoons plus 3 tablespoons extra-virgin olive oil, divided",
    "¾cup fresh bread crumbs",
    "2tablespoons finely grated Parmesan cheese",
    "2tablespoons finely chopped fresh parsley, divided",
    "¼teaspoon pepper",
    "1½tablespoons red wine vinegar",
    "1tablespoon Dijon mustard",
    "1garlic clove, minced to paste"
  ],
  "directions": [
    "1  Trim roots from leeks, leaving base intact so layers stay together. Starting 1 inch above base, halve leeks lengthwise (they’ll still be joined at base). Rinse thoroughly between layers to remove any dirt. Tie halves of each leek together with kitchen twine about 2 inches from top.",
    "2  Bring 3 quarts water to boil in Dutch oven. Add leeks and 3 tablespoons salt and return to boil. Adjust heat to maintain simmer. Cover and cook until area just above base can be pierced easily with paring knife, 15 to 20 minutes. Using tongs, grasp 1 leek close to base and hold vertically over pot to drain briefly. Transfer to paper towel–lined plate and repeat with remaining leeks. Let sit until cool enough to handle, about 10 minutes.",
    "3  While leeks cool, heat 2 teaspoons oil in 8-inch nonstick skillet over medium heat until shimmering. Add bread crumbs and cook over medium heat, stirring frequently, until deep golden brown, 4 to 5 minutes. Off heat, sprinkle with Parmesan and let sit until crumbs are just warm, about 5 minutes. Add 1 tablespoon parsley and pepper and stir, breaking up any clumps.",
    "4  Whisk vinegar, mustard, 1 tablespoon water, and garlic in small bowl until combined. Whisking constantly, drizzle in remaining 3 tablespoons oil. Whisk in remaining 1 tablespoon parsley. Squeeze leeks over sink to remove excess water. Remove twine and finish cutting leeks in half lengthwise. Cut each half crosswise into thirds (do not remove bases of leeks; they’re delicious). Spread half of vinaigrette over bottom of serving platter. Arrange leeks on platter, cut side up, opening layers slightly. Drizzle evenly with remaining vinaigrette. (Dressed leeks can be covered loosely and stored at room temperature for up to 3 hours.) Sprinkle with bread-crumb mixture and serve."
  ]
}