{
  "title": "Lemongrass Chicken Banh Mi",
  "source": "Thewoksoflife.com",
  "servings": "",
  "categories": [
    "Vietnamese"
  ],
  "ingredients": [
    "For the carrot & daikon salad:",
    "2carrots (julienned)",
    "1cup daikon radish (julienned)",
    "2tablespoons sugar",
    "1/2teaspoon salt",
    "3tablespoons rice wine vinegar",
    "2teaspoons sesame oil",
    "For the chicken & marinade:",
    "4tablespoons vegetable oil (divided)",
    "2tablespoons fish sauce",
    "1tablespoon oyster sauce",
    "1/2teaspoon red pepper flakes",
    "2teaspoons sugar",
    "2shallots (peeled)",
    "3cloves garlic",
    "2stalks fresh lemongrass (cut into pieces)",
    "2teaspoons lime zest",
    "6boneless, skinless chicken thighs (about 1 1/2 pounds, or 675 grams)",
    "To assemble the sandwiches:",
    "1/4cup mayonnaise",
    "2teaspoons Sriracha",
    "1tablespoon lime juice",
    "1baguette (cut into 4 equal pieces, each cut in half)",
    "1jalapeño (de-seeded and thinly sliced)",
    "1cup cilantro"
  ],
  "directions": [
    "Start by preparing the carrot and daikon. Add the julienned carrots and daikon to a large bowl and toss in the sugar, salt, vinegar and sesame oil. Set aside for 1 hour, stirring occasionally.",
    "Then prepare the chicken. In the bowl of a food processor, add 2 tablespoons oil, the fish sauce, oyster sauce, pepper flakes, sugar, shallots, garlic, lemongrass, and lime zest. Process until smooth. Add to a bowl, along with the chicken, and toss to coat the chicken in the marinade. Cover, transfer to the fridge, and marinate for 1-4 hours.",
    "Heat the remaining 2 tablespoons oil in a 12-inch ovenproof skillet over medium-high heat. Sear the chicken for about 5 minutes on each side, or until cooked through. Set aside on a plate.",
    "To assemble the sandwiches, combine the mayonnaise, Sriracha, and lime juice.",
    "Open up each piece of bread, and spread the sriracha mayonnaise on each side. Fill with the pickled carrots and daikon. Slice the cooked chicken, and add it to the sandwiches, along with sliced jalapeños and cilantro. Serve!"
  ]
}