{
  "title": "Lemon Ricotta Pancakes",
  "source": "Modern Bistro - ATK",
  "servings": "3 to 4 (Makes twelve 4-inch pancakes)",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "⅔cup (3⅓ ounces) all-purpose flour",
    "½teaspoon baking soda",
    "½teaspoon table salt",
    "8ounces (1 cup) whole-milk ricotta cheese",
    "2large eggs, separated, plus 2 large whites",
    "⅓cup whole milk",
    "1teaspoon grated lemon zest plus 4 teaspoons juice",
    "½teaspoon vanilla extract",
    "2tablespoons unsalted butter, melted",
    "¼cup (1¾ ounces) sugar",
    "1–2teaspoons vegetable oil"
  ],
  "directions": [
    "1 Adjust oven rack to middle position and heat oven to 200 degrees. Spray wire rack set in rimmed baking sheet with vegetable oil spray and place in oven. Whisk flour, baking soda, and salt together in medium bowl and make well in center. Add ricotta, egg yolks, milk, lemon zest and juice, and vanilla and whisk until just combined. Gently stir in melted butter.",
    "2 Using stand mixer fitted with whisk attachment, whip egg whites on medium-low speed until foamy, about 1 minute. Increase speed to medium-high and whip whites to soft, billowy mounds, about 1 minute. Gradually add sugar and whip until glossy, soft peaks form, 1 to 2 minutes. Transfer one-third of whipped egg whites to batter and whisk gently until mixture is lightened. Using rubber spatula, gently fold remaining egg whites into batter.",
    "3 Heat 1 teaspoon oil in 12-inch nonstick skillet over medium heat until shimmering. Using paper towels, wipe out oil, leaving thin film on bottom and sides of pan. Using ¼-cup measure or 2-ounce ladle, portion batter into pan in 3 places, leaving 2 inches between portions. Gently spread each portion into 4-inch round. Cook until edges are set and first side is deep golden brown, 2 to 3 minutes. Using thin, wide spatula, flip pancakes and continue to cook until second side is golden brown, 2 to 3 minutes longer. Serve pancakes immediately or transfer to prepared wire rack in preheated oven. Repeat with remaining batter, using remaining oil as needed."
  ]
}