{
  "title": "Lime-Roasted Cabbage with Turmeric White Bean Mash",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Makes 4 (large) servings",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "1small head cabbage, red, savoy, or otherwise, thinly sliced (2 pounds)",
    "Extra-virgin olive oil",
    "Diamond Crystal kosher salt",
    "¾cup short-grain white rice",
    "½cup raw almonds",
    "Boiling water",
    "½cup nutritional yeast",
    "½cup fresh cilantro leaves, rough bottom 2 inches of stems removed",
    "2garlic cloves",
    "1tablespoon sliced fresh ginger",
    "1teaspoon ground turmeric",
    "½teaspoon ground cumin",
    "½teaspoon Aleppo pepper flakes",
    "½teaspoon red pepper flakes",
    "2tablespoons apple cider vinegar",
    "1(15-ounce) can white beans, drained and rinsed",
    "Avocado oil",
    "1tablespoon fresh lime juice (about 1 lime)",
    "¼cup tender fresh herbs, such as mint, basil, cilantro, for serving (optional)"
  ],
  "directions": [
    "1. Equally stagger two racks in the oven and preheat it to 400°F. Line two sheet pans with parchment paper.",
    "2. Scatter the cabbage on the lined sheet pans. Drizzle each pan with 2 tablespoons olive oil and season with a few large pinches of salt. Mix to coat. Roast the cabbage until the edge pieces are golden brown, 20 to 22 minutes.",
    "3. While the cabbage is roasting, cook the rice according to the package directions. (I like to use a rice cooker for this to keep everything simple.)",
    "4. In a small heatproof bowl, cover the almonds with boiling-hot water and let soak for 5 minutes.",
    "5. In a food processor, combine the nutritional yeast, cilantro, garlic, ginger, turmeric, cumin, Aleppo pepper flakes, red pepper flakes, and vinegar. Drain the almonds and add them to the food processor with ½ cup cool water and pulse until everything is roughly combined. Add the beans, season with ¼ teaspoon salt, and process until smooth. Taste, season, and set aside.",
    "6. By this time, the rice should be finished. Set a large pan over medium heat and add enough avocado oil to coat the surface. When the oil reaches 325°F, add the rice in tablespoon-size chunks. Cook, undisturbed, until the rice is deeply golden on the bottom, 5 to 7 minutes. Use a slotted spoon to transfer the rice to a paper towel to drain.",
    "7. When the cabbage is done roasting, squeeze the lime juice over it and mix. Taste and season with salt, as needed.",
    "8. Plate the white bean mash, top with the cabbage, and sprinkle with rice nuggets. Top with the herbs, which are optional, but worth it if you have them."
  ]
}