{
  "title": "Linguine with Chile Clams & Basil",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4 to 6",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 8 garlic cloves",
    "- 1 pound cherry tomatoes",
    "- 1½ cups packed basil leaves",
    "DAIRY",
    "- 4 tablespoons (½ stick) unsalted butter",
    "SEAFOOD",
    "- 24 littleneck clams",
    "PANTRY",
    "- Kosher salt",
    "- ¼ cup extra-virgin olive oil",
    "- 2 tablespoons sambal oelek",
    "- ½ cup dry vermouth or white wine",
    "- 1 pound dried linguine"
  ],
  "directions": [
    "1. Bring a large pot of heavily salted water to a boil.",
    "2. Clean the clams:- Submerge the clams in a large bowl of cold water set in the sink, swooshing them around to release any grit. Use a clean sponge to scrub any that seem particularly dirty. Let them sit for at least 10 minutes while you start the broth so they can expel any sand inside them.",
    "3. Do some prep:- Thinly slice 8 garlic cloves.- Cut 1 pound cherry tomatoes in half.",
    "4. Cook the clams:- In a large Dutch oven, heat ¼ cup olive oil over medium heat. Add the sliced garlic and cook, stirring often, until very fragrant but not browned, 1 to 2 minutes.- Add 2 tablespoons sambal oelek and ½ cup dry vermouth. Cook for 2 to 3 minutes to cook off some of the raw alcohol flavor, leaving behind the acidity and slight sweetness of the vermouth.- Add the tomatoes and clams and stir once or twice, then cover with a tight-fitting lid. Cook until all the clams open, 8 to 15 minutes. Start checking at around 8 minutes; this timing will vary greatly depending on their size. As they open, transfer the cooked clams to a bowl, letting the remaining clams cook longer (never opening indicates that the clam was dead to begin with—chuck those). Leave behind the tomatoes and liquid; this is your sauce.",
    "5. Cook the pasta:- Once most of the clams are open, get your linguine cooking—drop it into the pot of boiling water and give it a good stir. Cook according to the package directions until al dente.- When the pasta is al dente, scoop out and reserve 1½ cups of the pasta water. Using tongs, transfer the pasta to the pot of sauce along with 4 tablespoons butter and about half of the reserved pasta water. Cook over medium heat, tossing often with tongs, until the sauce clings to the linguine, adding more pasta water as necessary. Add the clams back to pot and toss once or twice to reheat.",
    "6. Finish it up: Remove the pot from the heat and tear 1½ cups basil leaves into the pasta. Taste the sauce and add salt if you think it needs it. Serve right out of the Dutch oven, with tongs and a large spoon for the sauce."
  ]
}