{
  "title": "Lion’s Head Meatballs",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 3/4 teaspoon baking soda",
    "- 1/2 teaspoon table salt",
    "- 2 pounds ground pork",
    "- 1 large egg, lightly beaten",
    "- 2 scallions, white parts minced, green parts sliced thin",
    "- 2 tablespoons soy sauce",
    "- 2 tablespoons Shaoxing wine",
    "- 4 teaspoons sugar",
    "- 2 teaspoons grated fresh ginger",
    "- 1/2 teaspoon white pepper",
    "- 4 cups chicken broth",
    "- 1 small head napa cabbage (1 1/2 pounds), quartered lengthwise, cored, and cut crosswise into 2-inch pieces",
    "- 4 ounces mei fun (dried rice vermicelli)"
  ],
  "directions": [
    "1. Adjust oven rack to lower-middle position and heat oven to 325 degrees. Whisk baking soda, salt, and 2 tablespoons water together in the bowl of a stand mixer. Add pork and toss to combine. Add egg, scallion whites, soy sauce, Shaoxing wine, sugar, ginger, and pepper. Fit stand mixer with paddle and beat on medium speed until mixture is well combined and has stiffened and started to pull away from sides of bowl, and pork has slightly lightened in color, 45 to 60 seconds. Using wet hands, form about 1/2 cup (4 1/2 ounces) pork mixture into 3-inch round meatballs; repeat with remaining mixture to form 8 meatballs in total.",
    "2. Bring broth to a boil in a Dutch oven over high heat. Off heat, carefully arrange meatballs in the pot (7 around perimeter and 1 in the center; meatballs will not be totally submerged). Cover pot, transfer to oven, and cook for 1 hour.",
    "3. Transfer meatballs to a large plate. Add cabbage to the pot in an even layer and arrange meatballs over cabbage, paler side up. Cover, return pot to oven, and continue to cook until meatballs are lightly browned and cabbage is softened, about 30 minutes.",
    "4. Meanwhile, bring 4 quarts of water to a boil in a large pot. Remove from heat, add noodles, and let sit, stirring occasionally, until tender but not mushy. Drain noodles and distribute evenly among individual bowls. Ladle meatballs, cabbage, and broth into bowls over noodles. Sprinkle with scallion greens and serve."
  ]
}