{
  "title": "Loaded Corn Bread",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves: 12",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "7tablespoons unsalted butter (3.5 oz / 100g), plus more for serving",
    "3ounces (85g) sliced bacon (3 or 4 slices), coarsely chopped",
    "2cups corn kernels (10 oz / 284g), cut from about 2 large ears, or thawed frozen corn kernels",
    "4scallions, chopped",
    "1medium Fresno or jalapeño chile, halved, seeded, and finely chopped",
    "1cup all-purpose flour (4.6 oz / 130g)",
    "½cup yellow cornmeal (3 oz / 85g), preferably coarse",
    "1½teaspoons baking powder (0.21 oz / 6g)",
    "1½teaspoons Diamond Crystal kosher salt (0.16 oz / 5g)",
    "¼teaspoon baking soda",
    "½teaspoon freshly ground black pepper",
    "¼teaspoon cayenne pepper",
    "2large eggs (3.5 oz / 100g), at room temperature",
    "1cup sour cream (8.2 oz / 232g), at room temperature",
    "½cup buttermilk (4.2 oz / 120g), at room temperature",
    "2tablespoons sugar",
    "¼cup finely chopped fresh cilantro"
  ],
  "directions": [
    "Preheat the oven: Arrange an oven rack in the center position and preheat the oven to 425°F.",
    "Brown the bacon: In the ovenproof skillet (preferably cast-iron), heat 5 tablespoons of the butter over medium heat until foamy. Add the bacon and cook, stirring often, until the fat is rendered and the bacon is crisp, 5 to 7 minutes.",
    "Cook the corn and aromatics: To the skillet with the bacon, add the corn (if using thawed frozen corn, pat the kernels dry first), scallions, and chile and cook, stirring often, until the corn is tender and aromatics are soft, 5 to 7 minutes (if using frozen corn, the kernels will already be soft due to freezing and thawing, so only cook the mixture for as long as it takes for the aromatics to soften). Remove the skillet from the heat and set aside to cool.",
    "Mix the dry ingredients: In a large bowl, whisk together the flour, cornmeal, baking powder, salt, baking soda, black pepper, and cayenne to combine. Set aside.",
    "Mix the wet ingredients: In a medium bowl, whisk the eggs until no streaks remain. Whisk in the sour cream, buttermilk, sugar, and cilantro until the mixture is smooth. Set aside.",
    "Mix the wet ingredients into the dry: Switch to a flexible spatula and make a well in the center of the dry ingredients. Pour in the wet ingredients, then scrape in the cooled corn and aromatics mixture (it’s okay if it’s slightly warm); reserve the skillet for baking the corn bread. Gently mix with the spatula, starting in the center and working outward, folding just until the batter is evenly mixed.",
    "Heat and fill the pan: Set the skillet over medium-high heat for 1 minute, then add the remaining 2 tablespoons butter and swirl to coat. Scrape the batter into the skillet and smooth the surface. Transfer the skillet to the oven and bake until the top is puffed, cracked, and golden brown, 20 to 25 minutes. Let the corn bread cool in the skillet at least 10 minutes, then cut around the sides with an offset spatula or butter knife to loosen and invert it onto a wire cooling rack. Let cool, then serve warm or at room temperature with butter."
  ]
}