{
  "title": "Lobster Fra Diavolo with Linguine",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Lobster Brodo",
    "4(570 to 680g / 1¼ to 1½ lb) live lobsters",
    "28g / 2 Tbsp olive oil",
    "20g / 4 cloves garlic",
    "300g / 1 fennel bulb, cut into 1½-inch pieces",
    "150g / 2 stalks celery, cut into 1½-inch pieces",
    "150g / 1 large carrot, peeled and cut into 1½-inch pieces",
    "65g / ¼ cup tomato paste",
    "220g / 1 cup dry white wine",
    "1fresh bay leaf",
    "3g / 1 tsp black peppercorns",
    "To Finish",
    "624g / 1 lb 6 oz extruded linguine (this page)",
    "520g / 2 cups diavola sauce (this page)",
    "30g / 2 Tbsp crushed Calabrian chiles",
    "Dried red chile flakes, q.b."
  ],
  "directions": [
    "1 - To cook the lobsters, bring a large pot of water to a boil over high heat. Generously salt the water. Prepare a large ice-water bath.",
    "2 - Working with one lobster at a time, remove the body from the tail by twisting them in opposite directions. Reserve the body and the tail separately. Clean and discard any impurities from the body and set aside. Repeat with the remaining lobsters.",
    "3 - Remove the claws and set aside.",
    "4 - Place the claws in the boiling water and set a timer for 3 minutes. When the timer goes off, add the tails and reset the timer for 3 minutes. After the second 3 minutes, the lobsters will be parcooked, which means they won’t overcook when you put them in the sauce later.",
    "5 - Using tongs, remove the lobsters from the boiling water and place in the ice bath to stop the cooking and to cool.",
    "6 - Once cool to the touch, remove the lobsters from the ice-water bath and place on a sheet pan or in a large bowl.",
    "7 - Now, the messy part of cracking the lobsters: For the tails, place one tail on its side on a kitchen towel and wrap the towel around it. Press down firmly until you feel the shell crack. Remove from the towel and, using scissors, cut down the inner spine. Pull the shell off and set aside the meat and shell separately. Repeat with the remaining tails.",
    "8 - For the claws, place one claw on the kitchen towel and wrap the towel around it. Using the back of a heavy chef’s knife, bang the claw until you hear a crack. Turn the claw over and bang it again. You should be able to remove the shell and keep the claw meat in a single piece. Remove the cartilage from the center of the claw. Repeat with the remaining claws and reserve the meat and shells separately.",
    "9 - For the knuckles, use scissors to cut down each side and separate the meat from the shell. Reserve the meat and shells separately.",
    "10 - Cut the meat from the lobster tails, claws, and knuckles into ¼- to ½-inch pieces and set aside.",
    "11 - To make the brodo, place a large, heavy sauce pot or Dutch oven over medium-low heat. Add the oil, garlic, fennel, celery, and carrot and gently cook until tender, 3 to 5 minutes.",
    "12 - Add the tomato paste and cook for another 1 to 2 minutes, stirring frequently.",
    "13 - Add the wine and cook, stirring occasionally, until reduced by half, 5 to 7 minutes.",
    "14 - Add the reserved lobster shells and lobster bodies, then add cold water to reach just below the top of the shells. Add the bay leaf and peppercorns and bring to a gentle simmer over medium heat. Turn down the heat to low and simmer gently, skimming impurities as it cooks, until you have an aromatic and flavorful brodo, about 30 minutes.",
    "15 - Remove from the heat and strain the brodo through a fine-mesh strainer lined with a coffee filter or cheesecloth.",
    "16 - Measure out 337g / 1 cup plus 7 Tbsp brodo and set aside. Transfer the remainder to an airtight container and refrigerate for up to 3 days or freeze for up to 1 month for another use.",
    "17 - To finish, bring a large pot of water to a boil over high heat. Generously salt the water.",
    "18 - Add the linguine to the water and cook for 5 to 8 minutes, until al dente.",
    "19 - While the pasta is cooking, place a large sauté pan over medium-high heat. Add the lobster brodo and bring to a gentle boil. Turn down the heat to low and cook for 1 to 2 minutes.",
    "20 - Add the diavola sauce and Calabrian chiles and season with chile flakes q.b. Add the lobster meat.",
    "21 - Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Add 1 to 2 ladles (55g to 115g / ¼ to ½ cup) pasta cooking water. Toss for 1 to 2 minutes to marry the pasta and the sauce. If the sauce begins to tighten, add a splash of pasta cooking water or brodo to loosen and continue tossing to marry.",
    "22 - Divide the pasta into bowls and garnish with chile flakes q.b."
  ]
}