{
  "title": "Lobster Bisque",
  "source": "Modern Bistro - ATK",
  "servings": "6",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "1½cups dry white wine",
    "4(8-ounce) bottles clam juice, divided",
    "3(1-pound) live lobsters",
    "2tablespoons extra-virgin olive oil, divided",
    "¼cup brandy or cognac, warmed",
    "6tablespoons unsalted butter, divided",
    "1small carrot, chopped fine",
    "1small celery rib, chopped fine",
    "1small onion, chopped fine",
    "1garlic clove, minced",
    "½cup all-purpose flour",
    "1(14.5-ounce) can diced tomatoes, drained",
    "½teaspoon minced fresh tarragon, plus 1 small sprig",
    "1cup heavy cream",
    "1tablespoon lemon juice",
    "Pinch ground cayenne",
    "1tablespoon dry sherry"
  ],
  "directions": [
    "1  Bring wine and 3 bottles clam juice to boil over high heat in large stockpot. Rinse lobsters, then add to pot. Cover and steam lobsters for 3 minutes. Shake pot to redistribute lobsters and steam for 4 minutes longer. Transfer lobsters to bowl; let cool. Strain liquid through fine-mesh strainer into separate bowl.",
    "2  Remove lobster meat from tail and claws and dice; place in bowl, cover, and refrigerate. Split lobster bodies in half lengthwise, then remove and discard innards.",
    "3  Grind shells in food processor in 2 or 3 batches. (Some pinkish paste may coat some of shells.) Heat 1 tablespoon oil in 12-inch skillet over high heat until just smoking, about 3 minutes. Add half of lobster shells and cook until lightly browned, about 3 minutes; transfer to bowl. Repeat with remaining 1 tablespoon oil and remaining shells. Off heat, return all shells to skillet, add brandy, and let warm through, about 5 seconds. Wave lit match over pan until brandy ignites, then shake pan to distribute flames.",
    "4  Meanwhile, melt 2 tablespoons butter in Dutch oven over medium heat. Add carrot, celery, onion, and garlic and cook until vegetables are softened and lightly browned, 6 to 7 minutes. Stir in remaining 4 tablespoons butter until melted. Stir in flour until thoroughly combined and cook for 1 minute. Slowly stir in strained steaming liquid, scraping up any browned bits and smoothing out any lumps. Add tomatoes, tarragon sprig, and lobster shells. Add remaining 1 bottle clam juice to now-empty skillet and bring to boil over high heat, scraping up browned bits; add to Dutch oven.",
    "5  Bring soup to boil, then cover and reduce heat to low. Simmer gently, stirring often, until thickened, about 20 minutes. Stir in cream and simmer for 10 minutes longer.",
    "6  Strain bisque through fine-mesh strainer into bowl, pressing on solids with back of ladle to extract all liquid. Wash and dry Dutch oven. Return strained bisque to Dutch oven and stir in lemon juice and cayenne. Bring soup to simmer over medium-high heat. When hot, add diced lobster meat and sherry and season with salt and pepper to taste. Serve immediately, garnishing each bowl with minced tarragon."
  ]
}