{
  "title": "Long-Roasted Eggplant with Garlic, Labne, and Tiny Chile Croutons",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 4 to 6",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "3medium or 2 large globe or Italian eggplants (about 2½ pounds), halved lengthwise",
    "¾cup olive oil, divided, plus more as needed",
    "Kosher salt and freshly ground black pepper",
    "2garlic cloves, thinly sliced",
    "1fresh red chile, very thinly sliced, or 1 teaspoon crushed red pepper flakes",
    "2cups torn bread (crusty bread such as sourdough, country loaf, or miche), in ½-inch pieces",
    "1cup labne, full-fat Greek yogurt, or sour cream",
    "1preserved lemon, finely chopped",
    "1tablespoon fresh lemon juice, plus more as desired",
    "1cup fresh mint or cilantro leaves, tender leaves and stems"
  ],
  "directions": [
    "1 Preheat the oven to 425°F.2 Using a small paring knife, make a few ½-inch slits into the cut side of each eggplant. (You can do this lengthwise, crosswise, or even diagonally. Knock yourself out with your decorative prowess!)3 Place the eggplant cut side up on a rimmed baking sheet and drizzle with ½ cup olive oil, distributing as evenly as possible. Season with salt and pepper and turn over so that the eggplant is cut side down.4 Place in the oven and roast, without moving or disturbing, until eggplant is completely tender, cooked through, and golden brown on the bottom (since the skin is already so dark, it can be hard to tell, but the skin will look shriveled and, when poked, the whole thing should feel tender, on the verge of collapse; you can also use a spatula to lift up the eggplant to check the underside for color), 40 to 45 minutes.5 Meanwhile, heat the remaining ¼ cup olive oil in a large skillet over medium heat. Add the garlic and chile and cook, shaking the skillet occasionally, until the garlic and chile are frizzled and fragrant (but not yet browned), 1 or 2 minutes. Add the bread and season with salt and pepper. Cook, stirring frequently, until the bread is evenly toasted and golden brown, 3 to 5 minutes. Remove from the heat and set aside.6 Combine the labne, preserved lemon, and 1 tablespoon lemon juice in a small bowl; season with salt, pepper, and more lemon juice, if you like. Smear it onto the bottom of a large serving platter or in a shallow bowl.7 Once the eggplant is good and ready to go, use a fish spatula (or regular spatula) to lift up each eggplant half in one fell swoop, preserving its lovely golden underside. Place the eggplant, cut side up, on top of the seasoned labne. Scatter with the crispy croutons and herbs before serving."
  ]
}