{
  "title": "Low and Slow Rib Roast with Rosemary and Anchovy",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 8 to 12",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "7- to 7½-pound whole bone-in rib roast (about a 3-bone roast), not frenched",
    "Kosher salt and freshly ground black pepper",
    "6sprigs fresh rosemary",
    "1tin or jar of anchovy fillets (about 10 anchovies), plus more for serving (optional)",
    "8garlic cloves, finely grated",
    "¼cup olive oil",
    "1tablespoon canola oil",
    "Flaky sea salt",
    "1cup fresh parsley, tender leaves and stems, finely chopped, plus more for serving"
  ],
  "directions": [
    "1 Season the meat with salt and pepper (you want 1 teaspoon of kosher salt per pound). Place on a rimmed baking sheet (preferably lined with a wire rack so that the meat does not sit directly in the liquid that escapes from salting, and let sit at least 2 hours at room temperature or up to 48 hours refrigerated.2 Meanwhile, finely chop 2 sprigs of rosemary and about 10 anchovies and combine in a medium bowl with the garlic and olive oil. Season with salt and pepper.3 Preheat the oven to 250°F.4 Scatter the remaining 4 sprigs of rosemary on the bottom of a rimmed baking sheet. Smear the meat with the anchovy mixture and place on top of the rosemary. Place the whole thing in the oven and let it roast low and slow until a meat thermometer reaches 110°F (for medium-rare) when inserted into the deepest part of the meat, 2 to 2½ hours. Remove from the oven (the temperature will continue to rise as it sits—you’re looking for an eventual 125°F temperature). Let it hang out for up to 4 hours at room temperature.5 When you’re ready to eat, heat the canola oil in a large cast-iron skillet over medium-high heat. Once the oil is smoking, add the meat, fat side down. Cook, pressing lightly to encourage the whole underside to make contact with the skillet, until it’s deeply browned, 5 to 8 minutes. Flip the roast so that it’s fat side up and remove from heat. (Alternatively, increase the temperature to 500°F, or however high your oven goes, and cook the roast until the fat is browned, 10 to 15 minutes—this is easier, but your fat will never get as browned and you’ll miss out on pan drippings.)6 Transfer the meat to a cutting board, leaving any juices behind in the pan.7 Slice the roast away from the bones (see Note). Slice the roast however you please; I like mine on the thinner side, about ¼ inch slices, but some prefer thinner (like roast beef) or thicker (like prime rib). Place the slices on a large serving platter and pour over any juices left behind. Sprinkle with flaky salt and parsley, serving with more anchovies alongside, if you like."
  ]
}