{
  "title": "Lumpia",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Yields: 15",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "4ounces ground beef",
    "8ounces ground pork",
    "6garlic cloves, finely chopped",
    "2tablespoons finely chopped fresh ginger",
    "½cup water chestnuts, drained, rinsed, drained again, and cut into small dice",
    "¼cup finely diced carrots",
    "½small Spanish onion, finely diced",
    "3tablespoons low-sodium soy sauce",
    "¾teaspoon toasted sesame oil",
    "1teaspoon kosher salt",
    "½teaspoon freshly ground black pepper",
    "½teaspoon Thai chili flakes",
    "1medium scallion, thinly sliced",
    "15spring roll wrappers (I prefer Wei-Chan), cut in half crosswise on the diagonal",
    "1large egg whisked with 1 tablespoon water",
    "1quart peanut or vegetable oil",
    "1½cups store-bought sweet chili sauce"
  ],
  "directions": [
    "1. Put the beef and pork in a large bowl and gently mix to combine.",
    "2. Add the garlic, ginger, water chestnuts, carrot, onion, soy sauce, sesame oil, salt, pepper, chili flakes, and scallion and mix until combined.",
    "3. Line a baking sheet with parchment. Take half of a wrapper and place it on your work surface so that a point is facing you. Place about 2 heaping tablespoons of the filling on the wrapper and spread it out to the edges. Turn up the bottom corner and roll upward. Fold in the left and right corners, making sure the filling is nicely packed, with no air pockets. Continue rolling. Dip your finger in the egg wash, pat it on the remaining corner, and finish rolling the lumpia, sealing the edge. The lumpia should be about ½ inch in diameter. Put the lumpia on the baking sheet. The lumpia can be made to this point and refrigerated, covered with a damp towel, for up to 8 hours or frozen in an airtight container for 2 to 3 weeks.",
    "4. Heat the oil in a wok or high-sided sauté pan over medium heat until it reaches 350 degrees F on a deep-fry thermometer. Line another baking sheet with paper towels. Fry the lumpia in batches of four to six, until golden brown and crispy and the meat is cooked through, for a total of 4 minutes for fresh lumpia and 6 minutes for frozen. Remove with a slotted spoon to the prepared baking sheet. Serve with the sweet chili sauce on the side."
  ]
}