{
  "title": "Maccheroncini di Campofilone al Sugo Tradizionale (Pasta with Short Ribs and Tomato Sugo)",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Sugo",
    "454g / 1 lb beef short ribs, cut into 3-inch pieces",
    "Salt, q.b.",
    "150g / 2 stalks celery",
    "150g / 1 large carrot, peeled",
    "370g / 1 large onion",
    "112g / ½ cup olive oil",
    "25g / 5 cloves garlic, finely chopped",
    "1whole clove",
    "220g / 1 cup dry white wine",
    "1(227g / 8 oz) beef marrowbone",
    "1(680g / 24 oz) jar tomato passata (3 cups)",
    "Whole nutmeg, q.b.",
    "To Finish",
    "1batch egg dough (this page)",
    "22g / ¼ cup finely grated parmigiano-reggiano",
    "Whole nutmeg, q.b."
  ],
  "directions": [
    "1 - To make the sugo, season the short ribs on all sides with salt q.b. and let sit for at least 1 hour at room temperature or up to overnight in the refrigerator.",
    "2 - Fit your meat grinder with the small die. Chop the celery, carrot, and onion into ½- to 1-inch pieces. Put the celery, carrot, and onion through the meat grinder. Once all are ground, gather them in cheesecloth and wring to squeeze out the excess liquid. This is your soffritto.",
    "3 - Preheat the oven to 275°F.",
    "4 - Place a large, heavy sauce pot or Dutch oven over high heat and add 56g / ¼ cup of the olive oil. Add the short ribs and sear, turning as needed, until golden brown on all sides, 3 to 4 minutes per side and 10 to 15 minutes in total.",
    "5 - Transfer the short ribs to a plate and set aside. Drain off and discard any remaining oil.",
    "6 - Wipe out the pot and place it over medium-low heat. Add the remaining 56g / ¼ cup olive oil and the soffritto and cook, stirring frequently, until softened but without color, 5 to 8 minutes. Add the garlic and cook until aromatic but without color, 10 to 15 seconds.",
    "7 - Stud a short rib with the clove and return the short ribs to the pot. Add the wine and simmer until reduced by half, 5 to 7 minutes.",
    "8 - Add the marrowbone, followed by the tomato passata, to the pot. Then add water to reach about ½ inch above the top of the meat. Grate the nutmeg into the pot q.b. (The nutmeg will bloom as it cooks, so use a light touch.)",
    "9 - Cover the pot and braise the meat in the oven until very tender and falling off the bone, 3 to 4 hours. Remove from the oven and set aside to cool.",
    "10 - Once cooled, remove the short ribs from the pot and separate the meat from the bones. Using two forks, pull the meat apart into fine strands, discarding the sinew then run a knife through the strands to cut them into very fine pieces. Using the handle of a spoon, push out the marrow from the marrowbone, reserving the white part and discarding the brown bits and the bone.",
    "11 - Skim any excess fat from top of the sauce (leave a little bit in though—that’s flavor). Add the meat and marrow back to the pot and stir to combine. The meat should be cut so fine that it almost disappears into the sauce.",
    "12 - Measure out 462g / 2 cups sugo and set aside. Transfer the remainder to an airtight container and refrigerate for up to 3 days or freeze for up to 1 month for another use.",
    "13 - To finish, following the instructions for maccheroncini di Campofilone on this page, make 624g / 1 lb 6 oz with the pasta dough.",
    "14 - Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "15 - Place a large sauté pan over low heat. Add the sugo and 1 to 2 ladles (55 to 115g / ¼ to ½ cup) pasta cooking water to thin it out just slightly.",
    "16 - Lightly shake the maccheroncini to separate the strands. Add them to the water and stir immediately to keep them from clumping. Cook for about 30 seconds. (This pasta is very delicate and will cook in a flash.)",
    "17 - Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Gently toss for 30 seconds to 1 minute to marry the pasta and the sugo. This can be difficult to toss (it’s delicate), so feel free to marry by using a spoon rather than tongs to keep the pasta moving in the pan. If the sauce feels tight, add a splash of pasta cooking water to loosen. When the pasta is properly married, it will cling to the sauce and have a glossy sheen.",
    "18 - Divide the pasta into bowls and garnish with the parmigiano and with grated nutmeg q.b."
  ]
}