{
  "title": "Malaysian Beef Curry Puffs",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Yields: About 15",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "Malaysian Meat Curry Powder",
    "- 2 tablespoons coriander seeds",
    "- 2 tablespoons cumin seeds",
    "- 1 teaspoon whole black peppercorns",
    "- 1 teaspoon fennel seeds",
    "- 1 teaspoon ground turmeric",
    "- 3 whole cloves",
    "- 2 whole cardamom pods",
    "- 1 small cinnamon stick",
    "- 2½ tablespoons Kashmiri chili powder (see headnote)",
    "Dough",
    "- 2 cups all-purpose flour, plus more to dust the work surface",
    "- ½ teaspoon kosher salt",
    "- 1 cup (2 sticks) cold unsalted butter, cut into small pieces",
    "- ½ cup ice water",
    "Beef Filling",
    "- 3 tablespoons canola oil",
    "- ½ to ¾ small Russet potato, peeled and cut into ¼-inch dice (should yield 1 cup)",
    "- 1 small Spanish onion, diced",
    "- ½ pound ground chuck 80/20",
    "- 2 garlic cloves, finely chopped",
    "- 1 tablespoon Malaysian Meat Curry Powder",
    "- 2 tablespoons Squid Brand fish sauce",
    "- 1 tablespoon granulated sugar",
    "- ¼ teaspoon Thai chili flakes",
    "- 6 fresh curry leaves, thinly sliced",
    "- 2 tablespoons freshly squeezed lime juice (1 to 2 limes)",
    "- ¼ cup finely chopped fresh cilantro",
    "To Serve",
    "- Canola oil",
    "- 1 batch Cucumber Relish"
  ],
  "directions": [
    "1. Make the curry powder: Combine the coriander, cumin, peppercorns, fennel, turmeric, cloves, cardamom, and cinnamon stick in a medium sauté pan over medium heat and cook, mixing constantly, for about 2 minutes, until fragrant. Transfer to a plate and let cool for 5 minutes.",
    "2. Put the spice mixture into a coffee grinder and grind to a fine powder. Mix in the chili powder. Transfer to a container with a tight-fitting lid. The spice mixture will last for 6 months stored in a cool, dark place.",
    "3. Make the dough: Combine the flour, salt, and butter in the bowl of a food processor and process for about 8 pulses, until the mixture resembles coarse meal. Add ¼ cup of the water and pulse a few times, then add more water until the dough just comes together and forms a ball.",
    "4. Transfer the dough to a lightly floured surface and knead until soft. Form into a disc, wrap in plastic, and refrigerate for at least 30 minutes and up to 2 days.",
    "5. Make the filling: Line a plate with paper towels. Heat 2 tablespoons of the canola oil in a large sauté pan over medium-low heat until it begins to shimmer. Stir in the potatoes, cover, and cook, stirring occasionally, for about 7 minutes, until soft but no color is achieved. Transfer the potatoes with a slotted spoon to the paper towel–lined plate.",
    "6. Return the pan to the stove, raise the heat to high, add the remaining 1 tablespoon canola oil, and heat until it begins to shimmer. Add the onion and cook for about 5 minutes, until soft. Add the beef and garlic and cook, stirring occasionally, for about 8 minutes, until the meat is golden brown and the juices have evaporated.",
    "7. Stir in the potatoes, curry powder, fish sauce, sugar, chili flakes, and curry leaves and cook for 3 more minutes, until the flavors meld, adding a few splashes of water if the mixture becomes too dry. Remove from the heat and stir in the lime juice and cilantro. Transfer to a large plate or rimmed baking pan and let cool completely before stuffing the curry puffs.",
    "8. Remove the dough from the refrigerator and divide it in half. Wrap the other half and return it to the refrigerator. Lightly flour a surface, put the dough on top, and lightly flour the top. Roll out the dough into a large circle ⅛ inch thick. Cut out 4½-inch circles using a ring cutter or ramekin (should get 7 circles without rerolling).",
    "9. Transfer the circles to a baking sheet lined with parchment paper and refrigerate for about 15 minutes, until chilled. Repeat with the remaining dough and transfer those circles to another baking sheet lined with parchment and chill in the refrigerator for 15 minutes.",
    "10. Lightly flour a surface again and gently roll out one circle at a time, making sure that each is 4½ inches wide. Place a circle of dough in your palm and place 2 tablespoons of the meat filling in the center. Fold the dough into a semicircle and seal by pressing and pleating the edges together. Return the puffs to the parchment paper–lined baking sheet and chill in the refrigerator until firm, at least 15 minutes and up to 24 hours.",
    "11. Fry the curry puffs: Heat 3 inches of oil in a large wok or high-sided sauté pan until it reaches 350 degrees F on a deep-fry thermometer. Line a rimmed baking sheet with several layers of paper towels.",
    "12. Fry the puffs in batches for about 5 minutes, until golden brown. Remove using a spider and let drain on the prepared baking sheet. Repeat with the remaining dough. Serve with the cucumber relish on the side.",
    "13. Freeze curry puffs separately and only pack them together once they are fully frozen to prevent them from sticking together."
  ]
}