{
  "title": "Malted \"Forever\" Brownies",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Makes 16 brownies",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "2sticks unsalted butter (8 oz / 227g), cut into tablespoons",
    "2tablespoons heavy cream, half-and-half, or whole milk (1 oz / 28g)",
    "2cups all-purpose flour (9.2 oz / 260g)",
    "2teaspoons Diamond Crystal kosher salt (0.22 oz / 6g)",
    "1teaspoon baking soda (0.21 oz / 6g)",
    "¾cup packed dark brown sugar (5.3 oz / 150g)",
    "¾cup granulated sugar (5.3 oz / 150g)",
    "2large eggs (3.5 oz / 100g), cold from the refrigerator",
    "1tablespoon vanilla extract",
    "5ounces (142g) bittersweet chocolate disks, half coarsely chopped",
    "5ounces (142g) milk chocolate disks, half coarsely chopped"
  ],
  "directions": [
    "Preheat the oven and prepare the pan: Arrange an oven rack in the center position and preheat the oven to 350°F. Line an 8 × 8-inch pan with 2 sheets of foil, crossing one over the other and pressing the foil into the corners and up the sides. Lightly butter the foil and set aside.",
    "Bloom the cocoa: In a large heatproof bowl, whisk the cocoa powder and ¼ cup boiling water until smooth (this will bring out the flavor of the cocoa).",
    "Melt the chocolate, butter, and oil: Add the semisweet chocolate, butter, and oil to the bowl with the cocoa mixture and set it over a medium saucepan filled with about 1 inch of simmering (not boiling) water. Warm the mixture gently, stirring occasionally, until the chocolate and butter are melted and the mixture is smooth. Remove the bowl from the heat and let cool until lukewarm.",
    "Add the sugars and egg: Whisk the granulated and brown sugars into the chocolate mixture. It will look grainy and you might see some of the fat start to separate from the rest of the mixture, which is normal. Add the whole egg, egg yolks, and vanilla and whisk vigorously until the mixture comes back together and looks very thick, smooth, and glossy.",
    "Add the dry ingredients: Add the flour, malted milk powder (if using), and salt and whisk slowly until everything is combined, then whisk more vigorously until the batter is very thick, a full 45 seconds.",
    "Fold in the chocolate and bake: Add the milk chocolate to the batter and fold with a flexible spatula to distribute. Scrape the batter into the prepared pan, spreading in an even layer all the way to the corners. Bake the brownies until the surface is shiny and puffed and the center is dry to the touch but still soft when pressed, 25 to 30 minutes.",
    "Cool, chill, and cut: Allow the brownies to cool in the pan until they are no longer hot, about 1 hour, then refrigerate until the bottom of the pan feels cold, about 1 hour longer (this results in a chewier texture). Use the ends of the foil to lift the brownies out of the pan and transfer to a cutting board. Slice the brownies into 16 squares."
  ]
}