{
  "title": "Malted Milk Butter Cookies",
  "source": "By Heart - Hailee Catalano",
  "servings": "Makes About 2 1⁄2 Dozen Cookies",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "227grams (1 cup/2 sticks) unsalted butter, at room temperature",
    "100grams (1/2 cup) granulated sugar",
    "2eggs, at room temperature, yolks and whites separated (place the whites in the fridge until needed)",
    "1tablespoon vanilla bean paste",
    "1 1/2teaspoons kosher salt",
    "260grams (2 cups) all-purpose flour",
    "40grams (1/4 cup) malted milk powder",
    "100grams (1/2 cup) demerara sugar, for coating",
    "1tablespoon water"
  ],
  "directions": [
    "1. Using an electric mixer on medium, cream the butter and sugar in a large bowl until smooth, 1 minute. (This can also be made in a stand mixer fitted with a paddle attachment.)2. Add the egg yolks, vanilla, and salt, and beat on medium until combined, scraping down the bowl as needed.3. Add the flour and milk powder, and mix on low speed until just combined.4. Split the dough into two halves (about 326 g/11.5 ounces each), and place each half on a large piece of plastic wrap. Form each half into an 8-inch (20 cm) log, about 1 1/2 inches (4 cm) wide, using the plastic wrap to make the log even and tight. Refrigerate the logs until completely chilled, at least 3 hours, or up to 3 days in advance.5. When you are ready to bake, preheat the oven to 375°F (190°C) with a rack positioned in the center. Line a sheet tray with parchment paper. Place the demerara sugar on a sheet tray or plate.6. Whisk the reserved egg whites and water in a small bowl to make an egg wash.7. Use a pastry brush to egg wash the cookie logs all over and then roll them in the demerara sugar to cover.8. Cut the cookies into 1/2-inch-thick (1 cm) discs. Place about 9 cookies on the sheet tray (see Note). Keep any remaining sliced cookie dough on a plate or sheet tray in the refrigerator.9. Bake the cookies, one tray at a time, until lightly golden and set, 14 to 16 minutes.10. Cool the cookies on the tray for 5 minutes. Transfer to a wire rack to cool completely, and bake the remaining cookies. (Feel free to reuse the same sheet tray and parchment for each batch.)11. Store in an airtight container at room temperature for up to 5 days."
  ]
}