{
  "title": "Maple Cheddar Snack Mix",
  "source": "By Heart - Hailee Catalano",
  "servings": "Makes about 3 quarts (3 L)",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "5cups (175 g) corn Chex cereal",
    "2cups (120 g) Cheez-Its",
    "1cup (125 g) roasted unsalted cashews, or any nut you’d like",
    "1cup (60 g) oyster crackers",
    "1cup (50 g) mini pretzels",
    "1cup (90 g) sesame sticks",
    "1⁄4 cup (35 g) sesame seeds",
    "1⁄2 cup (1 stick/113g) unsalted butter",
    "1⁄2 cup (110 g) packed dark brown sugar",
    "1⁄2 cup (120 ml) pure maple syrup",
    "2teaspoons soy sauce",
    "1⁄2 teaspoon sweet smoked paprika",
    "1⁄4 teaspoon cayenne",
    "1⁄4 teaspoon kosher salt",
    "1⁄4 cup (28 g) cheddar cheese powder, plus more to taste"
  ],
  "directions": [
    "1. Preheat the oven to 275°F (135°C) with racks positioned in the upper and lower thirds. Line two sheet trays with parchment paper.2. Toss the Chex, Cheez-Its, cashews, oyster crackers, pretzels, sesame sticks, and sesame seeds in a large bowl.3. Heat the butter, brown sugar, and maple syrup in a small saucepan over medium heat. Cook, stirring occasionally, until the butter and sugar have melted and the mixture is bubbling, 4 or 5 minutes.4. Remove from the heat, and stir in the soy sauce, paprika, cayenne, and salt.5. Pour the maple mixture over the crunchies, and toss to evenly coat. Evenly divide the mixture between the sheet trays, and spread out into even layers.6. Bake for 40 to 45 minutes, tossing every 10 to 15 minutes, until the mixture is deeply golden and glossy, rotating the sheet pans between the racks halfway through the baking time. The mixture might seem slightly sticky, but it will crisp as it cools.7. Let cool for 10 minutes, tossing occasionally so the mixture doesn’t clump together.8. Evenly sprinkle the cheese powder over each tray, and toss to coat.9. Serve right away, or store in an airtight container at room temperature for up to 2 weeks for future snacking."
  ]
}