{
  "title": "Mapo Eggplant",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "4 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "- 1 Tbsp neutral oil",
    "- ¼ lb / 115g ground beef or pork (optional)",
    "- ¼ cup / 60ml Chili Oil (this page)",
    "- 1 Tbsp minced garlic",
    "- 1 Tbsp minced ginger",
    "- 2 Tbsp doubanjiang",
    "- 2 Tbsp Sichuan Chili Crisp (this page)",
    "- 2 lb / 900g eggplant, cut into 1- to 2-inch / 2.5 to 5cm pieces",
    "- 1 cup / 240ml bone broth or vegetable stock",
    "- 2 tsp soy sauce",
    "- 2 tsp granulated sugar",
    "- 2 tsp cornstarch",
    "- 2 Tbsp cold water",
    "- 2 scallions, green parts only, thinly sliced",
    "- ¼ tsp Ground Roasted Sichuan Pepper (this page)",
    "- White rice or noodles for serving"
  ],
  "directions": [
    "1. If using the ground meat, in a wok over high heat, warm the neutral oil. Add the ground meat and stir-fry for 4 to 5 minutes, until fully cooked, fragrant, and slightly crisp on the outside. Transfer to a bowl and set aside.",
    "2. In the same wok, bring the chili oil to medium heat. Add the garlic and ginger and stir-fry for about 1 minute, until fragrant. Add the doubanjiang and chili crisp and stir-fry for another minute, being careful not to burn the seasonings and aromatics.",
    "3. Add the eggplant, broth, soy sauce, and sugar and bring the mixture to a boil. Lower the heat to medium low, cover, and simmer for 8 to 10 minutes, until the eggplant is cooked through. Add the ground meat back to the wok, if using.",
    "4. Meanwhile, make a cornstarch slurry by mixing the cornstarch and cold water together. Add it to the wok a little at a time and gently stir it in. Keep adding the slurry until the sauce thickens. (Depending on the type of cornstarch you’re using, the amount you need to use can vary.)",
    "5. Transfer everything to a serving plate and garnish with the scallions and roasted Sichuan pepper. Serve immediately with white rice or noodles."
  ]
}