{
  "title": "Mapo Tofu",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "4 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "- 14 oz / 400g regular or soft tofu, cut into ¾-inch / 2cm cubes",
    "- 1 Tbsp neutral oil",
    "- ¼ lb / 115g ground beef or pork",
    "- ¼ cup / 60ml Chili Oil",
    "- 1 Tbsp minced garlic",
    "- 1 Tbsp minced ginger",
    "- 2 Tbsp doubanjiang",
    "- 2 Tbsp Sichuan Chili Crisp",
    "- ¾ cup / 175ml bone broth or vegetable stock",
    "- 2 tsp cornstarch",
    "- 2 Tbsp cold water",
    "- 2 scallions, green parts only, thinly sliced",
    "- ¼ tsp Ground Roasted Sichuan Pepper",
    "- White rice for serving"
  ],
  "directions": [
    "1. Gently place the tofu in a heatproof container, pour lightly salted boiling water over it so that it’s fully submerged, and set it aside. This step will give the tofu a better flavor and texture and prevent it from breaking as easily.",
    "2. In a wok or other pan over high heat, warm the oil, then add the meat, stir-frying until fully cooked, fragrant, and slightly crisp on the outside, 4 to 5 minutes. Transfer the meat to a small bowl and set aside.",
    "3. In the same wok over medium heat, warm the chili oil, then add the garlic and ginger and fry for about 1 minute, until fragrant. Add the doubanjiang and chili crisp and fry for another minute, being careful not to burn the seasonings and aromatics. Add the broth and bring the mixture to a boil over high heat.",
    "4. Drain the tofu and gently slide it into the wok. Using a rubber spatula, stir all the ingredients, taking care not to break the tofu. Add the meat back into the wok. Let the stock reduce for about 5 minutes so the tofu and meat soak up the flavors from the sauce.",
    "5. Meanwhile, in a small bowl, make a cornstarch slurry by mixing the cornstarch and water. Add the slurry to the wok a little at a time, gently stirring it in. Keep adding until the sauce thickens to your desired consistency. Depending on the type of cornstarch you’re using, the amount you need to use can vary.",
    "6. Transfer the mapo tofu to a serving bowl and sprinkle it liberally with scallions and roasted Sichuan pepper. Serve immediately with rice."
  ]
}