{
  "title": "Mapo Tofu",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Serves 4 to 6",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "- 2 cups (2½ ounces) dried shiitake",
    "- 2 tablespoons Mushroom Seasoning Powder, homemade or store-bought",
    "- Scant 1 tablespoon granulated sugar",
    "- Kosher salt",
    "- 3 pounds soft silken tofu, drained and cut into 1½-inch cubes",
    "- 2 tablespoons cornstarch",
    "- 1 cup olive, canola, or grapeseed oil",
    "- ½ cup tomato paste",
    "- ½ cup Sichuan doubanjiang (chili-bean paste)",
    "- ½ cup finely chopped garlic (about 3 ounces)",
    "- ½ cup finely chopped ginger (about 2¼ ounces)",
    "- 2 tablespoons Black Bean Sauce",
    "- 3 tablespoons gochugaru (Korean chili flakes)",
    "- 3 tablespoons store-bought Sichuan peppercorn oil",
    "- 3 tablespoons Sichuan peppercorn powder, or more to taste",
    "- ½ cup Chili Oil, homemade or store-bought",
    "- 2 cups loosely packed roughly chopped cilantro",
    "- 1 cup loosely packed roughly chopped Chinese yellow chives"
  ],
  "directions": [
    "1. Put the mushrooms in a heatproof bowl with the mushroom seasoning powder, sugar, and 1 tablespoon salt. Pour in 2 cups boiling water, stir, and soak for 20 minutes.",
    "2. Meanwhile, bring a medium pot of salted water to a boil. Add the tofu, let the water return to a boil, then gently drain and set aside. Mix the cornstarch with ¼ cup water in a small bowl and set aside.",
    "3. Drain the mushrooms, reserving the soaking liquid. Snip off and discard the tough stems, squeeze out excess liquid, and finely chop the mushrooms.",
    "4. Heat the oil in a large heavy pot over high heat until it smokes. Add the mushrooms and cook, stirring, until slightly browned, about 2 minutes.",
    "5. Stir in the tomato paste and cook until it begins to stick to the pot, about 2 to 3 minutes.",
    "6. Add the doubanjiang, garlic, ginger, and black bean sauce. Cook for 1 to 2 minutes more.",
    "7. Stir in the gochugaru and the reserved mushroom soaking liquid. Bring to a boil, then reduce to a gentle simmer. Stir in the Sichuan peppercorn oil and Sichuan peppercorn powder.",
    "8. While stirring, drizzle in the cornstarch mixture. Increase the heat and bring to a boil to thicken.",
    "9. Reduce heat slightly and add the tofu. Cook gently, stirring so the tofu is coated but remains intact, for 1 to 2 minutes until warmed through.",
    "10. Serve with rice and garnish with chili oil, cilantro, chives, and additional Sichuan peppercorn powder to taste."
  ]
}