{
  "title": "Massaman Curry with Potatoes and Peanuts",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "Curry Paste",
    "6dried New Mexican chiles",
    "4shallots, unpeeled",
    "7garlic cloves, unpeeled",
    "½cup chopped fresh ginger",
    "¼cup water",
    "1½tablespoons lime juice",
    "1½tablespoons vegetable oil",
    "1tablespoon fish sauce",
    "1teaspoon five-spice powder",
    "½teaspoon ground cumin",
    "½teaspoon pepper",
    "Curry",
    "1teaspoon vegetable oil",
    "1(14-ounce) can coconut milk",
    "1¼cups chicken broth",
    "1pound Yukon Gold potatoes, unpeeled, cut into ¾-inch pieces",
    "1onion, cut into ¾-inch pieces",
    "⅓cup dry-roasted peanuts",
    "¾teaspoon table salt",
    "1pound boneless, skinless chicken thighs, trimmed and cut into 1-inch pieces",
    "2teaspoons grated lime zest",
    "¼cup chopped fresh cilantro"
  ],
  "directions": [
    "1. For the curry paste Adjust oven rack to middle position and heat oven to 350 degrees. Line rimmed baking sheet with aluminum foil. Arrange New Mexican chiles on prepared sheet and toast until puffed and fragrant, 4 to 6 minutes. Transfer chiles to large plate. Heat broiler.",
    "2. Place shallots and garlic on now-empty sheet and broil until softened and skins are charred, 6 to 9 minutes.",
    "3. When cool enough to handle, stem and seed chiles and tear into 1½-inch pieces. Process chiles in blender until finely ground, about 1 minute. Peel shallots and garlic. Add shallots, garlic, ginger, water, lime juice, oil, fish sauce, five-spice powder, cumin, and pepper to blender. Process to smooth paste, 2 to 3 minutes, scraping down sides of blender jar as needed. (You should have 1 cup paste. Paste can be refrigerated for up to 1 week or frozen for up to 2 months; if frozen, let thaw completely before using.)",
    "4. For the curry Heat oil in large saucepan over medium heat until shimmering. Add curry paste and cook, stirring constantly, until paste begins to brown, 2½ to 3 minutes. Stir in coconut milk, broth, potatoes, onion, peanuts, and salt, scraping up any browned bits. Bring to simmer and cook until potatoes are just tender, 12 to 14 minutes.",
    "5. Stir in chicken; continue to simmer until chicken is cooked through, 10 to 12 minutes. Off heat, stir in lime zest. Sprinkle with cilantro and serve."
  ]
}