{
  "title": "Matbucha",
  "source": "Toriavey.com",
  "servings": "Servings: 6 servings",
  "categories": [
    "***Lauren’s Favorites",
    "African"
  ],
  "ingredients": [
    "3/4lb red bell peppers (3 peppers)",
    "1medium jalapeno (or more to taste)",
    "1LB of fresh tomatoes",
    "1clove garlic, minced",
    "2tbsp sugar (or to taste-- some people prefer it less sweet)",
    "1tsp aleppo chili pepper flakes (or more to taste)",
    "1/2tsp salt",
    "1/3cup extra virgin olive oil",
    "1tbsp paprika"
  ],
  "directions": [
    "Roast the bell peppers. Seed the peppers and peel off the charred skin. For instructions on how to roast bell peppers, click here. Chop the roasted skinned pepper flesh.",
    "Seed the jalapeno, then mince it. If you have sensitive skin, use gloves for this step. You can add more jalapenos for more heat if you like a spicy matbucha. As written, the recipe has a little kick, but it's not overly spicy.",
    "In a medium saucepan, combine diced tomatoes, roasted bell peppers, minced jalapeno, garlic, sugar, chili pepper flakes, and salt. Bring to a simmer over medium high heat.",
    "Reduce heat to around medium low, till the matbucha is cooking at a medium and constant simmer. Monitor the temperature of the matbucha, stirring every ten minutes to make sure it doesn't start to stick to the bottom of the pan. Let the mixture cook for 65-75 minutes till most of the liquid has reduced and cooked down.",
    "AD",
    "When most of the liquid has evaporated and the mixture is quite thick, you are ready to add your oil.",
    "AD",
    "In a small bowl, whisk together olive oil and paprika.",
    "Pour the seasoned oil into the pan and stir.",
    "Let the matbucha cook for about 30 minutes more, stirring every 5 minutes. Towards the end of cooking, taste the mixture and adjust seasoning as desired-- more sugar for sweetness, chili pepper flakes for spice, and salt if needed.",
    "Remove the matbucha from heat and allow to cool completely. The salad is best served at room temperature or chilled."
  ]
}