{
  "title": "Matzo Ball Soup",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "Matzo Balls",
    "¼cup chicken fat (schmaltz) or vegetable oil",
    "1onion, chopped fine",
    "4large eggs",
    "1teaspoon minced fresh dill",
    "¾teaspoon table salt, plus salt for cooking matzo balls",
    "½teaspoon pepper",
    "1cup (4 ounces) matzo meal",
    "Soup",
    "1tablespoon chicken fat (schmaltz) or vegetable oil",
    "1onion, chopped",
    "2carrots, peeled and cut into ½-inch pieces",
    "2celery ribs, chopped",
    "1parsnip, peeled and cut into ½-inch pieces",
    "½teaspoon table salt",
    "8cups chicken broth",
    "1½pounds chicken leg quarters, trimmed",
    "1teaspoon minced fresh dill"
  ],
  "directions": [
    "1. For the matzo balls Heat chicken fat in Dutch oven over medium heat until shimmering. Add onion and cook until light golden brown and softened, about 5 minutes. Transfer onion to large bowl and let cool for 10 minutes. (Do not clean pot.)",
    "2. Whisk eggs, 5 tablespoons water, dill, ¾ teaspoon salt, and pepper into cooled onion. Fold in matzo meal until well combined. Cover with plastic wrap and refrigerate for at least 1 hour or up to 2 hours. (Batter will thicken as it sits.)",
    "3. Bring 4 quarts water and 2 tablespoons salt to boil in now-empty Dutch oven. Divide batter into 12 portions (about 1 heaping tablespoon each) and place on greased plate. Roll portions into smooth balls between your wet hands and return to plate. Transfer matzo balls to boiling water, cover, reduce heat to medium-low, and simmer until tender and cooked through, about 30 minutes.",
    "4. Using slotted spoon, transfer matzo balls to colander and drain briefly. Transfer balls to clean plate and let cool to firm up, about 10 minutes. Discard cooking water. (Do not clean pot.)",
    "5. For the soup Meanwhile, heat chicken fat in large saucepan over medium heat until shimmering. Add onion, carrots, celery, parsnip, and salt and cook, covered, until vegetables begin to soften, about 5 minutes. Add broth, chicken, and dill and bring to boil. Cover, reduce heat to low, and cook until chicken is tender, 35 to 45 minutes. Remove from heat and transfer chicken to plate. (Chicken can be used for soup or reserved for another use. If adding to soup, shred with 2 forks into bite-size pieces; discard skin and bones.) Season soup with salt and pepper to taste.",
    "6. Transfer soup to now-empty Dutch oven and bring to simmer over medium heat. Carefully transfer matzo balls to hot soup (along with shredded chicken, if using). Cover and cook until matzo balls are heated through, about 5 minutes. Serve."
  ]
}