{
  "title": "Mean, Green Turkey Sandwich",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 to 8 (Makes Two 12-Inch/30 cm Sub Sandwiches)",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Barely Pickled Jalapeños",
    "4jalapeños, thinly sliced into rounds",
    "1⁄3 cup (80 ml) white distilled vinegar",
    "2teaspoons kosher salt",
    "1teaspoon granulated sugar",
    "Green Sunflower Spread",
    "Kosher salt, to taste",
    "21⁄2 ounces (70 g) fresh cilantro leaves and tender stems (from 1 to 11⁄2 large bunches)",
    "1batch Roasted Garlic Sunflower Seed Dip (just the dip)",
    "Sandwich Assembly",
    "Two 12-inch (30 cm) sub rolls, split open but still connected",
    "12ounces (340 g) thinly sliced smoked deli turkey",
    "8ounces (227 g) aged white cheddar slices",
    "1⁄2 large English cucumber, thinly sliced on a mandoline",
    "1small white onion, thinly sliced on a mandoline and rinsed (see Tip 1)",
    "3ounces (85 g) alfalfa or broccoli sprouts",
    "Olive oil, for drizzling",
    "Fresh lemon juice, to taste",
    "Flake salt and freshly cracked black pepper, to taste"
  ],
  "directions": [
    "1. Make the jalapeños: Mix the jalapeños, vinegar, kosher salt, and sugar in a small bowl. Let sit at room temperature while you prepare the rest of the sandwiches, at least 20 minutes. The jalapeños will not be totally submerged in the vinegar at first but will release liquid as they sit.",
    "2. Meanwhile, make the spread: Bring a small pot of water to a boil over high heat. Prepare a large ice bath.",
    "3. Season the boiling water with a generous amount of kosher salt. Add the cilantro, and blanch for 30 seconds. Immediately transfer with a slotted spoon to the ice bath to shock.",
    "4. Squeeze out all the excess moisture in the cilantro, roughly chop it, and transfer it to a high-powered blender along with the Roasted Garlic Sunflower Seed Dip. Blend until the cilantro is fully blended into the dip and the mixture is very green.",
    "5. Assemble the sandwiches: Spread 2 or 3 tablespoons of the dip on the bottom of each sub roll. Add the turkey and cheddar and then add a layer of cucumber, a layer of onion, and a layer of pickled jalapeños to each sandwich.",
    "6. Top each with a generous handful of sprouts, a drizzle of olive oil, and a squeeze of lemon juice. Sprinkle with flake salt and pepper. There will be more dip left, so feel free to also spread some on the other side of the bread, but I prefer just one side! (Save any leftover spread for dipping crackers, chips, or raw veggies. Store in an airtight container in the refrigerator for up to 3 days.)",
    "7. Close the subs, cut each into halves or quarters, and serve."
  ]
}