{
  "title": "Microwave Mochi with Sesame Ganache",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Serves 14",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "For the Filling:",
    "- 7 ounces vegan white chocolate, chopped into chip-size pieces",
    "- 1 tablespoon well-stirred tahini",
    "- ⅓ cup plus 1 tablespoon coconut milk",
    "- Neutral oil for greasing the pan",
    "For the Mochi:",
    "- 1½ cups mochiko sweet rice flour",
    "- 3 tablespoons granulated sugar",
    "- ½ cup cornstarch, plus more for dusting",
    "- Powdered sugar, for dusting",
    "- 2 teaspoons toasted black sesame seeds"
  ],
  "directions": [
    "MAKE THE FILLING:COMBINE the chocolate and tahini in a medium heatproof mixing bowl and stir well. In a medium microwave-safe bowl, microwave the coconut milk on high in 30-second intervals until it bubbles gently, stopping before it boils, about 1 minute total. Pour the coconut milk into the mixing bowl and stir until the chocolate has fully melted and the mixture is smooth.",
    "LIGHTLY grease a small sheet pan, then pour the mixture onto the pan. Freeze, uncovered, until solid but still malleable, about 1 hour. Scoop out 1 tablespoon’s worth, roll it into a ball, and put it on a plate. Do the same with the rest, then put them back on the sheet pan and put it back in the freezer while you make the mochi.",
    "MAKE THE MOCHI:COMBINE the mochiko, sugar, and 1½ cups water in a medium microwave-safe bowl and stir until smooth. Cover with plastic wrap and microwave on high for 1½ minutes. Uncover, scrape down the sides of the bowl with a flexible spatula, stir well, and microwave on high again until it looks glossy and translucent, about 30 seconds more.",
    "UNCOVER and stir in a single direction (say, clockwise) until it cools and thickens to form what looks like dough, about 1 minute. This helps give it its chewy texture.",
    "DUST a clean work surface with cornstarch and add ½ cup or so of cornstarch to a small mixing bowl. To make each mochi, dip a spoon in cornstarch, spoon out a scant ¼ cup of the mochiko mixture, put it on the dusted surface, and flatten it to an approximately 3-inch circle. Repeat for the rest of the mochiko mixture. Add one of the frozen ganache balls, gather the edges of the mochi around the ball to fully enclose it, and pinch them together, twisting off the pinched part. Place them pinched-side down on a plate and repeat for the rest of the mochiko mixture and ganache.",
    "THEY’RE ready to eat. Or you can freeze them in an airtight container in the freezer for up to 1 month. Let them thaw for 10 minutes to eat them like mochi ice cream or thaw fully.",
    "TO serve, add a little powdered sugar to a mesh strainer and tap it against your palm to dust over each mochi. Sprinkle on the black sesame seeds."
  ]
}