{
  "title": "Midwestern Fish Fry",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Tartar Sauce",
    "1⁄4 cup (7 g) loosely packed fresh dill, roughly chopped",
    "1⁄4 cup (7 g) loosely packed fresh parsley leaves, roughly chopped",
    "1egg",
    "1garlic clove, smashed",
    "Zest and juice of 1⁄2 lemon",
    "1cup (240 ml) canola oil",
    "3tablespoons finely chopped cornichons",
    "1tablespoon capers, drained and roughly chopped",
    "1tablespoon whole-grain mustard",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Slaw",
    "4heaping cups (260 g) thinly sliced (on a mandoline) red cabbage (about 1⁄2 medium head)",
    "1bunch red radishes (about 8), greens removed and thinly sliced on a mandoline",
    "1⁄2 small red onion, thinly sliced and rinsed",
    "2tablespoons red wine vinegar",
    "1tablespoon honey",
    "1⁄2 teaspoon caraway seeds",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Fish",
    "Canola oil, for frying",
    "3⁄4 cup (100 g) plus 1⁄2 cup (65 g) all-purpose flour",
    "1⁄2 cup (65 g) medium rye flour",
    "1⁄2 teaspoon baking powder",
    "One 12-ounce (335 ml) can lager-style beer, cold",
    "Four 4- or 5-ounce (113 to 142 g) cod fillets, pin bones and skin removed",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Flake salt, for finishing",
    "Lemon wedges, to taste"
  ],
  "directions": [
    "1. Make the sauce: Place the dill, parsley, egg, garlic, lemon zest, and lemon juice in a high-sided container (like a jar or quart/1 L container). Use an immersion blender to blend until smooth (see Note). There will still be bits of herbs.2. With the blender running, slowly stream in the canola oil to create a smooth emulsion. Stir in the cornichons, capers, and mustard, and season with salt and pepper.3. Make the slaw: Place the cabbage, radishes, onion, vinegar, honey, and caraway seeds in a large bowl, and toss to combine. Season with salt and pepper. Place in the refrigerator while you prepare the fish.4. Make the fish: Add 2 inches (5 cm) of canola oil to a large pot, and attach a candy thermometer to the side. Heat the oil over medium-high heat until the temperature reaches 365°F (185°C).5. While the oil heats, prepare the batter. Add 3⁄4 cup (100 g) all-purpose flour, the rye flour, and the baking powder to a large bowl, and whisk in the beer until combined. (A few lumps are okay!) Place in the refrigerator until you’re ready to batter the fish.6. Place the remaining 1⁄2 cup (65 g) of all-purpose flour in a shallow dish.7. When the oil is hot, pat all the cod fillets completely dry with a paper towel, and season both sides with salt and pepper.8. Working with one fillet at a time, dredge the fish in the flour and shake off any excess. Dip the fillet into the batter, and fully coat on all sides. Shake to remove any excess batter. Carefully add the fish to the hot oil using your hands, holding onto the fillet and letting it “swim” for a few seconds before dropping it fully into the oil. (This prevents the fish from sticking to the bottom of the pot.) Repeat with a second fillet. Return the batter to the refrigerator until you need it for the next batch.9. Fry until golden and crispy on both sides, flipping halfway through, 5 or 6 minutes. Adjust the heat as needed to maintain the oil temperature (365°F/185°C).10. Using a spider or fish spatula, transfer the fish from the oil to a wire rack or paper towel–lined plate, and sprinkle lightly with flake salt.11. Repeat steps 7 through 10 with the remaining fillets.12. Serve, with the tartar sauce, slaw, and lemon wedges on the side."
  ]
}