{
  "title": "Milk Chocolate-Peanut Butter Crème Brûlée",
  "source": "Mesa Grill - Bobby Flay",
  "servings": "4",
  "categories": [
    "Mesa Grill - Bobby Flay"
  ],
  "ingredients": [
    "- 3 cups heavy cream",
    "- ½ cup whole milk",
    "- ½ cup peanuts, toasted",
    "- ½ cup granulated sugar",
    "- 3½ ounces milk chocolate, finely chopped",
    "- ¼ cup smooth peanut butter, such as Jif",
    "- 7 large egg yolks",
    "- ¼ teaspoon kosher salt",
    "- ½ cup turbinado sugar or other raw sugar"
  ],
  "directions": [
    "1. Bring the heavy cream and milk to a simmer in a medium saucepan over medium heat, remove from the stove, and stir in the peanuts. Let sit, covered, for at least 1 hour in the refrigerator and up to 24 hours. Strain the mixture, wipe out the pan, and return the mixture to the pan.",
    "2. Preheat the oven to 350 degrees F.",
    "3. Place the mixture back on the stove, add ¼ cup of the granulated sugar, and bring to a simmer, stirring until the sugar has dissolved. Remove from the heat and whisk in the chocolate and peanut butter. Whisk together the yolks, the remaining ¼ cup granulated sugar, and the salt in a large bowl until pale in color. Slowly whisk in the hot chocolate mixture and continue whisking until combined. Strain the mixture through a fine-mesh strainer into a bowl.",
    "4. Place four 8-ounce ramekins inside a large baking dish and using a ladle, divide the mixture evenly among the ramekins. Pour hot water into the dish until it reaches halfway up the sides of the ramekins. Bake until the custard is set around the edges but still jiggles in the center, 40 to 45 minutes. The custard will continue to cook as it cools. Let cool to room temperature, then cover each ramekin with plastic wrap and refrigerate until cold, at least 4 hours and up to 24 hours.",
    "5. Preheat the broiler until very hot.",
    "6. Sprinkle an even coat of the turbinado sugar over each custard, place the ramekins on a baking sheet, and broil until the sugar is melted and dark golden brown, about 2 minutes. Remove from the oven and serve immediately."
  ]
}