{
  "title": "Minestrone",
  "source": "My Kitchen in Rome - Rachel Roddy",
  "servings": "Serves 8",
  "categories": [
    "Italian",
    "My Kitchen in Rome - Rachel Roddy"
  ],
  "ingredients": [
    "2red onions",
    "3carrots",
    "2celery stalks",
    "3tablespoons butter",
    "½cup extra-virgin olive oil",
    "7ounces potatoes",
    "12¼ounces zucchini",
    "5¼ounces green beans",
    "7ounces savoy cabbage",
    "4¼ounces canned or fresh plum tomatoes",
    "a large Parmesan rind",
    "2½cups cooked cannellini beans",
    "to serve:",
    "5¼ounces small dried pasta",
    "2tablespoons grated Parmesan",
    "or",
    "4slices good bread, toasted",
    "2tablespoons grated Parmesan",
    "salt"
  ],
  "directions": [
    "Finely dice the onions, carrots, and celery. Gently heat the butter and oil over low heat in a very large, heavy-bottomed pan, add the onion, carrot, and celery, and cook gently, uncovered, until they are soft and fragrant and starting to deepen in color—only just. This will take a good 10 minutes.",
    "Meanwhile, dice the potatoes, zucchini, and green beans. Add the potatoes to the soup, stir, and cook gently for 5 minutes. Shred the cabbage, and peel (if fresh) and roughly chop the tomatoes. Add the green beans and zucchini, and after 5 more minutes, add the shredded cabbage. Add the tomatoes, stir, and increase the heat so the contents of the pan bubbles more vigorously for a few minutes. Add 6½ cups water and the Parmesan rind, bring to a boil, then reduce the heat to a tremulous simmer. Cover the pan and leave it just so for 2 hours, stirring occasionally.",
    "After 1½ hours, add the cannellini beans, stir carefully and firmly, then cook for another 30 minutes. If you find the soup is looking too thick before it has finished cooking, add a little more water. When the minestrone has finished cooking, pick out the Parmesan rind and transfer about a fifth of the soup to a separate bowl. Process it until smooth with an immersion blender before returning it to the rest of the soup.",
    "There are different options for serving it. I generally divide the minestrone in half once I’ve made it, warm up the first day’s half, and add 5¼ ounces dried pasta that I’ve cooked in a separate pan until al dente. I then stir in a couple of tablespoons of grated Parmesan, wait 5 minutes, and serve. The next day, while the remaining soup is gently reheating, I toast 4 slices of bread, put them in the bottom of 4 bowls, sprinkle them with grated Parmesan and a little salt, and then ladle over the minestrone."
  ]
}