{
  "title": "Mini–Matzo Ball Soup With Horseradish And Herbs",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 8 portions (with about 8 matzo balls per bowl)",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "dark vegetable stock",
    "2tablespoons (30 ml) olive or vegetable oil",
    "2big leeks, sliced into 1-inch coins",
    "2yellow onions, unpeeled, quartered",
    "3medium carrots, cut into chunks",
    "1large parsnip, cut into chunks",
    "3celery stalks, cut into chunks",
    "6mushrooms, quartered",
    "1large rutabaga or turnip, cut into chunks",
    "1russet potato, in chunks",
    "4large or 6 small garlic cloves, unpeeled, smashed a little",
    "A handful of fresh parsley sprigs",
    "1sprig of fresh dill",
    "1teaspoon black peppercorns",
    "A pinch or two of cayenne",
    "1tablespoon kosher salt, plus more to taste",
    "1bay leaf",
    "12cups (2¾ liters) water",
    "mini–horseradish herb matzo balls",
    "¾cup (90 grams) matzo meal",
    "1teaspoon fine sea salt, plus more for boiling",
    "3large eggs, lightly beaten",
    "1½tablespoons (25 grams) prepared horseradish, drained a little",
    "3tablespoons (45 ml) vegetable or olive oil",
    "2teaspoons (10 ml) white wine vinegar",
    "Several grinds of black pepper",
    "3tablespoons (45 ml) seltzer water",
    "1tablespoon finely chopped fresh flat-leaf parsley",
    "2teaspoons minced fresh dill",
    "to finish",
    "1large carrot, julienned",
    "1large parsnip, julienned",
    "1tablespoon minced fresh dill, parsley, or chives"
  ],
  "directions": [
    "make your stock Heat the oil in the bottom of a stockpot (6 to 7 quarts is ideal) over medium-high heat. Add the leeks, onions, carrots, parsnip, celery, and mushrooms, and cook, stirring occasionally, until they’re browned in spots and a little soft, 10 to 15 minutes. Add the rutabaga, potato, garlic, parsley, dill, peppercorns, cayenne, salt, and bay leaf, then the water and bring to a simmer. Cook, covered, for 45 minutes to 1 hour, then taste and adjust the seasonings as desired. Strain the stock, and set aside.",
    "meanwhile, make the matzo balls Mix all the matzo-ball ingredients in a bowl. Cover, and chill in the refrigerator for 30 minutes. Bring well-salted water to a brisk boil in a large, wide pot such as a sauté pan, then reduce the heat to a simmer. Run your hands under water so they are thoroughly wet. Form matzo balls by dropping teaspoonfuls (as in, 1 teaspoon measurement or the equivalent tiny scoop) into the palm of your wet hands and rolling them loosely into balls. Drop them into the simmering salt water one at a time. Cover the pot, and cook them for 20 minutes.",
    "assemble the soup Meanwhile bring the stock back to a simmer. About 5 minutes before the matzo balls are ready, add the julienned carrots and parsnips, and let them simmer until tender, about 5 minutes. Add the matzo balls to the pot. Ladle into bowls, and garnish with herbs."
  ]
}