{
  "title": "Minty Lamb Meatballs with Crispy Cabbage & Tahini Sauce",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1medium green or red cabbage (about 2 pounds)",
    "3garlic cloves",
    "1cup mint leaves",
    "1lemon",
    "DAIRY",
    "1egg",
    "MEAT",
    "1pound ground lamb",
    "PANTRY",
    "5tablespoons extra-virgin olive oil",
    "Kosher salt and freshly ground black pepper",
    "⅔cup panko bread crumbs",
    "½cup plus 2 tablespoons tahini",
    "1½teaspoons ground cumin"
  ],
  "directions": [
    "1. Position one rack in the upper third of your oven and a second one in the middle. Preheat the oven to 450°F.",
    "2. Prep the cabbage:",
    "- Quarter 1 medium cabbage through the root end. Trim out the core of each quarter. Cut each quarter in half crosswise to create 8 pieces total. Separate all of the leaves and scatter them across 2 rimmed baking sheets—it’s okay if they overlap.",
    "- Drizzle each baking sheet with 2 tablespoons olive oil and season each with ¾ teaspoon salt and lots of black pepper. Use your hands to massage the oil into the cabbage so that it’s evenly distributed. Roast the cabbage until it is charred in some places and has lost some of its volume, 13 to 15 minutes. Remove from the oven and combine all of the cabbage on one baking sheet, reserving the other pan for the meatballs.",
    "- Increase the oven temperature to 500°F.",
    "3. Meanwhile, make the meatballs:",
    "- In a large bowl, lightly beat 1 egg. Add 2/3 cup panko, 2 tablespoons tahini, 1½ teaspoons ground cumin, 1¼ teaspoons salt, and 1 tablespoon olive oil and whisk to combine.",
    "- Finely grate 2 garlic cloves into the panko mixture.",
    "- Chop ½ cup mint leaves and add them to the mixture along with about ⅓ pound ground lamb. Use your hands to gently mix the panko mixture into the lamb until it is evenly distributed and no pockets of panko remain—beware of overworking the mixture or the meatballs may get tough. Mix in the remaining ⅔ pound ground lamb.",
    "- Roll the meatball mixture into 12 equal-size balls about 1½ inches wide. Arrange the meatballs on the empty baking sheet.",
    "4. Cook the meatballs and cabbage: Return both baking sheets to the oven, placing the meatballs on the top rack to encourage better browning. Roast until the meatballs are browned and bounce back when you press on them gently and the cabbage is mostly charred and crisp, 7 to 9 minutes. If the cabbage looks like it could use a few more minutes, leave it in the oven and pull out only the meatballs to avoid overcooking them.",
    "5. Meanwhile make the tahini sauce: While the meatballs roast, stir together ½ cup tahini, ⅓ cup water, the juice of 1 lemon, and ¾ teaspoon salt in a small bowl. Finely grate 1 garlic clove into the tahini. Whisk the sauce to combine. It should have a pourable consistency; if it looks too thick, whisk in another splash of water.",
    "6. Assemble and serve: Spread some of the tahini sauce on each plate, and top with the cabbage, meatballs, and ½ cup mint leaves."
  ]
}