{
  "title": "Miso Buttermilk Biscuits",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves: 16",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "½cup sweet white miso (4.8 oz / 136g)",
    "1¼cups buttermilk (10.6 oz / 300g), chilled",
    "3¼cups all-purpose flour (15 oz / 423g), plus more for rolling out",
    "1tablespoon baking powder (0.42 oz / 12g)",
    "1tablespoon sugar (0.46 oz / 13g)",
    "¼teaspoon baking soda",
    "2sticks unsalted butter (8 oz / 227g), cut into ½-inch pieces, chilled, plus 2 tablespoons (1 oz / 28g), melted, for brushing",
    "Freshly ground black pepper"
  ],
  "directions": [
    "Preheat the oven and prepare the baking sheet: Arrange an oven rack in the center position and preheat the oven to 425°F. Line a large rimmed baking sheet with parchment paper and set aside.",
    "Mix the miso and buttermilk: Place the miso in the bottom of a medium bowl and pour in a couple of tablespoons of the buttermilk. Mash with a fork until smooth, then add a few more tablespoons of buttermilk and continue to mash until you have a smooth, lump-free paste. Repeat the process until you’ve worked about half of the buttermilk into the miso and you have a smooth, pourable mixture (working the buttermilk in just a bit at a time helps prevent lumps). Whisk in the rest of the buttermilk until smooth. Refrigerate while you assemble the rest of the ingredients.",
    "Mix the dry ingredients: In a large bowl, whisk together the flour, baking powder, sugar, and baking soda to combine.",
    "Work in the butter: Add the pieces of butter to the bowl with the flour mixture and toss to coat. Then use your fingertips to quickly smash all the pieces into the flour mixture, flattening them and breaking up into bits.",
    "Mix in the miso buttermilk: Stirring the mixture constantly with a fork, drizzle the buttermilk mixture into the bowl with the flour mixture. Using a flexible spatula or bench scraper, fold the mixture several times inside the bowl to bring the dough together and ensure that it’s evenly combined. It will be a bit wet and sticky.",
    "Form the biscuits: Turn the dough out onto a lightly floured surface. Use floured hands to pat it into a rectangle about ½ inch thick. Use a bench scraper or knife to cut the dough in half lengthwise and again crosswise to create quadrants. Stack the quadrants one on top of the other, dust a bit more flour on top and underneath the dough, and then roll out the stack with a rolling pin into a square measuring about 8½-inches across (this stacking and rolling step creates flakiness).",
    "Cut and chill the biscuits: Using a sharp knife, trim the edges to straighten so you have a neat 8-inch square. Then cut the square into sixteen 2-inch squares (a 4 x 4 grid). Transfer each square to the prepared baking sheet, spacing evenly. Place the baking sheet in the freezer for about 15 minutes to allow the butter to firm up.",
    "Brush with butter and bake: Brush the tops of the chilled biscuits with the 2 tablespoons melted butter and top with black pepper. Transfer the baking sheet to the oven and reduce the temperature to 375°F. Bake until the tops of the biscuits are browned and the bottoms are golden brown, 20 to 25 minutes. Remove from the oven and let cool on the baking sheet."
  ]
}