{
  "title": "Miso Maple Ribs With Roasted Scallions",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 4 to 6 servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "2racks of baby back ribs (around 2 pounds or 1 kilogram each)",
    "½cup (145 grams) white (shiro) miso",
    "½cup (120 ml) maple syrup",
    "½cup (120 ml) rice vinegar",
    "Salt and freshly ground black pepper",
    "2bunches (about 4 ounces or 115 grams each) of scallions, trimmed",
    "1glug of a high-smoke-point cooking oil, such as peanut or sunflower"
  ],
  "directions": [
    "Heat the oven to 300 degrees. If you have them, place one baking or cooling rack on each of two large baking sheets. If you don’t, you’ll still be fine, but the racks help the heat to circulate. Place each rack of ribs on a very large (oversized width, if you have it) sheet of aluminum foil.",
    "Combine the miso, maple, and vinegar in a small saucepan, but don’t cook it yet. Brush about ½ cup of the mixture over both sides of the ribs, then season them well with salt and pepper. Seal each rack of ribs in its own packet, tightly. Transfer to the prepared racks or trays. Bake for 2½ hours, until tender.",
    "At some point in the baking time, bring the ingredients left in the saucepan to a boil, then simmer over medium-low heat until thick and glossy; this takes 20 to 25 minutes. Stir frequently, and then constantly near the end, because it will be the most likely to burn when it is thickest.",
    "When the ribs are done, arrange them in one layer on a large, foil-lined baking sheet. Heat the broiler. Thickly brush the sauce over the ribs, including on the edges, then flip the rib rack over and coat the second side. Arrange the scallions around the ribs on the sheet, and drizzle them very lightly with cooking oil. Run them under the broiler until charred, about 5 minutes, keeping a close watch on them so that they do not burn.",
    "Remove the ribs from the oven to a cutting board, and slice between the ribs to separate. Arrange on a serving platter with the scallions, and pass them around.",
    ""
  ]
}