{
  "title": "Miso-Butter Pancakes",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Makes 15 to 20 large pancakes",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "8tablespoons / 113g salted butter, plus more for griddling and serving",
    "2tablespoons white miso paste",
    "1½cups / 210g all-purpose flour",
    "⅔cup / 65g old-fashioned rolled oats",
    "3tablespoons dark brown sugar",
    "Diamond Crystal kosher salt",
    "1½teaspoons baking powder",
    "1¾cups / 420ml whole milk, though any milk will work",
    "2large eggs",
    "Maple syrup, for serving"
  ],
  "directions": [
    "1. Set a small pan over medium heat and add the butter. Let the butter fully melt, then whisk in the miso. Continue to cook for 2 to 3 minutes, stirring occasionally, since the butter will begin to foam. The milk solids will separate from the butter and form flecks at the bottom of the pan. Continue to stir until the flecks are golden brown. The miso will also toast with the butter. There will be some larger pieces, but that’s okay! Keep mixing until the butter mixture is extremely toasted into an almost burnt, dark brown. Remove from the heat and set aside.",
    "2. In a large bowl, whisk together the flour, oats, brown sugar, 1 teaspoon salt, and baking powder.",
    "3. In a small bowl, whisk together the milk and miso-brown butter. Add the eggs and whisk until smooth. Pour this mixture into the dry ingredients and mix until you have a smooth batter. This batter will thicken as you preheat the pan.",
    "4. Set a large pan over medium heat and wait until you can add a few drops of water and they form balls that bounce around the pan; this makes it so your pan will not need greasing. Turn the heat to medium-low. Working in batches, use a ¼-cup scoop to pour the batter into large, even pancakes, each 4 to 5 inches in diameter. Cook until golden, 2 to 3 minutes on each side.",
    "5. Serve with maple syrup drizzled on top."
  ]
}