{
  "title": "Miso-Marinated Pork Steaks & a Big Pile of Spicy Cukes",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1English (hothouse) cucumber",
    "MEAT",
    "2(1-inch-thick) bone-in pork shoulder steaks (about 2½ pounds total)",
    "PANTRY",
    "½cup white miso paste",
    "½cup sake",
    "3tablespoons plus 2 teaspoons sugar",
    "Kosher salt",
    "2tablespoons vegetable oil",
    "2tablespoons unseasoned rice vinegar",
    "¾teaspoon red pepper flakes",
    ""
  ],
  "directions": [
    "1. Marinate the pork:",
    "- In a medium bowl, whisk together ½ cup white miso, ½ cup sake, and 3 tablespoons sugar until well combined. Add 2 bone-in pork shoulder steaks and turn them to coat. Cover the bowl and refrigerate for at least 2 hours and up to overnight.",
    "- Pull the pork out of the fridge and let sit at room temperature for about 30 minutes.",
    "2. Make the cucumber salad: Cut 1 English (hothouse) cucumber in half lengthwise. Slice crosswise as thinly as possible into half-moons. Transfer the cucumber to a medium bowl and season with 1½ teaspoons salt. Chill in the fridge for at least 15 minutes and up to 2 hours.",
    "3. Cook the pork:",
    "- Using a spatula, scrape off most of the marinade from the pork steaks, letting the marinade drip back into the bowl, and transfer them to a large plate or rimmed baking sheet. Stir ½ cup water into the leftover marinade.",
    "- Heat a 12-inch cast-iron skillet over medium-high heat for 5 minutes to get it super-duper hot.",
    "- Pat the pork dry with paper towels. Season with 1 teaspoon salt and coat all over with 2 tablespoons vegetable oil. Adding oil to the meat itself versus directly to the skillet helps minimize the spattering and smoke when it hits the pan.",
    "- Add the pork to the skillet, decrease the heat to medium, and cook until it begins to brown on one side, about 2 minutes. Using tongs, flip the pork and cook on the other side until beginning to brown, 2 minutes longer. Continue cooking, flipping every minute or two, until the steaks are deeply caramelized and an instant-read thermometer reaches 145°F, 4 to 5 minutes longer. Transfer the steaks to a cutting board to rest for 10 minutes. Reserve the skillet.",
    "- While the pork rests, tip off and discard any liquid that has collected in the bowl of cucumbers. Add 2 tablespoons rice vinegar, ¾ teaspoon red pepper flakes, and 2 teaspoons sugar and toss to coat.",
    "- Cut the pork steaks off the bone—there may be a few bones that run through each steak, so navigate your way around them. Slice the meat across the grain into ½-inch-thick pieces. Not sure how to find the grain? Right this way. Transfer the sliced pork and any juices that have accumulated on the cutting board to a serving platter.",
    "4. Make the pan sauce and serve:",
    "- Carefully tip out and discard any fat left behind in the skillet. Return the skillet to medium heat and stir in the reserved marinade. Cook, stirring and swirling the skillet constantly, until the sauce comes to a simmer and turns glossy and deep golden brown. Remove from the heat. Add a splash of water if it looks too thick. Season with salt.",
    "- Spoon the pan sauce over the sliced pork. Top with a big pile of the spicy cucumbers.",
    ""
  ]
}