{
  "title": "Modern Cauliflower Gratin",
  "source": "Modern Bistro - ATK",
  "servings": "8 to 10",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "2heads cauliflower (2 pounds each)",
    "8tablespoons unsalted butter, divided",
    "½cup panko bread crumbs",
    "2ounces Parmesan cheese, grated (1 cup), divided",
    "2teaspoons table salt",
    "½teaspoon pepper",
    "½teaspoon dry mustard",
    "⅛teaspoon ground nutmeg",
    "Pinch cayenne pepper",
    "1teaspoon cornstarch dissolved in 1 teaspoon water",
    "1tablespoon minced fresh chives"
  ],
  "directions": [
    "1  Adjust oven rack to middle position and heat oven to 400 degrees.",
    "2  Pull off outer leaves of 1 head of cauliflower and trim stem. Using paring knife, cut around core to remove; halve core lengthwise and slice thin crosswise. Slice head into ½-inch-thick slabs. Cut stems from slabs to create florets that are about 1½ inches tall; slice stems thin and reserve along with sliced core. Transfer florets to bowl, including any small pieces that may have been created during trimming, and set aside. Repeat with remaining head of cauliflower. (After trimming you should have about 3 cups of sliced stems and cores and 12 cups of florets.)",
    "3  Combine sliced stems and cores, 2 cups florets, 3 cups water, and 6 tablespoons butter in Dutch oven and bring to boil over high heat. Place remaining florets in steamer basket (do not rinse bowl). Once mixture is boiling, place steamer basket in pot, cover, and reduce heat to medium. Steam florets in basket until translucent and stem ends can be easily pierced with paring knife, 10 to 12 minutes. Remove steamer basket and drain florets. Re-cover pot, reduce heat to low, and continue to cook stem mixture until very soft, about 10 minutes longer. Transfer drained florets to now-empty bowl.",
    "4  While cauliflower is cooking, melt remaining 2 tablespoons butter in 10-inch skillet over medium heat. Add panko and cook, stirring frequently, until golden brown, 3 to 5 minutes. Transfer to bowl and let cool. Once cool, add ½ cup Parmesan and toss to combine.",
    "5  Transfer stem mixture and cooking liquid to blender and add salt, pepper, mustard, nutmeg, cayenne, and remaining ½ cup Parmesan. Process until smooth and velvety, about 1 minute (purée should be pourable; adjust consistency with additional water as needed). With blender running, add cornstarch slurry. Season with salt and pepper to taste. Pour purée over cauliflower florets and toss gently to evenly coat. Transfer mixture to 13 by 9-inch baking dish (it will be quite loose) and smooth top with spatula. (To make ahead, gratin and bread-crumb mixture can be refrigerated separately for up to 24 hours. To serve, assemble and bake gratin as directed in step 6, increasing baking time by 13 to 15 minutes.)",
    "6  Scatter bread-crumb mixture evenly over top. Transfer dish to oven and bake until sauce bubbles around edges, 13 to 15 minutes. Let stand for 20 to 25 minutes. Sprinkle with chives and serve."
  ]
}