{
  "title": "Mojo Meatballs",
  "source": "Bonappetit.com",
  "servings": "",
  "categories": [
    "Hawaiin"
  ],
  "ingredients": [
    "1cup (packed) cilantro sprigs, divided, plus more for serving",
    "1large egg",
    "⅔cup panko (Japanese breadcrumbs)",
    "1tsp. ground cumin",
    "2Tbsp. plus ⅓ cup extra-virgin olive oil, divided",
    "4tsp. sugar, divided",
    "2½tsp. Diamond Crystal or 1½ tsp.",
    "Morton kosher salt, divided, plus more",
    "4garlic cloves, divided",
    "2serrano chiles or jalapeños, divided",
    "1lb. ground pork",
    "2medium red onions, cut into 1”-thick wedges",
    "Freshly ground black pepper",
    "Juice of 1 orange",
    "Juice of 2 limes",
    "Cooked white rice and plantain chips (for serving)"
  ],
  "directions": [
    "Place a rack in lower third of oven; preheat to 500°. Set aside ½ cup cilantro for making the sauce; finely chop remaining ½ cup cilantro. Lightly beat egg in a medium bowl to blend. Add panko, cumin, 1 Tbsp. oil, 2 tsp. sugar, and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt and stir until panko softens and turns pasty. Finely grate 3 garlic cloves and 1 chile into mixture, add chopped cilantro, and mix well to combine. Using your hands, mix in pork until evenly distributed.",
    "Toss onions with 1 Tbsp. oil on a large rimmed baking sheet; season with salt and pepper. Roast until wedges are well charred underneath, about 10 minutes.",
    "While the onions are cooking, divide pork mixture into eight pieces and roll each into a 2”-diameter ball.",
    "Using a metal spatula, turn onion wedges over and scoot them toward edges of baking sheet to make room for meatballs. Arrange meatballs in the center, spacing out evenly. Return baking sheet to oven and roast until meatballs are browned and spring back when gently pressed and onions are well charred on the other side, about 10 minutes.",
    "Meanwhile, remove stem from remaining chile and split in half lengthwise. Place in a blender and add orange juice, lime juice, reserved ½ cup cilantro, remaining garlic clove, ⅓ cup oil, 2 tsp. sugar, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt; blend until mostly smooth but still specked with herbs. Transfer sauce to a small bowl.",
    "Divide rice among bowls and top with meatballs and onions, then plantain chips and more cilantro sprigs. Serve with sauce alongside."
  ]
}