{
  "title": "Molly’s Biscuits",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes 12",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "1½sticks (12 tablespoons) unsalted butter, frozen",
    "1½cups buttermilk",
    "½cup plus 2 tablespoons sour cream",
    "4cups all-purpose flour, plus more for rolling",
    "2tablespoons plus 2¼ teaspoons baking powder",
    "2tablespoons kosher salt (Diamond Crystal or about half as much Morton)",
    "1tablespoon white sugar",
    "1½teaspoons citric acid",
    "1egg",
    "1tablespoon heavy cream or whole milk",
    "Flaky sea salt (optional)"
  ],
  "directions": [
    "Get your oven to 400°F. Line a large baking sheet with parchment paper (or lightly coat the baking sheet with nonstick spray).",
    "Use the large holes of a box grater to grate the frozen butter into a bowl, then put it back in the freezer. In a medium mixing bowl, whisk together the buttermilk and sour cream and set aside in the fridge. In a large mixing bowl, whisk together the flour, baking powder, kosher salt, sugar, and citric acid.",
    "Now, you want to make the dough without warming the butter too much. So get ready—speed is important from here on. Add the grated butter to the flour mixture and toss well with your hands, breaking up any big clumps of butter but not doing the usual “working in the butter” business. Instead, you’re basically just coating the butter bits in the dry stuff.",
    "Next, pour in the buttermilk mixture and use a flexible spatula to mix everything together in about eight big swooping folds. You’re trying to get all of the dry mixture wet without working it too much (that’d give you chewy biscuits). Then, use your hands to quickly finish the dough, giving it a couple of folds in the bowl and incorporating any wet or dusty spots.",
    "Dust the counter with about ¼ cup all-purpose flour. Give yourself a good 2 feet by 1 foot of space for the biscuits, even though you’re not going to roll them that big. Dump the dough onto the floured surface and dust the top of the dough blob with another 2 tablespoons or so flour. Pat the dough blob into a rough 6-inch square that’s about 2 inches high.",
    "Using a rolling pin and working from the middle out, roll out the dough to a nice even 10-inch square. Use your hands to brush off any excess flour.",
    "Fold one of the sides about a third of the way over the dough, then fold the opposite side over the folded dough. Rotate the dough a quarter turn clockwise (or at least the same direction each time) and roll out the dough to make that nice even square again. Repeat this process (fold like a letter, quarter turn, and roll it out) three more times, for a total of four folds, but on the last time, stop before you roll it into the 10-inch square. If your square begins to look wonky, take a moment to pat the dough into a neater rectangle between those quarter turns.",
    "After the fourth fold, roll out the dough once more, but this time make a rectangle measuring about 7 by 10 inches. Trim the edges with a bench scraper or knife—a straight edge makes the biscuits rise better. Cut the dough into twelve 2- to 2½-inch squares and put them on the baking sheet with a good 2 inches between each one.",
    "In a small bowl, whisk together the egg and heavy cream until there are no blobs of egg whites. Brush or rub the biscuit tops with a thin layer of this egg business, then lightly sprinkle with flaky sea salt.",
    "Bake on the center rack, rotating the pan halfway through, until the undersides are fully golden brown and a toothpick poked in the center comes out nice and dry, 20 minutes or so. Serve the biscuits warm.",
    "Wrap up any leftovers. They’ll stay pretty delicious in the fridge for a couple of days and freeze well, too. Reheat in a low oven before serving them again."
  ]
}