{
  "title": "Mom’s Famous Burnt Tomatoes",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Serves 10 to 12",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "6tablespoons unsalted butter",
    "3cups all-purpose flour",
    "3tablespoons kosher salt (Diamond Crystal or about half as much Morton)",
    "2tablespoons freshly ground black pepper",
    "1tablespoon white sugar",
    "Lots of canola oil (4 to 6 cups)",
    "6pounds large tomatoes (10 to 12), cored and cut into ½-inch round slices"
  ],
  "directions": [
    "Get ready because these babies take about an hour to fry and stack and otherwise prep for baking.",
    "Rub about 1 tablespoon of the butter on the bottom and up the sides of a 9 by 13-inch baking dish. Dice the rest of the butter into pea-size pieces. In a medium mixing bowl, stir together the flour, 1 tablespoon of the salt, and 1 tablespoon of the pepper. In a small mixing bowl, stir together the remaining 2 tablespoons salt, 1 tablespoon pepper, and the sugar.",
    "Pour 1 inch of oil into a deep cast-iron skillet and get it shimmering over medium-high heat. Working in batches to avoid crowding the oil, add four or five tomato slices to the flour mixture, toss to coat them well, and fry them in a single layer, flipping once, until they get brown on both sides and real soft, about 6 minutes. (If they take much time longer, turn up the heat for the next round.)",
    "As the tomatoes are done, use a slotted spatula to drain off as much oil as you can (try rapping on the edge of the pot) and then move the tomatoes to the buttered baking dish in a single layer. Keep frying and lining that baking dish until the bottom’s covered, then add about half the diced butter (a piece or two per slice) and evenly sprinkle on about a third of the sugar mixture.",
    "Meanwhile, get your oven to 375°F.",
    "Keep frying, adding a little more oil if necessary to maintain the depth and not stressing if the oil gets real dark. Continue to move the slices to the baking dish to make neat-ish stacks. Once you’ve finished the second layer of tomatoes, add the remaining butter and another even sprinkle of a third of the sugar mixture. You should have enough tomatoes to make stacks of three (any extras can become fours). Once you’ve finished frying and stacking the remaining tomatoes, sprinkle with the remaining sugar mixture.",
    "Move the baking dish to the oven and cook, uncovered, until the tomatoes have shrunk, leaked oil, and turned deep brown and nearly black in spots, about 2 hours, though my mom claims it’s impossible to overcook. At this point, it’s lava-hot, so let it cool for 10 minutes, then serve your friends a stack.",
    "Leftovers keep in the fridge for up to 5 days. Reheat them, covered, in a 350°F oven until hot."
  ]
}