{
  "title": "Mongolian Beef",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Servings: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 11/2 pounds beef flap meat, trimmed",
    "- 1/2 cup cornstarch",
    "- 2 quarts peanut or vegetable oil for frying",
    "- 4 scallions, white parts minced, green parts cut into 1-inch pieces",
    "- 2–4 small dried Sichuan chiles, stemmed and halved crosswise",
    "- 4 garlic cloves, minced",
    "- 1 tablespoon grated fresh ginger",
    "- 3/4 cup water",
    "- 2/3 cup packed brown sugar",
    "- 6 tablespoons soy sauce"
  ],
  "directions": [
    "1. Cut beef with grain into 21/2- to 3-inch-wide strips. Transfer to plate and freeze until firm, about 15 minutes. Slice strips crosswise against grain 1/8 inch thick. Toss beef with cornstarch in bowl; set aside.",
    "2. Line rimmed baking sheet with triple layer of paper towels. Add oil to large Dutch oven until it measures about 11/2 inches deep and heat over medium-high heat to 375 degrees. Carefully add one-third of beef to hot oil. Using tongs or cooking chopsticks, separate pieces so they fry individually. Fry beef, stirring occasionally, until browned and crispy, 2 to 4 minutes. Adjust burner, if necessary, to maintain oil temperature between 350 and 375 degrees. Using spider skimmer or slotted spoon, transfer beef to prepared sheet. Return oil to 375 degrees and repeat with remaining beef in 2 batches; transfer to sheet.",
    "3. Measure out and reserve 1 tablespoon frying oil; discard remaining oil or save for another use. Heat reserved oil in empty 14-inch flat-bottomed wok over medium-high heat until shimmering. Add scallion whites, chiles, garlic, and ginger and cook, mashing mixture into wok, until fragrant, about 30 seconds. Stir in water, sugar, and soy sauce and bring to vigorous simmer. Cook until sauce is thickened and reduced to 11/4 cups, 6 to 8 minutes. Add beef and scallion greens and cook, tossing constantly, until sauce coats beef, about 1 minute. Serve."
  ]
}