{
  "title": "Mouthwatering Chicken",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 4 (5- to 7-ounce) bone-in chicken thighs, trimmed",
    "- Table salt for poaching chicken",
    "- 1/4 cup vegetable oil",
    "- 1 (1/2-inch) piece ginger, peeled and smashed",
    "- 1 garlic clove, smashed and peeled",
    "- 3 tablespoons Sichuan chili flakes",
    "- 2 tablespoons soy sauce",
    "- 1 tablespoon Chinese black vinegar",
    "- 1 tablespoon toasted sesame oil",
    "- 2 teaspoons sugar",
    "- 2 teaspoons Sichuan peppercorns, toasted and coarsely ground",
    "- 1 scallion, green parts only, sliced thin",
    "- 2 tablespoons coarsely chopped fresh cilantro",
    "- 2 tablespoons chopped dry-roasted peanuts",
    "- 1 teaspoon sesame seeds, toasted"
  ],
  "directions": [
    "1. Place 1 chicken thigh skin side down on cutting board. Using sharp paring knife, cut slit along length of thigh bone to expose bone. Using tip of knife, cut meat from bone, being careful not to cut through skin. Slip knife under bone to separate bone from meat. Discard bone and trim any remaining cartilage from thigh. Repeat with remaining thighs.",
    "2. Whisk 4 quarts cool water and 2 tablespoons salt in Dutch oven until salt has dissolved. Arrange chicken skin side up in collapsible steamer basket in even layer, tucking thinner portions of meat under itself to form compact thighs. Submerge steamer basket in pot. Heat over medium heat, stirring occasionally to even out hot spots, until water begins to boil, 15 to 20 minutes. Remove pot from heat, cover, and let sit until chicken registers 175 degrees, 17 to 22 minutes. Transfer chicken skin side up to cutting board and let cool while preparing dressing.",
    "3. Combine vegetable oil, ginger, and garlic in bowl. Microwave until oil is hot and bubbling, about 2 minutes. Stir in chili flakes and let cool for 10 minutes. Strain oil mixture through fine-mesh strainer set over large bowl; discard solids. Whisk soy sauce, vinegar, sesame oil, sugar, and peppercorns into strained oil. (Chicken and dressing can be refrigerated separately for up to 24 hours; bring chicken to room temperature before slicing, and whisk dressing to recombine before proceeding with recipe.)",
    "4. Slice chicken crosswise into 1/2-inch-thick slices. Transfer chicken skin side up to shallow serving dish. Pour sauce over chicken and sprinkle with scallion, cilantro, peanuts, and sesame seeds. Serve."
  ]
}