{
  "title": "Mu Shu Pork",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Servings: 4",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 (12-ounce) pork tenderloin, trimmed",
    "- 1/4 cup soy sauce, divided",
    "- 2 tablespoons Shaoxing wine, divided",
    "- 1 teaspoon sugar",
    "- 1 teaspoon grated fresh ginger",
    "- 1/4 teaspoon white pepper",
    "- 1 ounce dried shiitake mushrooms, rinsed",
    "- 2 teaspoons cornstarch",
    "- 3 tablespoons vegetable oil, divided",
    "- 6 scallions, white and green parts separated and sliced thin, divided",
    "- 2 large eggs",
    "- 1 (8-ounce) can bamboo shoots, rinsed and sliced into matchsticks",
    "- 3 cups thinly sliced green cabbage",
    "- 1 recipe Spring Pancakes (this page)",
    "- Hoisin sauce"
  ],
  "directions": [
    "1. Cut tenderloin in half lengthwise. Transfer to plate and freeze until firm, about 15 minutes. Slice pork crosswise 1/8 inch thick. Whisk 2 tablespoons soy sauce, 1 tablespoon Shaoxing wine, sugar, ginger, and pepper in medium bowl until sugar has dissolved. Add pork and toss to coat; let marinate for 15 minutes.",
    "2. Microwave 1 cup water and mushrooms in covered bowl until steaming, about 1 minute. Let sit until mushrooms are softened, about 5 minutes. Drain in fine-mesh strainer, reserving 1/3 cup liquid; discard mushroom stems and slice caps thin. Whisk cornstarch, reserved mushroom liquid, remaining 2 tablespoons soy sauce, and remaining 1 tablespoon Shaoxing wine together in small bowl; set aside.",
    "3. Heat empty 14-inch flat-bottomed wok over high heat until just beginning to smoke. Drizzle 2 teaspoons oil around perimeter of wok and heat until just smoking. Add half of scallion whites and half of pork mixture and cook, tossing slowly but constantly, until pork is no longer pink, 2 to 6 minutes; transfer to large bowl. Repeat with 2 teaspoons vegetable oil, remaining scallion whites, and remaining pork mixture; transfer to bowl with pork.",
    "4. Heat 2 teaspoons oil in now-empty wok over medium-high heat until shimmering. Add eggs and scramble quickly using rubber spatula. Continue to cook, scraping slowly but constantly along bottom and sides of pan, until eggs just form cohesive mass, 15 to 30 seconds (eggs will not be completely dry). Transfer to bowl with pork mixture, then break up any large egg curds.",
    "5. Heat remaining 1 tablespoon oil in now-empty wok over medium-high heat until shimmering. Whisk reserved mushroom liquid mixture to recombine. Add mushrooms and bamboo shoots to wok and cook, tossing constantly, until heated through, about 1 minute. Add cabbage, all but 2 tablespoons scallion greens, and mushroom liquid mixture and cook, tossing slowly but constantly, until liquid has evaporated and cabbage is wilted but retains some crunch, 2 to 3 minutes. Add pork mixture and eggs and stir to combine. Transfer to platter and top with remaining scallion greens. Serve with pancakes, passing hoisin separately."
  ]
}