{
  "title": "Mushroom Toast with a Molly Egg",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 2",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 1 pound mushrooms, preferably oyster, maitake, and/or shiitake",
    "- 1 large shallot",
    "- 3 garlic cloves",
    "- 6 thyme sprigs, or 1 large rosemary sprig",
    "- ¼ cup parsley leaves",
    "DAIRY",
    "- ½ cup crème fraîche or sour cream",
    "- ½ ounce grated Parmesan cheese (2 tablespoons), plus more for sprinkling",
    "- 2 large eggs",
    "PANTRY",
    "- ⅓ cup plus 1 tablespoon extra-virgin olive oil",
    "- Kosher salt and freshly ground black pepper",
    "- 2 tablespoons red or white wine vinegar",
    "- 2 (1-inch-thick) slices country bread"
  ],
  "directions": [
    "1. Do your mise:",
    "- Tear 1 pound mushrooms into roughly 2-inch pieces, discarding any tough stemmy bits. If you’re using shiitakes, tear off and discard the stems; they’re too tough to eat.",
    "- Cut 1 large shallot in half through the root end. Peel, then finely chop.",
    "- Lightly smash and peel 3 garlic cloves. Thinly slice.",
    "- Pick the leaves from 6 thyme sprigs.",
    "- Chop ¼ cup parsley leaves.",
    "2. Cook the mushrooms:",
    "- Heat ⅓ cup olive oil in a 12-inch cast-iron skillet over medium-high heat until you just begin to see wisps of smoke coming from the pan. Add the mushrooms and toss to coat in the oil using tongs, until all the oil has been absorbed by the shrooms.",
    "- Season with ½ teaspoon salt.",
    "- Cook the mushrooms, undisturbed, until the mushrooms have developed good color on the underside, 4 to 5 minutes. Toss them around with your tongs to redistribute and cook, stirring once or twice, until mostly golden brown all over and no longer tough, 4 to 5 minutes longer (taste one!).",
    "3. Finish the mushrooms:",
    "- Reduce the heat to low, add the shallot, garlic, and thyme leaves to the skillet, and cook, stirring often, until the garlic and shallot are aromatic and softened but not browned, 1 to 2 minutes.",
    "- Stir in 2 tablespoons of red wine vinegar. Remove the skillet from the heat, stir in ½ cup crème fraîche and ½ ounce grated Parmesan cheese (2 tablespoons). Season with salt and black pepper. Cover to keep warm.",
    "- Toast 2 slices of bread (however is easiest for you).",
    "4. Cook the eggs: Heat 1 tablespoon olive oil in a large nonstick skillet over medium-low heat. Crack 2 eggs into the skillet, season them with salt and black pepper, and cook until the whites have just set but are not crispy and the yolk is runny, 3 to 4 minutes.",
    "5. Serve: Divide the toasts between 2 plates. Spoon the mushrooms over each piece of toast. Top each toast with more Parmesan, parsley, and an egg."
  ]
}