{
  "title": "Mushroom Bulgogi",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Serves 4",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "- 1 ounce dried shiitake (about 4 large), soaked and trimmed",
    "- 3 ounces dried sweet potato starch noodles (dangmyeon), soaked in cold water for 30 minutes and drained well",
    "- 3 tablespoons extra-virgin olive oil",
    "- 2 cups sliced (½ inch) stemmed fresh shiitake (about 16)",
    "- 2 tablespoons thinly sliced garlic",
    "- 3 ounces (½ cup) Korean rice cake sticks, soaked in cold water for 30 minutes and drained well",
    "- ¼ cup Chilsung Cider, Sprite, or ginger ale",
    "- 1 tablespoon soy sauce",
    "- 1½ teaspoons Mushroom Seasoning Powder, homemade or store-bought",
    "- 1 teaspoon toasted sesame oil",
    "- ½ cup sliced (¼ inch) yellow or white onion",
    "- 1 tablespoon grapeseed or another neutral oil",
    "- ½ medium Asian pear or 1 Bosc pear, peeled, cored, and thinly sliced",
    "- 1 teaspoon toasted sesame seeds"
  ],
  "directions": [
    "1. Bring a large pot of water to a boil. While heating, slice the soaked dried mushroom caps into ¼-inch thick slices.",
    "2. Add the sweet potato starch noodles to the boiling water and cook, stirring occasionally, until tender but still chewy, about 8 minutes. Drain, rinse with cold water, and drain thoroughly. Snip into 1-inch pieces using kitchen scissors.",
    "3. Heat a wide cast-iron skillet over medium-high heat for a few minutes. Add olive oil and spread the fresh mushrooms in a single layer. Cook without stirring until the bottoms start to turn golden, 1 to 2 minutes.",
    "4. Add garlic and cook, stirring, until fragrant and light golden, about 30 seconds.",
    "5. Add the dried mushrooms, rice cakes, Chilsung cider (or Sprite), soy sauce, mushroom seasoning powder, and sesame oil. Cook, stirring occasionally, until rice cakes are tender and most liquid has evaporated, about 2 minutes.",
    "6. Turn off the heat, stir in the sweet potato starch noodles, and transfer the mixture to a bowl.",
    "7. Clean the skillet and heat over medium for 3 to 5 minutes until very hot. Add onion in a single layer, drizzle with grapeseed oil, and turn off the heat.",
    "8. Immediately add the mushroom-noodle mixture evenly over the onions. Top with the pear slices and sprinkle with sesame seeds.",
    "9. Serve directly from the hot skillet."
  ]
}