{
  "title": "Mushroom and Dill Bar-Style Pizza",
  "source": "By Heart - Hailee Catalano",
  "servings": "SERVES 4 (MAKES TWO 12-INCH/30 CM PIZZAS)",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Cornmeal, for dusting",
    "1recipe Thin Bar Pie–Style Pizza Dough",
    "Olive oil, for drizzling",
    "1cup (240 ml) heavy cream",
    "1ounce (28 g) dried porcini mushrooms",
    "Kosher salt and freshly cracked black pepper, to taste",
    "12ounces (340 g) low-moisture whole-milk mozzarella, shredded",
    "6ounces (170 g) cremini mushrooms, sliced paper-thin on a mandoline",
    "1⁄2 cup (20 g) loosely packed fresh dill, roughly chopped"
  ],
  "directions": [
    "1. Preheat the oven to 500°F (260°C) with a pizza stone (if you have one) in the lower third (see Note). Dust two 12-inch (30 cm) round pizza pans with cornmeal (see Note 1).",
    "2. Place one ball of Thin Bar Pie–Style Pizza Dough on each pizza pan, and press and stretch out the dough as far as possible with your hands. The dough will not fit the whole pan at this point.",
    "3. Lightly oil the top of each pizza dough, and cover lightly with plastic wrap. Let both pizzas rest for 45 to 60 minutes at room temperature.",
    "4. Meanwhile, make the mushroom cream sauce. Add the heavy cream and porcinis to a small saucepan, and set over medium heat. Bring to a boil, reduce the heat to low, and simmer until the porcinis are rehydrated and very soft, 10 to 15 minutes.",
    "5. Transfer the mixture to a blender, and blend (with the top lid vented) until smooth. Start the blender on low and then increase to high because the mixture will be hot and you don’t want the sauce to shoot out of the blender. Add a small splash or two of water, if needed, to get the blender going. Season with salt.",
    "6. After the doughs have rested, press and stretch them out again, this time to fill out the entire pan. If the doughs still won’t quite stretch out the entire way, cover and let them rest another 15 minutes and try again. Prick the doughs all over with a fork.",
    "7. Top each pizza with half of the mushroom sauce and spread it out, leaving about a 1⁄4-inch (6 mm) border of dough exposed for the crust. Top each with half of the mozzarella and half of cremini mushrooms. Drizzle the mushrooms with olive oil, and season with salt and pepper.",
    "8. Bake one pizza at a time (see Note 2) in the lower third of the oven (on top of the pizza stone, if using) for 12 to 15 minutes, until golden and bubbly.",
    "9. Transfer the pizza to a cutting board. Top with half of the fresh dill, slice, and serve. (I find these pies are best eaten fresh from the oven.)",
    "10. Repeat steps 8 and 9 with the second pizza."
  ]
}