{
  "title": "Mussel Gratin",
  "source": "The Food of Sicily - Fabrizia Lanza",
  "servings": "Serves 6",
  "categories": [
    "Italian",
    "The Food of Sicily - Fabrizia Lanza"
  ],
  "ingredients": [
    "2pounds (900 g) mussels",
    "2large tomatoes, chopped",
    "1garlic clove, finely chopped",
    "2tablespoons olive oil, plus more for drizzling",
    "1¼cups (155 g) plain dried bread crumbs",
    "2tablespoons finely chopped fresh flat-leaf parsley",
    "Finely grated zest of 1 lemon",
    "1tablespoon dried oregano, preferably wild",
    "Fine sea salt and freshly ground black pepper"
  ],
  "directions": [
    "1. Wash the mussels carefully under cold water, scrubbing off any grit and pulling away the beards.2. Put the mussels in a large dry pan and cook uncovered over medium-high heat, stirring occasionally, just until they open, 3 to 5 minutes. Discard any that don’t open.3. Set a large sieve over a bowl and drain the mussels, reserving the liquid that collects in the bowl.4. When cool enough to handle, remove and discard the top shells, leaving the mussels attached to the bottom shells. Arrange them on a large baking sheet.5. In a medium skillet, combine the tomatoes, garlic, and 1 tablespoon olive oil. Cook over medium heat, stirring occasionally, until reduced to a light sauce, about 10 minutes. Transfer to a bowl.6. In the same skillet, heat the remaining 1 tablespoon olive oil over medium heat. Add the bread crumbs and cook, stirring, until they begin to toast, about 2 minutes.7. Add the parsley, lemon zest, oregano, salt, and pepper. Cook, stirring constantly, until golden brown, about 3 minutes.8. Stir in 1 cup (240 ml) of the tomato mixture and about 2 tablespoons of the reserved mussel liquid. The mixture should be sticky and hold together.9. Preheat the oven to 350°F (180°C).10. Fill each mussel shell with just enough of the bread crumb mixture to fully cover the mussel and return it to the baking sheet.11. Drizzle the shells with olive oil and bake for 10 minutes.12. Remove from the oven and sprinkle with a bit of the reserved mussel liquid.13. Broil until the bread crumbs are well toasted, 3 to 5 minutes.14. Serve immediately."
  ]
}