{
  "title": "Mustard-Roasted Chicken With Warm Green Bean And Potato Salad",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "3tablespoons plus 1 teaspoon Dijon mustard, divided",
    "¼cup extra-virgin olive oil, divided",
    "2teaspoons soy sauce",
    "1garlic clove, minced",
    "1teaspoon fresh minced rosemary",
    "¼teaspoon pepper, divided",
    "3pounds bone-in chicken pieces (split breasts halved crosswise, drumsticks, and/or thighs), trimmed",
    "½teaspoon table salt, plus salt for cooking vegetables",
    "1½pounds small red potatoes, 1 to 2 inches in diameter, halved",
    "8ounces green beans, trimmed and cut into 1½-inch lengths",
    "2tablespoons white wine vinegar",
    "1tablespoon capers, rinsed and minced",
    "2tablespoons chopped fresh parsley"
  ],
  "directions": [
    "1. Adjust oven rack to upper-middle position and heat oven to 475 degrees. Combine 3 tablespoons mustard, 1 tablespoon oil, soy sauce, garlic, rosemary, and ⅛ teaspoon pepper in small bowl; set aside.",
    "2. Pat chicken dry with paper towels and sprinkle with ½ teaspoon salt and remaining ⅛ teaspoon pepper. Place chicken skin side up on rimmed baking sheet, arranging breast pieces in center and leg and/or thigh pieces around perimeter. Brush chicken with mustard mixture. Roast until breasts register 160 degrees and drumsticks/thighs register 175 degrees, 25 to 30 minutes, rotating sheet halfway through roasting. Tent with aluminum foil and let rest.",
    "3. Meanwhile, bring 2 quarts water to boil in large saucepan over medium-high heat. Add potatoes and 1½ tablespoons salt to boiling water; return to boil and cook for 10 minutes. Add green beans and cook until both vegetables are tender, about 5 minutes. Drain well, return to pot, and cover to keep warm.",
    "4. Whisk vinegar, remaining 1 teaspoon mustard, and capers together in large bowl. Whisking constantly, slowly drizzle in remaining 3 tablespoons oil until incorporated. Transfer chicken to serving platter. Scrape up any browned bits and pour any accumulated juices from baking sheet into bowl with dressing; whisk to combine. Add warm vegetables, toss gently to combine, and season with salt and pepper to taste. Sprinkle chicken and salad with parsley and serve."
  ]
}