{
  "title": "My Best Attempt at Anne Hereford’s Apple Fritters",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes About 20 Fritters (3 or 4 per person)",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "2cups all-purpose flour",
    "2cups well-shaken buttermilk",
    "1cup Jiffy Corn Muffin Mix",
    "6tablespoons white sugar",
    "½teaspoon ground cinnamon",
    "½teaspoon freshly ground black pepper",
    "2large sweet-tart apples, like Honeycrisp or Pink Lady",
    "1tablespoon kosher salt (Diamond Crystal or about half as much Morton)",
    "Vegetable oil for deep-frying (about 2 quarts)"
  ],
  "directions": [
    "Grab three medium mixing bowls and set them in a row. In the first, put 1 cup of the flour. In the second, put the buttermilk. In the third, combine the Jiffy mix, the remaining 1 cup flour, 5 tablespoons of the sugar, the cinnamon, and pepper and stir really well.",
    "Cut the top and bottom off the apples, then cut through the core into thin, round slices (about ⅛ inch thick), flicking out any seeds. You want 20 or so slices. In a small bowl, mix the remaining 1 tablespoon sugar with the salt and set it aside.",
    "Bring 2 inches of oil to 350°F in a large heavy pot over medium-high heat. Line a baking sheet with a wire rack or paper towels.",
    "Working in four or five batches, toss the apple slices in the flour to coat well, shaking off the excess. Submerge the floured apple slices in the buttermilk until completely coated, letting any excess drip back into the bowl. Then toss them with the Jiffy mixture to coat in a thin layer. Move them to a second baking sheet as they’re done. Now, they’re ready to swim.",
    "Fry the apple slices in four batches to avoid crowding in the oil, flipping them over once, until they’re dark golden brown, about 5 minutes. When they’re done, use a slotted spoon or mesh strainer to move them to the prepared baking sheet in a single layer and right away sprinkle with the sugar mixture on both sides.",
    "When they’re cool enough to eat, you just might be cool enough to eat them."
  ]
}