{
  "title": "My Mom’s Sweet-and-Sour Baked Eggplant",
  "source": "Shuk From Market to Table",
  "servings": "Serves 4 to 6",
  "categories": [
    "Israel",
    "Shuk - From Market to Table"
  ],
  "ingredients": [
    "2medium globe or 4 smaller Asian eggplants",
    "Kosher salt",
    "Vegetable oil, for frying",
    "1medium onion, thinly sliced",
    "½cup (120 ml) tomato paste",
    "1½cups (360 ml) water",
    "1tablespoon sugar",
    "2 to 3tablespoons fresh lemon juice",
    "¼teaspoon chile flakes"
  ],
  "directions": [
    "Slice the eggplants into ½-inch-thick (1.5 cm) rounds and transfer to a colander set in the sink or over a bowl. Cover the eggplants generously with salt and let sit for 30 to 45 minutes to draw out the water.",
    "Preheat the oven to 210°F (100°C) if you want to bake the dish overnight, or to 250°F (120°C) for a 3-hour bake.",
    "Rinse the eggplants thoroughly and pat dry with paper towels.",
    "Line a plate or tray with paper towels. Fill a wide deep skillet with vegetable oil to a depth of about 1 inch (2.5 cm) and heat over medium-high heat for about 3 minutes, or until it reaches 350°F (175°C) on a deep-fry thermometer. Depending on the size of your pan, add about half the eggplant slices; they should be in one layer with some space between them. Fry for 2 to 3 minutes, then lift one eggplant slice and check the bottom—if it’s deep golden brown, it’s time to flip. Fry for 2 minutes on the second side, shaking the pan occasionally so they don’t stick together and will fry evenly. Using a slotted spoon or a spatula, transfer the fried eggplant to the paper towels to drain excess oil. Repeat with the rest of the eggplant. Let the eggplant cool; don’t wash the pan yet.",
    "Add the onion slices to the remaining oil in the pan and fry gently over medium heat until soft, fragrant, and slightly golden, about 10 minutes. Drain on more paper towels to remove excess oil.",
    "Line the bottom of a medium gratin or casserole dish with the onion. Sprinkle with salt. Layer the fried eggplant slices on top of the onion.",
    "Whisk together the tomato paste, water, sugar, lemon juice, chile flakes, and salt to taste in a small bowl and pour the mixture over the eggplant. Cover the dish with a lid or aluminum foil and bake for at least 3 hours at 250°F (120°C) or overnight at 210°F (100°C).",
    "Serve warm or at room temperature. Store in an airtight container in the fridge for up to 4 days."
  ]
}