{
  "title": "Napa Cabbage Salad with Shredded Chicken, Cotija & Corn Nuts",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 1 large garlic clove",
    "- 2 limes",
    "- 1 large napa cabbage (about 3½ pounds)",
    "- 6 small radishes",
    "- 1 cup packed cilantro leaves and tender stems",
    "DAIRY",
    "- ½ cup sour cream",
    "- ½ cup grated cotija cheese, plus more for serving",
    "MEAT",
    "- 1 whole store-bought rotisserie chicken",
    "PANTRY",
    "- ¼ cup mayonnaise",
    "- Kosher salt",
    "- 1 (7.5-ounce) can chipotle peppers in adobo sauce",
    "- ½ cup toasted corn (such as Corn Nuts) or Fritos",
    "- Freshly ground black pepper"
  ],
  "directions": [
    "1. Make the dressing:- In a large bowl, whisk together ½ cup sour cream, ¼ cup mayonnaise, ½ cup grated cotija cheese, and ¾ teaspoon salt.- Add ¼ cup adobo sauce from 1 (7.5-ounce) can of chipotles in adobo.- Finely grate 1 large garlic clove and the zest of ½ of the lime into the dressing. Squeeze the juice of both limes into the dressing. Whisk well to combine.",
    "2. Prep and scrunch the cabbage:- Remove and discard any floppy, wilty, or bruised outer leaves from 1 large napa cabbage. Cut the cabbage in quarters through the root. Thinly slice each quarter crosswise into roughly ½-inch-thick strips.- Add the cabbage to the bowl of dressing, season it with ¾ teaspoon salt, and squeeze and scrunch with your hands to help massage the dressing into the cabbage and break down some of that toughness.",
    "3. Prep the add-ins:- Remove and discard the skin of a rotisserie chicken. Pull the chicken meat off the bones, shredding it into bite-size pieces and adding it to the bowl of cabbage as you do.- Thinly slice 6 radishes crosswise into coins and coarsely chop 1 cup packed cilantro leaves and tender stems; add to the salad.- Coarsely chop or crush ½ cup toasted corn with the bottom of a small saucepan or other heavy, flat object; set aside for garnish.",
    "4. Toss and assemble:- Using tongs, toss the salad to evenly distribute and coat all the ingredients. You can be kind of aggressive with the tossing, since none of these ingredients are particularly delicate. Season the salad with more salt and black pepper as needed.",
    "5. Serve:- Divide the salad among bowls, piling it high ’cause it’s more fun to eat that way. Scatter the chopped toasted corn over top, along with more grated cotija cheese."
  ]
}