{
  "title": "Nate’s Spicy Fried Chicken Sandwich",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes 4",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "For Brining the Chicken",
    "¼cup kosher salt (Diamond Crystal or about half as much Morton)",
    "2tablespoons white sugar",
    "4boneless skinless chicken thighs (about 1½ pounds total)",
    "For Frying the Chicken",
    "Vegetable oil for deep-frying (about 2 quarts)",
    "1cup cornstarch",
    "½cup all-purpose flour",
    "2teaspoons freshly ground black pepper",
    "1teaspoon kosher salt (Diamond Crystal or about half as much Morton)",
    "¼teaspoon cayenne pepper",
    "½teaspoon garlic powder",
    "Heaping ¼ cup Nate’s Spicy Chicken Spices (this page)",
    "Sandwiches",
    "4teaspoons unsalted butter, room-temp so it’s mayo-soft",
    "4Martin’s potato sandwich rolls",
    "Mayo (Duke’s or bust) for swiping",
    "8bun-size pieces iceberg lettuce",
    "12 to 16drained dill pickle chips",
    "½juicy lemon"
  ],
  "directions": [
    "To brine that chicken: Heat 4 cups water with the salt and sugar in a medium pot, stirring occasionally, just until they dissolve, then let cool completely. Add the chicken so it’s submerged (or put the chicken and brine in a big resealable bag) and put it in the fridge for at least 2 hours or up to 12 hours.",
    "To fry that chicken: An hour or so before you’re ready to fry, drain the chicken, pat it dry, and let it come to room temp. Then get 2 inches of oil to 350°F in a medium heavy pot.",
    "While your oil heats up, whisk together the cornstarch, flour, black pepper, salt, cayenne, garlic powder, and 1 cup water in a medium bowl.",
    "When the oil’s hot, one by one, dunk each thigh in the batter, so it’s fully coated, then carefully add to the oil. To keep them from sticking to the pot or one another, I add two thighs to the oil, wait 2 or 3 minutes, then add the other two. Fry them, adjusting the heat to maintain 325-ish°F, until the crust is super-crackly and light brown and the center is cooked through (just cut into it and peek inside), about 15 minutes.",
    "When the thighs are done, pull them from the oil with tongs, shaking off any excess oil, and move them to a mixing bowl. Immediately and evenly sprinkle with the chicken spices, tossing to get as much of it to stick as possible. Let them hang out in the bowl.",
    "To assemble those sandwiches: Get a well-seasoned cast-iron skillet or griddle good and hot over medium heat.",
    "Swipe ½ teaspoon butter onto the cut side of each roll half, then cook the cut sides in batches until they’re dark golden brown. It goes quick, like 30 seconds to 1 minute. When they’re done, move them to the counter to build your sandwich.",
    "Evenly swipe about 1 teaspoon mayo on each roll half. On each roll bottom, pile on 2 lettuce leaves, 3 or 4 pickle chips, and the chicken. Squeeze a generous spritz of lemon juice onto the chicken on each sandwich and top with the other half of the roll. Eat. I love this sandwich."
  ]
}