{
  "title": "Neapolitan-Style Short Rib & Caramelized Onion Ragu",
  "source": "Italian American Don Angie Book",
  "servings": "MAKES ABOUT 6 CUPS (SERVES 4 TO 6 WITH PASTA)",
  "categories": [
    "Italian",
    "Italian American - Don Angie"
  ],
  "ingredients": [
    "1cup plus ⅓ cup extra-virgin olive oil",
    "8cups very thinly sliced yellow onions (about 2 pounds)",
    "4cups very thinly sliced cipollini or Vidalia onions (about 1½ pounds)",
    "3celery ribs, very thinly sliced",
    "3tablespoons kosher salt",
    "2teaspoons freshly ground black pepper",
    "2½pounds trimmed boneless short rib, cut into 1-inch cubes",
    "1cup dry white wine, such as Pinot Grigio",
    "8cups chicken stock, unsalted store-bought or homemade (this page)",
    "2tablespoons white wine vinegar",
    "To serve with pasta",
    "½cup kosher salt",
    "1pound dried tubular pasta, such as ziti or paccheri",
    "½cup (1 stick) unsalted butter, cubed",
    ""
  ],
  "directions": [
    "In a large heavy-bottomed pot, heat 1 cup of the olive oil over medium-high heat until it is nearly smoking. Add both onions, the celery, 1½ tablespoons of the salt, and 1 teaspoon of the pepper and stir well. Increase the heat to high and continue stirring until the vegetables begin to soften and release liquid, 2 to 3 minutes. Reduce the heat to medium and continue to cook, stirring and scraping intermittently, every 8 to 10 minutes, to avoid sticking. Continue cooking and scraping the vegetables while searing the short rib in the next step.",
    "Season the short rib evenly with the remaining 1½ tablespoons salt and 1 teaspoon pepper. In a second large heavy-bottomed pot, heat the remaining ⅓ cup olive oil over medium-high heat until it is nearly smoking. Working in batches if necessary to avoid overcrowding, add the meat in an even layer and sear until browned on all sides, about 4 minutes total.Using a ladle, carefully remove the excess fat from the pot and discard, leaving behind about 2 tablespoons of fat. Add the wine and simmer until the volume of the liquid is reduced by half, 2 to 3 minutes. Add the chicken stock and bring to a boil over high heat, then reduce the heat to low and simmer. Cover the pot, leaving just a small crack open at the top, and simmer gently until the meat is fork-tender, 1½ to 2 hours. The liquid should be reduced to about half of its original volume and turn dark brown in color.",
    "Meanwhile, keep watching and stirring the vegetable mixture. If the vegetables start to stick or burn, deglaze with up to ¼ cup water, adding 1 tablespoon at a time, and scraping the bottom of the pot to release any stuck or burnt bits. (You may end up repeating this deglazing process two or three times.) Cook the mixture until the vegetables are very soft, a deep golden brown, and about one-quarter of their original volume, 1½ to 2 hours.",
    "When the vegetables are caramelized and the meat is tender, add the vegetables to the pot of meat and stir very well to combine. Stir in the vinegar. The sauce should be thick enough to coat the back of a spoon. If it’s too thin, simmer over low heat until it thickens up, which can take up to 30 minutes.",
    "The sauce is ready to be used at this point, or it can be stored in an airtight container in the refrigerator for up to 1 week, or in the freezer for up to 3 months.",
    "To serve with pasta: In a large pot, bring 4 quarts water and the salt to a boil over high heat. Add the pasta and cook according to the package directions. Drain and add the pasta to the sauce, increase the heat to medium-high, and mix thoroughly with a spoon to coat. Add the butter and pecorino and stir well to combine. Once the butter has melted, remove from the heat. Finish with the lemon juice and parsley, stirring well to combine. Serve immediately."
  ]
}