{
  "title": "Niçoise Sando with Smashed Egg & Black Olive Mayo",
  "source": "Molly Baz - Cook This Book",
  "servings": "Makes 2",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 1 garlic clove",
    "- 1 ripe medium tomato",
    "- ½ cup basil leaves",
    "DAIRY",
    "- 4 large eggs",
    "PANTRY",
    "- ⅓ cup oil-cured black olives",
    "- 6 tablespoons mayonnaise",
    "- 2 (10-inch) soft hoagie rolls",
    "- 1 (6.7-ounce) jar high-quality oil-packed tuna",
    "- Kosher salt and freshly ground black pepper",
    "- 2 tablespoons red or white wine vinegar",
    "- 2 handfuls potato chips"
  ],
  "directions": [
    "1. Cook the eggs:",
    "- Bring a medium pot of water to a boil.- Using a slotted spoon, carefully lower 4 eggs into the water. Set a timer for 9 minutes.- Meanwhile, fill a medium bowl with ice and water. Once the eggs are cooked, transfer them to the ice bath to chill for at least 5 minutes to stop the cooking.",
    "2. Make the olive mayo:",
    "- Smash ⅓ cup oil-cured black olives with the bottom of a measuring cup and discard the pits.- Finely chop the olives and combine them with 6 tablespoons mayo in a small bowl.- Finely grate 1 garlic clove into the olive mayo and mix well to combine. No need to season this mayo, since oil-cured black olives are inherently very salty.",
    "3. Prep your other elements:",
    "- Cut the hoagie rolls in half lengthwise and pull out some of the bread to hollow them slightly so that the ingredients have somewhere to sit.- Drain the oil from 1 (6.7-ounce) jar of oil-packed tuna.- Slice 1 medium tomato about ¼ inch thick. Season the slices with salt and black pepper and set on paper towels to drain (no soggy sandwich!). Wipe down that cutting board.",
    "4. Assemble:",
    "- Slather the olive mayo on all 4 hoagie halves, dividing it evenly.- Peel the eggs. Tear each egg into a few pieces, then place them on the bread. Using the back of a fork, smash each egg down so that it sits more evenly on the sandwich. Season the eggs with salt and black pepper.- Layer the sliced tomatoes on the bottom halves of the sandwiches.- Flake apart the tuna and arrange it in an even layer on top of the eggs. Drizzle 1 tablespoon red wine vinegar over the tuna on each sandwich.- Top with some basil leaves, a handful of potato chips, and the top of the hoagie roll. Press down firmly to compress everything.",
    "5. Wrap and serve: Wrap the sandwiches in parchment paper or foil to keep them tidy, then slice each sandwich in half before serving."
  ]
}