{
  "title": "No-Knead Brioche Sandwich Loaf",
  "source": "Modern Bistro - ATK",
  "servings": "1 loaf",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "1⅔cups (9⅛ ounces) bread flour",
    "1¼teaspoons instant or rapid-rise yeast",
    "¾teaspoon table salt",
    "3large eggs, room temperature, plus 1 large egg, lightly beaten with 1 tablespoon water and pinch table salt",
    "8tablespoons (4 ounces) unsalted butter, melted",
    "¼cup water, room temperature",
    "3tablespoons sugar"
  ],
  "directions": [
    "1 Whisk flour, yeast, and salt together in large bowl. Whisk 3 eggs, melted butter, water, and sugar in second bowl until sugar has dissolved. Using rubber spatula, gently fold egg mixture into flour mixture, scraping up dry flour from bottom of bowl, until cohesive dough starts to form and no dry flour remains. Cover bowl tightly with plastic wrap and let dough rest for 10 minutes.",
    "2 Using greased bowl scraper (or your fingertips), fold dough over itself by gently lifting and folding edge of dough toward middle. Turn bowl 90 degrees and fold dough again; repeat turning bowl and folding dough 2 more times (total of 4 folds). Cover tightly with plastic and let rise for 30 minutes. Repeat folding and rising every 30 minutes, 3 more times. After fourth set of folds, cover bowl tightly with plastic and refrigerate for at least 16 hours or up to 48 hours.",
    "3 Transfer dough to well-floured counter, divide in half, and cover loosely with greased plastic. Using your well-floured hands, press 1 piece of dough into 4-inch round (keep remaining piece covered). Working around circumference of dough, fold edges toward center until ball forms. Repeat with remaining piece of dough. Flip each dough ball seam side down and, using your cupped hands, drag in small circles on counter until dough feels taut and round and all seams are secured on underside. (If dough sticks to your hands, lightly dust top of dough with flour.) Cover dough rounds loosely with greased plastic and let rest for 5 minutes.",
    "4 Grease 8½ by 4½-inch loaf pan. Flip each dough ball seam side up, press into 4-inch disk, and repeat folding and rounding steps. Place rounds seam side down, side by side, into prepared pan. Press dough gently into corners. Cover loosely with greased plastic and let rise until loaf reaches ½ inch below lip of pan and dough springs back minimally when poked gently with your knuckle, 1½ to 2 hours.",
    "5 Adjust oven rack to middle position and heat oven to 350 degrees. Gently brush loaf with egg mixture and bake until deep golden brown and loaf registers 190 to 195 degrees, 35 to 40 minutes, rotating pan halfway through baking. Let loaf cool in pan for 15 minutes. Remove loaf from pan and let cool completely on wire rack, about 3 hours, before serving.",
    "Shaping a Brioche Loaf:",
    "1. Using greased bowl scraper (or your fingertips), gently lift and fold edge of dough toward middle. Turn bowl 90 degrees and repeat 2 more times. Cover tightly with plastic and let rise for 30 minutes. Repeat folding and rising every 30 minutes, 3 more times. After fourth set of folds, cover bowl tightly with plastic and refrigerate for at least 16 hours or up to 48 hours.",
    "2. Transfer dough to well-floured counter, divide in half, and cover loosely with greased plastic. Using your well-floured hands, press 1 piece of dough into 4-inch round. Working around circumference of dough, fold edges toward center until ball forms. Repeat with remaining piece of dough.",
    "3. Grease 8½ by 4½-inch loaf pan. Flip each dough ball seam side up, press into 4-inch disk, and repeat folding and rounding steps. Flip each ball seam side down and, using your cupped hands, drag in small circles on counter until dough feels taut and round and all seams are secured on underside. Cover dough rounds loosely with greased plastic and let rest for 5 minutes.",
    "4. Place rounds seam side down in greased 8½ by 4½-inch loaf pan, side by side. Press dough gently into corners. Cover loosely with greased plastic and let rise, 1½ to 2 hours. Gently brush loaf with egg mixture and bake until deep golden brown and loaf registers 190 to 195 degrees, 35 to 40 minutes, rotating pan halfway through baking."
  ]
}