{
  "title": "Not Yo Mama’s Peanut Butter-Bacon Burger",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes 1 Awesome Burger",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "5ounces ground beef, divided into two 2-inch balls",
    "1teaspoon unsalted butter",
    "Generous ½ teaspoon Lawry’s Seasoned Salt",
    "1Martin’s potato sandwich roll",
    "2bun-size pieces iceberg lettuce",
    "Some thinly sliced red onion",
    "Creamy peanut butter for serving",
    "2strips bacon, cooked however you like your bacon",
    "Ketchup (there is only Heinz) for swiping"
  ],
  "directions": [
    "Set a medium cast-iron skillet over high heat until it’s pretty hot. While the skillet’s heating up, put a beef ball between two pieces of parchment or wax paper and evenly flatten it to make a 6-inch patty. Repeat with the other ball on separate parchment paper.",
    "Add about ½ teaspoon of the butter to the pan and swirl it around. Lower the heat to medium, then add one of the patties and season the up-side liberally with Lawry’s (a generous ¼ teaspoon per patty).",
    "Cook until the first side gets a little brown (you’re not looking for a crust here), 30 to 45 seconds. Flip the patty and cook about 45 seconds more.",
    "Move the patty to a plate and use a roll half to wipe up the buttery drippings, leaving it for a few seconds, so it gets a little toasty. Cook the other patty the same way (the butter, the Lawry’s), but this time, stack the patty on the other patty. Use the other roll half to sop up the drippings and let it get toasty, too.",
    "Here’s how I build it, but no rules apply, as long as you get all the stuff between the buns: On the bun bottom, add the lettuce leaf and some onion. Add the patty stack, then some peanut butter (I go large and use 3 tablespoons, but 2 tablespoons is probably more reasonable) and the bacon (break ’em up to fit on the burger). Swipe some ketchup on the top bun, cap the burger, and eat."
  ]
}