{
  "title": "Not-Spicy Silken Tofu Stew",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Serves 4",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "FOR THE PARSLEY DRESSING:",
    "- 1 cup roughly chopped parsley",
    "- ¼ cup extra-virgin olive oil",
    "- 2 tablespoons toasted sesame oil",
    "- 1½ teaspoons Umami Salt and Pepper",
    "FOR THE STEW:",
    "- 3 tablespoons well-stirred tahini (such as Soom)",
    "- 2 tablespoons unseasoned rice vinegar",
    "- 1 teaspoon soy sauce",
    "- ¼ cup extra-virgin olive oil",
    "- 3 long green chilies, quartered lengthwise and chopped into ½-inch pieces",
    "- 2 garlic cloves, sliced ¼ inch thick",
    "- A fat 2-inch knob ginger, peeled and sliced ¼ inch thick",
    "- ¼ cup dry white wine",
    "- 4 cups Mushroom Stock, homemade or store-bought",
    "- 24 ounces sundubu or soft silken tofu, drained if necessary",
    "- ¾ pound chrysanthemum greens or watercress, woody bottoms trimmed, roughly chopped"
  ],
  "directions": [
    "1. Combine the parsley dressing ingredients in a blender. Pulse until the parsley is mostly submerged in the oil, then blend on high until completely smooth, deep green, and slightly warm, 1 to 2 minutes. Set aside. Dressing keeps in the fridge for up to 1 week.",
    "2. In a small bowl, stir together tahini, rice vinegar, and soy sauce until smooth. Set aside.",
    "3. In a medium heavy pot, heat olive oil over medium-high until shimmering. Add the green chilies and cook until slightly blistered, about 2 minutes.",
    "4. Add garlic and ginger to the pot and cook, stirring, until fragrant, about 1 minute.",
    "5. Add white wine and simmer for 30 seconds. Add the mushroom stock and bring to a boil, skimming any froth.",
    "6. Stir in the tahini mixture and reduce heat to a moderate simmer. Squeeze in sundubu (or spoon in large chunks of silken tofu) and simmer gently without stirring for about 3 minutes, until tofu is heated through.",
    "7. In a mixing bowl, toss the chrysanthemum greens or watercress with the parsley dressing.",
    "8. Serve the stew in bowls topped with the dressed greens."
  ]
}