{
  "title": "Nutella Brownie Pie",
  "source": "Bromabakery.com",
  "servings": "Yield: 16 servings",
  "categories": [],
  "ingredients": [
    "AD",
    "1unbaked 9 inch pie crust (you can use homemade or store bought!)",
    "1/2cup unsalted butter",
    "2/3cup granulated sugar",
    "2large eggs, at room temperature",
    "2/3cup Nutella + about 1/3 cup for swirling",
    "2/3cup all-purpose flour",
    "1/4cup Dutch process cocoa",
    "1teaspoon vanilla",
    "1/2teaspoon salt"
  ],
  "directions": [
    "Place your pie dough on a well floured surface and roll out into a large circle to about an 1/8th of an inch thickness. Place your pie dish face down onto the dough circle and use a sharp knife to cut a border 2 inches wider than the pie dish.",
    "Roll the dough over your rolling pin, until it’s fully wrapped around. Unroll the dough over the dish, centering it. Roll the excess dough on the edges in and under towards the dish, like a sleeping bag. Use your fingers to press the dough, sealing it to create a thick outer crust.",
    "Crimp the dough, making a “v” with two fingers one hand on the outside of the pie crust and the index finger of the opposite hand to make an indent in the pie crust. Repeat around the pie until the entire crust is crimped. Place in the freezer to chill while you make the filling.",
    "While the crust chills, preheat the oven to 375°F and make the Nutella brownie filling.",
    "In a large microwave-safe bowl, combine butter and sugar. Microwave for 30 seconds, then remove and stir with a whisk. Repeat the process 2 more times. Some granules of sugar will remain, but the goal is to get the mixture to a glossy finish.",
    "Allow the mixture to cool slightly, then add in the eggs one at a time, whisking in between each addition. Whisk until the mixture lightens in color slightly, about 2 minutes.",
    "Add in the 2/3 cup Nutella and vanilla extract and mix well.",
    "Add the cocoa powder, flour, and salt. Fold in the flour until just combined.",
    "Pour mixture into prepared pie crust, using a rubber spatula to spread the batter out evenly. Drop the remaining 1/3 cup (the rest of the jar if you’re using a small jar of Nutella) by the tablespoon on top of the brownies. I like to do this like a 5 pattern on dice. Use a butter knife to make big swirls throughout the brownies. Don’t over swirl–you want big ribbons of Nutella!",
    "Bake for 35 to 40 minutes, testing for doneness by inserting a knife into the center of the pie. You’ll know it’s done when the edge is set, but a knife inserted into the middle still comes out with a bit of brownie batter on it.",
    "Place in the fridge to cool for at least 1 hour before serving!"
  ]
}