{
  "title": "Oat Bars",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 24 to 36 bars",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "crust",
    "Nonstick spray",
    "1¾cups (230 grams) all-purpose flour",
    "½teaspoon fine sea or table salt",
    "⅓cup (65 grams) granulated sugar",
    "¾cup plus 2 tablespoons (200 grams) cold unsalted butter",
    "filling",
    "½cup (115 grams) unsalted butter",
    "½cup (100 grams) granulated sugar",
    "¾cup (145 grams) dark-brown sugar",
    "¼teaspoon fine sea or table salt",
    "3large eggs",
    "1½teaspoons vanilla extract",
    "1⅓cups (105 grams) rolled oats",
    "½cup finely shredded coconut, sweetened or unsweetened",
    "1½cups chocolate chips, chopped white or dark chocolate, candy bars, dried fruit, or a mix thereof (with the dried fruit, a mix with chocolate is best or the sweetness of the fruit will be overwhelming)",
    "Powdered sugar, to finish"
  ],
  "directions": [
    "prepare your pan Heat the oven to 350 degrees. Line the bottom of a 9-by-13-inch baking tray (a quarter sheet pan or cake pan is fine) with parchment paper (if using a cake pan, hang the parchment over the sides so the bars are easier to remove). Lightly coat the sides with nonstick spray.",
    "make the crust Combine the flour, salt, and sugar in the bowl of a food processor. Cut the butter into chunks, and add it to the bowl, then run the machine until the mixture forms large clumps—that’s right, just keep running it; it might take another 30 seconds for it to come together, but it will. Transfer the dough clumps to the prepared baking pan and press them evenly across the bottom and ¼ inch up the sides. Bake for 15 to 20 minutes, until very pale golden.",
    "meanwhile, prepare the filling Melt your butter in a medium saucepan over medium heat. Continue to cook the butter, stirring frequently, until golden brown bits form at the bottom, about 5 minutes. Remove from the heat and stir in the sugars and salt. Let cool for 5 to 10 minutes, then whisk in the eggs, one at a time, and the vanilla, and stir in the oats, coconut, and chocolate, fruit, and/or candy.",
    "Pour over the parbaked crust, spreading evenly.",
    "bake the bars Bake for 15 to 20 minutes, until the top is firm and golden and the bars are set or, at most, barely jiggle if shimmied. The bars are much easier to cut cleanly from the fridge, but they are gooiest when warm. Dust with powdered sugar before serving or selling for the prettiest finish.",
    "do ahead Store at room temperature for up to 2 days, or in the fridge for longer."
  ]
}