{
  "title": "Oat and Pecan Brittle Cookies",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Makes about 18 large cookies",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Pecan Brittle",
    "1¼cups coarsely chopped pecans (5 oz / 142g)",
    "¾cup granulated sugar (5.3 oz / 150g)",
    "4tablespoons unsalted butter (2 oz / 57g)",
    "½teaspoon baking soda",
    "½teaspoon Diamond Crystal kosher salt",
    "Cookies",
    "2sticks unsalted butter (8 oz / 227g), cut into tablespoons",
    "1⅓cups all-purpose flour (6.1 oz / 173g)",
    "2teaspoons Diamond Crystal kosher salt (0.22 oz / 6g)",
    "1teaspoon baking soda (0.21 oz / 6g)",
    "2cups old-fashioned rolled oats, not quick-cooking (7 oz / 200g)",
    "¾cup packed dark brown sugar (5.3 oz / 150g)",
    "½cup granulated sugar (3.5 oz / 100g)",
    "2large eggs (3.5 oz / 100g), cold from the refrigerator",
    "1tablespoon vanilla extract"
  ],
  "directions": [
    "Prepare the baking sheets: Line two large rimmed baking sheets with parchment paper and set aside.",
    "Make the dough: In a stand mixer fitted with the paddle attachment, beat the butter on medium until smooth. Add the powdered sugar and salt and pulse the mixer several times to incorporate the sugar, then beat on medium-low until the mixture is light and creamy, about 1 minute. Add the yolks and beat on medium until the mixture is a bit fluffier, about 1 minute more. Add the flour and shredded coconut and mix on low until you have a stiff dough, about 30 seconds more. Scrape down the sides and bottom of the bowl and then pulse the mixer just to make sure everything is well incorporated.",
    "Form the thumbprints: Use a ½-ounce scoop or tablespoon measure to scoop level portions of dough. Roll the portions between your palms to make balls, then place them on the prepared baking sheets, spacing them about 1 inch apart (they don’t spread much during baking). Flatten each ball slightly, then use your thumb or the end of a wooden spoon handle to make a deep impression in the center of each piece of dough, almost but not quite pressing through to the baking sheet. Use your fingertips to widen the impression all the way around so it’s about 1 inch across—the dough will slump a bit in the oven, so the impressions won’t be as deep or wide after baking. If the dough cracks when you’re making the impression, just squeeze it back together.",
    "Chill the dough and preheat the oven: Transfer the baking sheets to the refrigerator and chill until the cookies are very firm to the touch, 15 to 20 minutes. Meanwhile, arrange two oven racks in the upper and lower thirds of the oven and preheat to 350°F.",
    "Bake the cookies: Bake the cookies on the upper and lower racks, switching racks and rotating the sheets front to back after 12 minutes, until they’re golden all over, 20 to 25 minutes total. Remove the baking sheets from the oven and set aside to cool while you make the caramel.",
    "Make the coconut caramel: In a small heavy-bottomed saucepan, combine the granulated sugar, corn syrup, and 3 tablespoons of water (1.5 oz / 43g). Cook over medium heat, stirring with a heatproof spatula until the sugar is dissolved. Bring the mixture to a boil and cook, swirling the pan occasionally instead of stirring, and brushing down the sides with a wet pastry brush to dissolve any sugar crystals, until the syrup turns a deep amber color, 6 to 8 minutes. Immediately remove the saucepan from the heat and slowly stream in the coconut milk, stirring with a heatproof spatula and taking care because the mixture will sputter. Add the coconut oil and salt and stir until smooth. Let the caramel cool, stirring occasionally, until it is thickened but still warm and pourable, 20 to 25 minutes (you can stir it over an ice bath to speed this up).",
    "Fill the thumbprints: Use a teaspoon to carefully drizzle the liquid caramel into the depression of each cookie, filling them as generously as possible. (Alternatively, you can transfer the caramel to a piping bag and use that to fill the cookies for a bit more control.) Let the cookies sit until the caramel is set, about 10 minutes."
  ]
}