{
  "title": "Olive Oil–Poached Zucchini with Grilled Bread and Oregano",
  "source": "Pasta - Missy Robbins",
  "servings": "4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Roasted Garlic:",
    "400g / 4 large heads garlic",
    "14g / 1 Tbsp olive oil",
    "Garlic Butter:",
    "14g / 1 Tbsp olive oil",
    "5g / 1 clove garlic, finely chopped",
    "228g / 1 cup unsalted butter, at room temperature",
    "Peel of ¼ lemon, pith removed and peel finely chopped",
    "Poached Zucchini:",
    "1kg / 6 to 8 large zucchini",
    "18g / 2 Tbsp salt",
    "1.5kg / 7 cups olive oil",
    "150g / 30 cloves garlic",
    "Peels of 5 lemons, pith removed",
    "6 to 8sprigs oregano",
    "To Finish:",
    "4(1-inch-thick) slices country bread",
    "112g / ½ cup olive oil",
    "30g / 6 cloves garlic, thinly sliced",
    "Peels of 2 lemons, pith removed and peels finely chopped",
    "3g / 1½ tsp dried red chile flakes",
    "42g / ¼ cup small salt-packed capers, rinsed",
    "55g / ¼ cup red wine vinegar",
    "Salt, q.b.",
    "10sprigs oregano, leaves removed from stems"
  ],
  "directions": [
    "1. To make the roasted garlic, preheat the oven to 300°F.2. Lay a double layer of aluminum foil large enough to wrap the garlic on your work surface. Place the garlic heads in the center of the foil. Drizzle with the olive oil, then enclose the garlic completely in the foil, sealing all of the edges well.3. Place the foil packet in the oven and roast the garlic until lightly golden and soft enough to mash easily, 1 to 1½ hours. Set the packet aside to cool.4. Unwrap the garlic and cut each head in half horizontally to remove the top quarter.5. Squeeze the garlic from its papery sheaths into a bowl and mash with a fork until creamy. Measure out 90g / 6 Tbsp roasted garlic and set aside until ready to use. Transfer the remainder to an airtight container and refrigerate for up to 1 week for another use.6. To make the garlic butter, place a sauté pan over low heat and add the olive oil. Add the chopped garlic and gently cook until aromatic but without color, 10 to 15 seconds. Remove from the heat.7. Place the butter, sautéed garlic, roasted garlic, and lemon peel in a bowl and fold the ingredients together until well integrated. Set aside until ready to use, or transfer to an airtight container and refrigerate for up to 1 week.8. To make the zucchini, cut them lengthwise into quarters. Cut the quarters into 1-inch cubes.9. Spread the zucchini cubes on a sheet pan and sprinkle evenly with the salt. Let sit at room temperature for about 30 minutes. This will help season the zucchini internally and draw out some of the moisture.10. Place a large saucepan over low heat. Add the olive oil, garlic, lemon peels, and oregano and gently heat until slightly warm and the flavors have come together, 5 to 10 minutes.11. Add the zucchini and gently poach in the olive oil, stirring and testing periodically to check for doneness, 20 to 25 minutes. The zucchini should retain its bright green color and be tender but not mushy.12. Remove the pan from the heat and transfer the zucchini to a sheet pan to cool more rapidly. Reserve the olive oil. Once both the zucchini and olive oil are cool, recombine them and set aside until ready to use. Or combine them, transfer to a container, and refrigerate for up to 5 days, then, when ready to use, remove from the refrigerator and bring to room temperature. (You can speed this up by gently heating the zucchini in the olive oil.)13. To finish, heat a grill to medium or preheat your broiler and position an oven rack closest to the heat source.14. Slather the garlic butter on both sides of each bread slice. Place the bread on the grill or arrange the slices on a sheet pan and place under the broiler. Toast, turning once, until golden brown and slightly crunchy, 1 to 2 minutes on each side.15. Remove the bread from the grill or broiler and place on a wire rack to cool slightly.16. Place a large sauté pan over low heat and add 28g / 2 Tbsp of the olive oil. Add the garlic and gently cook until aromatic but without color, 10 to 15 seconds. Set aside to cool.17. Tear the bread into 1- to 2-inch pieces.18. Remove the zucchini from the olive oil and place it in a large bowl along with the gently cooked garlic, the lemon peels, chile flakes, capers, vinegar, and the remaining 84g / 6 Tbsp olive oil. Toss to combine. Add the torn bread.19. Season with salt q.b. and add most of the oregano leaves, reserving a few for garnish. Toss to combine.20. Divide into bowls and garnish with the remaining oregano."
  ]
}