{
  "title": "Olive Oil Pineapple Upside-Down Cake",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6 to 8",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "3tablespoons unsalted butter, plus more for greasing the pan",
    "67grams (1⁄3 cup) granulated sugar",
    "2tablespoons heavy cream, at room temperature",
    "3⁄4 teaspoon kosher salt",
    "1⁄2 teaspoon vanilla bean paste",
    "One 20-ounce (567 g) can pineapple slices in 100 percent pineapple juice, drained and patted dry",
    "7 or 8maraschino cherries, destemmed",
    "130grams (1 cup) all-purpose flour, plus more for dusting the pan",
    "200grams (1 cup) granulated sugar",
    "120grams (1⁄2 cup) full-fat Greek yogurt, at room temperature",
    "105grams (1⁄2 cup) olive oil, plus more for serving",
    "2eggs, at room temperature",
    "2teaspoons vanilla bean paste",
    "1⁄8 teaspoon pure almond extract",
    "65grams (1⁄2 cup) super-fine blanched almond flour, lightly packed",
    "2teaspoons baking powder",
    "1teaspoon kosher salt"
  ],
  "directions": [
    "1. Preheat the oven to 375°F (190°C). Cut a circle of parchment paper to fit the bottom of a 9-inch (23 cm) round cake pan. Grease the pan with a little butter to help the parchment stick to the bottom. Then grease the pan all over with butter and dust with all-purpose flour.",
    "2. Make the topping: Heat the sugar in a small saucepan over low heat. Cook, stirring, until the sugar melts and then turns a deep amber color, 5 to 7 minutes. (The sugar will clump at first but will then melt and caramelize.)",
    "3. Remove the pan from the heat, and slowly whisk in the butter and cream. (It will bubble up quite a bit!)",
    "4. Return the pot to low heat, and cook, whisking, until everything is bubbly and combined, about 1 more minute. Turn off the heat, and stir in the salt and vanilla bean paste. Immediately pour the caramel into the prepared cake pan, and tilt the pan to cover the bottom with the caramel.",
    "5. Arrange slices of pineapple on top of the caramel. Cut pieces of pineapple as needed to cover the whole pan (except the holes in the center of the pineapple rings). Add cherries in the holes of the pineapple slices. Set the pan aside.",
    "6. Make the batter: Whisk the sugar, yogurt, olive oil, eggs, vanilla, and almond extract in a medium bowl until combined.",
    "7. Add the all-purpose flour, almond flour, baking powder, and salt to a large bowl. Whisk to combine and break up any clumps. Pour in the wet ingredients, and whisk until just combined. Don’t overmix; a few lumps are okay!",
    "8. Pour the batter over the pineapple, and spread out evenly. Bake for 30 to 35 minutes, until a toothpick inserted into the cake comes out mostly clean with a few moist crumbs.",
    "9. Let the cake cool in the pan for 10 minutes and then carefully invert the cake onto a wire rack positioned over a sheet pan or cutting board to catch any drips. If any small pieces of pineapple don’t release, simply press them back onto the cake.",
    "10. Slice and serve the cake warm. Store any cooled leftovers at room temperature in an airtight container for up to 2 days."
  ]
}