{
  "title": "One-Pot Chicken & Schmaltzy Rice with Lemony Yog",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4 to 6",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 1 large white or yellow onion",
    "- 7 garlic cloves",
    "- 2 lemons",
    "- 4 ounces sugar snap peas",
    "- 1 large bunch dill or cilantro",
    "DAIRY",
    "- 2 tablespoons unsalted butter",
    "- 1 cup plain whole-milk yogurt",
    "MEAT",
    "- 2 pounds bone-in, skin-on chicken thighs (about 6 small)",
    "PANTRY",
    "- 1½ cups basmati rice",
    "- Kosher salt and freshly ground black pepper",
    "- ¾ cup roasted, salted pistachios"
  ],
  "directions": [
    "1. Prep the rice:- Place 1½ cups basmati rice in a medium bowl and cover with room-temperature water. Let the rice soak for 30 minutes.",
    "2. Crisp up the chicken:- Pat 2 pounds of chicken thighs dry with paper towels to remove any surface moisture; this will encourage crispiness and browning. Season the chicken thighs all over with 2 teaspoons salt and a few good cranks of black pepper.- Arrange the thighs skin-side down in a large, dry Dutch oven. Set the pot over medium heat and cook, undisturbed, until the skin releases easily from the pot and is light golden brown, 8 to 10 minutes.- Once the chicken skin no longer sticks to the pot, move the chicken thighs around a bit in the pot to ensure even browning and continue to cook until the skin is very crisp and deeply golden brown, 6 to 8 minutes longer. Parts of your pot will get hotter than others, so if some of the thighs seem darker golden brown than the rest, swap them for even cooking. When the chicken skin is very crispy, use tongs to transfer the thighs to a plate, skin-side up.",
    "3. While the chicken cooks, do some prep:- Finely chop 1 large onion.- Finely chop 6 garlic cloves.",
    "4. Drain the rice:- Drain the soaked rice in a fine-mesh strainer, rinsing with cold water and swirling the rice around with your fingers until the water runs completely clear, 1 to 2 minutes. Set the strainer on top of a kitchen towel to drain any additional water.",
    "5. Add the aromatics and toast the rice:- Reduce the heat under the Dutch oven (now with only the chicken fat) to medium-low and stir in the chopped onion. Cook, stirring often, until the onion is translucent and soft, about 6 minutes.- Add the chopped garlic to the pot and cook, stirring, until fragrant, about 1 minute. Season with salt and lots of black pepper.- Stir in the rice and cook, stirring constantly, until the grains turn translucent around the edges, 1 minute.- Add 2 cups water, 2 tablespoons butter, and 1 teaspoon salt and stir to scrape up any bits that are stuck to the bottom of the pot. Bring the water to a boil over medium-high heat. Once the water boils, nestle the chicken thighs back into the pot, skin-side up, along with any accumulated juices. Cover the pot, reduce the heat to low, and cook without removing the lid for exactly 16 minutes. Immediately turn off the heat. Let the rice finish steaming, covered, for 10 minutes.",
    "6. Make the lemony yogurt:- Finely grate the zest of 1 lemon and 1 garlic clove into a small bowl. Stir in 1 cup whole-milk yogurt. Cut the lemon in half. Squeeze in the juice of the lemon halves. Season the yogurt with salt.",
    "7. Chop some stuff:- Cut 4 ounces snap peas crosswise into 1-inch pieces.- Coarsely chop ¾ cup roasted, salted pistachios.- Finely chop the leaves and tender stems from 1 large bunch of dill, discarding the tough stems. You should have about 1 cup chopped.",
    "8. Fluff and finish:- Transfer the chicken to a plate. Fluff the rice with a fork.- Add the snap peas, chopped dill, pistachios, and the juice of the halved lemon, fluffing with a fork as you incorporate them all. Taste and adjust the seasoning as needed. Divide the rice and chicken among shallow serving bowls or plates. Spoon some of the lemony yogurt over top and finish with a few cranks of black pepper."
  ]
}