{
  "title": "One-Pot Chicken with Dates and Caramelized Lemon",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 4 to 6",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "3½- to 4-pound chicken, or 3 pounds bone-in, skin-on chicken thighs or legs",
    "Kosher salt and freshly ground black pepper",
    "4tablespoons olive oil, divided",
    "1lemon, cut into thick slices crosswise, seeds removed",
    "2shallots, halved lengthwise",
    "4–6medjool dates (3 ounces), pitted",
    "4sprigs fresh thyme or oregano, plus more for serving",
    "1cup water",
    "2teaspoons ground Urfa chile, or 1 teaspoon crushed red pepper flakes",
    "Flaky sea salt",
    ""
  ],
  "directions": [
    "1 Preheat the oven to 425°F.2 Season the chicken all over with salt and pepper. Heat 2 tablespoons of the oil in a large (at least 8-quart) Dutch oven over medium-high heat. Place the chicken in the pot breast side up, and using tongs or your hands (be careful!), press lightly to make sure the skin comes into even contact with the pot bottom. This is your chance to brown the legs and render that excess fat! It’s rarely offered in whole-chicken recipes, so take advantage. (If using parts, just sear the chicken skin side down.)3 Cook, without moving, until the chicken is nice and browned, 5 to 8 minutes. Seriously, no peeking! Nothing exciting will happen before 5 minutes, I promise you.4 Add the lemon slices and shallot, maneuvering the chicken however you need so that the slices come into contact with the bottom of the pot. Let everything sizzle in the chicken fat until lightly caramelized, about 2 minutes.5 Add the dates, thyme, and water. Sprinkle the top of the chicken with the Urfa chile and place the lid on. Put the Dutch oven in the oven and roast until the dates are plump, the lemon is jammy, and the chicken is almost but not totally cooked through, 20 to 25 minutes (it will look mostly cooked through and a little anemic from getting covered with the lid).6 Remove the lid and drizzle the chicken with the remaining 2 tablespoons oil and continue to cook until the liquid has reduced by half and the top of the chicken is an illustrious, glistening golden-brown, another 20 to 30 minutes (depending on if you’re using parts or whole bird).7 Let the chicken rest in the Dutch oven for 10 minutes, then transfer to a cutting board and carve. Serve along with the shallot, lemons, and dates, with some more thyme and flaky sea salt sprinkled over."
  ]
}