{
  "title": "Oniony Poppy Seed Dinner Rolls",
  "source": "By Heart - Hailee Catalano",
  "servings": "Makes 15 Rolls",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Onions",
    "3tablespoons unsalted butter",
    "1large yellow onion, small diced",
    "Kosher salt, to taste",
    "Dough",
    "228grams (13⁄4 cups) all-purpose flour",
    "225grams (11⁄2 cups plus 2 tablespoons) bread flour",
    "1tablespoon plus 2 teaspoons granulated sugar",
    "1tablespoon kosher salt",
    "11⁄4 teaspoons instant yeast (I like Saf-instant brand)",
    "250grams (1 cup) whole milk",
    "5tablespoons unsalted butter, at room temperature, plus more for greasing",
    "1tablespoon plus 1 teaspoon poppy seeds, plus more for garnish",
    "Unsalted butter, for greasing",
    "1egg",
    "1tablespoon water",
    "For Finishing",
    "57grams (1⁄4 cup) unsalted butter, melted",
    "Flake salt, for topping"
  ],
  "directions": [
    "1. Make the onions: Melt the butter in a medium saucepan over medium heat. Add the onion, and season with a generous pinch of salt. Cook, stirring occasionally, until the onion is very soft with minimal browning, 8 to 10 minutes. Set aside to cool to room temperature.",
    "2. Make the dough: Add the all-purpose flour, bread flour, sugar, salt, yeast, milk, butter, and poppy seeds to the bowl of a stand mixer fitted with a dough hook. Mix on low to combine.",
    "3. Increase the speed to medium, and mix until the dough is smooth and has pulled away from the sides of the bowl, about 4 minutes. Increase the speed to medium-high, and mix until the dough can be stretched out fairly thin without tearing, 8 to 10 minutes. You may need to hold onto the mixer to stabilize it during this process!",
    "4. Add in about two-thirds (about 5 tablespoons) of the cooled onion mixture, and mix on medium until the onions are fully incorporated, 3 or 4 minutes.",
    "5. Grease a large bowl with butter, transfer the dough to the bowl, cover with plastic wrap, and let rise until it doubles in size, about 2 hours. (This time will depend on how warm your kitchen is, but it shouldn’t take longer than 21⁄2 hours.)",
    "6. Place the dough on a clean surface (not dusted with flour), and divide it into 15 equal pieces. (For perfectly even rolls, weigh the entire batch of dough in grams to get the total weight and then divide that number by 15. That will give you the exact gram measurement for each roll.)",
    "7. Form each piece of dough into a roll by cupping your hand over the dough and using a quick circular motion to form a tight ball.",
    "8. Place the rolls in a buttered 9 × 13-inch (23 × 33 cm) baking dish (metal is ideal, but glass also works!), leaving a bit of space in between each roll.",
    "9. Lightly cover the dish with a kitchen towel, and let the rolls rise until they puff up and nearly double in size, 45 minutes to 1 hour; the rolls will be just about touching. (This time will also depend on how warm your kitchen is, but it shouldn’t take longer than 11⁄2 hours.)",
    "10. Meanwhile, preheat the oven to 375°F (190°C) with a rack positioned in the center.",
    "11. Make the egg wash by whisking together the egg and water in a small bowl until completely homogeneous. Brush the risen rolls all over with the egg wash, and sprinkle the tops with the remainder of the cooked onions (the butter will have solidified, but that is okay!) and a bit more poppy seeds.",
    "12. Bake the rolls for 35 to 45 minutes, until very golden. Brush the hot rolls with the melted butter, being careful not to brush off the onions on top. Sprinkle with flake salt.",
    "13. Let the rolls cool for 5 to 10 minutes before enjoying warm. Store any leftovers in an airtight container for up to 2 days. Toast or reheat in a 350°F (175°C) oven before enjoying."
  ]
}