{
  "title": "Onion Soup Toast, aka Soupe au Sandwich",
  "source": "Joe Beef",
  "servings": "Serves 6 to 8 or two country lunches for 4",
  "categories": [
    "Sandwiches"
  ],
  "ingredients": [
    "For the broth",
    "2tablespoons grapeseed oil or other neutral oil",
    "8bacon slices, cut into matchsticks",
    "4medium onions, thinly sliced",
    "2leek whites, thinly sliced",
    "¼cup (60 ml) sherry vinegar",
    "½cup (120 ml) dry sherry",
    "2tablespoons minced fresh lovage, celery, or flat-leaf parsley leaves",
    "2quarts (2 l) water",
    "1¾pounds (750 g) smoked ham or smoked ham shank",
    "Salt and white pepper",
    "For the cheese sauce",
    "1tablespoon all-purpose flour",
    "1cup (110 g) finely grated Gruyère or Comté cheese",
    "1cup (240 ml) whole milk",
    "2large egg yolks",
    "For the sandwich",
    "Unsalted butter, at room temperature, for the loaf pan",
    "6 to 9slices crustless white bread, toasted",
    "1shallot, minced",
    "4playing card–size slices (2¼ ounces/75 g each) foie gras terrine (see Microwaved Foie Gras, this page)"
  ],
  "directions": [
    "1. To a wide, heavy-bottomed pan, add the grapeseed oil and bacon. Over medium heat, cook the bacon pieces until mildly crisped.",
    "2. Stir in the onions and leeks, and continue to stir well while cooking. It takes a good 20 minutes of cooking and stirring to get to a nice golden retriever color on the alliums.",
    "3. Add the sherry vinegar, dry sherry, and lovage. Stir to combine. Cook for a minute, then add the water and pork chunk, and bring to a boil. Reduce the heat, cover, and simmer gently for 1 hour.",
    "4. Remove the pork from the soup and season the soup with salt and white pepper to taste.5. Strain the broth, reserving the onions and leeks for your loaf. (The broth can be refrigerated now if you are making this ahead of time.) Set aside.",
    "6. Thinly slice the pork chunk.",
    "7. For the sauce: In a bowl, mix the flour and cheese with a fork. In a small pot, bring the milk to a boil. Pour the cheese mixture into the milk and stir until combined; cook briefly until thickened. Whisk in the egg yolks, then set aside.",
    "8. Preheat the oven to 325˚F (160˚C), and generously butter the loaf pan.",
    "9. Build the “sandwich” in the loaf pan: Place a layer of toast on the bottom of the pan to cover. It’s okay to have some overlap, just make sure you’re covering the whole surface of the pan. Next lay down the pork slices, followed by a sprinkling of shallots and the cheese sauce.",
    "10. Lay down another layer of toast, then the foie gras terrine pieces. Squish them to make a nice flat layer, followed by the reserved onions and leeks. Top with a final layer of toast and press well, using a spatula.",
    "11. Pour a few spoonfuls of the broth over the top layer of toast and bake for 30 minutes. Keep the rest of the broth hot until ready to serve.",
    "12. Remove the loaf pan from the oven and, using the spatula again, press the top down lightly to ensure the sandwich comes together nicely. Bake for another 10 minutes, until the top is brown. (At this point, the baked sandwich can be refrigerated in its loaf pan until needed.)",
    "13. To serve, cut the sandwich into 8 slices, approximately 1 inch (2.5 cm) thick. Transfer each slice to a shallow soup bowl and pour the steaming broth from a jug, table side, as they do in fancy restaurants."
  ]
}