{
  "title": "Onion Dip & Oven-Baked Potato Chips",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "6 to 8 (makes 2 cups dip and a whole pile of chips)",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "For the Dip",
    "2tablespoons vegetable oil",
    "1medium onion, finely minced",
    "1teaspoon kosher salt",
    "1teaspoon freshly ground black pepper",
    "1cup sour cream",
    "⅓cup mayonnaise",
    "3tablespoons finely minced chives, plus more for garnish",
    "1½teaspoons garlic powder",
    "For the Chips",
    "2medium russet potatoes (about 1 pound total)",
    "3tablespoons olive oil",
    "1teaspoon kosher salt",
    "1teaspoon freshly ground black pepper, or more to taste"
  ],
  "directions": [
    "MAKE THE DIP: In a medium skillet, heat the oil over medium-high heat. Add the onion and cook, stirring, for 5 minutes. Reduce the heat to medium-low, add ½ teaspoon each of the salt and pepper, and cook, stirring, until the onion is golden and caramelized, 15 more minutes. Remove from the heat and transfer to a bowl. Let cool for 10 minutes.",
    "Add the sour cream, mayonnaise, chives, garlic powder, and the remaining ½ teaspoon each salt and pepper and stir to combine. Chill for at least 1 hour to let the flavors meld. The onion dip can be made up to 3 days ahead; keep refrigerated.",
    "MAKE THE CHIPS: Position racks in the top and bottom thirds of the oven and preheat the oven to 375°F. Line two large baking sheets with parchment paper.",
    "Slice the potatoes on a mandoline into thin-as-a-dime slices. Pat the potatoes dry between two layers of paper towels, then toss them in a large bowl with the olive oil, salt, and pepper. Really use your hands to rub them to make sure the slices get coated in the oil and aren’t stuck to each other.",
    "Separate the slices and arrange them on the lined baking sheets. Bake until golden and crisp, switching racks and rotating the pans front to back halfway through, 12 to 15 minutes (the chips will bake at different rates; the small ones will bake first, so watch ’em). You’ll know when they’re done because they’ll have gotten a little wavy, lifted themselves off the pan, and turned browned in spots. And the potatoes may seem to color unevenly, but they will still be crispy when cooled. Remove from the oven, cool, and serve with the dip.",
    "Of course, you could always use a deep fryer and ditch the sheet pans! If so, fill a pot halfway with vegetable oil (not olive), heat over medium-heat until one slice of potato dropped into the oil sizzles immediately, and fry the chips in batches until golden brown and crispy, 1 to 2 minutes per batch. Drain on paper towels, then salt and pepper the f*ck out of ’em.",
    "If you have potato slices that really vary in diameter, arrange all the small ones on one sheet and the big ones on the other so they cook evenly. You may end up pulling the small ones a minute or two earlier than the big ones.",
    "If you don’t have a mandoline (or are just into fingertip preservation), use a really sharp knife to cut the potatoes."
  ]
}