{
  "title": "Orange Sriracha Chicken",
  "source": "Nomnompaleo.com",
  "servings": "4 servings",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "Chicken:",
    "10chicken drumsticks (about 3½ pounds)",
    "2teaspoons kosher salt (but remember: not all kosher salts are the same: I use Diamond Crystal brand—if you’re using Morton’s kosher salt, use 1 to 1½ teaspoons instead)",
    "Marinade:",
    "1medium yellow onion, roughly chopped",
    "1cup fresh basil leaves, packed",
    "½cup orange juice",
    "4cloves garlic, roughly chopped",
    "1tablespoon fish sauce",
    "1tablespoon balsamic vinegar",
    "1teaspoon tomato paste",
    "½teaspoon freshly ground black pepper",
    "Orange Sriracha Sauce:",
    "½cup orange juice",
    "2tablespoons honey",
    "1tablespoon Paleo Sriracha (hey, hotheads: you can add more, but just know that you’ll be reducing the sauce and therefore concentrating the heat)",
    "1tablespoon ghee",
    "1teaspoon coconut aminos",
    "1teaspoon toasted sesame seeds (optional)",
    "Kosher salt"
  ],
  "directions": [
    "Here’s what you do:",
    "In a large bowl, sprinkle the salt on the chicken, and set aside.",
    "To make the marinade, toss the onion, basil, orange juice, garlic, fish sauce, balsamic vinegar, tomato paste, and pepper in a food processor or high-powered blender.",
    "Purée until smooth.",
    "Pour the mixture over the chicken, making sure that all the drumsticks are well-coated.",
    "Cover and marinate the chicken in the refrigerator for at least an hour and up to 12 hours.",
    "When you’re ready to cook, take the bowl of chicken out of the fridge and preheat the oven to 400°F. Place a wire rack on top of a foil-lined baking sheet.",
    "Transfer the drumsticks to the wire rack. Spoon some extra marinade onto each piece of chicken. Bake for 40 minutes or until cooked through and the skin is golden brown, flipping each piece and turning the baking sheet at the halfway point.",
    "While the chicken’s in the oven, make the Orange Sriracha Sauce. In a small saucepan, stir together the orange juice, honey, sriracha, ghee, and coconut aminos.",
    "Cook over high heat. Once it’s at a boil, turn down the heat to low, and reduce the sauce until it’s thickened (about 3 to 5 minutes).",
    "Taste and—if necessary—season with salt to taste.",
    "After 40 minutes in the oven…",
    "…brush a thin layer of the Orange Sriracha Sauce on each drumstick, and then roast for 5 more minutes.",
    "Then, take the tray out of the oven…",
    "…and use a brush to glaze the chicken with the remaining sauce.",
    "If desired, add a sprinkle of toasted sesame seeds.",
    "The marinade gives these chicken drumsticks a rich, herby under-layer of flavor, while the spicy sriracha and sweet, citrusy notes of the sauce provide a tongue-tingling balance to this umami-packed dish."
  ]
}