{
  "title": "Orange Chicken Roast with Fennel and Shallots",
  "source": "Carolinagelen.substack.com",
  "servings": "4 to 6 servings",
  "categories": [],
  "ingredients": [
    "Marinade",
    "1tablespoon fennel seeds",
    "1tablespoon coriander seeds",
    "1/4cup granulated sugar",
    "1tablespoon kosher salt",
    "I used Diamond kosher salt for this, other salts might be saltier so adjust accordingly",
    "Zest of 2 medium oranges",
    "5sage leaves, finely chopped, about 1 tablespoon chopped",
    "2sprigs tarragon, finely chopped, about 2 tablespoons chopped",
    "2teaspoons Dijon mustard",
    "¼cup extra-virgin olive oil",
    "Roast",
    "4 to 4.5-pound (1.8 to 2kg) whole chicken",
    "¼ to 1/3cup extra-virgin olive oil",
    "2medium Navel oranges (other oranges will work!)",
    "Pick ones with smooth skin (not too porous) that feel juicy (not hard) to a gentle squeeze, similar to a lime, they will be less bitter due to a smaller pith amount. Check the picture below, you’ll want to pick the orange on the left, not the one on the right:",
    "2medium fennel bulbs",
    "2medium shallots",
    "1cup orange juice, can be store-bought or freshly squeezed from 4 medium oranges"
  ],
  "directions": [
    "Make the marinade",
    "In a mortar and pestle grind the fennel and coriander seeds. You can also do this by placing the seeds in between two paper towels, and crushing them with a rolling pin.",
    "To a small bowl, add the sugar, salt and orange zest. Rub everything together using your fingers until the sugar becomes a bright orange color and is very fragrant. Add the spices, the sage, tarragon, mustard, olive oil, and mix with a spoon until combined and paste-like.",
    "Prep the chicken",
    "Pat dry the chicken using paper towels. If the chicken comes stuffed with its neck save that for a chicken stock. Place the chicken breast side down on a cutting board. Using a pair of kitchen shears cut around the spine of the chicken, left and right and save it for stock.",
    "Flip the chicken breast side up on the cutting board. Place your palm on top of the breast and press against it to crack the wishbone and flatten the breast.",
    "Generously spread the marinade all over the chicken in an even layer focusing on the skin, not so much on the cavity. Place the chicken on a cooling rack on top of a plate or tray to catch any juices. Set aside to marinate at room temperature while you take care of the remaining ingredients. It can also be left to marinate in the fridge, overnight, uncovered, for more flavor.",
    "Prep the pan",
    "Heat the oven to 425°F (220°C). Set an oven rack in the center of your oven.",
    "Slice the oranges into 7 to 8 slices per orange, about 1 centimeter or 1/2 inch thick. Discard the orange ends.",
    "Slice the fennel greens off, saving some fronds for plating. Slice each bulb in about 5 to 6 slices, through the root end, then thinly slice the shallots.",
    "To a 9 x 13-inch pan with tall sides (to catch all the drippings) add the olive oil — 1/3 cup if using a 4 pound chicken and a 1/4 cup if using a 4 1/2 pound chicken. The bigger the chicken, the less oil you’ll have to use because you’ll have more fat rendering from the chicken.",
    "Add the oranges in a single layer, then top with fennel and sprinkle the shallots all over. Add the orange juice in the pan. Season with a big pinch of salt.",
    "Place the chicken on top of the fennel, shallots and oranges, breast-side up. Poke the skin all over with a knife or skewers to encourage better fat rendering. Tuck the wings underneath the breast to prevent them from burning.",
    "Cover with a sheet of aluminum foil (making sure it’s not sticking too much on the chicken breast, just loosely tented) and bake for 20 minutes.",
    "After 20 minutes, remove the foil and bake for an additional 30 to 40 minutes, depending on the size of your chicken. Come back to the chicken every 10 minutes or so, and using a spoon, scoop out and drizzle the juices from the pan all over the chicken skin to crisp up. You’ll notice some spots starting to get darker or burn, as soon as you see that, tear up a piece of aluminum foil and cover the spot to prevent it from burning.",
    "Remove the chicken from the pan carve, going with a knife around the bones to carve out the breast, thighs and wings. Plate everything on a large platter with the remaining oranges, fennel, shallots, and pan juices on the side. Sprinkle some flaky salt on top and some fennel fronds.",
    "Optional, but make some stock with the scraps",
    "You’ll be left with lots of scrappy cuts from the chicken and veg, so instead of letting them go to waste, make some stock!",
    "Heat the oven to 425°F. Add the neck, spine, plus any scrappy shallot ends or fennel to a baking sheet. Coat with lots of olive oil and roast for 10 to 15 minutes, until darker in color.",
    "Add everything to a pot and cover with 6 cups of water. Add any other veg scraps you might have on hand (I added some old celery, garlic skins and a carrot) and bring to a boil. Reduce the heat and simmer until reduced in half. Strain and discard all solids. Freeze the stock for later or store in the fridge. It’s a great base for gravy, soups, stews, etc."
  ]
}