{
  "title": "Oven-Roasted Ribs With Peanut-Chipotle Sauce And Peanut–Green Onion Relish",
  "source": "Mesa Grill - Bobby Flay",
  "servings": "8 as an appetizer or 4 as an entrée",
  "categories": [
    "Mesa Grill - Bobby Flay"
  ],
  "ingredients": [
    "Peanut-Chipotle Sauce:",
    "- 2 cups Mesa Grill BBQ Sauce",
    "- ½ cup smooth peanut butter, such as Jif",
    "- ¼ cup soy sauce",
    "- 1½ tablespoons rice wine vinegar",
    "- 2 teaspoons chipotle chile puree",
    "- 1½ tablespoons honey",
    "Ribs:",
    "- ¼ cup canola oil",
    "- 2 racks of pork ribs (12 ribs each)",
    "- Spice rub from Spice-Crusted New York Strip Steaks with Mesa Grill Steak Sauce",
    "- Peanut–Green Onion Relish (recipe follows)",
    "- Kosher salt",
    "- 1 cup soy sauce",
    "- ¼ cup coarsely chopped fresh ginger"
  ],
  "directions": [
    "1. To make the sauce, whisk together the barbecue sauce, peanut butter, soy sauce, vinegar, chipotle puree, and honey until combined. The sauce can be stored in the refrigerator for up to 4 days.",
    "2. Preheat the oven to 500 F.",
    "3. Heat the oil in a large roasting pan over two burners over medium-high heat until shimmering. Season the racks on both sides with salt and season on the top side with the rub. Place in the pan, rub-side down, and cook until golden brown and a crust has formed, 3 to 5 minutes on each side. Remove the racks to a cutting board or baking sheet.",
    "4. Pour any excess oil out of the roasting pan and return to medium-high heat. Combine the soy sauce, 4 cups of water, and the ginger in the roasting pan and bring to a boil. Put a rack into the roasting pan and place the ribs on the rack. Brush with the peanut-chipotle puree.",
    "5. Place in the oven and bake for 1¼ to 1½ hours, basting every 15 minutes, until the meat is falling-off-the-bone tender. Remove from the oven and cut into single ribs; arrange on a platter and sprinkle with the peanut–green onion relish."
  ]
}