{
  "title": "Pad See Ew",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 4",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "12ounces beef sirloin, thinly sliced across the grain",
    "4teaspoons soy sauce",
    "2teaspoons baking soda",
    "3tablespoons sweet dark soy sauce",
    "3tablespoons oyster sauce",
    "4teaspoons Lee Kum Kee Premium Soy Sauce",
    "2teaspoons granulated sugar",
    "¼cup canola oil",
    "3large eggs",
    "3garlic cloves, finely chopped",
    "16ounces fresh flat rice noodles, cut in ½-inch-thick noodles lengthwise",
    "3cups choy sum, coarsely chopped",
    "1cup bean sprouts",
    "4Pickled Chilies, thinly sliced, plus 2 tablespoons of the pickling liquid",
    "¼teaspoon white pepper",
    "½cup chopped fresh cilantro leaves",
    "Thai dried chili flakes, to taste"
  ],
  "directions": [
    "1. Put the beef in a bowl, add the soy sauce and baking soda, and mix to combine well. Let marinate at room temperature for 15 minutes.",
    "2. Whisk together the dark soy sauce, oyster sauce, premium soy sauce, and sugar in a small bowl.",
    "3. Bring a medium pot of water to a boil. Add the beef and cook for 20 seconds, stirring once. Drain the beef, transfer to a large plate in a single layer, and leave in the refrigerator until cooled, about 10 minutes (this will stop the beef from overcooking). This step can be done several hours in advance.",
    "4. Cook the dish in two batches: Heat half of the oil in a large cast-iron pan or flat wok over high heat until the oil begins to shimmer. Add half of the eggs (being careful because it will splatter). Let the eggs sit until they just begin to set, about 30 seconds, then, using a spatula, scramble them. Add half of the garlic and cook for 20 seconds longer. Stir in half of the noodles, beef, and sauce and cook, stirring constantly, for 2 minutes. Add half of the choy sum and cook until it just begins to wilt. Remove from the heat and stir in half of the bean sprouts, chilies, pickling juice, and white pepper and transfer to a shallow bowl or platter. Repeat the process with the remaining ingredients. Garnish with the cilantro and chili flakes."
  ]
}