{
  "title": "Pad Thai",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 4",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "1¼cups Tamarind Paste",
    "¾cup Squid Brand fish sauce",
    "1cup palm sugar",
    "¼cup (packed) light brown sugar",
    "3tablespoons rendered pork fat (not lard) or canola oil",
    "12large shrimp, peeled and deveined",
    "2shallots, thinly sliced",
    "2large eggs",
    "8ounces flat rice noodles, soaked in room-temperature water for at least 25 minutes, until soft, drained well, and cut with scissors",
    "¼cup finely diced preserved radish",
    "¼cup smoked tofu, cut into small dice",
    "¼cup roasted, unsalted peanuts, chopped",
    "¼teaspoon Thai chili flakes",
    "¼cup Chinese chives (or regular chives), finely chopped",
    "1cup raw bean sprouts",
    "2limes, cut into wedges"
  ],
  "directions": [
    "1. Combine the tamarind paste, fish sauce, palm sugar, and brown sugar in a medium saucepan over medium heat and cook just until the sugar has dissolved. Do not boil and do not reduce the mixture. If by chance it reduces, add a splash of water.",
    "2. Heat the pork fat in a large cast-iron pan or wok over high heat. Add the shrimp and sear on one side until golden. Transfer to a plate.",
    "3. Reduce the heat to medium and add the shallots. Cook for 10 seconds, then add the eggs and cook for 20 to 30 seconds to let set, then break up, stirring constantly. Deglaze the pan with some of the sauce. Add the noodles, preserved radish, tofu, 2 tablespoons of the peanuts, and the chili flakes. Stir to coat. Add the shrimp back to pan and add the Chinese chives and ½ cup of the bean sprouts. Cook for 1 minute longer.",
    "4. Transfer the mixture to a platter or bowls. Squeeze 2 of the lime wedges over the top and the remaining 2 tablespoons peanuts, and the remaining ½ cup bean sprouts. Serve with additional lime wedges on the side."
  ]
}