{
  "title": "Pad Thai Carbonara (Bacon & Egg Pad Thai Spaghetti)",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "4",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "For the Sauce:",
    "2½tablespoons sweet soy sauce*",
    "1tablespoon liquid soybean paste**",
    "1½teaspoons fish sauce, plus more to taste",
    "1½teaspoons less-sodium soy sauce, plus more to taste",
    "For the Vegetables and Noodles:",
    "1small head broccoli",
    "3slices thick-cut bacon, cut into 1-inch squares",
    "4cloves garlic, roughly chopped",
    "½teaspoon Thai chile powder (see this page), or to taste",
    "½cup chicken broth, plus more if needed",
    "½pound spaghetti, cooked to al dente, drained, and oiled",
    "2eggs, beaten",
    "2scallions, cut into 1-inch lengths"
  ],
  "directions": [
    "Separate the broccoli crown from the stem. Trim the end off the stem, peel it, and cut it crosswise into ¼-inch-thick coins. Separate the crown into small florets.",
    "In a small bowl, whisk together the sweet soy, soybean paste, fish sauce, and less-sodium soy. This is your sauce.",
    "In a wok or very large sauté pan, cook the bacon over medium heat until just gently crisped (I mean, don’t go crazy; just get most of the fat rendered), 6 to 7 minutes. Add the garlic and chile powder and cook, stirring, for 1 minute. Increase the heat to medium-high, add the sauce, and cook until reduced slightly, about 1 minute. Add the broccoli, splash with half the chicken broth, and cook until just tender, 3 to 5 minutes. Increase the heat to high. Add the spaghetti and the rest of the broth and cook, tossing, until very hot and the sauce is absorbed, 3 to 5 minutes (if it feels too dry, splash in more broth or water a little at a time). Season with additional soy sauce and fish sauce to taste.",
    "Remove the pan from the heat, add the eggs, and toss until the eggs are creamy. Toss in the scallions and serve."
  ]
}