{
  "title": "Pan-Seared Branzino with Anchovy and Herbs",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 2",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Frisée and Branzino",
    "1medium head frisée (about 12 ounces/340 g), core removed and leaves separated",
    "2skin-on branzino fillets (about 5 ounces/142 g each), pin bones and scales removed",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Canola oil, for frying",
    "All-purpose flour, for dusting",
    "Anchovy-Herb Sauce",
    "1⁄2 cup (120 ml) olive oil",
    "1⁄4 cup (15 g) finely chopped fresh dill fronds",
    "1⁄4 cup (15 g) finely chopped fresh parsley",
    "3tablespoons red wine vinegar",
    "6oil-packed anchovy fillets, minced",
    "3scallions, thinly sliced",
    "1garlic clove, finely grated",
    "Freshly cracked black pepper, to taste"
  ],
  "directions": [
    "1. Prepare the frisée: Place the frisée in a large ice bath for a few minutes to crisp. Remove from the ice bath and dry in a salad spinner, or lay out on a kitchen towel to dry completely.2. Make the sauce: Whisk the olive oil, dill, parsley, vinegar, anchovies, scallions, garlic, and pepper in a medium bowl until combined.3. Make the branzino: Using a very sharp knife, score just the skin of each branzino fillet (being very careful not to cut into the flesh) with two or three diagonal slashes down the length of the fillet. This helps prevent the fish from curling while cooking.4. Season the fillets with salt and pepper, and set aside.5. Heat about 1⁄4 inch (6 mm) of canola oil in a 12-inch (30 cm) stainless-steel pan over medium heat. To test if the oil is hot enough, add a small pinch of flour to see if it sizzles.6. Working with one fillet at a time, dust the fish in flour until fully coated, shaking off any excess. Carefully place the fillet in the pan, skin-side down, and immediately press down on the fish gently with a fish spatula to prevent curling. When you feel the fish relax and flatten out, you can release the gentle press.7. Fry until the fish is golden and crispy and releases itself from the pan, 3 or 4 minutes. If you feel like the fish is sticking to the pan while you’re frying, don’t panic; just leave it undisturbed to cook. It will release itself from the pan when it’s ready.8. Carefully flip the fish (away from your body), and cook the second side until golden, 2 or 3 minutes. Transfer the fish to a sheet pan lined with a wire rack.9. Fry the second fillet. You shouldn’t need to add more oil, but if bits of flour in the pan look black or smell burnt, pour out the oil into a heatproof bowl and add fresh oil to the pan. Either way, after cooking, let the used oil cool and then discard it.10. Serve the crispy fish, skin side up, with the frisée on the side, and top everything with the anchovy sauce right before serving. Serve any remaining sauce on the side for extra topping."
  ]
}