{
  "title": "Pan Bagnat (French Tuna Sandwich)",
  "source": "Simplyrecipes.com",
  "servings": "",
  "categories": [
    "French"
  ],
  "ingredients": [
    "1/2small red onion, thinly sliced",
    "2hardboiled eggs, sliced",
    "2anchovy fillets, finely chopped",
    "2(5-ounce) cans oil-packed tuna fish",
    "1/4cup pitted Nicoise or Kalamata olives",
    "1 to 2tablespoon red wine vinegar",
    "210-inch baguettes, or 1 full-sized baguette, cut in half (see Recipe Note)",
    "1garlic clove, peeled",
    "1/4cup olive oil",
    "1/2teaspoon salt",
    "1/8teaspoon pepper",
    "2tomatoes, sliced",
    "12large basil leaves"
  ],
  "directions": [
    "1 Soak the onions: Place the onion slices in a bowl and cover with cold water. Let them soak for at least 10 minutes or up to 30 minutes at room temperature, while you prepare the sandwiches.",
    "2 Make the sandwich filling: In a bowl, combine the tuna, its oil, anchovies, olives and 2 teaspoons of red wine vinegar. Stir gently to keep from mashing the tuna chunks.",
    "3 Prepare the bread: Slice the baguettes along their length to separate the top from the bottom. Remove some of the soft crumb inside the top and bottom of the bread to make room for the filling.",
    "Rub the insides with the garlic clove. Brush with olive oil and sprinkle with vinegar, salt, and pepper.",
    "4 Fill the sandwiches: Distribute the tuna mixture evenly in the bottoms of the baguettes. Top with the red onion, eggs slices, tomatoes and basil. Drizzle with more olive oil, and sprinkle on salt and pepper.",
    "Top the sandwiches with the tops of the baguettes, and wrap each tightly in plastic wrap.",
    "5 Press the sandwiches: Place the wrapped sandwiches side-by-side on the counter and set a cutting board on top. Place a heavy pot or skillet on top, and place a few canned goods inside to weight it down even more.",
    "Press the sandwiches for 10 minutes, turn them over, and continue to press for another 10 minutes on the other side.",
    "6 Slice and store the sandwiches: With the sandwiches still wrapped in plastic, use a serrated knife to cut them into individual servings.",
    "The sandwiches are ready to eat now, or they can be packed into a picnic basket or lunch box and eaten within about two hours from now. The sandwiches taste best at room temperature."
  ]
}