{
  "title": "Pan-Roasted Chicken Parts with Vinegar-Tarragon Sauce",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "1teaspoon cornstarch",
    "1cup chicken broth, divided",
    "½cup cider vinegar",
    "2teaspoons honey",
    "3pounds bone-in chicken pieces (split breasts halved crosswise, drumsticks, and/or thighs), trimmed",
    "1teaspoon table salt",
    "½teaspoon pepper",
    "2teaspoons vegetable oil",
    "1shallot, minced",
    "4garlic cloves, lightly crushed and peeled",
    "1tablespoon unsalted butter, chilled",
    "1tablespoon chopped fresh tarragon"
  ],
  "directions": [
    "1. Adjust oven rack to upper-middle position and heat oven to 450 degrees. Dissolve cornstarch in 2 tablespoons broth in 2-cup liquid measuring cup. Whisk in vinegar, honey, and remaining broth; set aside.",
    "2. Pat chicken dry with paper towels and sprinkle with salt and pepper. Heat oil in 12-inch ovensafe skillet over medium-high heat until just smoking. Cook chicken, skin side down, until well browned, 6 to 8 minutes. Transfer to plate, skin side up.",
    "3. Pour off all but 1 tablespoon fat from skillet and return to medium-high heat. Add shallot and garlic and cook until fragrant, about 30 seconds. Whisk broth mixture to redistribute cornstarch and add to skillet, scraping up any browned bits. Bring to boil and return chicken to skillet, skin side up, along with any accumulated juices. Move skillet to oven and cook until breasts register 160 degrees and drumsticks/thighs register 175 degrees, 10 to 15 minutes.",
    "4. Transfer chicken to serving platter, tent with aluminum foil, and let rest while preparing sauce. Return skillet to medium-high heat (skillet handle will be hot), bring to boil, and cook until sauce is slightly thickened, 5 to 7 minutes. Off heat, whisk butter, tarragon, and any accumulated juices from platter into sauce. Season with salt and pepper to taste. Spoon sauce over chicken and serve."
  ]
}