{
  "title": "Pappardelle with Porcini and Veal Bolognese",
  "source": "Pasta - Missy Robbins",
  "servings": "Servings: 4 to 6",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Ragù",
    "56g / 2 oz dried porcini mushrooms",
    "1.4kg / 6 cups room-temperature water",
    "200g / ½ large fennel bulb",
    "236g / 1 onion",
    "10g / 2 cloves garlic",
    "28g / 2 Tbsp plus 112g / ½ cup olive oil",
    "896g / 2 lb ground veal",
    "220g / 1 cup dry white wine",
    "122g / ½ cup juice from canned San Marzano tomatoes",
    "1fresh bay leaf",
    "2sprigs thyme",
    "2sprigs rosemary",
    "1sprig sage",
    "2g / 1 tsp coriander seed",
    "9g / 1 Tbsp black peppercorns",
    "Salt, q.b.",
    "To Finish",
    "1batch egg dough (this page)",
    "30g / 2 Tbsp unsalted butter, cold and cubed",
    "20g / ¼ cup finely chopped parsley",
    "22g / ¼ cup finely grated parmigiano-reggiano",
    "Whole nutmeg, q.b.",
    "Black pepper, q.b."
  ],
  "directions": [
    "1   To make the ragù, in a bowl, cover the porcini with cool water and soak for about 5 minutes, sloshing the mushrooms around with your hand a few times to remove dirt and other impurities. Drain the porcini, return them to the bowl, add the room-temperature water, and set aside to soften, 30 minutes to 1 hour.",
    "2   Once the mushrooms are fully hydrated and softened, drain them, reserving the water (you should have about 948g / 4 cups water), and finely chop. Set the mushrooms and soaking water aside separately.",
    "3   While the porcini hydrate, fit your meat grinder with the small die. Core the fennel and remove the fronds and stems. Chop the onion and fennel into ½- to 1-inch pieces. Put the onion, fennel, and garlic through the meat grinder. Once ground, gather them in cheesecloth and wring to squeeze out the liquid. This is your soffritto.",
    "4   Place a heavy sauce pot or Dutch oven over medium-high heat and add 28g / 2 Tbsp of the olive oil. Add the veal and sauté, breaking it up with a wooden spoon into small, uniform crumbled pieces, until just cooked through, 5 to 7 minutes. Using a slotted spoon, transfer the meat to a bowl and set aside.",
    "5   Turn the heat down to low and add the remaining 112g / ½ cup olive oil, the soffritto, and the porcini to the pot. Continue to cook, stirring frequently, until softened but without color, 3 to 5 minutes.",
    "6   Add the wine and cook until almost fully evaporated, about 5 minutes.",
    "7   Return the veal to the pot and add the reserved porcini liquid and the San Marzano juice.",
    "8   Make a sachet with cheesecloth for the bay leaf, thyme, rosemary, sage, coriander seed, and peppercorns. Add to the veal and porcini mixture.",
    "9   Cook the sauce over low heat for 2 to 3 hours. The flavors should be melded and the meat fully softened.",
    "10   Remove from the heat and season with salt q.b. Measure out 606g / 2¼ cups ragù and set aside. Transfer the remainder to an airtight container and refrigerate for up to 5 days or freeze for up to 1 month for another use.",
    "11   To finish, following the instructions for pappardelle on this page, make 624g / 1 lb 6 oz with the pasta dough.",
    "12   Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "13   Place a large sauté pan over medium-low heat. Add the ragù.",
    "14   Add the pappardelle to the water and cook for 1 to 2 minutes, until tender but not soft.",
    "15   Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Add the butter and 1 ladle (55g / ¼ cup) pasta cooking water and alternate tossing and folding the pasta and sauce together with a wooden spoon for about 1 minute to marry. If the sauce begins to tighten, add a splash of pasta cooking water to loosen and continue tossing and folding to marry. Add the parsley and fold or toss to integrate. The ragù should nicely coat the pasta without clumping.",
    "16   Divide the pasta into bowls and garnish with the parmigiano and with grated nutmeg and pepper q.b."
  ]
}