{
  "title": "PasTINA and Mini Meatball Soup",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 to 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "1⁄2 recipe meatball mix from Tina’s Meatballs",
    "Olive oil, for searing and drizzling",
    "3garlic cloves, finely minced",
    "2celery stalks, small diced",
    "1small fennel bulb, cored and small diced (fronds reserved for topping)",
    "1medium yellow onion, small diced",
    "Kosher salt and freshly cracked black pepper, to taste",
    "2tablespoons tomato paste",
    "6cups (1.4 L) chicken broth, homemade or store-bought",
    "2dried bay leaves",
    "1⁄2 cup (90 g) dry pastina",
    "1medium bunch (about 12 ounces/340 g) dandelion greens, tough stem end removed and roughly chopped",
    "Grated pecorino Romano, to taste",
    "Lemon zest, to taste"
  ],
  "directions": [
    "1. Using oiled hands, form the Tina’s Meatballs mixture into very tiny meatballs, about 1 teaspoon (7 g) each.",
    "2. Coat the bottom of a large pot with olive oil, and heat over medium-high heat. Working in two batches, add half of the meatballs to the pot, and sear on one side until golden, 2 to 4 minutes. Use a small spoon or offset spatula to carefully flip over the meatballs, and brown the other side for another 1 or 2 minutes. Transfer the meatballs to a plate. (The meatballs will not be fully cooked at this point; they will finish in the soup.) Repeat with the second half of the meatballs, adding more oil to the pot as needed.",
    "3. Reduce the heat to medium, and add more oil to the pot, if needed. Add the garlic, celery, fennel, and onion, and cook until softened, 5 to 7 minutes. Season with salt and pepper.",
    "4. Stir in the tomato paste, and cook until slightly brown, 1 or 2 minutes. Add the chicken broth and bay leaves. Bring to a boil and then reduce the heat to medium-low for a light simmer. Add the meatballs, and simmer for 10 minutes.",
    "5. Increase the heat to medium, and bring the soup back to a boil. Stir in the pastina, and cook, maintaining a steady but not rapid boil, until the pastina is cooked through, 6 or 7 minutes. Stir every now and then to ensure the pastina isn’t sticking to the bottom of the pot. Remove the bay leaves.",
    "6. Reduce the heat to low, and add the dandelion greens. Cook until the greens wilt, 2 or 3 minutes. Season with salt and pepper.",
    "7. Serve topped with pecorino Romano, lemon zest, the reserved fennel fronds, pepper, and a drizzle of olive oil."
  ]
}