{
  "title": "Pasta with Sausage and Broccoli",
  "source": "The Food of Sicily - Fabrizia Lanza",
  "servings": "Serves 4 to 6",
  "categories": [
    "Italian",
    "The Food of Sicily - Fabrizia Lanza"
  ],
  "ingredients": [
    "- Fine sea salt",
    "- 1 pound (750 g) broccoli or broccolini",
    "- 6 tablespoons (90 ml) olive oil, plus more as needed",
    "- ⅓ cup (35 g) skin-on almonds, blanched and peeled",
    "- Freshly ground black pepper",
    "- 12 ounces (340 g) uncooked Italian fennel sausage",
    "- 1 cup (240 ml) white wine",
    "- 1 medium yellow onion, finely chopped",
    "- 2 garlic cloves, finely chopped",
    "- 1 pound (450 g) dried pasta, such as busiate, fusilli, rigatoni, or penne rigate",
    "- Thinly shaved ricotta salata cheese, for serving"
  ],
  "directions": [
    "1. Bring a pot of lightly salted water to a boil. While the water heats up, trim the broccoli, discarding any tough, woody ends. Cut off the florets and set them aside. Cut the stems and any tender leaves into bite-size pieces.2. First, add just the stems to the boiling water and cook until they are just tender, about 2 minutes. Add the florets and leaves to the boiling water and cook until they turn bright green, 1 to 2 minutes. Use a slotted spoon to transfer all of the broccoli to a colander. (Reserve the pot and the cooking water for the sauce and the pasta.)3. In a food processor, combine the broccoli, 3 tablespoons of the olive oil, the almonds, a pinch each of salt and pepper, and ¼ cup (60 ml) of the reserved cooking water. Puree until smooth. If it’s too thick to blend, add another splash of cooking water and a drizzle of oil. Taste and season with salt and pepper. Set aside.4. In a large heavy skillet, cook the sausage in 1 tablespoon of the olive oil over high heat, breaking it up with a spoon, until it is starting to brown, about 8 minutes. Transfer it to a bowl and set aside.5. Return the skillet to medium heat. Pour in ½ cup (120 ml) of the wine and simmer for about 1 minute, scraping the bottom of the skillet with a wooden spoon to deglaze the pan, and then pour the pan juices over the browned sausage in the bowl.6. Return the skillet to medium heat and cook the onion in the remaining 2 tablespoons olive oil until softened, about 5 minutes. Add the garlic and cook, stirring constantly, for 30 seconds. Stir in the sausage along with its juices and the remaining ½ cup (120 ml) wine. Simmer for about 15 minutes, adding a splash of broccoli cooking water if the mixture starts to stick to the pan.7. Meanwhile, top up the pot of cooking water as needed and bring to a boil. Add the pasta and cook until al dente.8. Reserving 1 cup (240 ml) of the cooking water, drain the pasta and add to the skillet with the sausage. Pour in the broccoli mixture, increase the heat to high, and toss gently to coat the pasta in the sauce, adding a little cooking water if needed to lighten the sauce.9. To serve, divide the pasta among shallow bowls and top with some thinly shaved ricotta salata."
  ]
}