{
  "title": "Pasta alla Norcina with Roasted Squash",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 to 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "1small butternut squash (about 24 ounces/680 g), peeled and cut into 1⁄2-inch (1 cm) cubes",
    "Olive oil, for drizzling",
    "Kosher salt and freshly cracked black pepper, to taste",
    "1pound (454 g) hot Italian sausage (4 or 5 links), casing removed if needed",
    "3garlic cloves, thinly sliced",
    "2large shallots, minced",
    "1⁄4 teaspoon freshly grated nutmeg, plus more for topping",
    "3⁄4 cup (180 ml) dry white wine",
    "1cup (240 ml) heavy cream",
    "1pound (454 g) dry mezze rigatoni",
    "1⁄2 cup (55 g) freshly grated pecorino Romano, plus more for serving"
  ],
  "directions": [
    "1. Preheat the oven to 425°F (220°C). Line a sheet tray with parchment paper.2. Place the squash in a medium bowl. Drizzle liberally with olive oil, season with salt and pepper, and toss to coat. Spread out on the sheet tray.3. Roast the squash, tossing halfway through the cooking time, until tender and caramelized but not mushy, 30 to 35 minutes.4. Bring a large pot of water to a boil over high heat.5. Meanwhile, heat another large pot over medium-high heat. Coat the bottom of the pan with a thin layer of olive oil. Add the sausage, and cook, breaking up the meat into bite-size chunks, until browned, 6 to 8 minutes. (The sausage won’t be fully cooked.)6. Reduce the heat to medium, and add the garlic, shallots, and nutmeg. Cook, stirring occasionally, until the shallots are translucent and the garlic is soft, 3 or 4 minutes.7. Deglaze the pan with the wine, and scrape up any brown bits from the bottom of the pan. Cook until the wine is reduced by half, 1 or 2 minutes.8. Add the cream, bring to a simmer, and reduce the heat to very low to keep the sauce warm while the pasta cooks, about 10 minutes.9. Generously salt the boiling water from step 4, and drop in the mezze rigatoni. Cook according to the package directions until al dente. Drain the pasta, reserving at least 2 mugsful of pasta water, and add it to the pot with the sausage.10. Add a splash of pasta water and pecorino Romano to the pot, and toss to combine. Cook, adding splashes of pasta water as needed, until the sauce coats the pasta nicely, 1 or 2 minutes.11. Turn off the heat, and gently stir in the squash. Season with salt and pepper.12. Serve, topped with more pecorino Romano and a small grating of fresh nutmeg."
  ]
}