{
  "title": "Pastrami Roast Chicken with Schmaltzy Onions & Dill",
  "source": "Molly Baz - Cook This Book",
  "servings": "4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "2large red onions",
    "2whole garlic heads",
    "½cup dill leaves",
    "MEAT",
    "1(3½- to 4-pound) whole chicken",
    "PANTRY",
    "5tablespoons extra-virgin olive oil",
    "Kosher salt",
    "1teaspoon freshly ground black pepper",
    "1tablespoon sweet paprika",
    "1tablespoon light brown sugar",
    "Dijon mustard, for serving",
    ""
  ],
  "directions": [
    "① Position a rack in the middle of your oven. Preheat the oven to 450°F.",
    "② Get your mise on:",
    "✦Cut 2 large onions in half through the root end and slice into ¾-inch-thick wedges. Scatter the onions in a 12-inch cast-iron pan (or on a large rimmed baking sheet).",
    "✦Cut 2 heads of garlic in half crosswise and nestle them into the onions, cut-sides down, skins and all.1",
    "✦Drizzle 3 tablespoons olive oil all over the onions and garlic and season with 1 teaspoon salt, tossing to coat.",
    "③ Season the chicken:",
    "✦Pat the chicken dry with paper towels.2",
    "✦In a small bowl, combine 4 teaspoons salt, 1 teaspoon black pepper, 1 tablespoon paprika, 1 tablespoon brown sugar, and 2 tablespoons olive oil, mixing with your fingertips until a paste forms.3",
    "✦Place the chicken breast-side up on top of the onions in the skillet. Rub the paste evenly over the chicken, making sure to hit all the nooks, crannies, and undersides.4",
    "④ Roast the chicken:",
    "✦Transfer the skillet to the oven, with the legs toward the back of the oven, and roast 50 to 65 minutes, giving the onions a stir once or twice after at least 30 minutes for more even cooking. The chicken is done when the skin is deeply golden brown and the thickest part of the leg registers 165°F on an instant-read thermometer. If the rub is getting too dark, lightly tent the darkest areas with aluminum foil for the remainder of the cook time.",
    "✦Remove the skillet from the oven and let it rest 15 to 20 minutes.5 Using tongs, tilt the chicken to allow the juices from the cavity to drip into the skillet, then transfer the chicken to a large cutting board.",
    "⑤ Serve:",
    "✦Stir ½ cup dill leaves into the onions and garlic in the pan.",
    "✦Carve the rested chicken, removing the legs from the carcass first, then the breast and wings. Slice the breasts crosswise into ½-inch-thick pieces and cut between the drumstick and thigh to separate them. No idea what I’m talking about? No problem. Pull up this video for a quick carving tutorial. It will all make a lot more sense. Return the chicken to the skillet, on top of the onion mixture, and serve with Dijon mustard for slathering.",
    ""
  ]
}