{
  "title": "Pastry Cream",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Makes: 2½ cups",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "2cups whole milk (16 oz / 456g)",
    "Seeds scraped from ½ vanilla bean or 1½ teaspoons vanilla extract or paste",
    "½teaspoon Diamond Crystal kosher salt",
    "½cup sugar (3.5 oz / 100g)",
    "¼cup cornstarch (1 oz / 30g)",
    "5large egg yolks (2.8 oz / 80g)",
    "6tablespoons unsalted butter (3 oz / 85g), cut into ½-inch pieces, chilled"
  ],
  "directions": [
    "Set up the sieve: Place a fine-mesh sieve over the top of a large heatproof bowl and set aside.",
    "Infuse the milk: Combine the milk, vanilla seeds and pod, and salt in a medium, heavy-bottomed saucepan. Set the saucepan over medium-low heat and let the mixture come slowly to a simmer, whisking occasionally, to allow the vanilla to infuse the milk.",
    "Beat the sugar, cornstarch, and yolks: While the milk is heating, combine the sugar, cornstarch, and yolks in a large bowl. Whisk vigorously until the mixture is very pale, light in texture, and thick, about 2 minutes (it will seem too thick to whisk at first but will thin out as you work it). Using a ladle and whisking constantly, slowly stream about half of the hot milk into the bowl with the egg mixture (this gradually raises the temperature of the eggs so they don’t curdle). Whisking constantly, quickly stream the egg mixture back into the saucepan with the remaining warm milk.",
    "Cook the pastry cream: Increase the heat to medium and continue to cook, whisking constantly, until the foam has subsided and the pastry cream is thick like pudding and easily holds the marks of the whisk, about 3 minutes (but possibly several minutes longer depending on the strength of your stove and the sturdiness of your saucepan). It’s important that the mixture comes to a boil in order to activate the cornstarch, but at the same time you don’t want to overcook the pastry cream—when you pause whisking for about 5 seconds, a few thick bubbles should form beneath the surface and then pop. If this isn’t happening or the cream isn’t thickening, raise the heat slightly and keep whisking, pausing every 30 seconds to check if it’s bubbling.",
    "Strain and incorporate the butter: Scrape the cooked pastry cream into the mesh sieve and use the whisk to press the mixture through the mesh into the bowl below (discard any solids). Whisk the cold butter into the hot pastry cream one piece at a time until smooth. Press a sheet of plastic wrap directly onto the surface of the pastry cream and refrigerate until it’s cold, at least 4 hours."
  ]
}