{
  "title": "Pea Tortellini In Parmesan Broth",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 8 servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "broth",
    "12ounces (340 grams) Parmesan rinds",
    "12cups (2¾ liters) water",
    "1large onion, quartered or roughly chopped",
    "4unpeeled garlic cloves, lightly smashed",
    "2teaspoons peppercorns",
    "Large handful of fresh flat-leaf parsley",
    "½teaspoon kosher salt, plus more to taste",
    "tortellini",
    "1cup (150 grams) cooked peas, cooled",
    "½cup (125 grams) ricotta",
    "½cup (65 grams) grated Parmesan",
    "½teaspoon kosher salt",
    "Several grinds of black pepper",
    "A few fine gratings of lemon zest",
    "2teaspoons (10 ml) lemon juice",
    "Two 48-count packages of wonton skins or wrappers",
    "to serve",
    "A handful of pea shoots, for garnish (optional)",
    "Olive oil and Parmesan, for serving"
  ],
  "directions": [
    "make the broth Place all the ingredients in a large wide pot and simmer, partially covered, for 1 to 1½ hours. Strain the broth; you should have about 8 cups.",
    "meanwhile, make the tortellini In a food processor or blender, pulse the peas with the ricotta, Parmesan, salt, pepper, zest, and juice until the peas are chopped but not fully puréed, scraping down the bowl once or twice. Taste, and adjust the seasonings. If you don’t have a food processor or blender, simply mash the peas well in a bowl before stirring in the other ingredients.",
    "Trim the stack of wonton wrappers down to 2-inch squares. (The scraps make impromptu/makeshift fresh noodles.) Get a small dish of water you can dip your fingers into. Place one wonton wrapper near it on your work surface, and keep the others covered so they don’t dry out. Use your finger to dab water around the circumference. Dollop just about ½ teaspoon filling in the middle, then fold the wrapper diagonally over the dough, pressing out as much air as you can as you seal it. Dab the corners with more water and, wrapping them around your small finger, seal them together. Fold down the opposite corner, napkinlike. Repeat with the remaining wonton skins and filling. You may find that placing the filling in a sandwich bag with the corner snipped off to make a makeshift piping bag makes the filling process easier.",
    "finish the soup Bring your broth back to a simmer, and add half the tortellini. Cook until they float to the surface, 2 to 3 minutes. Remove the tortellini with a slotted spoon to a bowl briefly as you repeat with second half.",
    "to serve Return the cooked tortellini to the pot and ladle broth over them to rewarm them. Ladle them into shallow bowls, and swirl in a few pea shoots, if using. Drizzle with a little olive oil, and sprinkle with Parmesan.",
    ""
  ]
}