{
  "title": "Peach Tarte Tatin",
  "source": "Modern Bistro - ATK",
  "servings": "Serves: 8",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "3Tablespoons Unsalted Butter, Softened",
    "½Cup (3½ Ounces) Plus 2 Tablespoons Sugar, Divided",
    "¼Teaspoon Table Salt",
    "2Pounds Ripe but Firm Peaches, Peeled, Pitted, and Quartered",
    "1Recipe All-Butter Pie Dough, Rolled and Chilled",
    "1Tablespoon Bourbon (Optional)"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 400 degrees. Smear butter over bottom of 10-inch ovensafe skillet. Sprinkle ½ cup sugar over butter and shake skillet to distribute sugar in even layer. Sprinkle salt over sugar. Arrange peaches in circular pattern around edge of skillet, nestling fruit snugly. Tuck remaining peaches into center, squeezing in as much fruit as possible (it is not necessary to maintain circular pattern in center).",
    "2. Place skillet over high heat and cook, without stirring fruit, until juice is released and turns from pink to deep amber, 8 to 12 minutes. (If necessary, adjust skillet’s placement on burner to even out hot spots and encourage even browning.) Remove skillet from heat. Carefully slide prepared dough over peaches, making sure dough is centered and does not touch edge of skillet. Brush dough lightly with water and sprinkle with remaining 2 tablespoons sugar. Bake until crust is very well browned, 30 to 35 minutes. Transfer skillet to wire rack set in rimmed baking sheet and let sit until cool enough to handle, 20 to 30 minutes.",
    "3. Place inverted platter on top of crust. With your hand firmly securing platter, carefully tip skillet over bowl to drain juice (skillet handle may still be hot). When all juice has been transferred to bowl, return skillet to wire rack, remove platter, and shake skillet firmly to redistribute peaches. Carefully invert tart onto platter, then slide tart onto wire rack. (If peaches have shifted during unmolding, gently nudge them back into place with spoon.)",
    "4. Pour juice into now-empty skillet (handle may be hot). Stir in bourbon, if using, and cook over high heat, stirring constantly, until mixture is dark and thick and starting to smoke, 2 to 3 minutes. Return mixture to bowl and let cool until mixture is consistency of honey, 2 to 3 minutes. Brush mixture over peaches. Let tart cool for at least 20 minutes. Cut into wedges and serve."
  ]
}