{
  "title": "Peach Melba Tart",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "1cup granulated sugar (7 oz / 200g)",
    "½cup dry white wine (4 oz / 113g)",
    "1teaspoon vanilla extract",
    "Pinch of kosher salt",
    "1lemon, halved crosswise",
    "1½lb (680g) firm ripe peaches (about 6–10 small), halved, skins and pits left on",
    "½recipe Rough Puff Pastry (this page) or 1 sheet thawed frozen store-bought puff pastry",
    "All-purpose flour, for rolling out",
    "1large egg, beaten",
    "6ounces (170g) raspberries (about 1⅓ cups)",
    "Pastry Cream (this page)"
  ],
  "directions": [
    "Poach the peaches: In the bottom of a large Dutch oven or straight-sided skillet, combine the sugar, wine, vanilla, salt, and 2 cups of water (16 oz / 454g). Squeeze the lemon halves into the Dutch oven and toss the rinds in as well. Set the Dutch oven over medium heat and stir occasionally until the sugar is dissolved. Bring the poaching liquid to a very gentle simmer, then add the peach halves cut-sides up, arranging them in a single layer so they are all submerged. Continue to cook over medium heat until the poaching liquid comes back to a simmer and is bubbling very gently, about 4 minutes. Remove the Dutch oven from the heat and turn the peaches over. Cover the Dutch oven and set aside to allow the peaches to poach gently as the mixture cools.",
    "Preheat the oven: Arrange an oven rack in the center position and preheat the oven to 400°F.",
    "Roll out the pastry and form the crust: Let the pastry sit at room temperature for about 5 minutes to soften. Roll out on a lightly floured surface, dusting over top and underneath with more flour as needed, to a large rectangle measuring about 15 × 11 inches and ⅛ inch thick.",
    "If you’re using thawed frozen puff pastry, roll out the pastry on a lightly floured surface to the same dimensions. Transfer the pastry to a parchment-lined rimmed baking sheet and trim with a knife to straighten the edges so you have a squared-off rectangle measuring about 14 × 10 inches. Slice off ½-inch-wide strips of pastry from all four sides of the rectangle. Brush around the border of the pastry rectangle with some of the beaten egg, then place the strips over the egg wash, aligning them so they’re flush with the edges of the rectangle. Trim off any overhang at the corners, then press along the borders to help the pastry adhere to itself. Brush the borders with more egg wash, then use a fork to prick the surface of the pastry all over.",
    "Bake the pastry: Bake the pastry until the surface is puffed and deep golden brown all over, 20 to 25 minutes. Remove from the oven and press down on the surface of the pastry with the back of a spoon to flatten if it’s puffed up in places. Let cool completely.",
    "Peel and pit the peaches: Meanwhile, remove the peaches from the cooled poaching liquid one piece at a time and gently peel the skin away from the flesh and discard. With truly ripe in-season peaches, this should happen easily. Gently pull out any pits and discard. Transfer the peeled and pitted halves to a plate. Reserve ¼ cup of the poaching liquid (if you have more fruit poaching to do down the road, reserve and chill the remaining poaching liquid; it’s super flavorful!).",
    "Crush the raspberries: In a small bowl, combine half the raspberries and the ¼ cup reserved poaching liquid and crush the berries with the back of a spoon until you have a saucy consistency. Fold in the remaining berries and set aside.",
    "Assemble the tart: Whisk the pastry cream until smooth, then spoon between 1½ and 2 cups onto the surface of the pastry (don’t use all the pastry cream, or you’ll overfill the tart; save any leftover for serving with other summer fruits). Spread the pastry cream all the way to the edges in an even layer, then arrange the peach halves over the pastry cream (you may have one or two peach halves left over). Spoon the raspberry mixture over the peaches and serve immediately, or chill the tart, loosely covered, until ready to serve."
  ]
}