{
  "title": "Peanut Butter and Concord Grape Sandwich Cookies",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Makes about 30 sandwich cookies",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "2½cups all-purpose flour (11.4 oz / 325g)",
    "½teaspoon baking soda",
    "1½teaspoons Diamond Crystal kosher salt (0.16 oz / 5g), plus more for sprinkling the tops",
    "2sticks unsalted butter (8 oz / 227g), at room temperature",
    "½cup packed light brown sugar (3.5 oz / 100g)",
    "½cup granulated sugar (3.5 oz / 100g), plus more for sprinkling the tops",
    "1cup natural crunchy peanut butter (9 oz / 260g)",
    "2large eggs (3.5 oz / 100g)",
    "1teaspoon vanilla extract",
    "Concord Grape Jam (recipe follows)"
  ],
  "directions": [
    "Mix the dry ingredients: In a medium bowl, whisk together the flour, baking soda, and 1½ teaspoons of the salt. Set aside.",
    "Cream the butter, sugars, and peanut butter: In a stand mixer fitted with the paddle attachment, beat the butter, brown sugar, and ½ cup of the granulated sugar on medium speed, scraping down the sides occasionally, until the mixture is light and just a little bit fluffy, about 2 minutes. Add the peanut butter and continue to mix on medium until the mixture is smooth and creamy, about 1 minute.",
    "Add the eggs and dry ingredients: Add the eggs one at a time, beating well and scraping down the sides after each addition until the mixture is smooth. Turn off the mixer, add all of the flour mixture and the vanilla, and pulse the mixer on low just to incorporate the flour. Gradually increase the mixer to medium and beat, scraping down the sides if necessary, until you have a thick, smooth, homogenous dough, about 30 seconds.",
    "Form the dough into logs: Divide the dough in half and, using two sheets of parchment paper, roll each half into a tight, even 2-inch-thick cylinder. Wrap the logs in plastic and refrigerate until the dough is firm, at least 2 hours or up to 2 days. (This would be a good time to make the Concord grape jam.)",
    "Preheat the oven and prepare the baking sheets: Meanwhile, arrange two oven racks in the upper and lower thirds of the oven and preheat to 350°F. Line two rimmed baking sheets with parchment paper.",
    "Slice and punch out the cookies: Remove one log of dough from the refrigerator and unwrap. Place on a cutting board and use a sharp knife to trim off the ends. Slice the dough crosswise into ⅛-inch-thick coins, trying to make them as thin as possible but, more importantly, trying to get them the same thickness so they bake evenly. Rotate the log every couple of slices to maintain a cylindrical shape. Transfer each slice to a prepared baking sheet, spacing them about 1 inch apart. You should get about 30 slices per log, enough to fill both sheets. To make Linzer cookies instead of regular sandwich cookies, use a ¾-inch cutter to punch out the centers of half of the cookies—these will be the “tops.” Sprinkle the “tops” (or half the cookies if you’re not making Linzers) with sugar and just a few extra grains of salt.",
    "Bake and repeat: Bake the cookies on the upper and lower racks until lightly browned around the edges, 13 to 15 minutes, switching racks and rotating the sheets front to back after 10 minutes. Remove from the oven and let cool completely. Repeat the slicing and baking process with the second log of dough.",
    "Fill the cookies: Stir the Concord grape jam to loosen it and smooth out any lumps. If making Linzers, turn the “bottom” cookies with no cutout (or, if not, the un-sugared cookies) over and spread a thin layer of jam all the way to the edges. Top with the remaining “tops” for Linzers (or regular sugared cookies) and press gently so the cookies adhere."
  ]
}