{
  "title": "Peanut Butter Shortbread Bars",
  "source": "Sugarspunrun.com",
  "servings": "Serving: 1",
  "categories": [
    "Bars"
  ],
  "ingredients": [
    "Shortbread Crust",
    "1cup unsalted butter softened (226g)",
    "⅓cup sugar (70g)",
    "⅓cup light brown sugar tightly packed (70g)",
    "1large egg yolk",
    "¾teaspoon vanilla extract",
    "½teaspoon salt",
    "2 ¼cups all-purpose flour (260g)",
    "Peanut Butter Fudge",
    "2cups creamy peanut butter (475g)",
    "½cup butter cut into about 8 pieces (113g)",
    "1teaspoon vanilla extract",
    "2 ¼cups powdered sugar (260g)",
    "1Tablespoon milk (15ml)",
    "Chocolate Ganache",
    "2cups semisweet chocolate chips (340g)",
    "½cup heavy cream (120ml)",
    "½teaspoon vanilla extract",
    "sea salt for sprinkling"
  ],
  "directions": [
    "Shortbread Layer",
    "Preheat oven to 350F (177C) and line a 13x9 baking pan with parchment paper.",
    "Using an electric mixer, beat butter and sugars until well creamed, about 30 seconds.",
    "Add egg yolk and vanilla extract and stir well, pausing to scrape down the sides and mixing until ingredients are well-combined.",
    "Add flour gradually (about ½ cup at a time), pausing to scrape down sides of bowl. Halfway through the addition of the flour, sprinkle in the salt with the beater still running.",
    "Don't over-beat the dough, you want it to be slightly crumbly to make it easier to press into the pan.",
    "Drop dough over prepared pan and gently, evenly, press dough into the bottom of the pan. To make it easier, I usually lay a piece of wax paper over the dough and use the palm of my hand to smooth the surface (and then discard wax paper).",
    "Bake on 350F (177C) for 20-25 minutes -- edges should be lightly golden brown.",
    "Allow to cool completely before adding peanut butter fudge",
    "Peanut Butter Fudge",
    "Combine peanut butter and butter in large heat proof bowl and microwave at 15-second increments (stirring between each) until butter is completely melted.",
    "Stir in vanilla extract.",
    "Gradually stir in powdered sugar.",
    "Add milk and stir well. Mixture should be fudgy enough that you can mold pieces into a ball, but not too stiff that you won't be able to spread it over the brownies (feel free to add additional milk, 1 teaspoon at a time, if mixture is too stiff, or more powdered sugar, 1 Tablespoon at a time if mixture is too soft).",
    "Drop peanut butter mixture by heaping spoonfuls over the cooled brownies and use a knife to gently spread until the shortbread layer is evenly covered with a thick layer of fudge.",
    "Chocolate Topping",
    "Combine chocolate chips and heavy cream in a small saucepan over medium heat.",
    "Stir frequently until chocolate is melted and mixture is smooth.",
    "Remove from heat and stir in vanilla extract. Allow chocolate to cool for about 15 minutes, and then evenly spread over prepared caramel layer. Wait several minutes and then sprinkle with sea salt.",
    "Allow chocolate to harden (I recommend placing in refrigerator for about 30 minutes -- my family prefers these treats refrigerated anyway) before cutting and serving."
  ]
}