{
  "title": "Penne alla Vodka",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Vodka Sauce",
    "42g / 3 Tbsp olive oil",
    "250g / 1 onion, finely diced",
    "15g / 3 cloves garlic, finely chopped",
    "2g / 1 tsp dried red chile flakes",
    "85g / ⅓ cup tomato paste",
    "73g / ⅓ cup vodka",
    "1(680g / 24 oz) jar tomato passata (3 cups)",
    "115g / ½ cup heavy cream",
    "56g / ¼ cup mascarpone",
    "Salt, q.b.",
    "To Finish",
    "624g / 1 lb 6 oz extruded penne (this page)",
    "30g / 2 Tbsp unsalted butter, cold and cubed",
    "22g / ¼ cup finely grated parmigiano-reggiano",
    "Dried red chile flakes, q.b.",
    "Black pepper, q.b."
  ],
  "directions": [
    "1 - To make the sauce, place a large sauté pan over low heat and add the olive oil. Add the onion and cook until translucent but without color, 5 to 8 minutes.",
    "2 - Add the garlic and cook until aromatic but without color, 10 to 15 seconds. Add the chile flakes and allow them to bloom.",
    "3 - Add the tomato paste and cook, stirring constantly, until the color deepens, 2 to 3 minutes. Add the vodka and cook, stirring occasionally, until the alcohol has cooked off, 3 to 5 minutes.",
    "4 - Add the tomato passata and stir to combine. Turn the heat down to low and simmer until the flavors have integrated, about 30 minutes.",
    "5 - Remove from the heat. Stir in the cream and then gently fold in the mascarpone. Season with salt q.b.",
    "6 - Measure out 533g / 2¼ cups sauce and set aside. Transfer the remainder to an airtight container and refrigerate for up to 3 days.",
    "7 - To finish, bring a large pot of water to a boil over high heat. Generously salt the water.",
    "8 - Add the penne to the water and cook for 5 to 8 minutes, until al dente.",
    "9 - While the pasta is cooking, place a large sauté pan over low heat. Add the reserved sauce and 2 to 3 ladles (115 to 170g / ½ to ¾ cup) pasta cooking water and stir to combine.",
    "10 - Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Toss for 30 seconds to 1 minute to marry the pasta and the sauce.",
    "11 - Add the butter and continue tossing to marry. If the sauce begins to tighten, add a splash of pasta cooking water to loosen and continue tossing.",
    "12 - Divide into bowls and garnish with the parmigiano and with chile flakes and pepper q.b."
  ]
}