{
  "title": "Perfect Poached Eggs with Spiced Chickpeas & Smothered Pita Chips",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 6 garlic cloves",
    "- 1 jalapeño",
    "- 1 medium yellow onion",
    "- 1 cup cilantro leaves and tender stems, plus more leaves for serving",
    "DAIRY",
    "- 4 large eggs",
    "- Plain whole-milk yogurt, for serving",
    "PANTRY",
    "- 2 (14.5-ounce) cans chickpeas",
    "- ¼ cup extra-virgin olive oil, plus more for drizzling",
    "- 2 teaspoons ras el hanout (see headnote)",
    "- Kosher salt",
    "- 1 (28-ounce) can crushed tomatoes",
    "- 4 cups pita chips (6 ounces)"
  ],
  "directions": [
    "1. Do some prep:",
    "- Lightly smash and peel 6 garlic cloves; thinly slice them.- Trim and discard the stem of 1 jalapeño. (Discard the seeds if you are spice averse.) Finely chop the jalapeño.- Finely chop 1 medium yellow onion. Not sure how to properly chop an onion? I got you.- Chop 1 cup cilantro leaves and tender stems.- Drain and rinse 2 (14.5-ounce) cans of chickpeas. Set aside in a large bowl.",
    "2. Build the stew:",
    "- Heat ¼ cup olive oil in a 12-inch cast-iron skillet over medium heat. Add the garlic, onions, jalapeño, 2 teaspoons ras el hanout, and 1½ teaspoons salt and cook, stirring often, until the onion is very soft and just beginning to brown at the edges, 8 to 10 minutes.- Add the drained chickpeas (reserve that bowl) and cook, stirring often, to allow the chickpeas to absorb some of the flavor of the spices, 4 to 5 minutes.- Add 1 (28-ounce) can crushed tomatoes to the skillet. Bring the stew to a simmer and cook until slightly thickened, 15 to 20 minutes. Remove from the heat and stir in the cilantro. Taste and adjust the seasoning.",
    "3. Poach the eggs:",
    "- Fill a large pot with 3 inches of water and bring to a boil.- Place the reserved large bowl right next to the sink so we can do some swift maneuvering here. Rest a fine-mesh strainer over the sink or a bowl. Crack an egg into the strainer, lift it up, and gently shake it to release some of the excess egg whites, discarding them. You’ll be left with a yolk that is surrounded by a very contained, tight egg white orb. Carefully tip the egg out of the strainer into the large bowl. Repeat with 3 additional eggs, adding all of them to the same bowl. If you've never strained eggs in this manner before, pull up this video.- Once the water boils, turn off the heat. Immediately lower the lip of the bowl of eggs down into the water and gently let each egg slip out of the bowl and into the water, one by one. Set a timer for 3 minutes and let the eggs poach undisturbed.",
    "4. Serve:",
    "- While the eggs poach, stir 4 cups pita chips into the stew.- Divide the stew among 4 serving bowls. Using a slotted spoon, transfer 1 poached egg to each bowl. Season the eggs with salt. Top each bowl with cilantro leaves, plain whole-milk yogurt, and more olive oil."
  ]
}