{
  "title": "Peruvian Roast Chicken With Garlic And Lime",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "3tablespoons extra-virgin olive oil",
    "¼cup lightly packed fresh mint leaves",
    "2tablespoons kosher salt",
    "6garlic cloves, chopped coarse",
    "1tablespoon ground black pepper",
    "1tablespoon ground cumin",
    "1tablespoon sugar",
    "2teaspoons smoked paprika",
    "2teaspoons dried oregano",
    "2teaspoons grated lime zest plus ¼ cup juice (2 limes)",
    "1teaspoon minced habanero chile",
    "1(3½- to 4-pound) whole chicken, giblets discarded"
  ],
  "directions": [
    "1. Process oil, mint, salt, garlic, pepper, cumin, sugar, paprika, oregano, lime zest and juice, and habanero in blender until smooth paste forms, 10 to 20 seconds. Using your fingers or handle of wooden spoon, carefully loosen skin over thighs and breast and remove any excess fat. Rub half of paste beneath skin of chicken. Spread entire exterior surface of chicken with remaining paste. Tuck wingtips underneath chicken. Place chicken in gallon-size zipper-lock bag and refrigerate for at least 6 hours or up to 24 hours.",
    "2. Adjust oven rack to lowest position and heat oven to 325 degrees. Place vertical roaster on rimmed baking sheet. Slide chicken onto vertical roaster so chicken stands upright and breast is perpendicular to bottom of pan. Roast until skin just begins to turn golden and breast registers 140 degrees, 45 to 55 minutes. Carefully remove chicken and pan from oven and increase oven temperature to 500 degrees.",
    "3. When oven is heated to 500 degrees, place 1 cup water in bottom of pan and return pan to oven. Roast until entire skin is browned and crisp, breast registers 160 degrees, and thighs register 175 degrees, about 20 minutes (replenish water as necessary to keep pan from smoking), rotating bird 180 degrees halfway through cooking.",
    "4. Carefully remove chicken from oven and let rest, still on vertical roaster, 20 minutes. Using dish towel, carefully lift chicken off vertical roaster and onto carving board. Carve chicken and serve."
  ]
}