{
  "title": "Philly French Dip Sandwiches",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "4",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "For the Cheese Sauce",
    "3tablespoons butter",
    "3tablespoons all-purpose flour",
    "1cup whole milk",
    "6slices American cheese, torn into pieces",
    "½teaspoon kosher salt",
    "⅛teaspoon cayenne pepper",
    "For the Steak",
    "1¼pounds New York strip steak, trimmed of excess fat, chilled in the freezer for 30 minutes",
    "2teaspoons soy sauce",
    "Kosher salt and freshly ground black pepper",
    "¼cup extra-virgin olive oil",
    "1jumbo (¾ pound) onion, thinly sliced",
    "4cloves garlic, thinly sliced",
    "1cup beef broth",
    "4hero, hoagie, or sub rolls"
  ],
  "directions": [
    "MAKE THE CHEESE SAUCE: In a small heavy saucepan, heat the butter until foamy. Add the flour and cook, stirring, until blonde, 2 to 3 minutes. Whisk in the milk and bring to a boil, reduce the heat, and simmer until thickened slightly, 3 to 4 minutes. Add the cheese, salt, and cayenne and stir until smooth. Remove from the heat and cover to keep warm. (Reheat over low heat, if necessary, when you’re about ready to serve.)",
    "MAKE THE STEAK: Remove the steak from the freezer and slice it really thinly against the grain. Place it in a bowl and toss it with the soy sauce and season generously with salt and pepper.",
    "In a large skillet, heat the oil over high heat. Add the onion and cook, stirring, until browned in spots and softened, about 9 minutes. Season with salt. Add the garlic and cook 1 additional minute. Add the meat and cook, stirring, until just cooked through and tender, 2 to 4 minutes. Transfer the meat and onions to a plate and cover to keep warm. Add the broth to the skillet and bring to a boil, scraping up the browned bits on the bottom into the broth. Reduce the heat to medium and boil to reduce the liquid slightly to make a jus, about 4 minutes.",
    "Split and toast the buns. Warm the beef jus over a very low flame. Divide the steak mixture among the bottom side of the buns and drizzle the jus evenly over the meat (just enough to moisten but not so much that the buns fall apart when you pick them up). Close the buns, cut them in half, and serve them with the cheese sauce, dipping as you eat."
  ]
}