{
  "title": "Philly Roast Pork Sandwich",
  "source": "Seriouseats.com",
  "servings": "6",
  "categories": [
    "Generic"
  ],
  "ingredients": [
    "For the Pork:",
    "One 3-pound (1.4kg) skinless, boneless pork butt (pork shoulder), preferably with fat cap (see notes)",
    "3medium cloves garlic, minced",
    "2tablespoons (18g) Diamond Crystal kosher salt; for table salt use half as much by volume",
    "1tablespoon minced fresh rosemary",
    "1tablespoon minced fresh thyme",
    "1teaspoon freshly ground black pepper",
    "1/2teaspoon red pepper flakes",
    "2tablespoons (30ml) extra-virgin olive oil",
    "1medium yellow onion (8 ounces; 225g), halved and thinly sliced",
    "2cups (473ml) pork stock, homemade chicken stock, or store bought low-sodium chicken broth (see notes)",
    "For the Sandwiches:",
    "3tablespoons extra virgin olive oil",
    "1 1/4pounds broccoli rabe",
    "1/4tsp salt and freshly ground black pepper",
    "2clove cloves garlic",
    "1pinch red pepper flakes",
    "1cup long hot peppers",
    "1roll (1 oz) rolls",
    "18slices provolone cheese"
  ],
  "directions": [
    "For the Pork: In a bowl, combine garlic, salt, rosemary, thyme, black pepper, and red pepper flakes. If needed, use a sharp knife to trim fat cap on pork to 1/4 inch, then cut a 1-inch crosshatch pattern in fat cap.",
    "Place pork on a large double layer of plastic wrap. Sprinkle pork all over with salt mixture. Tie pork with kitchen twine at 1-inch intervals, then wrap pork tightly in plastic, place on a platter, and refrigerate for at least 12 hours and up to 24 hours.",
    "Adjust oven rack to middle position and heat oven to 325°F (160°C). In a large Dutch oven, heat oil over medium-high heat until shimmering. Add onion and cook until soft and translucent, 5 to 7 minutes. Remove from heat.",
    "Unwrap pork and transfer to Dutch oven, fat side up. Add stock, then cover, transfer to oven, and cook until meat registers 180°F (80°C) in center, 2 to 2 1/2 hours. Remove from the oven and transfer the roast to a carving board, then let cool to room temperature, about 1 hour (if time allows, refrigerate the roast whole until well chilled, at least 2 hours and up to 1 day). Set pork jus aside or refrigerate until ready to use.",
    "For the Sandwiches: Adjust oven rack to middle position and heat oven to 400℉ (200°C). Remove the kitchen twine from the roast and slice the roast against the grain as thin as possible; set aside.",
    "Reheat the jus over medium-high heat until just simmering, and season with salt to taste. Add the sliced pork with any accumulated juices and mix to coat. Gently simmer until pork is heated through, about 1 minute. Keep warm until ready to assemble sandwiches.",
    "In a 12-inch skillet, heat oil over medium heat until shimmering. Add broccoli rabe, salt, and pepper and cook, stirring occasionally, until tender and lightly browned, 6 to 9 minutes. Stir in garlic and pepper flakes and cook until fragrant, about 1 minute. Stir in peppers and 1 cup of the pork jus from the Dutch oven, bring to a simmer, and cook until liquid is reduced and rabe is very tender, about 5 minutes.",
    "Arrange rolls, split side up, on rimmed baking sheet. Divide provolone evenly among rolls, then bake until cheese is melted and rolls are beginning to toast around the edges, about 3 minutes. Using tongs, divide pork and broccoli rabe evenly among rolls, then ladle a few spoonfuls of remaining jus over each sandwich. Serve."
  ]
}