{
  "title": "Pickled Shrimp",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 to 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "2teaspoons kosher salt, plus more for poaching the shrimp",
    "1pound (454 g) jumbo shrimp (16/20), peeled and deveined (tails left on)",
    "2celery stalks, thinly sliced on a bias",
    "1large shallot, thinly sliced",
    "1⁄2 cup (120 ml) extra virgin olive oil",
    "1⁄2 cup (120 ml) white wine vinegar",
    "Zest and juice of 1 lemon",
    "2teaspoons chopped jarred Calabrian chiles in oil",
    "1⁄2 teaspoon fennel seeds, toasted and slightly crushed",
    "Freshly cracked black pepper",
    "3tablespoons capers, drained",
    "1⁄4 cup (10 g) chopped fresh parsley",
    "2tablespoons thinly sliced fresh chives",
    "Celery leaves, for garnish"
  ],
  "directions": [
    "1. Bring a large pot of water to a boil over high heat. Season with a big pinch of salt. Prepare a large ice bath and set aside.2. Drop the shrimp in the boiling water, and stir to ensure the shrimp are submerged. Turn off the heat, and cover with a lid until the shrimp are cooked through, pink, and barely starting to curl, 3 to 4 minutes. (This time will vary depending on the size of your shrimp. Feel free to uncover the pot to take a peek! If you are unsure, you can remove one shrimp and cut a small bit off the top to be sure it is opaque all the way through.)3. Immediately transfer the shrimp to the ice bath to cool completely. Drain and pat dry with a paper towel. Add to a large bowl along with the celery and shallot.4. Add the olive oil, vinegar, lemon zest, lemon juice, chiles, 2 teaspoons salt, fennel seeds, and a generous amount of pepper. Toss to coat.5. Transfer the mixture to an airtight container (ideally something shallow so the dressing covers the shrimp), place in the refrigerator, and let the shrimp sit overnight or up to 2 days. (I find the sweet spot to be around the 24-hour mark.) The olive oil may solidify slightly in the refrigerator but will return to normal after sitting at room temperature for a few minutes.6. When you’re ready to serve, toss the shrimp with the capers, parsley, and chives. If there is too much accumulated liquid, feel free to drain off some of the marinade before tossing. (I like a generous amount!) Garnish with celery leaves, and serve."
  ]
}