{
  "title": "Pigs in a Brioche Blanket",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves: Makes 48 bite-sized pieces",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "Pigs in Brioche",
    "½recipe Brioche Dough, chilled",
    "All-purpose flour, for rolling out",
    "8all-beef hot dogs (about 2 oz / 57g each), patted dry, pricked all over with the tip of a paring knife",
    "1large egg, beaten",
    "1tablespoon sesame seeds",
    "Creamy Mustard Dip",
    "¼cup spicy brown mustard (2.8 oz / 80g)",
    "⅓cup sour cream (3 oz / 86g)",
    "1teaspoon honey",
    "Pinch of kosher salt",
    "Pinch of cayenne pepper, or more to taste"
  ],
  "directions": [
    "Portion the dough: Use your fist to lightly punch down the brioche dough to expel some of the gases that built up during the first rise. Turn the dough out onto a clean work surface. Use a bench scraper to divide the dough into 8 equal pieces each weighing about 2.25 ounces / 64g (eyeball it if you don’t have a scale). Arrange the pieces on a rimmed baking sheet, spacing them evenly, then cover with plastic wrap and refrigerate to keep them cold (cold dough is easier to maneuver around the hot dogs).",
    "Preheat the oven and prepare the baking sheet: Arrange an oven rack in the center position and preheat the oven to 350°F. Line a second rimmed baking sheet with parchment paper and set aside.",
    "Roll out the dough: Remove a piece of dough from the refrigerator and roll it out on an unfloured surface into a thin rope measuring about 22 inches long (the unfloured surface provides traction for the dough so it stretches more easily; if it starts to stick, dust it with a pinch of flour). Return the rope to the baking sheet in the refrigerator, tucking it back underneath the plastic, and repeat the rolling process with the remaining pieces of dough one at a time. The point here is to keep the brioche cold so the dough is easier to work with and all the pieces proof at the same rate.",
    "Cover the hot dogs: Remove the baking sheet from the refrigerator. Working one piece at a time, lightly dust a hot dog with flour to coat, then take a piece of brioche and, starting from the midpoints of both, wind the dough around the hot dog until you reach one end. Tug gently to stretch the dough and overlap it onto itself as you wind, then wrap the rest of the rope around the other end of the hot dog. Pinch the ends so the brioche seals to itself. Place on the parchment-lined baking sheet and cover with plastic wrap while you repeat the process with the remaining dogs and pieces of brioche.",
    "Proof the pigs in a blanket: Once all the hot dogs are in their blankets and covered on the baking sheet, let them sit at room temperature until the dough is puffed and springs back but holds a slight imprint when poked with a finger, 25 to 35 minutes.",
    "Egg wash, sprinkle with sesame, and bake: Uncover the dogs and gently brush every surface of the dough with the egg. Sprinkle the sesame seeds evenly over top. Bake the pigs in a blanket until they’re deep golden brown all over, 25 to 30 minutes. Remove from the oven and let cool on the baking sheet.",
    "Make the dipping sauce: In a small bowl, stir the mustard, sour cream, and honey until smooth. Season with the salt and cayenne.",
    "Slice and serve: Cut each of the cooled pigs in a blanket crosswise into 6 pieces and serve them on a platter with the dipping sauce."
  ]
}