{
  "title": "Pineapple-Kimchi Fried Rice",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Kimchi fried rice is a common sight in Korea and in my apartment. Pineapple fried rice is my Thai takeout go-to. One day at Mission, we were trying out a quick-fermented kimchi made with pineapple and suddenly realized we could use it to make a mash-up of the two fried rices. OK, there are actually three represented here, because the sesame seeds and garlic-and-(vegan)-butter combo is ripped from the Benihana classic. If you haven’t made the pineapple kimchi, no stress: Mix equal parts chopped aged cabbage kimchi and crushed fresh pineapple. It’ll still taste great.",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "- 2 tablespoons extra-virgin olive oil",
    "- ½ cup thinly sliced scallions",
    "- 1 large garlic clove, thinly sliced",
    "- 2 cups drained Pineapple Kimchi",
    "- 1 tablespoon unsalted vegan butter",
    "- 4 cups freshly cooked jasmine rice",
    "- 1 tablespoon toasted sesame seeds",
    "- 1½ teaspoons soy sauce",
    "- 1 teaspoon Umami Salt and Pepper",
    "- Kosher salt",
    "- 1 cup thinly sliced or crumbled roasted seaweed",
    "- 4 pinches gochugaru (Korean chili flakes)"
  ],
  "directions": [
    "1. PUT the oil, scallions, and garlic in a wok or heavy skillet, set it over high heat, and let the oil sizzle. Cook until the scallions and garlic are fragrant but not colored, about 2 minutes. Add the kimchi and vegan butter and cook, stirring and tossing, until the kimchi is warmed through, about 1 minute. Turn off the heat.",
    "2. ADD the rice, sesame seeds, and soy sauce and use a wooden spoon or flexible spatula to gently stir, breaking up any clumps but not smashing the grains. In a small mixing bowl, combine the umami salt and pepper and 1 tablespoon warm water, stir to dissolve, and add the mixture to the skillet.",
    "3. TURN the heat to high and cook just until it’s hot through, 30 seconds to 1 minute. Season with salt. Sprinkle on the seaweed and gochugaru and serve."
  ]
}