{
  "title": "Pineapple and Pecan Upside-Down Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 9-inch cake pan, food processor, stand or hand mixer",
    "Extra-virgin olive oil for the pan",
    "1medium pineapple (about 3½ lb / 1.59kg) ①",
    "½cup packed light brown sugar (3.5 oz / 100g)",
    "¼cup dark rum (2 oz / 57g)",
    "1tablespoon unsalted butter",
    "Pinch of kosher salt",
    "1cup pecan halves or pieces (4 oz / 113g)",
    "1cup all-purpose flour (4.6 oz / 130g)",
    "1½teaspoons ground cinnamon",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "1teaspoon baking soda (0.21 oz / 6g)",
    "½teaspoon baking powder",
    "¼teaspoon ground nutmeg (preferably freshly grated)",
    "1stick unsalted butter (4 oz / 113g), at room temperature",
    "½cup granulated sugar (3.5 oz / 100g)",
    "¼cup packed light brown sugar (1.8 oz / 50g)",
    "2large eggs (3.5 oz / 100g), at room temperature",
    "1teaspoon vanilla extract",
    "½cup buttermilk (4.2 oz / 120g), at room temperature",
    "⅓cup strained apricot jam (optional), warmed, for glazing"
  ],
  "directions": [
    "Prepare the pan: Lightly butter the bottom and sides of the cake pan and line the bottom with a round of parchment paper. Set the pan aside.",
    "Cut the pineapple: Working on a cutting board and using a large knife, place the pineapple on its side and cut crosswise to remove the stem end and base (discard). Stand the pineapple upright. Slice off the thick rind by cutting down and around the sides, following the contours of the fruit and rotating it as you go. Be generous as you cut, fully removing any and all of the knobby exterior (go back with a paring knife if necessary to remove any “eyes”). Cut the pineapple lengthwise into quarters, then lay each quarter flat on its side. Slice lengthwise along the spears to remove the fibrous inner core, then cut the pineapple crosswise into very thin fan-shaped slices that measure no more than ⅛-inch thick.",
    "Poach the pineapple: In a large saucepan, combine the pineapple slices and any accumulated juices with the brown sugar and rum. Add just enough water so the pineapple is barely submerged. Bring the mixture to a simmer over medium-low heat, swirling the pan to dissolve the sugar. Adjust the heat to maintain a gentle simmer and cook, swirling the pan occasionally to ensure even cooking, until the pineapple slices are softened and translucent, 10 to 15 minutes. Carefully transfer the slices to a plate (they will be delicate), leaving the juices behind in the saucepan.",
    "Make the caramel: Return the saucepan to medium heat and add the butter and a pinch of salt. Cook, swirling often, until the butter is melted and the liquid is bubbling and thick, 5 to 7 minutes. Pour the caramel into the bottom of the prepared cake pan and tilt to coat. Set the pan aside to cool.",
    "Arrange the pineapple in the pan: Arrange the cooled pineapple slices across the bottom of the pan in a tight overlapping pattern (you may have some leftover pineapple). Set the pan aside while you make the cake.",
    "Preheat the oven and toast the nuts: Arrange an oven rack in the center position and preheat the oven to 350°F. Place the pecans on a small rimmed baking sheet and bake, shaking halfway through, until darkened in color and very toasty smelling, 10 to 14 minutes. Remove from the oven and set aside to cool completely.",
    "Mix the dry ingredients: In a food processor, combine the flour, cinnamon, salt, baking soda, baking powder, and nutmeg. Add the cooled pecans and process in long pulses until the nuts are finely ground. Set aside.",
    "Cream the butter and sugars: In a stand mixer fitted with the paddle attachment (or in a large bowl if using a hand mixer), beat the butter, granulated sugar, and brown sugar on medium-high until light and fluffy, scraping down the sides of the bowl once or twice, about 4 minutes.",
    "Add the eggs: Add the eggs one at a time, beating thoroughly after each addition. Beat in the vanilla.",
    "Alternate the dry and wet ingredients: Reduce the mixer speed to low and add the flour mixture in 3 additions, alternating with 2 additions of the buttermilk, beating after each addition just until you have a smooth batter. Turn off the mixer and use a flexible spatula to fold the batter several times, scraping the bottom and sides, to ensure everything is evenly mixed.",
    "Fill the pan and bake: Gently dollop the batter over the pineapple and use a flexible or small offset spatula to smooth it into an even layer (don’t worry if some juices from the pineapple pool around the sides). Bake the cake until the surface is golden brown all over, springy to the touch, and a cake tester or toothpick inserted into the center comes out clean, 40 to 45 minutes.",
    "Cool and glaze the cake: Set the pan on a wire rack and let the cake cool for 15 minutes. Use an offset spatula or paring knife to cut around the sides of the pan to release the cake. Invert the cake onto the wire rack and slowly remove the pan. Peel off the parchment paper and let the cake cool completely. If desired, use a pastry brush to dab the warm apricot jam across the entire surface for a shiny finish."
  ]
}