{
  "title": "Pistachio Linzer Tart",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 9-inch round or 14 x 4-inch rectangular removable-bottom tart pan, food processor, pastry bag, large cake icer or other pastry tip (optional)",
    "1cup shelled pistachios (4.2 oz / 120g) ①",
    "Butter for the pan",
    "1cup all-purpose flour (4.6 oz / 130g)",
    "½teaspoon ground cinnamon",
    "½teaspoon Diamond Crystal kosher salt",
    "½cup sugar (3.5 oz / 100g)",
    "10tablespoons unsalted butter (5 oz / 142g), cut into ½-inch pieces, chilled",
    "1large egg (1.8 oz / 50g), cold",
    "1teaspoon vanilla extract",
    "2teaspoons finely grated lemon zest",
    "⅔cup store-bought jam (7 oz / 200g), such as raspberry, strawberry, cherry, or apricot ②",
    "2teaspoons fresh lemon juice"
  ],
  "directions": [
    "Preheat the oven and toast the pistachios: Arrange an oven rack in the center position and preheat the oven to 350°F. Scatter the pistachios on a small rimmed baking sheet and toast until they’re golden and nutty smelling, shaking halfway through, 8 to 10 minutes. Remove from the oven (leave the oven on) and let the pistachios cool. Rub the warm pistachios between your fingers to remove any papery skins that may have loosened during toasting and discard (don’t worry about removing every last bit).",
    "Prepare the pan: Lightly coat the bottom and sides of the tart pan with butter and set aside.",
    "Grind the nuts into the dry ingredients: In a food processor, combine the flour, cinnamon, salt, and cooled pistachios and process in long pulses until the nuts are finely ground. Transfer the flour mixture to a medium bowl and set aside.",
    "Make the batter: In a food processor (no need to wash it after grinding the nuts), combine the sugar and chilled butter pieces and pulse, scraping the sides of the bowl once or twice, until the mixture is smooth and creamy. Add the egg, vanilla, and lemon zest and pulse again, scraping down the sides one more time, until incorporated (it’s okay if it looks a little broken). Add the pistachio/flour mixture and pulse just until a thick, smooth batter forms.",
    "Smooth half the batter into the pan: Carefully remove the blade from the food processor and scrape any batter back into the bowl. Mix the batter with a flexible spatula to make sure all of the ingredients are evenly incorporated, then scrape about half the batter into the prepared pan. Use a small offset spatula to smooth the batter into a thin, even layer across the bottom of the pan and all the way to the edges.",
    "Bake and cool the first layer: Transfer the pan to the oven and bake until the batter is firm and set and just starting to turn golden around the edges, 15 to 20 minutes. Remove the pan from the oven and set aside to cool. (Leave the oven on.)",
    "Transfer the remaining batter to a pastry bag (fitted with a large cake icer tip or other tip, if desired, to make a more decorative pattern). The batter will be thick, but do your best to eliminate air pockets as you place it inside the pastry bag, since they will make it harder to pipe it across the tart. If the bag is disposable, use scissors to snip a 1-inch opening off the end (you can do this with a resealable zip-top bag, too).",
    "Mix the filling: In a small bowl, combine the jam and lemon juice and stir until smooth.",
    "Assemble the tart: Spread the jam mixture in an even layer across the surface of the cooled tart bottom, leaving a ¼-inch border all the way around. Pipe tight, parallel rows of batter from one side of the pan to the other across the surface of the jam (or, really, in any pattern you want). Squeeze the pastry bag with even pressure and pipe slowly to coax the thick batter out of the bag. If the line of batter breaks or you hit an air pocket, just start again where you left off. Use all the remaining batter.",
    "Bake the tart: Bake again until the jam is bubbling gently and the edges of the tart are golden brown, another 25 to 30 minutes. Remove the pan from the oven and let the tart cool completely.",
    "Serve: Carefully remove the tart base from the pan and slice."
  ]
}