{
  "title": "Pistachio Dukkah",
  "source": "Shuk From Market to Table",
  "servings": "Makes about 2½ cups (350 g)",
  "categories": [
    "Israel",
    "Shuk - From Market to Table"
  ],
  "ingredients": [
    "2tablespoons cumin seeds",
    "2½tablespoons coriander seeds",
    "½cup (75 g) sesame seeds",
    "1½cups (195 g) shelled pistachios",
    "¾cup (65 g) unsweetened coconut flakes",
    "1teaspoon kosher salt",
    "Freshly ground black pepper"
  ],
  "directions": [
    "Preheat the oven to 300°F (145°C). Line a rimmed baking sheet with parchment paper.",
    "Heat a small dry skillet over medium heat. Toast the cumin and coriander, stirring frequently with a wooden spoon, until just fragrant, 2 to 3 minutes (this happens quickly, so stick around and make sure the spices don’t burn). Transfer to a small plate and let cool. Toast the sesame seeds in the same pan, stirring frequently, until lightly golden, 3 to 4 minutes. Transfer to a small plate and let cool.",
    "Scatter the pistachios on the baking sheet in a single layer. Toast in the oven until slightly fragrant and drier, 15 to 20 minutes. Keep an eye on them—toasted pistachios should retain their green color; if they turn brown, you’ve toasted them too long and must start again with a new batch of nuts. (Don’t worry, it happens.) Transfer the pistachios to a plate and let cool; leave the oven on.",
    "Scatter the coconut flakes on the baking sheet and toast in the oven until they turn golden, 6 to 8 minutes, stirring halfway through to make sure the coconut toasts evenly.",
    "Grind the toasted cumin and coriander in a spice or coffee grinder or using a pestle and mortar; in both cases, you want the texture to remain slightly coarse. Transfer to a medium bowl.",
    "Pulse the cooled pistachios in a food processor until finely chopped, then transfer to the bowl with the cumin and coriander. Add the toasted sesame seeds, toasted coconut flakes, salt, and a few twists of black pepper. Stir thoroughly to combine.",
    "Store in an airtight container in a cool, dark place for up to 2 months."
  ]
}