{
  "title": "Pita or Laffa Zahav",
  "source": "Zahav Cookbook",
  "servings": "8 Breads",
  "categories": [
    "Mediteranean"
  ],
  "ingredients": [
    "2½teaspoons active dry yeast",
    "2teaspoons sugar",
    "2cups all-purpose flour",
    "2cups bread flour",
    "1½teaspoons kosher salt",
    "2tablespoons olive oil"
  ],
  "directions": [
    "Mix together ½ cup water, the yeast, and sugar in a small bowl and let stand until foamy, about 5 minutes.",
    "Combine the all-purpose flour, bread flour, and salt in the bowl of a stand mixer fitted with the dough hook. Mix on low speed until blended. Add the yeast mixture, another ½ cup water, and the oil and mix on low until the dough forms a ball that pulls clear of the sides and bottom of the bowl. (If after a minute the mixture doesn’t form a ball, add a tablespoon of water.) The moment the dough starts to pull clear of the bottom of the bowl, add ½ cup water and continue mixing until incorporated. The dough should feel tacky when slapped with a clean hand, but it should not stick. (If it sticks, add more flour, a tablespoon at a time.)",
    "Cover the dough with plastic wrap and let rise at room temperature until doubled in size, about an hour. Alternatively, let it rise in the refrigerator overnight.",
    "Preheat the oven to 500°F, with a rack in the upper third. Place a baking stone or an inverted baking sheet in the oven to preheat as well.",
    "Roll the dough into 8 balls the size of baseballs. Cover with a cloth and let rise until they are about the size of softballs.",
    "FOR LAFFA: Roll each dough ball as thin as possible (less than ⅛ inch is ideal—the laffa should be the size of a Frisbee) with a floured rolling pin on a floured work surface. Drape one laffa over your outstretched hand and quickly invert it onto the baking stone or baking sheet, quickly pulling any wrinkles flat. Bake the laffa until puffy and cooked through, about 1 minute. Serve immediately.",
    "FOR PITA: Roll each dough ball to about a ¼-inch thickness (about the size of a hockey puck) with a floured rolling pin on a floured work surface. Place one or two at a time on the baking stone or baking sheet and bake until puffed and cooked through, about 3 minutes. Serve immediately, or let cool.",
    ""
  ]
}