{
  "title": "Pizza Bianca",
  "source": "My Kitchen in Rome - Rachel Roddy",
  "servings": "Makes 5 pizzas (can be halved)",
  "categories": [
    "Italian",
    "My Kitchen in Rome - Rachel Roddy"
  ],
  "ingredients": [
    "2¼pounds Italian farina 0 or bread flour",
    "3½teaspoons fast-action dried yeast, or 2 tablespoons plus ½ teaspoon fresh yeast",
    "2½teaspoons salt",
    "3tablespoons extra-virgin olive oil"
  ],
  "directions": [
    "In a large bowl, mix together the flour and yeast with a wooden spoon. Then add a scant 3 cups water gradually, and once it is incorporated, add the salt and the oil. Mix until you have a pale, sticky, putty-like mixture. Cover with a clean tea towel or plastic wrap and leave to rest for 1 hour at room temperature in a draft-free part of the kitchen.",
    "Scrape the mixture onto a lightly floured board; it will still be sticky. Now for the piegature di rinforzo. With lightly floured hands, gently stretch and pull the edges of the dough and fold them back over themselves. Try as best as you can to turn the dough 90 degrees (it will stick) by using a dough scraper or spatula and repeat the pull-and-fold motion. With this repeated pulling and folding, the incorporation of air and a little flour from your hands means the dough will get more soft and manageable. Bonci suggests you repeat this pulling-and-folding motion 3 times, wait for 20 minutes, repeat, wait for 20 minutes, then repeat.",
    "Put the soft dough in an oiled bowl, cover it with a tea towel or plastic wrap, and leave it for 18–24 hours in the bottom half of the fridge.",
    "Remove the bowl from the fridge and leave it for 10 minutes. Carefully lift the dough out of the bowl and cut it into 5 pieces of more or less 12 ounces each—you can use a scale to check. Working piece by piece, shape the dough into a ball, fold it over once as you did for the piegature di rinforzo, and leave it to sit for another 30 minutes at room temperature, away from any drafts. Preheat the oven to 500°F and oil your baking sheet or pizza stone.",
    "The final stage needs to be done with a delicate touch; you don’t want to squash out the air you have so patiently incorporated. On a lightly floured board, use your fingertips to push and massage the dough into a square or rectangle the same size as your baking sheet, starting from the borders and working into the center. Once it is more or less the right size, drape it over your arm and lift it onto your prepared baking sheet. Zig-zag the dough with a thin stream of olive oil.",
    "Bake it directly on the floor of the oven for 15 minutes, then check the pizza by lifting up the corner and looking underneath—it should be firm and golden. If it seems nearly done, move it to the middle rack for 10 more minutes. Take it out, brush it with more olive oil if you think it needs it, and sprinkle with salt. Slice and eat."
  ]
}