{
  "title": "Pizzoccheri alla Valtellinese (Buckwheat Pasta with Potatoes, Cabbage, and Brown Butter)",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "1batch buckwheat dough (this page)",
    "432g / 4 small Yukon gold potatoes, peeled and diced into ½-inch pieces",
    "28g / 2 Tbsp olive oil",
    "165g / 11 Tbsp unsalted butter, cold and cubed",
    "5g / 1 garlic clove, thinly sliced",
    "1head savoy cabbage, cored and cut into 3- to 4-inch strips (about 1kg)",
    "120g / 1 cup coarsely grated fontina cheese, at room temperature",
    "30g / ⅓ cup finely grated parmigiano-reggiano"
  ],
  "directions": [
    "1 - Following the instructions for pizzoccheri on this page, make 454g / 1 lb with the pasta dough.",
    "2 - Bring a small pot of water to a boil and salt generously. Add the potatoes and cook until tender, but not without some bite, 3 to 5 minutes. Drain and set aside until ready to use.",
    "3 - Place a large sauté pan or Dutch oven over medium-low heat and add the oil and 30g / 2 Tbsp of the butter. Add half of the garlic and gently cook until aromatic but without color, 10 to 15 seconds.",
    "4 - Add the cabbage and cook until tender and wilted, 3 to 5 minutes. Remove from the heat and set aside until ready to use.",
    "5 - Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "6 - Place a small saucepan over medium-low heat. Add the remaining butter and garlic and cook until the butter is golden brown and foamy, 3 to 4 minutes. Set aside and keep warm.",
    "7 - Add the pizzoccheri to the water and cook for 3 to 5 minutes, until tender but not too soft.",
    "8 - Place the sauté pan with the cabbage over low heat. Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Add the potatoes and gently toss to combine.",
    "9 - Transfer half of the warm pasta-and-cabbage mixture to a large (9 by 13-inch) casserole dish and arrange in an even layer.",
    "10 - Sprinkle half of the fontina and half of the parmigiano over the top. Spoon half of the warm garlic butter over the cheese.",
    "11 - Repeat the same layering process with the remaining pasta, cheese, and garlic butter.",
    "12 - Serve family style from the casserole dish."
  ]
}