{
  "title": "Poached Chicken over Brothy Rice with Cilantro Scallion Sauce (a.k.a. I LOVE YOU, NONG’S)",
  "source": "Molly Baz Cook This Book",
  "servings": "4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "2whole garlic heads",
    "1(4-inch) piece fresh ginger",
    "4scallions",
    "1large bunch cilantro",
    "2jalapeños",
    "1lime",
    "MEAT",
    "2bone-in, skin-on chicken breasts (about 2 pounds)",
    "PANTRY",
    "1cup long-grain white rice, such as basmati or jasmine",
    "Kosher salt",
    "¼cup extra-virgin olive oil or neutral oil",
    ""
  ],
  "directions": [
    "① Cook the rice:",
    "✦Rinse 1 cup long-grain rice in a fine-mesh strainer, swirling the rice with your hands until the water runs clear, 1 to 2 minutes.",
    "✦Combine the rinsed rice, 1¼ cups cold water, and ¼ teaspoon salt in a small saucepan and bring to a simmer over medium-high heat. Cover the pot immediately with a tight-fitting lid and reduce the heat to very low. Cook 16 minutes (set a timer). Turn off the heat, leave the lid on, and let the rice steam for another 10 minutes; uncover and fluff with a fork.",
    "② Meanwhile, prep the broth:",
    "✦Cut 2 heads of garlic in half crosswise. No worries if they fall apart a bit.",
    "✦Thinly slice 1 (4-inch) piece of ginger lengthwise into planks.1",
    "✦Cut 4 scallions in half crosswise, separating the dark green parts from the light green and white parts.",
    "✦Cut 1 large bunch of cilantro in half, separating and reserving the thick stems from the tender leaves and stems.",
    "③ Poach the chicken:",
    "✦Place 2 bone-in, skin-on chicken breasts skin-side up in a medium saucepan. Add the halved garlic heads, sliced ginger, dark scallion greens, thick cilantro stems, 4 cups water, and 2 tablespoons salt. The chicken should be just submerged in the water; if it’s not, add more water.",
    "✦Bring the water to a simmer over medium-high heat. Using tongs, flip the chicken breasts so they’re skin-side down.2 Cook until an instant-read thermometer inserted into the thickest part of the breasts (insert the probe near top part, i.e., the rounded part of the breast) reaches 150°F. This will take 10 to 20 minutes.3",
    "④ Make the scallion sauce:",
    "✦Thinly slice the light green and white parts of the remaining scallions crosswise. Finely chop the cilantro leaves and tender stems.",
    "✦Trim the stems of 2 jalapeños. Cut the jalapeños in half lengthwise and pull out the seeds and inner ribs. Finely chop the jalapeños. Combine the scallions, cilantro, and jalapeños in a small bowl.",
    "✦Stir in ¼ cup olive oil and the juice of 1 lime; season with salt.",
    "⑤ Back to that chicken:",
    "✦Once the chicken reaches 150°F, use tongs to transfer the breasts to a cutting board and let cool for about 10 minutes. Once cool enough to handle, remove and discard the skin. Carve the meat of each breast off the bone and cut each against the grain into ½-inch-thick slices. Here’s a video to help guide you through that process.",
    "✦While the chicken cools, add 3 cups water to the broth and return to a simmer. Remove from the heat.",
    "⑥ Serve:",
    "✦Place a big mound of cooked rice in each of 4 serving bowls and top with the chicken breast slices. Ladle some broth over top (no need to strain it; just avoid the big pieces of garlic and scallion floating around).",
    "✦Spoon the scallion sauce generously over the chicken. Serve more broth alongside for sipping.4",
    ""
  ]
}