{
  "title": "Poached Fish with Creamed Leeks & Toasty Hazelnuts",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 4 medium leeks",
    "- 12 garlic cloves",
    "- 1 lemon",
    "DAIRY",
    "- 2 cups heavy cream",
    "SEAFOOD",
    "- 1½ pounds cod, halibut, or pollack fillets",
    "PANTRY",
    "- ½ cup blanched hazelnuts or blanched whole almonds",
    "- Kosher salt",
    "- 3 tablespoons extra-virgin olive oil"
  ],
  "directions": [
    "1. Do some prep:",
    "- Trim the roots and dark green tops of 4 medium leeks. Peel off and discard the first two layers of the leeks, which often contain lots of dirt. Cut the leeks crosswise into 1-inch rounds. If the leeks look especially gritty or dirty, give them a rinse under cold water.",
    "- Firmly smash and peel 12 garlic cloves.",
    "- Using a vegetable peeler, peel 4 (3-inch-long) strips of lemon zest from 1 lemon. Cut the lemon in half.",
    "- Coarsely chop ½ cup blanched hazelnuts.",
    "2. Poach the leeks: Combine 2 cups heavy cream, 1 cup water, the leeks, garlic, 2 teaspoons salt, and the lemon zest in a medium saucepan (choose one that fits the fish with a little wiggle room around it, about 3 quarts) and bring to a simmer over medium heat. Reduce the heat as needed to maintain a bare simmer with very gentle bubbles and cook until the leeks are very soft, 10 to 15 minutes. The cream may boil up vigorously, so stay nearby and stir the pot occasionally to avoid overflow.",
    "3. Toast the hazelnuts: Meanwhile, in a small saucepan, combine the chopped hazelnuts and 3 tablespoons olive oil. Cook over medium-low heat, swirling the pan often, until the hazelnuts are golden brown, 5 to 6 minutes. Remove from the heat, and season with ½ teaspoon salt.",
    "4. Poach the fish:",
    "- Season the fish all over with 1 teaspoon salt.",
    "- Using a spatula or large spoon, add the fish to the cream, submerging it. If the cream doesn’t cover the fish all the way, add enough water to barely cover.",
    "- Return the liquid to a simmer over medium heat and simmer very gently until the flesh of the fish has just turned opaque and flakes with slight pressure from the tines of a fork, 6 to 8 minutes. Remove from the heat.",
    "5. Serve: Divide the fish among 4 shallow serving bowls, using a serving spoon to flake it into large irregular pieces. Spoon over some of the melted leeks and cream, the hazelnuts and oil, and the juice of the zested lemon."
  ]
}