{
  "title": "Poached Chicken With Quinoa And Warm Tomato-Ginger Vinaigrette",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "4(6- to 8-ounce) boneless, skinless chicken breasts",
    "½cup soy sauce for poaching chicken",
    "8garlic cloves (6 smashed, 2 minced)",
    "¾teaspoon table salt, divided, plus salt for poaching chicken",
    "3tablespoons extra-virgin olive oil, divided, plus extra for drizzling",
    "1½cups prewashed white quinoa",
    "1shallot, minced",
    "2teaspoons grated fresh ginger",
    "⅛teaspoon ground cumin",
    "⅛teaspoon ground fennel",
    "12ounces cherry tomatoes, halved",
    "¼cup chopped fresh parsley",
    "2teaspoons red wine vinegar"
  ],
  "directions": [
    "1. Pound chicken breasts to uniform thickness. Whisk 4 quarts water, soy sauce, smashed garlic cloves, and ¼ cup salt in Dutch oven until salt is dissolved. Arrange breasts skinned side up in steamer basket, making sure not to overlap them. Submerge steamer basket in pot.",
    "2. Heat pot over medium heat, stirring liquid occasionally to even out hot spots, until water registers 175 degrees, 15 to 20 minutes. Turn off heat, cover pot, and let sit until chicken registers 160 degrees, 17 to 22 minutes. Transfer chicken to cutting board, tent with aluminum foil, and let rest.",
    "3. Meanwhile, heat 1 tablespoon oil in large saucepan over medium heat until shimmering. Add quinoa, minced garlic, half of shallot, and ½ teaspoon salt and cook until fragrant, about 3 minutes. Stir in 1¾ cups water and bring to simmer. Reduce heat to low, cover, and simmer until quinoa is tender and water is absorbed, 18 to 22 minutes, stirring once halfway through cooking. Remove pot from heat and let sit, covered, for 10 minutes.",
    "4. Heat 1 tablespoon oil in 10-inch nonstick skillet over medium heat until shimmering. Add ginger, cumin, fennel, and remaining shallot and cook until fragrant, about 30 seconds. Stir in tomatoes and remaining ¼ teaspoon salt and cook, stirring frequently, until tomatoes have softened, 3 to 5 minutes. Off heat, stir in parsley, vinegar, and remaining 1 tablespoon oil and season with salt and pepper to taste.",
    "5. Add half of tomato-ginger vinaigrette to quinoa and stir to combine. Season with salt and pepper and drizzle with extra oil to taste. Slice each chicken breast on bias ¼ inch thick and transfer to platter or individual plates. Serve with remaining warm vinaigrette and quinoa."
  ]
}