{
  "title": "Pollo Yucateco Asado",
  "source": "Bricia Lopez, Javier Cabral - Asada: The Art of Mexican-Style Grilling",
  "servings": "Serves 6",
  "categories": [
    "Asada: The Art of Mexican-Style Grilling",
    "Mexican"
  ],
  "ingredients": [
    "¼teaspoon cumin seeds",
    "1whole clove",
    "1whole allspice berry",
    "1½teaspoons dried Mexican oregano",
    "2½tablespoons ground achiote",
    "1½tablespoons sea salt",
    "1½teaspoons ground white pepper",
    "1½teaspoons garlic powder",
    "¼cup (120 ml) distilled white vinegar",
    "Juice of one orange, about ⅓ cup (75 ml) fresh orange juice + half an orange, silced with peel on",
    "2tablespoons olive oil",
    "3pounds (1.3 kg) bone-in chicken thighs",
    "For serving:",
    "Arroz blanco (this page)",
    "Frijoles negros (this page)",
    "Warm tortillas (preferably homemade; recipes on this page)",
    "Salsa de Piña Tatemada (this page)"
  ],
  "directions": [
    "In a cast-iron skillet over medium heat, add the cumin seeds, clove, allspice, and oregano. Toast for about 2 minutes or until the spices are aromatic. Grind everything in a molcajete or spice grinder until finely ground.",
    "In a medium bowl, whisk together the toasted ground spices, the achiote, salt, white pepper, garlic powder, vinegar, orange juice, and olive oil until well combined.",
    "Pat the chicken dry with paper towels. Using a gallon-size resealable bag, add the marinade, the orange slices, and the chicken. Seal and let sit in the refrigerator for at least 30 minutes but preferably overnight.",
    "Before grilling, remove the chicken thighs in their marinade from the fridge to allow them to return to room temperature.",
    "Start a charcoal or gas grill. The gas should be set to high. If using a pellet grill, preheat your grill to 450°F (230°C) for at least 15 minutes. If using charcoal, the coals should be red but entirely covered with gray ash.",
    "Remove the chicken thighs from the marinade while reserving a few orange slices to grill as well, and put them on the grill directly over the high fire, skin side up. Close the lid and cook, turning once, for about 15 minutes on each side. The chicken is cooked when its internal temperature reaches 175°F (79°C) on a meat thermometer. Transfer the meat to a cutting board and let rest for 5 minutes.",
    "Serve the chicken with arroz blanco, frijoles negros, tortillas, and salsa."
  ]
}