{
  "title": "Pollo alla Romana con Peperoni",
  "source": "My Kitchen in Rome - Rachel Roddy",
  "servings": "Serves 4",
  "categories": [
    "Italian",
    "My Kitchen in Rome - Rachel Roddy"
  ],
  "ingredients": [
    "3tablespoons olive oil",
    "2ounces pancetta, diced (optional)",
    "2¾pounds chicken, either a nice plump whole chicken cut into 8 pieces, or chicken thighs",
    "salt and freshly ground black pepper",
    "½cup dry white wine",
    "1¼pounds canned plum tomatoes with their juice, or fresh tomatoes, peeled",
    "1plump garlic clove (optional)",
    "a sprig of rosemary",
    "4large red peppers"
  ],
  "directions": [
    "Heat the oil in a large, heavy-bottomed casserole dish or deep sauté pan, add the pancetta, if using, and cook until it renders its fat. Add the chicken pieces, skin-side down, and cook until the skin forms a golden crust, then turn them over and brown the other sides.",
    "Season with salt and several grindings of black pepper, add the wine, and let it bubble away until most of it has evaporated. Meanwhile, coarsely chop the tomatoes, gently crush the garlic with the back of a knife, and roughly chop the rosemary. Add them to the pan, stir, and cook, covered, over moderate heat. Keep an eagle eye on the pan for the first 10 minutes, stirring every now and then to prevent sticking. Once everything has gotten going, half cover the pan and cook for another 45 minutes, or until the tomatoes have reduced into a dense, rich sauce and the chicken is tender. If at any point the sauce seems too thick, add a little water.",
    "While the chicken and tomatoes are cooking, preheat the oven to 400°F. Roast the peppers for about 45 minutes, turning them every now and then, until they are soft, blistered, charred, and floppy, at which point tip them into a bowl and cover it tightly with plastic wrap. Leave them to steam for 10 minutes, by which time the skins should be easy to peel away. Discard the skins, seeds, stem, and pith. Cut or tear the peppers into thick strips and stir them into the chicken. Cook over low heat for another 5 minutes so that the flavors have a chance to mingle.",
    "Allow the pan to sit for about 15 minutes, or better still for an hour or several. You can serve it at room temperature or reheat it over low heat until warm, but not hot."
  ]
}