{
  "title": "Pollo in Guajillo",
  "source": "Bricia Lopez, Javier Cabral - Asada: The Art of Mexican-Style Grilling",
  "servings": "Serves 4",
  "categories": [
    "Asada: The Art of Mexican-Style Grilling",
    "Mexican"
  ],
  "ingredients": [
    "12guajillo chiles (1¾ ounces/50 g), stems and seeds removed",
    "½large white onion (5¼ ounces/150 g), roughly chopped",
    "8cloves garlic, peeled",
    "¼teaspoon black peppercorns (about 12 peppercorns)",
    "1whole clove",
    "1tablespoon dried Mexican oregano",
    "2tablespoons grapeseed oil",
    "¼cup (60 ml) orange juice",
    "2tablespoons seasoned rice vinegar",
    "2tablespoons fresh lime juice",
    "¼teaspoon ground cinnamon",
    "1½tablespoons sea salt",
    "2pounds (910 g) bone-in chicken thighs"
  ],
  "directions": [
    "Add the peppercorns, clove, and dried oregano to the pan and lightly toast until they are aromatic, about 2 minutes. Transfer the toasted spices and oregano to a molcajete or spice grinder and grind until finely ground.",
    "In a high-performance blender or food processor, add the toasted chiles, onion, garlic, ground spices and oregano, oil, orange juice, rice vinegar, lime juice, cinnamon, and salt. Blend until most of the chiles have come apart.",
    "Pat the chicken dry with paper towels. Using a gallon-size resealable bag, add the marinade and the chicken. Seal and let sit in the refrigerator for at least 30 minutes or overnight.",
    "Remove the chicken thighs in their marinade from the fridge to allow them to reach room temperature before grilling.",
    "Start a charcoal or gas grill. The gas should be set to high. If using a pellet grill, preheat your grill to 450°F (230°C) for at least 15 minutes. If using charcoal, the coals should be red but entirely covered with gray ash.",
    "Remove the chicken from the marinade and put them on the grill directly over the medium fire, skin side up. Close the lid and cook, turning once, about 15 minutes on each side. The chicken is cooked when its internal temperature reaches 175°F (79°C) on a meat thermometer. Transfer the meat to a cutting board and let rest for 5 minutes.",
    "In a cast-iron skillet over medium heat, lightly toast the chiles, about 2 to 3 minutes on each side. Remove from the skillet and set aside.",
    "In the same skillet, add the onion and garlic, turning once or twice until they are lightly charred, about 10 minutes. Remove from the skillet and set aside.",
    ""
  ]
}