{
  "title": "Polpette al Sugo",
  "source": "My Kitchen in Rome - Rachel Roddy",
  "servings": "Makes 12–15",
  "categories": [
    "Italian",
    "My Kitchen in Rome - Rachel Roddy"
  ],
  "ingredients": [
    "1⅓cups fresh bread crumbs, preferably from stale bread",
    "¼cup milk",
    "14ounces ground beef",
    "7ounces ground pork, or a fat sausage",
    "1egg",
    "⅓cup grated Parmesan",
    "a grating of nutmeg",
    "2tablespoons finely chopped flat-leaf parsley and mint",
    "salt and freshly ground black pepper",
    "for the sauce:",
    "2(14.5-ounce) cans plum tomatoes",
    "1garlic clove",
    "3tablespoons olive oil",
    "2bay leaves"
  ],
  "directions": [
    "Preheat the oven to 425°F and grease a baking sheet. Put the bread crumbs in a small bowl with the milk and leave it for 10 minutes, or until the bread absorbs the milk. Mix together all the ingredients for the meatballs and season with salt and pepper. Using your hands, mold the mixture into roughly 1½-ounce balls if you are eating them alone or with mash or rice, or ¾-ounce balls for eating with pasta (you could weigh the first one to get an idea). Put the balls on the prepared baking sheet and bake for 15 minutes for big ones or 8 minutes for small ones, turning them once, until they are just starting to brown. Alternatively, fry the polpette in a sauté pan in a little olive oil, turning them carefully until evenly browned.",
    "Meanwhile, make the tomato sauce. Coarsely chop the tomatoes or pass them through a food mill. Crush the garlic with the back of a knife. Heat the oil in a large, deep frying pan, add the garlic, and cook gently over low heat until the scent rises up from the pan. Add the tomato and bay leaves and simmer for 15 minutes, stirring and breaking the tomatoes up further with the back of a wooden spoon, until the sauce is thick. Season with salt and pepper, then add the meatballs and cook them in the sauce for a further 15 minutes.",
    "Serve alone with bread on the side, or with mashed potatoes or rice. If you are serving them with pasta, transfer the meatballs from the sauce with a slotted spoon to a warm plate. Mix the sauce with cooked drained spaghetti in a wide bowl, then dot with the meatballs and serve."
  ]
}