{
  "title": "Pomegranate-Roasted Salmon With Lentils And Swiss Chard",
  "source": "Modern Bistro - ATK",
  "servings": "4",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "2tablespoons plus 1 teaspoon extra-virgin olive oil, divided",
    "12ounces Swiss chard, stemmed, ½ cup stems chopped fine, leaves cut into 2-inch pieces",
    "1small onion, chopped fine",
    "2garlic cloves, minced",
    "4sprigs fresh thyme",
    "¾teaspoon table salt, divided",
    "2cups chicken or vegetable broth",
    "1cup lentilles du Puy, picked over and rinsed",
    "4(6- to 8-ounce) skin-on salmon fillets, 1 inch thick",
    "2tablespoons pomegranate molasses, divided",
    "¼teaspoon pepper",
    "½cup pomegranate seeds"
  ],
  "directions": [
    "1. Adjust oven rack to lowest position, place aluminum foil–lined rimmed baking sheet on rack, and heat oven to 500 degrees. Heat 1 tablespoon oil in large saucepan over medium-high heat until shimmering. Add chard stems, onion, garlic, thyme sprigs, and ¼ teaspoon salt and cook, stirring frequently, until softened, about 5 minutes. Stir in broth and lentils and bring to boil. Reduce heat to low, cover, and simmer, stirring occasionally, until lentils are mostly tender, 45 to 50 minutes.",
    "2. Stir chard leaves into lentils. Increase heat to medium-low and continue to cook, uncovered, until chard leaves are tender, about 4 minutes. Off heat, discard thyme sprigs, stir in 1 tablespoon oil, and season with salt and pepper to taste; cover to keep warm.",
    "3. Meanwhile, make 4 or 5 shallow slashes, about 1 inch apart, on skin side of each fillet, being careful not to cut into flesh. Pat salmon dry with paper towels. Brush with remaining 1 teaspoon oil, then brush with 1 tablespoon pomegranate molasses and sprinkle with remaining ½ teaspoon salt and pepper. Reduce oven temperature to 275 degrees and use oven mitts to remove sheet from oven. Carefully place salmon skin-side down on hot sheet. Roast until center is still translucent when checked with tip of paring knife and registers 125 degrees (for medium-rare), 8 to 12 minutes.",
    "4. Brush salmon with remaining 1 tablespoon pomegranate molasses. Transfer salmon to individual plates or serving platter. Stir pomegranate seeds into lentil mixture and serve with salmon."
  ]
}