{
  "title": "Pomegranate-Glazed Bone-In Chicken Breasts With Farro Salad",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "1½cups whole farro",
    "¾teaspoon table salt, divided, plus salt for cooking farro",
    "4(12-ounce) bone-in split chicken breasts, trimmed and halved crosswise",
    "¼teaspoon pepper, divided",
    "¼cup extra-virgin olive oil, divided",
    "6tablespoons pomegranate molasses",
    "1teaspoon ground cinnamon",
    "2tablespoons plain Greek yogurt",
    "1shallot, minced",
    "2tablespoons lemon juice",
    "1English cucumber, halved lengthwise and cut into ¼-inch pieces",
    "8ounces cherry tomatoes, halved",
    "¼cup chopped fresh mint"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 450 degrees. Set wire rack in aluminum foil–lined rimmed baking sheet. Bring 4 quarts water to boil in Dutch oven. Add farro and 1 tablespoon salt, return to boil, and cook until grains are tender with slight chew, 15 to 30 minutes. Drain farro, spread in second rimmed baking sheet, and let cool completely, about 15 minutes.",
    "2. Pat chicken dry with paper towels and sprinkle with ½ teaspoon salt and ⅛ teaspoon pepper. Heat 1 tablespoon oil in 12-inch skillet over medium-high heat until just smoking. Cook chicken skin side down until well browned, 5 to 7 minutes. Flip chicken and brown lightly on second side, about 3 minutes; transfer skin side up to prepared rack.",
    "3. Meanwhile, combine pomegranate molasses, cinnamon, and ⅛ teaspoon salt in bowl. Brush top of chicken with half of pomegranate glaze. Transfer to oven and roast for 10 minutes. Brush chicken with remaining pomegranate glaze and continue to roast until chicken registers 160 degrees, 5 to 10 minutes. Cover with aluminum foil and let rest.",
    "4. Whisk yogurt, shallot, lemon juice, remaining 3 tablespoons oil, remaining ⅛ teaspoon salt, and remaining ⅛ teaspoon pepper together in large bowl; set aside.",
    "5. Add cooled farro, cucumber, tomatoes, and mint to bowl with vinaigrette and toss gently to combine. Season with salt and pepper to taste. Serve with chicken."
  ]
}