{
  "title": "Poppy Seed Almond Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Makes 1 Bundt cake",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: Stand or hand mixer, 12-cup Bundt pan ①",
    "Cake",
    "Neutral oil and all-purpose flour for the pan",
    "2⅓cups granulated sugar (16.4 oz / 465g)",
    "2tablespoons poppy seeds (0.6 oz / 17g)",
    "1½teaspoons baking powder (0.21 oz / 6g)",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "3cups all-purpose flour (13.8 oz / 390g)",
    "1½cups whole milk (12.7 oz / 360g)",
    "1⅓cups neutral oil, such as vegetable or grapeseed (10.2 oz / 288g)",
    "3large eggs (4.3 oz / 150g)",
    "1½teaspoons vanilla extract",
    "1½teaspoons almond extract",
    "Glaze",
    "¾cup powdered sugar (3.2 oz / 90g)",
    "¼cup orange juice (2 oz / 57g)",
    "2teaspoons butter, melted",
    "½teaspoon vanilla extract",
    "½teaspoon almond extract"
  ],
  "directions": [
    "Preheat the oven and prepare the pan: Arrange an oven rack in the center position and preheat the oven to 350°F. Generously brush the inside of the Bundt pan with oil. Dust flour all around the bottom, sides, and up the tube. Tap out the excess and set aside.②",
    "Combine the sugar and dry ingredients: In the bowl of a stand mixer fitted with the paddle attachment (or in a large bowl if using a hand mixer), mix together the granulated sugar, poppy seeds, baking powder, salt, and flour.",
    "Add the wet ingredients and beat: Add the milk, oil, eggs, and vanilla and almond extracts to the bowl and beat on low just to combine. Increase the speed to medium-high and beat until the batter is very smooth and thick, about 2 minutes. (If using a hand mixer, beat about a minute longer.)",
    "Fill the pan and bake: Scrape the batter into the prepared pan and bake until the top is risen, split, and deep golden brown and a cake tester or toothpick inserted into the deepest part of the cake comes out clean, 80 to 90 minutes. Let the cake cool in the pan for 15 minutes.",
    "Invert the cake and poke holes: Use a butter knife or a small offset spatula to cut down and around the inner and outer edges of the Bundt pan. Invert it onto a wire rack and tap the rack sharply against the counter to release the cake. Remove the pan and poke holes all over the top of the cake with a skewer or toothpick. Set the rack over a rimmed baking sheet (to catch the drips of glaze) and set the cake aside.",
    "Make the glaze and finish the cake: In a medium bowl, whisk the powdered sugar, orange juice, melted butter, and vanilla and almond extracts until smooth. Brush all of the glaze over the top of the cake, allowing it to absorb. Using the brush, collect any glaze that dripped onto the baking sheet and brush back over the cake. Let cool completely."
  ]
}