{
  "title": "Porcini with Rosemary and Garlic",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Caramelized Garlic",
    "56g / ¼ cup olive oil",
    "75g / 15 whole cloves garlic",
    "To Finish",
    "1.2kg / 2½ lb porcini mushrooms (about 8)",
    "42g / 3 Tbsp plus 56g / ¼ cup olive oil, plus more q.b.",
    "30g / 6 cloves garlic, finely chopped",
    "Salt, q.b.",
    "1lemon, cut in half and seeds removed",
    "Peel of ½ lemon, pith removed and peel finely chopped",
    "3sprigs rosemary, leaves removed from stems",
    "Flaky sea salt, q.b."
  ],
  "directions": [
    "1   To make the caramelized garlic, place a large sauté pan over low heat and add the olive oil. Add the garlic, arranging the cloves in a single layer. Cook slowly, stirring to ensure even cooking, until they are light golden brown and soft enough to mash, 7 to 10 minutes.",
    "2   Remove from the heat and let cool. Set aside until ready to use, or transfer the garlic and oil to an airtight container and refrigerate for up to 3 days.",
    "3   To finish, clean the dirt from the mushrooms by peeling off the first layer of flesh on the stems with a paring knife. Be careful to avoid taking off too much. With a slightly damp towel, gently but thoroughly clean away any remaining dirt.",
    "4   Cut the mushrooms in half lengthwise.",
    "5   Place a sauté pan over low heat and add 42g / 3 Tbsp of the olive oil. Add the chopped garlic and gently cook until aromatic but without color, 10 to 15 seconds. Set aside.",
    "6   Place a large sauté pan over medium heat and add the remaining 56g / ¼ cup olive oil. Add the porcini, cut side down, in a single layer. Place another pan on top to weight them down for a more even sear (they tend to curl a bit when they hit the pan) and cook for 1 to 2 minutes. Remove the top pan and continue to cook until golden brown and glossy, 2 to 3 minutes.",
    "7   Turn the mushrooms over and continue cooking until golden brown and cooked through but not mushy, another 2 to 3 minutes. You may need to add a bit more olive oil, as mushrooms absorb quite a bit as they cook. During the last minute of cooking, season the mushrooms on both sides with salt q.b. and toss. Set aside.",
    "8   Remove the caramelized cloves from their oil and transfer to a large bowl. Lightly mash them with the back of a fork.",
    "9   Add the mushrooms and gently cooked chopped garlic, then squeeze in the juice from the lemon halves and stir to combine.",
    "10   Transfer the mushrooms, cut side up, to a serving platter or divide onto plates. Garnish with the lemon peel, rosemary, a drizzle of olive oil, and sea salt q.b."
  ]
}