{
  "title": "Pork and Tofu Meatballs with Buttermilk Sauce",
  "source": "The Gaijin Cookbook - Ivan Orkin",
  "servings": "Serves 6 to 8 as an hors d’oeuvre",
  "categories": [
    "Japanese",
    "The Gaijin Cookbook - Ivan Orkin"
  ],
  "ingredients": [
    "½onion",
    "7garlic cloves, peeled",
    "One 3-inch piece ginger, peeled",
    "2tablespoons soy sauce",
    "½teaspoon kosher salt",
    "2large eggs",
    "1pound ground pork",
    "¼package (3½ ounces) soft tofu",
    "2½cups panko",
    "6 to 8cups vegetable oil for deep-frying",
    "For Serving",
    "Buttermilk Sauce (recipe follows)",
    "Bull-Dog tonkatsu sauce",
    "Katsuobushi (bonito flakes)",
    "Buttermilk Sauce",
    "Makes about ⅔ cup",
    "¼cup sour cream",
    "3tablespoons Kewpie mayonnaise",
    "2tablespoons buttermilk",
    "1tablespoon white (shiro) miso",
    "1½teaspoons aonori (powdered dried green seaweed)",
    "½teaspoon wasabi paste (from a tube is fine)"
  ],
  "directions": [
    "1. Combine the onion, garlic, ginger, soy sauce, and salt in a food processor and process until smooth. Throw in the eggs and whir for 10 more seconds. Pour the mixture into a bowl and add the ground pork, tofu, and 1½ cups of the panko. Mix thoroughly by hand, cover with plastic wrap, and refrigerate for at least 4 hours or overnight.",
    "2. The next day, pulse the remaining 1 cup panko in the food processor until you have a coarse meal, about 15 seconds. Transfer to a shallow container. Retrieve the meatball mixture from the fridge and roll it into 1-ounce (golfball–size) balls.",
    "3. Heat 4 inches of vegetable oil to 325°F in a deep pot over medium heat. Roll each meatball in the panko meal, shake off any excess, and fry for 5 minutes, or until deeply browned and fully cooked through.",
    "4. Transfer the meatballs to a platter and top each one with a spoonful of buttermilk sauce, a squeeze of Bull-Dog sauce, and a few flakes of katsuobushi. Serve as an hors d’oeuvre.",
    "Buttermilk SauceWhisk everything together in a bowl. Transfer to an airtight container. The sauce can be refrigerated for up to 2 days.",
    ""
  ]
}