{
  "title": "Pork Stir-Fried Noodles",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "1pound boneless country-style pork ribs, trimmed",
    "3tablespoons soy sauce",
    "2tablespoons oyster sauce",
    "2tablespoons hoisin sauce",
    "1tablespoon toasted sesame oil",
    "1/4teaspoon liquid smoke",
    "1/4teaspoon five-spice powder",
    "1/2cup chicken broth",
    "1tablespoon chili-garlic sauce",
    "1teaspoon cornstarch",
    "5teaspoons vegetable oil, divided",
    "1/4cup Shaoxing wine, divided",
    "8ounces shiitake mushrooms, stemmed and halved if small or quartered if large",
    "1/2small head napa cabbage, halved, cored, and sliced crosswise into 1/2-inch strips (4 cups)",
    "10scallions, white parts sliced thin, green parts cut into 1-inch pieces",
    "2garlic cloves, minced",
    "2teaspoons grated fresh ginger",
    "12ounces fresh lo mein noodles"
  ],
  "directions": [
    "1. Transfer pork to plate and freeze until firm, about 15 minutes. Slice pork crosswise 1/8 inch thick on bias. Whisk soy sauce, oyster sauce, hoisin, sesame oil, liquid smoke, and five-spice powder together in bowl. Transfer 3 tablespoons soy sauce mixture to medium bowl; add pork and stir to break up clumps. Cover and refrigerate for at least 15 minutes or up to 1 hour.",
    "2. Whisk broth, chili-garlic sauce, and cornstarch into remaining soy sauce mixture; set aside.",
    "3. Heat empty 14-inch flat-bottomed wok over high heat until just beginning to smoke. Drizzle 1 teaspoon vegetable oil around perimeter of wok and heat until just smoking. Add half of pork mixture and cook, tossing slowly but constantly, until pork is lightly browned, 2 to 3 minutes. Add 2 tablespoons Shaoxing wine and cook, stirring constantly, until liquid is reduced and pork is well coated, 30 to 60 seconds. Transfer pork mixture to clean medium bowl and repeat with 1 teaspoon oil, remaining pork mixture, and remaining 2 tablespoons Shaoxing wine. Wipe wok clean with damp paper towels.",
    "4. Heat now-empty wok over high heat until just beginning to smoke. Drizzle 1 teaspoon vegetable oil around perimeter of wok and heat until just smoking. Add mushrooms and cook, tossing slowly but constantly, until light golden brown, 4 to 6 minutes; transfer to bowl with pork mixture.",
    "5. Add 1 teaspoon vegetable oil and cabbage to now-empty wok and cook, tossing slowly but constantly, until spotty brown, 3 to 5 minutes. Push cabbage to 1 side of wok. Add remaining 1 teaspoon oil, scallions, garlic, and ginger to clearing and cook, mashing mixture into wok, until fragrant, about 30 seconds. Stir scallion mixture into cabbage. Add pork mixture and reserved chicken broth mixture and cook, stirring frequently, until sauce is thickened, about 2 minutes.",
    "6. Meanwhile, bring 4 quarts water to boil in large pot. Add noodles and cook, stirring often, until almost tender (center should still be firm with slightly opaque dot). Drain noodles, transfer to wok, and cook over medium-high heat, tossing gently, until noodles are tender and evenly coated with sauce. Serve."
  ]
}