{
  "title": "Pork Curry from Scratch",
  "source": "The Gaijin Cookbook - Ivan Orkin",
  "servings": "Serves 4 to 6",
  "categories": [
    "Japanese",
    "The Gaijin Cookbook - Ivan Orkin"
  ],
  "ingredients": [
    "2tablespoons vegetable oil",
    "1¼pounds boneless pork shoulder or boneless country-style ribs, cut into 1-inch cubes",
    "2large onions, roughly chopped",
    "2tablespoons minced ginger",
    "2tablespoons minced garlic",
    "1large russet potato, peeled and cut into large chunks",
    "1large carrot, peeled and cut into 1-inch chunks",
    "1tablespoon kosher salt",
    "3tablespoons unsalted butter",
    "2tablespoons all-purpose flour",
    "¼cup curry powder (I like S&B brand)",
    "4cups chicken stock, Dashi, or water",
    "3tablespoons ketchup",
    "3tablespoons Bull-Dog tonkatsu sauce",
    "Soy sauce"
  ],
  "directions": [
    "1 Heat a Dutch oven or other large heavy-bottomed pot over medium heat, then coat with 1 tablespoon of the vegetable oil. Working in batches if necessary, brown the pork on all sides. Take a good 10 to 15 minutes to render the fat and achieve some nice browning. As the pieces are browned, transfer them to a bowl or plate.",
    "2 Pour off all but 1 tablespoon of the fat from the pot. Add the onions and cook until they’re slightly softened and beginning to brown around the edges, about 5 minutes. Stir in the ginger and garlic and cook until fragrant, about 2 minutes more. Stir in the potato and carrot, season with the salt, and cook for 4 minutes, stirring regularly.",
    "3 Return the meat and any accumulated juices to the pan. Add the remaining 1 tablespoon oil and the butter to the pot and let the butter melt. Mix the flour and curry powder together, then sprinkle evenly over the vegetables and meat. Stir to distribute the flour-curry mix, pour in the stock or water, and stir again to combine. Bring to a simmer, then drop the heat to low and stir in the ketchup and Bull-Dog sauce. Cook until the meat and vegetables are tender, 30 to 40 minutes, stirring occasionally to prevent scorching.",
    "4 Season the curry to taste with soy sauce and serve over steamed rice with a side of pickles."
  ]
}