{
  "title": "Pork Tenderloin Agrodolce With Squash Rings",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "2 to 4 servings (this doubles easily for a crowd)",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "sauce",
    "2tablespoons (30 ml) olive oil",
    "1small red onion, thinly sliced",
    "¼teaspoon kosher salt",
    "2teaspoons (10 grams) tomato paste",
    "2tablespoons (25 grams) granulated sugar",
    "½cup (120 ml) red wine vinegar",
    "squash",
    "One 2-pound (about 1-kilogram) delicata or acorn squash",
    "1tablespoon (15 ml) olive oil",
    "Salt and freshly ground black pepper",
    "tenderloin",
    "1teaspoon fennel seeds, crushed with mortar and pestle",
    "2teaspoons finely chopped fresh rosemary",
    "¾teaspoon kosher salt",
    "Freshly ground black pepper",
    "One 1-to-1¼-pound (455-to-565-gram) pork tenderloin",
    "1tablespoon (15 ml) olive oil",
    ""
  ],
  "directions": [
    "Heat the oven to 425 degrees.",
    "make the sauce Heat the olive oil in a large skillet over medium heat. Add the onion and salt, and cook, stirring frequently, until the onion is softened and beginning to brown, about 10 minutes. Add the tomato paste, and stir to combine, then add the sugar and vinegar. Bring to a simmer, then reduce the heat to medium-low, and cook until slightly syrupy but still loose enough that there is a small puddle around the onion, 5 to 7 more minutes. Remove from the heat and set aside.",
    "make the squash Cut the ends off the squash and scrape out the seeds with a spoon. Slice the squash into ½-inch rings. Coat a baking sheet with olive oil. Spread the squash rings on the baking sheet in one layer, and sprinkle with salt and pepper. Roast for about 30 minutes, until bronzed underneath, then flip and roast for another 10 minutes, until browned at the edges and tender in the center.",
    "meanwhile, prepare the pork tenderloin Combine the fennel, rosemary, ¾ teaspoon salt, and a generous amount of black pepper. Pat the tenderloin dry, then rub the spice mixture onto all sides. Heat a large ovenproof skillet over medium-high heat, and add 1 tablespoon olive oil. When the oil is hot, add the pork, and sear the tenderloin until it is brown on all sides. Brush some of the liquid from the onion pan all over the tenderloin before transferring the skillet to the oven. Roast for 10 to 15 minutes, or until the internal temperature of the meat reaches 145 degrees or the juices run clean when pricked with the tip of a knife. Let it rest on a cutting board for 5 minutes before thinly slicing.",
    "to serve Pile the squash rings on a platter, and drape them with three-quarters of the onion and the sauce. Top with sliced pork tenderloin, and add the remaining onion mixture on top to finish."
  ]
}