{
  "title": "Pork Sausages with Mustardy Lentils & Celery",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "4celery stalks",
    "1lemon",
    "1cup parsley leaves",
    "4garlic cloves",
    "1medium yellow or white onion",
    "MEAT",
    "1pound fresh pork sausages (any kind)",
    "PANTRY",
    "Kosher salt",
    "1½cups French green lentils (a.k.a. lentilles du Puy) or black beluga lentils",
    "4tablespoons extra-virgin olive oil",
    "2tablespoons Dijon mustard",
    "Freshly ground black pepper"
  ],
  "directions": [
    "1. Cook the lentils: Fill a medium saucepan about three-quarters full with water. Season with 1 tablespoon salt and bring to a boil. Add the lentils, adjust the heat to medium-low to maintain a simmer, and cook, stirring once or twice, until just tender but not mushy, 20 to 30 minutes. Drain the cooked lentils in a fine-mesh strainer.",
    "2. Meanwhile, make the celery salad and prep your vegetables:",
    "- Pick off any leaves attached to 4 celery stalks and place them in a medium bowl. Trim any nasty brown ends off the stalks, thinly slice on a bias, and add to the bowl with the leaves.",
    "- Zest about half a lemon into the celery. Cut the lemon in half and squeeze the zested half into the bowl, tossing to combine. Reserve the remaining lemon half for the lentils.",
    "- Add 1 cup parsley leaves to the bowl, but don’t toss the salad yet; we’ll get to that later, closer to serving time so it stays crisp. Keep chilled.",
    "- Thinly slice 4 garlic cloves.",
    "- Finely chop 1 medium yellow onion. Not sure how? Right this way for a quick onion dicing lesson!",
    "3. Cook the sausages: Once the lentils have been cooking for about 15 minutes, heat a 12-inch cast-iron skillet over medium heat. Add 3 tablespoons olive oil and 1 pound pork sausages and cook, turning occasionally, until well browned and cooked through, 10 to 13 minutes. Transfer them to a plate.",
    "4. Finish the lentils:",
    "- Add the onion and garlic to the skillet and return it to medium heat. Cook, stirring often, until the onion is softened, 4 to 5 minutes.",
    "- Add the lentils, 2 tablespoons Dijon mustard, and 1 cup water. Stir, scraping up any browned bits from the pan, until saucy, 3 to 5 minutes. Remove from the heat, squeeze the juice from the reserved lemon half into the pan, and stir again to combine. Taste and add salt if needed.",
    "5. Serve:",
    "- Toss the parsley leaves with the celery, drizzle with 1 tablespoon olive oil, and season with salt and black pepper.",
    "- Slice the sausages on the bias. Divide the lentils among 4 bowls and top each with several slices of sausage and some of the celery salad."
  ]
}