{
  "title": "Portobello Jerky Fried Rice",
  "source": "Mission Vegan - Danny Bowien",
  "servings": "Serves 4",
  "categories": [
    "Korean",
    "Mission Vegan - Danny Bowien"
  ],
  "ingredients": [
    "FOR THE JERKY",
    "- 2 tablespoons extra-virgin olive oil",
    "- 2 tablespoons soy sauce",
    "- 1 tablespoon granulated sugar",
    "- 1 tablespoon Mushroom Seasoning Powder, homemade or store-bought",
    "- 1 tablespoon smoked paprika",
    "- 1 tablespoon ground black pepper",
    "- 2 pounds portobello mushrooms, stems removed, cut into ½-inch-thick slices",
    "FOR THE DISH",
    "- 2 teaspoons Umami Salt and Pepper",
    "- 1 teaspoon granulated sugar",
    "- ¼ cup extra-virgin olive oil",
    "- 2 garlic cloves, thinly sliced",
    "- 4 cups freshly cooked jasmine rice",
    "- 2 cups coarsely crumbled salted potato chips",
    "- ½ cup sliced (¼ inch) sawtooth herb",
    "- ½ cup very thinly sliced red onion"
  ],
  "directions": [
    "1. PREHEAT the oven to 250ºF.",
    "2. IN a large mixing bowl, combine the oil, soy sauce, sugar, mushroom seasoning powder, smoked paprika, and black pepper and stir well. Add the mushrooms and toss gently until evenly coated, taking care not to break them. Spread the mushrooms on two large parchment paper–lined sheet pans in a single layer, leaving a little space between them.",
    "3. BAKE until the mushrooms look deep brown and shriveled, their surface is dry, and they’re chewy, like jerky, about 2 hours.",
    "4. LET them cool completely, then store in an airtight container in the fridge for up to 4 days.",
    "5. IN a small mixing bowl, combine the umami salt and pepper, sugar, and 1 tablespoon warm water and stir to dissolve. Chop enough mushroom jerky into ½-inch pieces to give you 2 cups.",
    "6. COMBINE the oil and garlic in a large nonstick skillet, set it over medium-high heat, and let the oil sizzle. Cook, swirling occasionally, until the garlic turns golden brown, about 45 seconds. Add the mushroom jerky, stir to coat in the oil, then turn off the heat.",
    "7. ADD the rice and stir gently, breaking up any clumps but not smashing the grains. Stir in the sugar mixture, turn the heat to high, and cook, stirring occasionally, just until it’s hot through, 30 seconds to 1 minute. Add the chips and give it all one more good toss.",
    "8. TRANSFER to plates and garnish with the sawtooth herb and onions. Serve right away."
  ]
}