{
  "title": "Pot Roast au Poivre with Charred Onions",
  "source": "By Heart - Hailee Catalano",
  "servings": "SERVES 6 TO 8",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Pot Roast",
    "2teaspoons black peppercorns",
    "3tablespoons shiitake mushroom powder (see Note)",
    "1tablespoon kosher salt",
    "One 31⁄2-pound (1.5 kg) chuck roast, tied with butcher’s twine to keep snug while cooking",
    "Olive oil, for searing",
    "4medium yellow onions, peeled and halved",
    "8garlic cloves, peeled and smashed",
    "1⁄2 cup (120 ml) cognac or brandy",
    "2cups (480 ml) unsalted beef stock, homemade or store-bought",
    "1small bunch fresh thyme, tied together with butcher’s twine",
    "2dried bay leaves",
    "Sauce",
    "2tablespoons unsalted butter",
    "3small shallots, minced",
    "2tablespoons green peppercorns in brine, drained and roughly chopped",
    "1⁄2 cup (120 ml) cognac or brandy",
    "1⁄2 cup (120 ml) heavy cream",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Thinly sliced fresh chives, to taste"
  ],
  "directions": [
    "1. Make the roast: The night before you want to cook the roast, crush the black peppercorns into a coarse powder with a mortar and pestle or spice grinder. Transfer to a small bowl along with the mushroom powder and salt, and mix.",
    "2. Season the roast all over with the spice mix. Transfer to a wire rack on top of a sheet tray, and let sit, uncovered, in the refrigerator for at least 8 hours or up to 24 hours.",
    "3. The next day, preheat the oven to 325°F (165°C) with a rack positioned in the lower third.",
    "4. Coat the bottom of a large Dutch oven with olive oil, and heat over medium heat. Add the roast, and sear on all sides until deep golden, 5 to 7 minutes per side. Adjust the heat as needed to ensure that the bits at the bottom of the pot don’t burn. Transfer the meat to a large plate.",
    "5. Add the onions, cut side down, to the Dutch oven, and sear until deep golden, 2 or 3 minutes. (The onions won’t be fully cooked at this point, just charred.) Add the garlic, and cook for 1 minute.",
    "6. Remove the pot from the heat (leaving the onions and garlic in the pot), and deglaze with the cognac, scraping up any brown bits from the bottom of the pot. Reduce the cognac by half using the residual heat, 1 or 2 minutes.",
    "7. Return the pot to medium heat, and add the beef stock, thyme, and bay leaves. Bring to a simmer and then return the roast to the pot along with any accumulated juices. The liquid should come about halfway up the side of the meat. (If not, add some water.)",
    "8. Cover and bake for 3 for 4 hours, until fork-tender. Transfer the meat to a platter, remove the twine, and cover with foil to keep warm.",
    "9. Scoop out the onions and garlic using a slotted spoon (they will be very soft), place them on a small plate, and set aside.",
    "10. Make the sauce: Strain the braising liquid into a large bowl. Skim off any excess fat from the top with a spoon and discard.",
    "11. Wipe out the Dutch oven, and heat over medium heat. Add the butter and melt. Toss in the shallots, and sweat until soft, 3 or 4 minutes.",
    "12. Stir in the green peppercorns. Turn off the heat, and deglaze with the cognac. Reduce the cognac by half using the residual heat, 1 or 2 minutes.",
    "13. Set the pot over medium-high heat, and add 11⁄2 cups (360 ml) of the reserved braising liquid. (Discard any remaining liquid.) Reduce until the liquid lightly coats the back of a spoon, 6 to 8 minutes.",
    "14. Add the cream and continue to reduce the sauce until it fully coats the back of the spoon, 4 to 6 minutes. Season with salt and pepper, if needed.",
    "15. Top the beef with the sauce, and garnish with chives. Serve the charred onions alongside the beef on the platter."
  ]
}