{
  "title": "Pot of Pasta with Broccoli Rabe and Chorizo Bread Crumbs",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 6 to 8",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "1pound fresh chorizo or spicy hot Italian sausage (about 4 links), casings removed",
    "6tablespoons olive oil, divided, plus more as needed",
    "1½cups fresh coarse bread crumbs (see this page) or panko",
    "Kosher salt and freshly ground black pepper",
    "1pound dried tube-shaped pasta, such as rigatoni or ziti",
    "6garlic cloves, thinly sliced",
    "¼cup tomato paste (1 4-ounce can)",
    "1large bunch of broccoli rabe, stems trimmed, coarsely chopped",
    "Hunk of pecorino, parmesan, or ricotta salata, for grating"
  ],
  "directions": [
    "1 Cook the sausage in a large pot over medium-high heat, breaking up the meat with the back of a spoon, until browned, 5 to 8 minutes. Using a slotted spoon, remove the sausage, leaving the fat behind.2 Add 3 tablespoons oil and the bread crumbs to the pot; season with salt and pepper. Cook, stirring frequently, until the bread crumbs are golden brown, 2 to 3 minutes. Transfer to a bowl.3 Cook the pasta in a large pot of salted boiling water until just al dente. Drain, reserving at least 1 cup of the pasta water.4 Meanwhile, heat the remaining 3 tablespoons olive oil in the pot, then add the garlic and cook, stirring occasionally, until it’s toasted and golden brown, 2 to 3 minutes. Add the tomato paste and cook, stirring constantly, until it’s a nice brick-red color and starts to stick a bit to the bottom of the pot, 2 to 3 minutes more.5 Reduce the heat to medium-low and add the broccoli rabe, then season with salt and pepper. Cook, stirring occasionally, until it’s all wilted and bright green, 3 to 5 minutes.6 Add the pasta and chorizo back to the pot along with ½ cup of pasta water. Cook, stirring constantly, until each piece of pasta is coated nicely in the tomato-y, chorizo-y sauce.7 Serve straight from the pot (or not), with toasted bread crumbs and pecorino for sprinkling over."
  ]
}