{
  "title": "Potato Galette",
  "source": "Modern Bistro - ATK",
  "servings": "6 to 8",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "2½pounds Yukon Gold potatoes, unpeeled, sliced ⅛ inch thick",
    "5tablespoons unsalted butter, melted, divided",
    "1tablespoon cornstarch",
    "1½teaspoons chopped fresh rosemary",
    "1teaspoon table salt",
    "½teaspoon pepper"
  ],
  "directions": [
    "1 Adjust oven rack to lowest position and heat oven to 450 degrees. Place potatoes in large bowl and fill with cold water. Swirl to remove excess starch, then drain in colander. Spread potatoes on paper towels and dry thoroughly.",
    "2 Whisk 4 tablespoons melted butter, cornstarch, rosemary, salt, and pepper together in a large bowl. Add potatoes and toss until thoroughly coated. Add remaining 1 tablespoon melted butter to 10-inch ovensafe nonstick skillet and swirl to coat. Place 1 potato slice in the center of the skillet, then overlap slices in a circle around the center slice, followed by an outer circle of overlapping slices. Gently place remaining sliced potatoes on top of the first layer, arranging so they form even thickness.",
    "3 Place skillet over medium-high heat and cook until potatoes are sizzling and slices around the edge of the pan start to turn translucent, about 5 minutes. Spray a 12-inch square of aluminum foil with vegetable oil spray. Place foil, sprayed side down, on top of potatoes. Place a 9-inch round cake pan on top of the foil and fill with 2 cups pie weights. Firmly press down on the cake pan to compress the potatoes. Transfer skillet to oven and bake for 20 minutes.",
    "4 Remove cake pan and foil from skillet. Continue to cook until a paring knife can be inserted in the center with no resistance, 20 to 25 minutes. Being careful of the hot skillet handle, return skillet to medium heat on stovetop and cook, gently shaking pan (skillet handle will be hot), until galette releases from sides of skillet, 2 to 3 minutes. Carefully slide galette onto a large plate, place a cutting board over galette, and gently invert plate and cutting board together, then remove plate. Using a serrated knife, gently cut galette into wedges; serve immediately."
  ]
}