{
  "title": "Poulet au Vinaigre",
  "source": "Modern Bistro - ATK",
  "servings": "4 to 6",
  "categories": [
    "***NEED TO MAKE",
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "8(5- to 7-ounce) bone-in chicken thighs, trimmed",
    "1¼teaspoons table salt",
    "¾teaspoon pepper",
    "1tablespoon vegetable oil",
    "1large shallot, minced",
    "2garlic cloves, sliced thin",
    "1cup chicken broth",
    "1cup dry white wine",
    "⅓cup red wine vinegar, plus extra for seasoning",
    "1tablespoon tomato paste",
    "2tablespoons unsalted butter, chilled",
    "1tablespoon minced fresh tarragon"
  ],
  "directions": [
    "1  Adjust oven rack to lower-middle position and heat oven to 325 degrees. Pat chicken dry with paper towels and sprinkle both sides with salt and pepper. Heat oil in 12-inch ovensafe skillet over medium heat until shimmering. Add chicken, skin side down, and cook, without moving it, until well browned, about 8 minutes. Using tongs, flip chicken and brown on second side, about 3 minutes. Transfer chicken to large plate.",
    "2  Pour off all but 2 tablespoons fat from skillet. Add shallot and garlic and cook, stirring frequently, until garlic is golden brown, about 1½ minutes. Add broth, wine, and vinegar; bring to simmer, scraping up any browned bits. Return chicken to skillet, skin side up (skin will be above surface of liquid). Transfer skillet to oven and bake, uncovered, until chicken registers 195 degrees, 35 to 40 minutes.",
    "3  Using tongs, transfer chicken to clean serving platter and tent with aluminum foil. Place skillet over high heat. Whisk tomato paste into liquid and bring to boil. Cook, occasionally scraping sides of skillet to incorporate fond, until sauce is thickened and reduced to 1¼ cups, 5 to 7 minutes. Off heat, whisk in butter and tarragon. Season with salt, pepper, and up to 1 teaspoon extra vinegar (added ¼ teaspoon at a time) to taste. Pour sauce around chicken and serve."
  ]
}