{
  "title": "Pretzel Linzers With Salted Caramel",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 2 dozen linzer sandwiches",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "cookies",
    "3½cups (about 165 grams) small pretzel twists",
    "1½cups (195 grams) all-purpose flour",
    "¾teaspoon baking powder",
    "½teaspoon coarse or kosher salt",
    "¼cup (50 grams) light-brown sugar",
    "1cup (200 grams) granulated sugar",
    "1cup (8 ounces or 225 grams) unsalted butter (cold is fine) cut into medium-sized chunks",
    "1large egg",
    "Powdered sugar, to finish",
    "caramel",
    "½cup (120 ml) heavy cream",
    "2tablespoons (30 grams) unsalted butter",
    "½teaspoon coarse or flaky sea salt",
    "¼cup (60 ml) golden syrup or light corn syrup",
    "⅔cup (130 grams) granulated sugar"
  ],
  "directions": [
    "make the pretzel flour Grind your pretzels in a food processor until very powdery; you cannot blend them too much. Measure from this 1½ cups (155 grams) pretzel “flour.” Discard the rest.",
    "make the cookies Return the measured amount to the food processor and add the flour, baking powder, salt, and sugars, and blend them with the pretzels to combine. Add the butter, and run the machine until the mixture is the texture of cornmeal or nut flour. Add the egg, and run the machine just until the dough clumps.",
    "Place a large sheet of parchment or waxed paper on a large board, and drop the clumpy dough on it. Use your hands to quick-mash it into one mound; don’t bother kneading the dough. Place another large sheet of parchment or waxed paper on top, and, with a rolling pin, roll the dough out into one thin (about ⅛ inch thick) large sheet. If the sheet is too big for your counter, divide the dough and roll out half at a time. Transfer the board, parchment, and flattened dough to the freezer, and chill until it is firm to the touch, about 15 minutes (or as long as you need to do whatever you were going to do next).",
    "Heat the oven to 350 degrees.",
    "Peel back the first layer of parchment, use it to line a large baking sheet, and begin cutting out your cookie shapes. I use a ½-inch and a 2-inch round cookie cutter, and although it would be logical to cut the 2-inch round first, I find that cutting the interior circles first, then the exterior of the cookie second, allows the dough to keep its shape better. You want to keep your dough cold or it will be hard to lift the pieces from the parchment and keep them in shape; if it begins to warm up or soften, just slide the dough back into the freezer for a couple minutes. Reroll the extra scraps. Arrange the cookies an inch or two apart on the prepared baking sheet.",
    "bake the cookies For 10 to 12 minutes, until golden at edges, then cool completely on racks.",
    "meanwhile, make the filling Warm the cream, butter, and salt together until the butter melts. (I use the microwave for this.) Over medium heat, stir the syrup and sugar together in a medium saucepan and let them cook until they are a deep amber color (305 to 310 degrees on a thermometer, but you can also eyeball it). Add the warmed cream mixture, and stir to combine. Cook until the caramel is a copper color, 245 to 250 degrees, and then pour into a heatproof spouted cup for easy pouring. Let it cool until it thickens a little, but not so much that it would be hard to pour, 25 to 30 minutes.",
    "assemble the cookies Arrange all of the linzer lids (the cookies with the holes in them) in one layer, and sift some powdered sugar over them. Arrange all of the bases (the cookies without holes) upside down. Give the caramel a stir and pour about a teaspoon slowly, carefully, onto each base, making sure to stop when the puddle is ¼ inch from the edges. You can always add a drop more or remove a smidge if needed. Repeat with the remaining bottom cookies. Should the caramel cool so much that it’s not pouring well, you can rewarm it in the microwave. Carefully lift the powdered lids on top. I like to put them in the fridge just long enough so the caramel can firm up, 5 to 10 minutes. If any lids slide out of alignment, you can nudge them back into place.",
    "do ahead Well-wrapped frozen sheets of cookie dough keep for months."
  ]
}