{
  "title": "Priya's Dal",
  "source": "Indianish",
  "servings": "",
  "categories": [],
  "ingredients": [
    "For the dal",
    "1cup whole masoor dal (also known as whole red lentils or brown lentils-they are brown in color)",
    "1bay leaf",
    "1teaspoon ground turmeric",
    "1teaspoon kosher salt",
    "2tablespoons fresh lime juice (from about 1 lime)",
    "For the seasoning (also known as chhonk)",
    "2tablespoons ghee or olive oil",
    "2teaspoons cumin seeds",
    "2dried red chiles",
    "Pinch of red chile powder",
    "Pinch of asafetida (optional, but really great)"
  ],
  "directions": [
    "1 MAKE THE DAL: Put the lentils in a bowl, add water to fully cover them, and set aside at room temperature to soak for 1 hour. Drain thoroughly. (if using an electric multi-cooker, skip this step.)",
    "2 In a large pot over high heat, combine the lentils, bay leaf, turmeric, salt, and 4 cups water and bring the water to a boil. Reduce the heat to medium-high, give the lentils a stir, and insert a large long-handled spoon into the pot (to break the surface tension and prevent boiling over). Cook with the spoon still inserted until the lentils are soft but still retain their shape and the entire mixture resembles a thick soup, 20 to 30 minutes. Remove from the heat and let sit for 15 minutes. (Alternatively, in an electric multi-cooker like an Instant Pot, combine the dal, bay leaf, turmeric, salt, and 3 cups water and cook on manual high pressure for 20 minutes, then allow the pressure to release naturally.) Add the lime juice and set aside.",
    "3 MAKE THE SEASONING: In a small pan or butter warmer over medium-high heat, warm the ghee (or oil). Once the ghee melts (or the oil begins to shimmer), add the cumin seeds and cook until they start to sputter and brown, which should take seconds. Immediately remove the pan from the heat and stir in the dried chiles, red chile powder, and asafetida (if using).",
    "4 Add the seasoning to the cooked dal and mix thoroughly."
  ]
}