{
  "title": "Profiteroles with Chocolate Sauce",
  "source": "Modern Bistro - ATK",
  "servings": "Makes: 24 Puffs",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "Cream Puffs:",
    "2Large Eggs Plus 1 Large White",
    "5Tablespoons Unsalted Butter, Cut into 10 Pieces",
    "6Tablespoons Water",
    "2Tablespoons Whole Milk",
    "1½Teaspoons Sugar",
    "¼Teaspoon Table Salt",
    "½Cup (2½ Ounces) All-Purpose Flour, Sifted",
    "Chocolate Sauce:",
    "¾Cup Heavy Cream",
    "3Tablespoons Light Corn Syrup",
    "3Tablespoons Unsalted Butter, Cut into 3 Pieces",
    "Pinch Table Salt",
    "6Ounces Bittersweet Chocolate, Chopped Fine",
    "1Quart Vanilla or Coffee Ice Cream"
  ],
  "directions": [
    "1. For the cream puffs: Adjust oven rack to middle position and heat oven to 425 degrees. Spray rimmed baking sheet with vegetable oil spray and line with parchment paper; set aside. Beat eggs and white in measuring cup. (You should have about ½ cup; discard excess.)",
    "2. Bring butter, water, milk, sugar, and salt to boil in small saucepan over medium heat. When mixture reaches full boil (butter should be fully melted), immediately remove saucepan from heat and stir in flour with spatula until combined and mixture clears sides of pan. Return saucepan to low heat and cook, stirring constantly, using smearing motion, for 3 minutes, until mixture is slightly shiny with wet-sand appearance and tiny beads of fat appear on bottom of saucepan (temperature should register 175 to 180 degrees).",
    "3. Immediately transfer mixture to food processor and process with feed tube open for 10 seconds to cool slightly. With machine running, gradually add eggs in steady stream. When all eggs have been added, scrape down sides of bowl, then process for 30 seconds until smooth, sticky paste forms. (If not using immediately, transfer paste to bowl, press sheet of plastic wrap sprayed with oil spray directly on surface, and store at room temperature for up to 2 hours.)",
    "4A. To portion using pastry bag: Fold down top 3 or 4 inches of 14- or 16-inch pastry bag fitted with ½-inch plain tip to form a cuff. Hold bag open with your hand in cuff and fill bag with paste. Unfold cuff, lay bag on work surface, and, using your hands or bench scraper, push paste into lower portion of pastry bag. Twist top of bag and pipe paste into 1½-inch mounds on prepared baking sheet, spacing them 1 to 1¼ inches apart (you should be able to fit all 24 mounds on baking sheet).",
    "4B. To portion using spoons: Scoop 1 level tablespoon of dough. Using second small spoon, scrape dough onto prepared sheet into 1½-inch mound. Repeat, spacing mounds 1 to 1¼ inches apart (you should be able to fit all 24 mounds on baking sheet).",
    "5. Use back of teaspoon dipped in bowl of cold water to smooth shape and surface of piped mounds. Bake for 15 minutes (do not open oven door), then reduce oven temperature to 375 degrees and continue to bake until puffs are golden brown and fairly firm (puffs should not be soft and squishy), 8 to 10 minutes longer. Remove baking sheet from oven. With paring knife, cut ¾-inch slit into side of each puff to release steam; return puffs to oven, turn off oven, and prop oven door open with handle of wooden spoon. Dry puffs in turned-off oven until centers are just moist (not wet) and puffs are crisp, about 45 minutes. Transfer puffs to wire rack to cool. (Cooled puffs can be stored in airtight container at room temperature for up to 24 hours or frozen in zipper-lock bag for up to 1 month. Before serving, crisp room temperature puffs in 300-degree oven for 5 to 8 minutes, or 8 to 10 minutes for frozen puffs.)",
    "6. For the chocolate sauce: Bring cream, corn syrup, butter, and salt to boil in small saucepan over medium-high heat. Off heat, add chocolate while gently swirling saucepan. Cover pan and let stand until chocolate is melted, about 5 minutes. Uncover and whisk gently until combined. (Sauce can be cooled to room temperature, placed in airtight container, and refrigerated for up to 3 weeks. To reheat, transfer sauce to heatproof bowl set over saucepan of simmering water. Alternatively, microwave at 50 percent power, stirring once or twice, for 1 to 3 minutes.)",
    "7. Line baking sheet with parchment paper; freeze until cold, about 20 minutes. Using 2-inch ice cream scoop (about same diameter as puffs), scoop ice cream onto cold sheet and freeze until firm, then cover with plastic wrap; keep frozen until ready to serve. (Ice cream can be scooped and frozen for up to 1 week.)",
    "8. When ready to serve, use paring knife to split open puffs about ⅜ inch from bottom; set 3 or 4 bottoms on each dessert plate. Place scoop of ice cream on each bottom and gently press tops into ice cream. Pour sauce over profiteroles and serve immediately."
  ]
}