{
  "title": "Pull-Apart Sour Cream and Chive Rolls",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves: 24 rolls",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "½cup plus 2 tablespoons whole milk (5 oz / 142g)",
    "5⅓cups bread flour (1 lb 8.4 oz / 693g)",
    "1½teaspoons active dry yeast (0.18 oz / 5g)",
    "1cup sour cream (8.2 oz / 232g), at room temperature",
    "¼cup sugar (1.8 oz / 50g)",
    "4teaspoons Diamond Crystal kosher salt (0.42 oz / 12g)",
    "3large eggs (5.3 oz / 150g)",
    "8tablespoons unsalted butter (4 oz / 113g), cut into pieces, at room temperature",
    "½cup very finely chopped chives (0.71 oz / 20g)",
    "Flaky salt and freshly ground black pepper"
  ],
  "directions": [
    "Make the tangzhong: In a small saucepan, whisk ½ cup of the milk (4 oz / 113g), ⅓ cup of the flour (1.5 oz / 43g), and ½ cup water (4 oz / 113g) until smooth. Set the saucepan over medium heat and cook, whisking constantly, until you have a very stiff paste that resembles mashed potatoes, about 2 minutes. Remove the saucepan from the heat and scrape the mixture into the bowl of a stand mixer fitted with the dough hook attachment.",
    "Proof the yeast: Gently warm the remaining 2 tablespoons milk in the same saucepan over low heat until it’s lukewarm but not hot, about 105°F on an instant-read thermometer. Remove from the heat and whisk in the yeast until dissolved. Set the saucepan aside until the mixture is foamy, about 5 minutes.",
    "Mix the dough: To the bowl with the tangzhong, add the sour cream, sugar, kosher salt, 2 of the whole eggs, 4 tablespoons of the butter (2 oz / 57g), and the remaining 5 cups bread flour (22.9 oz / 650g). Scrape in the yeast mixture and mix on low until a shaggy dough forms. Increase the speed to medium and mix, scraping down the sides occasionally with a flexible spatula or dough scraper and adding more flour by the tablespoon if the dough is very sticky, until the dough is very smooth and supple, 8 to 10 minutes.",
    "Let the dough rise once: Scrape the dough out of the bowl and onto a clean work surface. Form it into a smooth ball and dust lightly with flour. Place the dough inside a separate large, clean bowl and cover tightly with plastic wrap. Let it sit in a warm place until roughly doubled in size, 1 to 1½ hours.",
    "Prepare the pan: While the dough is rising, smear 2 tablespoons of the butter across the bottom and sides of a 13 × 9-inch pan, preferably metal (it will be a generous layer of butter, which is what you want). Set the pan aside.",
    "Add the chives and portion the dough: Uncover the dough and use your fist to punch it down lightly to expel some of the gas that built up during the first rise. Turn the dough out onto a lightly floured surface and stretch it into a square. Roll it out into about a 12-inch square, dusting with more flour underneath as needed to prevent sticking, and sprinkle the chives evenly across the dough.",
    "Starting at one end, fold up the dough several times, enclosing the chives in a loose roll. Flatten the roll with the heel of your hand into a long rectangle. Dusting with more flour as needed, roll out the dough again into a 16 × 6-inch rectangle. Use a wheel cutter or bench scraper to cut the dough into twenty-four 2-inch squarish pieces (8 × 3 grid).",
    "Form the rolls: Working with one piece of dough at a time, gather all the edges and pinch them together to form a teardrop shape. Place the piece of dough seam-side down on the work surface. Holding your fingers in a cupped position like you’re playing the piano, place your hand on top of the piece of dough and drag the dough across the surface, moving your hand in a rapid circular motion, to form it into a tight ball. Do not add flour, as this step requires friction between the dough and the surface. Place the ball of dough in the prepared pan and repeat with the remaining pieces of dough, spacing them in a 4 × 6 grid.",
    "Do the second rise and preheat the oven: Cover the pan with plastic wrap and let sit at room temperature until the rolls are nearly doubled in size, 45 to 60 minutes. Meanwhile, arrange an oven rack in the center position and preheat the oven to 375°F.",
    "Brush with egg and bake: Beat the remaining egg in a small bowl with a fork until no streaks remain. Uncover the pan and gently brush the tops of the rolls with the egg, then sprinkle with flaky salt and black pepper. Bake the rolls until the tops are deep golden brown, 25 to 30 minutes.",
    "Brush with more butter and let cool: Remove the pan from the oven and immediately brush the tops of the hot rolls with the remaining 2 tablespoons butter. Let the rolls cool in the pan for 15 minutes. Cut around the sides of the pan to loosen the rolls, then slide a metal spatula underneath to loosen the bottom. Slide the entire grid of rolls out and onto a wire rack to cool. Serve warm or at room temperature."
  ]
}