{
  "title": "Pulled BBQ Chicken Sandwiches with Pineapple Slaw",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "6",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "For the Pulled BBQ Chicken",
    "1½pounds boneless, skinless chicken thighs",
    "Kosher salt and freshly ground black pepper",
    "2tablespoons canola oil",
    "1small onion, thinly sliced",
    "3cloves garlic, minced",
    "2tablespoons tomato paste",
    "½cup ketchup",
    "⅓cup tomato sauce",
    "¼cup apple cider vinegar",
    "2tablespoons dark brown sugar",
    "1tablespoon finely chopped canned chipotle in adobo sauce (leave the seeds in and even add more if you want it spicy)",
    "1teaspoon mustard powder (or French’s ballpark-style mustard in a pinch)",
    "For the Slaw",
    "3cups shredded green cabbage (about ½ pound)",
    "3cups shredded red cabbage (about ½ pound)",
    "1small carrot, grated",
    "2scallions, thinly sliced",
    "¼cup fresh or canned pineapple chunks (drained if canned), finely chopped",
    "¾cup mayonnaise",
    "2tablespoons apple cider vinegar",
    "1½teaspoons granulated sugar (optional)",
    "½teaspoon kosher salt",
    "½teaspoon freshly ground black pepper",
    "6King’s Hawaiian rolls or potato buns (toasted if you want)"
  ],
  "directions": [
    "MAKE THE PULLED BBQ CHICKEN: Season the chicken generously with salt and pepper. In a medium Dutch oven, heat the oil over medium-high heat until shimmering-hot. Add the chicken in one layer (work in batches if you have to) and brown it until golden all over, 3 to 4 minutes per side. Transfer to a plate and set aside.",
    "Add the onion to the pan and cook, stirring, until golden, 9 to 10 minutes. Add the garlic and cook 2 more minutes. Add the tomato paste and cook, stirring, for 2 minutes. Add the ketchup, tomato sauce, ¼ cup water, vinegar, brown sugar, chipotles, mustard powder, ½ teaspoon salt, and ½ teaspoon pepper. Bring to a boil, reduce to a simmer, and cook uncovered until the sauce is thick, about 4 to 5 minutes.",
    "Return the chicken and any juices to the pan, cover, and simmer until the chicken is very tender, about 1 hour. Add a few splashes of water if necessary to keep it from getting too dry. Remove from the heat and let cool. Shred the chicken with two forks right in the sauce (it will be pretty easy to shred). Keep covered in the Dutch oven until ready to serve.",
    "MAKE THE SLAW: In a big bowl, combine both cabbages, the carrot, scallions, and pineapple. In a separate bowl, whisk together the mayo, vinegar, granulated sugar (if using), salt, and pepper. Pour the dressing over the slaw, toss, and refrigerate until ready to serve.",
    "To serve, mound as much of the pulled chicken and sauce onto each bun as you can handle, and top with some slaw."
  ]
}