{
  "title": "Pumpkin Ice Cream",
  "source": "Kingarthurbaking.com",
  "servings": "About 1 quart",
  "categories": [
    "Ice Cream"
  ],
  "ingredients": [
    "1cup (269g) pumpkin purée",
    "1cup (227g) milk, whole preferred",
    "1 1/2cups (340g) heavy cream",
    "1 1/2teaspoons King Arthur Pumpkin Pie Spice",
    "1teaspoon cinnamon",
    "pinch of salt",
    "1tablespoon King Arthur Pure Vanilla Extract",
    "1/4teaspoon pumpkin flavor, optional; for enhanced flavor",
    "4large egg yolks",
    "1/2cup (99g) granulated sugar",
    "1/2cup (106g) light brown sugar or dark brown sugar, packed",
    "1/4teaspoon xanthan gum, optional; for smoother texture",
    "2tablespoons (28g) bourbon, optional; for softer ice cream and added flavor"
  ],
  "directions": [
    "Freeze the work bowl of an ice cream maker according to the manufacturer's instructions.",
    "Combine the pumpkin purée, milk, cream, spices, salt, vanilla, and pumpkin flavor in a saucepan. Set the pan over medium heat, and bring the mixture just to a boil. Remove it from the heat.",
    "Beat together the egg yolks, sugars, and xanthan gum until light and airy.",
    "Pour half the warm pumpkin mixture slowly into the egg yolk mixture, stirring constantly.",
    "Pour the yolk/pumpkin mixture back into the saucepan with the remaining pumpkin mixture. Cook over low heat, stirring with a heatproof spatula, until the custard thickens significantly; it will register between 170°F and 180°F on a digital thermometer.",
    "Remove the pan from the heat, and let the custard cool to room temperature, stirring occasionally to prevent a skin from forming. Refrigerate for at least 2 hours, or overnight.",
    "Transfer the custard to an ice cream maker. Freeze according to the manufacturer's instructions, adding bourbon at the end of the freezing process.",
    "Serve immediately if you prefer soft, creamy ice cream. For firmer consistency, transfer the ice cream to an airtight container and freeze for about 2 hours.",
    "Tips from our Bakers",
    "Adding the bourbon will help keep the ice cream from turning rock-hard in the freezer.",
    "Want to use fresh pumpkin purée rather than canned? It’s simple to make your own; see how it’s done."
  ]
}