{
  "title": "Raspberry Hazelnut Brioche Bostock",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 8 toasts",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "hazelnut cream",
    "1¼cups (175 grams) skinned hazelnuts, well toasted",
    "A pinch of sea salt",
    "6tablespoons (75 grams) granulated sugar",
    "6tablespoons (85 grams) unsalted butter, cold if using food processor; otherwise at room temp",
    "1large egg",
    "¼teaspoon almond extract, 1 teaspoon brandy, or 2 teaspoons Frangelico liqueur",
    "syrup",
    "⅔cup (155 ml) water",
    "⅔cup (130 grams) granulated sugar",
    "A few thick peel strips from ½ orange",
    "1tablespoon orange liqueur, or ½ teaspoon orange oil (optional)",
    "brioche toast",
    "8slices brioche, ¾-to-1-inch thick, lightly toasted if not already stale",
    "1cup (125 grams) fresh raspberries",
    "Powdered sugar, for dusting"
  ],
  "directions": [
    "to make the hazelnut cream in a food processor Combine ¾ cup of the hazelnuts—reserve remainder for garnish—the salt, and the sugar in a food processor, and grind as finely as possible. Add butter, and blend until combined, scraping down the sides if needed. Add the egg and extract or flavoring; blend until combined. Transfer to a bowl, and chill until firm but spreadable.",
    "to make the cream without a food processor Mince ¾ cup hazelnuts to a fine powder and mix with sugar and salt. Whisk butter with the hazelnut-sugar mixture, egg, and flavoring until combined. Chill until firm but spreadable.",
    "make the syrup Combine the water, sugar, and orange peels in a small saucepan, and bring to a simmer. Stirring frequently, simmer until sugar has dissolved. Remove from heat and let cool slightly, then fish out and discard the peels and add any liqueur or flavoring.",
    "Heat the oven to 375 degrees. Place an oven-safe cooling rack on a baking sheet and arrange the brioche slices in one layer.",
    "Generously brush each slice with the syrup. Divide the raspberries among slices of brioche and mash them roughly, unevenly, into the syrup-soaked bread. Dollop each slice with equal amounts of hazelnut cream, and use a small offset spatula or butter knife to spread it evenly over each surface. Don’t worry if it makes a mess of the raspberries already mashed on—that’s the point! Coarsely chop the remaining hazelnuts, and sprinkle some over each slice.",
    "Bake the brioche for 10 to 15 minutes, until puffed and golden all over. Remove from the oven, and dust with powdered sugar. Eat warm or at room temperature."
  ]
}