{
  "title": "Ravioli Filled with Ricotta and Mint",
  "source": "The Food of Sicily - Fabrizia Lanza",
  "servings": "Serves 4 to 6",
  "categories": [
    "Italian",
    "The Food of Sicily - Fabrizia Lanza"
  ],
  "ingredients": [
    "- 1⅔ cups (200 g) all-purpose flour, plus more for dusting",
    "- 1¼ cups (200 g) semolina flour",
    "- 3 large eggs",
    "- 1¾ cups (440 g) whole-milk ricotta cheese",
    "- 2 tablespoons freshly grated Parmigiano-Reggiano cheese, plus more for serving",
    "- ½ cup (10 g) finely chopped fresh mint leaves",
    "- Pinch of freshly grated nutmeg",
    "- Pinch of ground cinnamon",
    "- Pinch of crushed red pepper flakes",
    "- Fine sea salt",
    "- 3 cups (720 ml) good-quality tomato sauce, homemade or store-bought, warmed"
  ],
  "directions": [
    "1. In a medium bowl, combine the all-purpose flour and semolina flour, then make a well in the center and crack the eggs into it. Use a fork to stir the eggs while gradually incorporating flour from the sides. When the mixture becomes too stiff to stir, transfer it to a clean work surface and knead to form a smooth ball. Cover with plastic wrap and set aside to rest while you make the filling.2. In another bowl, mix together the ricotta, Parmigiano, mint, nutmeg, cinnamon, and pepper flakes. Season to taste with salt.3. After the dough has rested, cut it into 8 equal portions. Working with 1 portion at a time, pass the dough through a pasta machine set to the thickest setting. Change the machine to the next thinner setting. Pass the dough through again. Continue decreasing the machine’s setting and passing the dough through until you’ve rolled the dough through the second-thinnest setting. Repeat the rolling process with the other dough pieces.4. Lay out a pasta sheet on a lightly floured work surface. Place small spoonfuls of the filling every few inches along one long side of the dough. Fold the dough over the filling and press the edges with your fingertips to seal. Trim the dough with a small knife or a round cutter to form filled pasta squares or rounds. Repeat with all the dough sheets and remaining filling, arranging the ravioli in a single layer on lightly floured baking sheets as you work. Let the ravioli dry for 30 minutes to 1 hour before cooking.5. Bring a large pot of salted water to a boil. Add the ravioli to the boiling water and cook until tender, about 6 minutes. Use a slotted spoon to transfer the ravioli to a large serving platter and spoon the sauce over them. Top with grated Parmigiano-Reggiano. Serve at once."
  ]
}