{
  "title": "Ravioli Red Sauce",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 6 to 8 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Filling",
    "696g / 3 cups ricotta",
    "1small (85g / 3 oz) ball fresh mozzarella, diced into ¼-inch pieces",
    "17g / 3 Tbsp finely grated parmigiano-reggiano",
    "17g / 3 Tbsp finely grated pecorino romano",
    "Black pepper, q.b.",
    "Salt, q.b.",
    "To Finish",
    "1batch egg dough (this page)",
    "500g / 2 cups simple red sauce (this page)",
    "Finely grated parmigiano-reggiano, q.b.",
    "Finely grated pecorino romano, q.b.",
    "Dried red chile flakes, q.b."
  ],
  "directions": [
    "1 - To make the filling, place a tamis or fine-mesh strainer over a bowl. Pass the ricotta through the tamis.",
    "2 - Add the mozzarella, parmigiano, and pecorino to the bowl and fold to mix. Season with pepper and salt q.b. It should taste well seasoned. Refrigerate until ready to use.",
    "3 - To finish, following the instructions for ravioli on this page, make 50 to 60 square pieces with the pasta dough and filling.",
    "4 - Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "5 - Place a large sauté pan over low heat. Add the red sauce. If needed, add a splash of pasta cooking water to loosen the sauce.",
    "6 - Add the ravioli to the water and turn down the heat to bring the water to a gentle simmer instead of a rolling boil. It is important to cook these gently at a simmer instead of a boil. The filling is delicate and can break if cooked over high heat. Cook for 2 to 3 minutes, until tender at the thickest closure point.",
    "7 - Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn up the heat to medium. Swirl the pasta in the sauce for 30 seconds to 1 minute to marry, using a spoon to gently turn the pasta over and coat all sides. If the sauce begins to tighten, add a splash of pasta cooking water to loosen and continue swirling to marry.",
    "8 - Transfer to a serving platter or divide onto plates. Garnish with parmigiano and pecorino q.b. Finish with chile flakes q.b."
  ]
}