{
  "title": "Ravioli di Ricotta e Spinaci",
  "source": "My Kitchen in Rome - Rachel Roddy",
  "servings": "Serves 4",
  "categories": [
    "Italian",
    "My Kitchen in Rome - Rachel Roddy"
  ],
  "ingredients": [
    "7ounces spinach",
    "1⅓cups best-quality ricotta, ideally made from sheep’s milk, drained",
    "¾cup grated Parmesan, plus 3 tablespoons to serve",
    "a little grated nutmeg (optional)",
    "1quantity egg pasta (here), cut into manageable lengths (about 4 inches wide)",
    "7tablespoons butter",
    "8small sage leaves"
  ],
  "directions": [
    "Rinse the spinach, then cook it in a hot pan, covered, with just the water clinging to the leaves, until it has wilted. Drain the spinach well, then squeeze as much water as possible from it. You’ll be left with a tiny ball. Roughly chop the spinach and then mix it in a bowl with the ricotta, Parmesan, and grating of nutmeg, if you are using it.",
    "On a work surface dusted lightly with flour, lay out the pasta sheets. Using a teaspoon, put an acorn-size mound of the ricotta-and-spinach mixture at 1¼-inch intervals until you get halfway along each strip of pasta. Fold the pasta sheet over to cover the heaps of filling and press it down around them, then firmly press your fingertips between the mounds to seal them. Cut the ravioli apart with a wheeled cutter, then place them on a clean tea towel or flour-dusted tray, making sure they don’t touch each other or they will stick.",
    "To cook the ravioli, bring a large pot of water to a fast boil, add salt, stir, and then carefully drop the ravioli into the pot a few at a time. Depending on the thickness, ravioli takes anywhere from 5–8 minutes. Test for doneness by eye, pinching the (hot) edge of the pasta and tasting. Keep an eagle eye out and don’t leave the pasta unattended.",
    "While the pasta is cooking, melt the butter in a small saucepan or frying pan over low heat. Increase the heat and add the sage leaves. When they begin to change color, which should take about 1 minute, remove the pan from the heat and keep warm.",
    "Once cooked, lift the ravioli from the water with a slotted spoon or spider strainer directly onto a warm serving dish. Sprinkle with Parmesan, pour over the butter and sage, and serve immediately."
  ]
}