{
  "title": "Raw & Roasted Rainbow Carrots with Sesame & Lime",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1medium red onion",
    "1½pounds medium carrots, preferably rainbow",
    "1lime",
    "1cup cilantro leaves and tender stems",
    "PANTRY",
    "¼cup plus 3 tablespoons extra-virgin olive oil",
    "2teaspoons ground cumin",
    "Kosher salt",
    "2teaspoons honey or maple syrup",
    "2tablespoons toasted sesame seeds"
  ],
  "directions": [
    "1. Place a large rimmed baking sheet in the lower third of your oven. Preheat the oven to 450°F.",
    "2. Prep and roast the carrots:- Cut 1 medium red onion in half through the root end. Peel the onion and then cut it into 1-inch wedges through the root end, so they stay intact. Add the onion wedges to a large bowl.- Scrub 1½ pounds medium carrots. Cut half of the carrots on the bias into long spears that are about ¾ inch thick. As you get closer to the tops of the carrots and they are thicker, cut the spears in half lengthwise so they match the other carrots in thickness. Add the carrot spears to the onion wedges along with 3 tablespoons olive oil, 2 teaspoons cumin, and 1 teaspoon salt. Toss well to coat.- Arrange the carrots and onions on the preheated baking sheet in a single layer (reserve the bowl). Roast for 12 to 14 minutes, until the bottoms are browned. Shake the pan to redistribute and turn the carrots and onions and continue roasting until the onions and carrots are charred on both sides and soft to the touch, 8 to 10 minutes more.",
    "3. Marinate the carrots:- Finely grate the zest of half of a lime into the reserved bowl. Add 2 teaspoons honey and the juice of the lime and whisk to combine. Whisking constantly, stream in ¼ cup olive oil. Season with salt.- Thinly slice the remaining raw carrots on the bias into oblong coins. Add to the dressing and toss well to coat. Season with salt.- Once the roasted vegetables are finished, let them cool for 5 minutes on the baking sheet, then add them to the bowl with the raw carrots and toss well to combine.",
    "4. Serve: Just before serving, add 1 cup cilantro leaves and tender stems and 2 tablespoons toasted sesame seeds and toss to combine. Reseason the salad and transfer to a platter. It’s great eaten cold, warm, or at room temperature."
  ]
}