{
  "title": "Really Great Chicken Soup",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4 to 6",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "2large leeks",
    "2whole garlic heads plus 5 garlic cloves",
    "6celery stalks",
    "2medium turnips or parsnips (about 1¼ pounds)",
    "3large thyme sprigs",
    "MEAT",
    "4chicken legs (drumstick plus thigh, attached) or 4 thighs and 4 drumsticks (about 2 pounds total)",
    "2pounds chicken wings",
    "PANTRY",
    "Kosher salt",
    "1tablespoon whole black peppercorns, plus more for grinding",
    "8prunes",
    "2tablespoons extra-virgin olive oil"
  ],
  "directions": [
    "1. Start the broth:- Season 4 chicken legs and 2 pounds of chicken wings all over with 4 teaspoons salt. Place all the chicken in a large pot.- Cut 2 large leeks in half lengthwise. Separate and reserve the white parts; rinse the dark green parts to remove grit.- Cut 2 garlic heads in half crosswise.- Cut 4 celery stalks into 2-inch pieces (reserve any leaves for garnish).- Chop 1 medium turnip into 2-inch wedges.- Add the leek greens, garlic heads, chopped celery and turnip, 1 tablespoon whole black peppercorns, 2 prunes, 1 thyme sprig, and 1 tablespoon salt to the pot.- Add 12 cups water, bring to a simmer over medium-high heat, then reduce to medium-low and cook uncovered for about 1 hour. Occasionally skim foam from the surface.",
    "2. Prep the rest of the veg:- Thinly slice 2 celery stalks.- Thinly slice 5 garlic cloves.- Cut the reserved leek whites on a bias into 1½-inch pieces.- Cut 1 turnip into quarters lengthwise, then slice into ¼-inch-thick pieces.- Tear 6 prunes into 2 or 3 pieces each.- Pick 2 teaspoons leaves from 2 thyme sprigs.",
    "3. Shred the chicken:- After the soup simmers for 1 hour, remove the chicken legs and let them cool. Shred the meat into bite-size pieces and discard the skin. Return the bones to the broth to continue simmering.",
    "4. Assemble the soup:- In a large Dutch oven, heat 2 tablespoons olive oil over medium heat. Add leeks, sliced garlic, and prunes. Season with salt and black pepper.- Cook, stirring, until leeks start to soften, 3 to 4 minutes. Add ¾ cup broth and continue cooking until the leeks collapse and are softened, 10 to 12 minutes.- Strain the broth into the Dutch oven. Discard the solids (wings, bones, veg, skin).- Add shredded chicken, sliced turnips, thyme leaves, and sliced celery. Simmer until the turnips and celery are tender, 4 to 5 minutes. Season with salt.",
    "5. Serve:- Divide the soup into bowls and garnish with freshly ground black pepper and reserved celery leaves."
  ]
}