{
  "title": "Red Lentil Soup, Dal Style",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 4 servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "soup",
    "3tablespoons (45 ml) neutral oil",
    "1large onion, minced",
    "1½tablespoons (40 grams) minced ginger",
    "2garlic cloves, minced",
    "1fresh hot green chile pepper, minced, or ½ teaspoon ground cayenne pepper",
    "¼teaspoon turmeric",
    "1½teaspoons ground cumin",
    "1teaspoon ground coriander",
    "2teaspoons kosher salt, or more to taste",
    "½cup (125 grams) chopped fresh or canned tomatoes",
    "1large carrot, diced (just shy of 1 cup)",
    "6cups (1.4 liters) water",
    "1cup (210 grams) red lentils",
    "to finish",
    "3tablespoons (45 ml) canola oil or ghee",
    "1½teaspoons (5 grams) mustard seeds",
    "A handful of chopped fresh cilantro",
    "A squeeze of fresh lemon juice per bowl"
  ],
  "directions": [
    "In a large pot, heat the neutral oil over medium-high heat until hot and shimmering, then add the onion, ginger, garlic, and any fresh chile you are using, and cook, stirring, until browned, about 5 minutes. Turn the heat to medium-low, and add the turmeric, cumin, coriander, cayenne (if you’re not using fresh chile), and salt. Cook the onion mixture for a minute or two, then add the tomatoes, and scrape up any bits that have stuck to the pan. Add the carrot, cook for 1 minute more, then add the water and lentils. Bring back to a simmer, partially cover, and cook for 25 to 30 minutes, until the lentils and carrot are soft. Taste, and adjust the seasonings as needed. If desired, blend for a second or two with an immersion blender to create a mixed smooth-rough texture.",
    "Heat the canola oil in a small skillet over high heat. When the oil begins to smoke, add the mustard seeds and cover the pan with a lid or splatter screen. When the seeds stop popping, immediately pour the oil over the soup. Add a squeeze of lemon juice and garnish with cilantro."
  ]
}