{
  "title": "Red Chicken Curry",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "4",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "8boneless, skinless chicken thighs (about 2 pounds), patted dry",
    "Kosher salt and freshly ground black pepper",
    "2tablespoons canola oil",
    "1small onion, sliced",
    "2tablespoons finely minced fresh ginger (from a 2-inch piece)",
    "6cloves garlic, finely minced",
    "2tablespoons Thai red curry paste (buy that sh*t)",
    "1(13.5-ounce) can full-fat coconut milk, shaken",
    "2tablespoons light brown sugar",
    "1tablespoon fish sauce, or more to taste",
    "1large red bell pepper, cored, seeded, and sliced",
    "1large yellow bell pepper, cored, seeded, and sliced",
    "1medium potato, peeled and cut into 1-inch chunks",
    "2cups broccoli florets (cut larger florets in half to make them bite-size)",
    "¼teaspoon ground white pepper",
    "1teaspoon chopped jalapeño, plus more for garnish",
    "Cooked jasmine rice, for serving",
    "Chopped fresh basil, for garnish"
  ],
  "directions": [
    "Season the chicken generously with salt and pepper. In a large heavy-bottomed pot or Dutch oven, heat the oil over medium-high heat. Brown the chicken all at once (it’s OK if they don’t all lie flat in the pot; we’re saving time here) until golden, 4 to 5 minutes per side. Transfer the chicken to a plate.",
    "Add the onion to the pot and cook, stirring, until just softened, about 4 minutes. Add the ginger, garlic, and curry paste and cook, stirring, until fragrant, about 2 minutes. Stir in the coconut milk, brown sugar, and fish sauce until smooth. Bring to a boil, reduce the heat to medium-low, and simmer about 2 minutes. Stir in the bell peppers and potato, then return the chicken with any juices to the pot. Cover and simmer until the chicken and potatoes are just cooked through, about 20 minutes.",
    "While the curry is cooking, place the broccoli and ½ inch of water in a microwave-safe bowl. Cover and microwave on high until the broccoli turns bright green, about 3 minutes. Drain.",
    "Uncover the curry and stir in the broccoli, ½ teaspoon salt (or more to taste), white pepper, and jalapeño and simmer, uncovered, until the liquid thickens slightly, about 3 minutes. Serve with rice and garnish with basil and more jalapeño."
  ]
}