{
  "title": "Red Chile-Honey Glazed Salmon With Black Bean Sauce And Jalapeño Crema",
  "source": "Mesa Grill - Bobby Flay",
  "servings": "4",
  "categories": [
    "Mesa Grill - Bobby Flay"
  ],
  "ingredients": [
    "Black Bean Sauce:",
    "- 1½ cups dried black beans",
    "- 1 small red onion, coarsely chopped",
    "- 2 cloves garlic, peeled",
    "- 2 chipotle chiles in adobo sauce, chopped",
    "- 1 teaspoon ground cumin",
    "- Kosher salt",
    "Red Chile–Honey Glazed Salmon:",
    "- ⅓ cup honey",
    "- 1 tablespoon ancho chile powder",
    "- 1 tablespoon Dijon mustard",
    "- Kosher salt and freshly ground black pepper",
    "- Four (8-ounce) skin-on salmon fillets",
    "- 2 tablespoons canola oil",
    "Jalapeño Crema (recipe follows)",
    "Thinly sliced green onions, white and green parts, for garnish (optional)"
  ],
  "directions": [
    "1. Pick over the beans and discard any stones. Put in a bowl, cover with water, and let soak overnight.",
    "2. Drain the beans and combine with the onion, garlic, chipotles, and cumin in a medium saucepan and add just enough cold water to cover by an inch; bring to a boil over high heat. Reduce the heat and simmer, adding more water if the beans appear dry, until the beans are tender, 1 to 1½ hours.",
    "3. Transfer the mixture to a food processor or blender (in batches, if needed) with a slotted spoon, add 1 cup of the cooking liquid, and process until almost smooth; the sauce should be a little chunky. Season with salt. If the sauce is too thick, thin with more of the cooking liquid or with water. This can be made up to 4 hours in advance and refrigerated. Reheat before serving.",
    "4. To make the glaze for the salmon, whisk together the honey, ancho powder, and mustard in a small bowl and season with salt and pepper.",
    "5. Preheat a grill pan or large nonstick sauté pan over high heat. Brush the salmon with the oil on both sides and season with salt and pepper. Place the salmon in the pan, skin side down, and cook until golden brown and a crust has formed, 3 to 4 minutes. Brush the top of the salmon with some of the glaze, flip over the fillets, and continue cooking until a crust has formed and the salmon is cooked to medium, about 2 minutes more. The salmon will be pink in the center.",
    "6. Spoon some of the black bean sauce onto 4 plates and drizzle with some of the jalapeño crema. Set the salmon in the center, glazed side up, brush with more of the glaze, and garnish with green onion."
  ]
}