{
  "title": "Rhubarb Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 10",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 4½ × 8½-inch loaf pan, measured from the top",
    "1pound (454g) rhubarb stalks ①",
    "½teaspoon baking soda",
    "Butter and demerara sugar for the pan",
    "1¾cups all-purpose flour (8 oz / 228g) ②",
    "2½teaspoons baking powder (0.35 oz / 10g)",
    "¾teaspoon Diamond Crystal kosher salt",
    "1¼cups granulated sugar (8.8 oz / 250g)",
    "1stick unsalted butter (4 oz / 113g), melted and cooled",
    "2large eggs (3.5 oz / 100g)",
    "1½teaspoons finely grated orange zest",
    "⅓cup plain whole-milk Greek yogurt (2.8 oz / 80g)",
    "1teaspoon vanilla extract",
    "Demerara sugar, for sprinkling the top"
  ],
  "directions": [
    "Preheat the oven and prepare the pan: Arrange an oven rack in the center position and preheat the oven to 350°F. Coat the bottom and sides of the loaf pan with butter. Line the bottom and two longer sides with a piece of parchment paper, leaving an overhang of several inches on each side. Butter the parchment paper, then sprinkle demerara sugar inside the pan, shaking it to coat the bottom and sides, and set the pan aside.",
    "Prepare the rhubarb: Select the nicest, thinnest stalks of rhubarb and trim them to lengths of about 8½ inches until you have 4 or 5 pieces that length. If only some or none of the stalks are very thin, split 1 or 2 stalks lengthwise. Weigh the pieces: You should have about 4 ounces (113g)—remove or add accordingly! Set the trimmed stalks aside.",
    "Make the rhubarb mush: Chop all of the remaining rhubarb into ½-inch pieces. Transfer two-thirds (8 oz / 227g) to a small saucepan and set the remaining one-third (4 oz / 113g) aside to fold into the batter later. Add 1 tablespoon water to the saucepan and cook the chopped rhubarb over medium heat, stirring often and mashing with the back of a wooden spoon, until the pieces have completely broken down into a smooth mixture that resembles applesauce, 5 to 7 minutes. Remove from the heat and set aside to cool completely (you should have about ⅔ cup [5.8 oz / 165g]).",
    "Once the rhubarb mixture is cool, thoroughly stir the baking soda into the rhubarb (it will foam and turn a grayish tinge, which is normal). This will neutralize some of the acid and help the cake rise more predictably. Set the mixture aside.",
    "Mix the dry ingredients: In a medium bowl, whisk the flour, baking powder, and salt to combine. Set aside.",
    "Mix the wet ingredients: In a large bowl, vigorously whisk the granulated sugar, melted butter, eggs, and orange zest until the mixture is thick and light, about 1 minute. Whisk in the yogurt, vanilla, and rhubarb mush until smooth.",
    "Mix the wet ingredients into the dry: Scrape the rhubarb mixture into the bowl with the flour mixture and whisk just until the dry ingredients disappear and the batter is evenly mixed. Switch to a flexible spatula and fold the reserved 4 ounces (113g) chopped rhubarb into the batter.",
    "Fill the pan and bake: Scrape the batter into the prepared pan and smooth the top. Arrange the reserved rhubarb stalks over the top of the batter in parallel lines. Sprinkle the top generously with demerara sugar and bake, reducing the oven temperature to 325°F after 60 minutes, until the top is golden and crisp and a cake tester inserted into the center comes out clean, 80 to 90 minutes total. ④ Tent the top of the cake with a piece of foil if it starts to darken beyond a deep golden brown.",
    "Cool and unmold the cake: Let the cake cool in the pan for 20 minutes. Cut along the short sides of the pan to release the cake and use the parchment to lift the cake from the pan. Let cool completely on a wire rack."
  ]
}