{
  "title": "Rice Pudding Cake with Mango Caramel",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 10",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: Standard or handheld blender, 10-inch cake pan ①",
    "Mango Caramel Sauce",
    "1cup sugar (7 oz / 200g)",
    "1½cups coarsely chopped fresh mango (8 oz / 227g), from about 1 large mango ②",
    "½cup heavy cream (4.2 oz / 120g)",
    "4tablespoons unsalted butter (2 oz / 57g), cut into ½-inch pieces",
    "½teaspoon Diamond Crystal kosher salt",
    "Rice Pudding Cake and Assembly",
    "1cup Arborio or Carnaroli rice (7.1 oz / 200g)",
    "3cups whole milk (25.4 oz / 720g)",
    "1(12 oz / 340g) can evaporated milk",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "¾cup sugar (5.3 oz / 150g)",
    "¼cup dark rum (2 oz / 57g)",
    "½teaspoon ground cardamom",
    "Seeds scraped from 1 vanilla bean, plus the pod",
    "4tablespoons unsalted butter (2 oz / 57g), cut into ½-inch pieces, chilled",
    "Butter for the pan",
    "2large eggs (3.5 oz / 100g)",
    "3large egg yolks (1.8 oz / 50g)",
    "1large mango, peeled and thinly sliced, for serving"
  ],
  "directions": [
    "Make the mango caramel sauce: In a small saucepan, combine the sugar and ⅓ cup water (2.6 oz / 75g). Place the saucepan over medium heat and stir with a heatproof spatula to dissolve the sugar. Stop stirring when the mixture comes to a boil and cook, brushing down the sides of the pan with a wet pastry brush to dissolve any crystals and swirling the pan often, until the mixture turns a deep amber color, 7 to 10 minutes. Immediately remove the pan from the heat and carefully add the chopped mango. Return the saucepan to medium-low heat and cook, stirring occasionally, until the mango starts to release some liquid, about 5 minutes. Carefully add the heavy cream in a slow, steady stream, stirring constantly (the mixture may sputter), then stir in the butter a piece at a time until the mixture is smooth. Stir in the salt, then adjust the heat to a gentle simmer. Cook, stirring occasionally, until the caramel is slightly thickened, 5 to 10 minutes longer.",
    "Blend and reserve the caramel: Remove the caramel mixture from the heat and let it cool slightly. Use a standard or handheld blender to blend until the sauce is completely smooth (you should have about 2 cups, but if you have less, stir in some more heavy cream). Set the caramel aside.",
    "Cook the rice pudding mixture: In a medium saucepan, combine the rice, whole milk, evaporated milk, salt, sugar, rum, and cardamom. Add the vanilla seeds and throw in the pod, too. Bring it all to a simmer over medium heat, stirring often to dissolve the sugar and to prevent the rice from sticking to the bottom. Reduce the heat to maintain a gentle simmer and continue to cook, stirring often, until the rice is translucent and tender and the liquid is thickened, 25 to 30 minutes. You’ll know the rice is done when, rather than settling to the bottom of the pan, the individual grains float about suspended in the liquid. ③",
    "Add the butter and cool: Remove the saucepan from the heat and stir in the 4 tablespoons butter, a few pieces at a time, until they have melted and incorporated into the liquid. Let the rice pudding mixture sit until it’s warm but not hot, stirring occasionally to encourage cooling and to reincorporate any skin that forms on the surface (you can stir the pan over an ice bath to speed up this process).",
    "Preheat the oven and prepare the pan: Arrange an oven rack in the center position and preheat the oven to 350°F. Butter the bottom and sides of the cake pan. Line the bottom with a round of parchment paper, then butter the parchment paper. Set the pan aside.",
    "Beat and add the eggs: In a small bowl, beat the whole eggs and yolks until no streaks remain, then stir into the warm rice pudding mixture until thoroughly combined.",
    "Bake and cool: Pour the entire mixture into the prepared cake pan (feel free to leave in the vanilla pod, which will continue to release flavor in the oven). Bake until the surface is lightly browned in spots and a cake tester or toothpick inserted into the center comes out clean, 40 to 50 minutes. Remove the cake from the oven and let it cool completely on a wire rack.",
    "Serve: Cut around the sides of the pan with a small offset spatula or paring knife. Invert the cake onto a wire rack, peel off the parchment paper, then reinvert onto a serving plate. Rewarm the caramel sauce if necessary. Cut the cake into slices (remove the vanilla pod if you haven’t) and serve with a drizzle of caramel and fresh sliced mango."
  ]
}