{
  "title": "Ricotta Gnocchi with Broccoli Pesto, Basil, and Pistachios",
  "source": "Pasta - Missy Robbins",
  "servings": "4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "333g / generous 3 cups (about 1 head) broccoli florets",
    "75g / 2½ oz broccoli rabe, leaves and florets separated",
    "20g / 1 cup tightly packed basil leaves",
    "30g / 2 Tbsp water",
    "½clove garlic",
    "224g / 1 cup olive oil, plus more q.b.",
    "31g / ¼ cup raw pistachios, finely chopped",
    "30g / ⅓ cup finely grated parmigiano-reggiano",
    "30g / ⅓ cup finely grated pecorino romano",
    "Salt, q.b.",
    "1batch ricotta gnocchi dough (this page)",
    "90g / ⅔ cup chopped raw Sicilian pistachios",
    "60g / ⅔ cup finely grated pecorino romano",
    "20 to 25small basil leaves",
    "Black pepper, q.b."
  ],
  "directions": [
    "1. To make the pesto, break the broccoli florets into ½-inch pieces.",
    "2. Bring a large pot of water to a boil over high heat. Generously salt the water. Prepare a salted ice-water bath and set a colander in it. Line a sheet pan with paper towels.",
    "3. Drop the broccoli florets into the boiling water and blanch until tender but not soft and still vibrantly green, 2 to 3 minutes. Using a slotted spoon or spider, transfer the florets to the ice-water bath. Transfer the florets to the paper towels to drain.",
    "4. Repeat with the broccoli rabe florets, reserving the leaves. Discard the boiling water and reserve the ice-water bath.",
    "5. Pat the broccoli and broccoli rabe florets dry with the paper towels to remove all the excess water. Set aside.",
    "6. Bring a small saucepan of water to a boil over high heat. Lightly salt the water. Drop the basil and broccoli rabe leaves into the boiling water and blanch until tender but still vibrantly green, about 15 seconds. Using a slotted spoon, transfer the basil and broccoli leaves to the ice-water bath. Remove from the ice-water bath, place in a kitchen towel, and squeeze to remove all the excess water.",
    "7. Place the basil and broccoli rabe leaves in a blender with the water, add the garlic, and blend on high speed to make a very smooth puree. If the mixture is too thick to puree, add a small amount of water to loosen. Set aside.",
    "8. Add the broccoli and broccoli rabe to the bowl of a food processor in batches and pulse to puree until smooth.",
    "9. Place the broccoli mixture in a large bowl. Add the basil puree, olive oil, pistachios, parmigiano, and pecorino. Mix well to combine and season with salt q.b.",
    "10. Measure out 510g / 2 cups pesto and set aside. Transfer the remainder to an airtight container and refrigerate for up to 3 days or freeze for another use.",
    "11. To finish, following the instructions for ricotta gnocchi on this page, make 130 to 140 pieces.",
    "12. Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "13. Add the gnocchi to the water and cook for 3 to 5 minutes, until they float to the top of the pot.",
    "14. While the gnocchi are cooking, place a large sauté pan over very low heat. Add the pesto and 1 to 2 ladles (55g to 115g / ¼ to ½ cup) pasta cooking water and stir gently to combine. If it overheats, you will lose the vibrant color quickly, so keep an eye on it.",
    "15. Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Keep the pan over low heat and gently toss for 30 seconds to 1 minute to marry the pasta and the sauce.",
    "16. Divide the pasta into bowls and garnish with the chopped pistachios, pecorino, basil, and with pepper q.b."
  ]
}