{
  "title": "Ricotta-Stuffed Shells with Burrata, Mushrooms, and Herbs",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 6 to 10",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "2pounds mixed fresh mushrooms, such as maitake, oyster, chanterelle, trumpet, or shiitake, torn or cut into bite-sized pieces",
    "4garlic cloves, well smashed",
    "3tablespoons olive oil, plus more as needed for the baking sheet and baking dish",
    "Kosher salt and freshly ground black pepper",
    "2cups (16 ounces) full-fat ricotta",
    "½cup grated pecorino or parmesan, plus more as desired",
    "1¼cups heavy cream, divided",
    "1(12-ounce) box large dried shells",
    "8ounces burrata or mozzarella, torn into bite-sized pieces",
    "1cup fresh parsley, tender leaves and stems, coarsely chopped",
    "½cup finely chopped fresh chives",
    "¼cup fresh tarragon leaves",
    "1tablespoon grated lemon zest"
  ],
  "directions": [
    "1 Preheat the oven to 425°F.2 Toss the mushrooms and garlic on a rimmed baking sheet with the olive oil and season with salt and pepper. Roast, tossing occasionally, until they’re starting to brown and crisp, 15 to 20 minutes.3 Meanwhile, combine the ricotta, pecorino, and ¾ cup cream in a medium bowl. Season with salt and pepper.4 Cook the shells in a large pot of salted boiling water until just al dente. Drain and transfer to an oiled rimmed baking sheet. Toss the shells in a bit more oil, just to make sure they don’t stick to one another as you’re filling them.5 Using a spoon, fill each shell with the ricotta mixture—they should look pretty full, but don’t be crazy, okay? You have a lot of shells to fill!6 Drizzle a bit of olive oil in the bottom of a 2-quart baking dish or large cast-iron skillet (a 9 by 13-inch baking dish will work in a pinch, although it won’t be as dramatic as a presentation). Place the shells in the baking dish, letting them overlap slightly, so each is as snug as a bug in a rug. Or a shell in a dish. Ha. Anyway. Scatter the burrata into the little in-between spots and top with the mushrooms. Pour the remaining ½ cup cream over everything.7 Cover with foil and bake until the cheese is melted and everything is warmed through, 8 to 10 minutes. Remove the foil and continue to bake until the shells are sizzling around the edges and the mushrooms have miraculously gotten even darker and more caramelized looking, 15 to 20 minutes.8 Meanwhile, combine the parsley, chives, tarragon, and lemon zest in a small bowl. Season with salt and pepper and drizzle with a little olive oil.9 Top the pasta with the herb mixture, grating or shaving more pecorino over, and serve."
  ]
}