{
  "title": "Ricotta-Filled Turnovers",
  "source": "The Food of Sicily - Fabrizia Lanza",
  "servings": "Makes about 20 turnovers",
  "categories": [
    "Italian",
    "The Food of Sicily - Fabrizia Lanza"
  ],
  "ingredients": [
    "- 7 tablespoons (105 ml) white wine",
    "- 3 tablespoons olive oil",
    "- 2 cups (320 g) semolina flour, plus more for dusting",
    "- Pinch of fine sea salt",
    "- 1 cup (250 g) whole-milk ricotta cheese, preferably sheep’s milk, well drained",
    "- 3 tablespoons granulated sugar",
    "- ½ teaspoon ground cinnamon, plus more (optional) for garnish",
    "- Vegetable oil, for frying",
    "- Powdered sugar, for garnish",
    "Equipment:",
    "- Pasta machine"
  ],
  "directions": [
    "1. In a small saucepan, heat the wine and olive oil over medium heat until just warm. Remove from heat and set aside.2. Mound the semolina on a clean work surface and make a well in the center. Add the salt and wine-oil mixture to the well.3. Use a fork to slowly incorporate the liquid into the flour, then knead by hand until smooth and elastic, about 5 minutes.4. In a small bowl, mix the ricotta, granulated sugar, and cinnamon. Set aside.5. Divide the dough into quarters, keeping unused portions covered.6. Set a pasta machine to the thickest setting and roll a piece of dough through about five times, folding it in half before each pass.7. Move to the next thinner setting and roll it through two or three more times, again folding each time, until the dough is about 1/16 inch (2 mm) thick.8. Lay the dough on a floured surface and cut into 4-inch (10 cm) rounds.9. Place a spoonful of ricotta filling slightly off-center on each round. Moisten the edges with water and fold over to form a half-moon.10. Pinch the edges firmly to seal. Repeat with remaining dough and filling, rerolling scraps as needed.11. Heat 2 inches (5 cm) of vegetable oil in a heavy-bottomed pot over medium-high heat until hot enough for frying.12. Fry the cassatelle in batches, turning occasionally, until golden brown, about 3 minutes per batch.13. Transfer to a paper towel–lined sheet pan to drain.14. Sprinkle with powdered sugar and cinnamon, if desired, and serve warm."
  ]
}