{
  "title": "Ricotta and Spinach Fritters",
  "source": "My Kitchen in Rome - Rachel Roddy",
  "servings": "Makes about 15",
  "categories": [
    "Italian",
    "My Kitchen in Rome - Rachel Roddy"
  ],
  "ingredients": [
    "about 1 pound spinach",
    "1½cups ricotta (ideally sheep’s milk, but cow’s milk works well too)",
    "3large eggs",
    "½cup grated Parmesan or pecorino",
    "freshly grated nutmeg",
    "salt and freshly ground black pepper",
    "flour, for dusting",
    "1cup fine dried bread crumbs or instant polenta",
    "olive or vegetable oil, for frying"
  ],
  "directions": [
    "Soak the spinach in several changes of water. Discard any wilted or bruised leaves and trim away any very thick, woody stalks. Put it in a large pan with nothing but the water that clings to the leaves, cover, and cook over medium heat until it has collapsed and is tender. This should take 3–5 minutes, depending on the freshness and age of the spinach.",
    "Drain the spinach, and once it is cool enough to handle, squeeze and press it gently with your hands to eliminate as much water as possible. Chop it roughly, then transfer it to a large bowl. Add the ricotta and stir gently but firmly with a wooden spoon. Add 1 egg, the grated Parmesan, and a grating of nutmeg and season with salt and pepper. Stir the ingredients until they are evenly combined, then taste and adjust the seasoning if necessary. Let the mixture rest in the fridge for an hour.",
    "Prepare 3 plates, one with the remaining eggs, beaten, one with seasoned flour, and one with the bread crumbs or polenta. Using a teaspoon, scoop out a golf-ball-size lump of the spinach-and-ricotta mixture. Shape it into a ball and flatten it into a patty. Dip it in flour, then egg, and finally roll it in the bread crumbs or polenta until evenly coated. Put the polpette on a plate lined with parchment paper while you prepare the rest.",
    "In a deep frying pan or saucepan, heat the oil to 375°F (I judge this by eye, using a cube of bread—see here) and carefully lower in 3 or 4 polpette at a time. Cook for about 2 minutes, or until crisp and deep gold. Use a slotted spoon to lift them onto a plate lined with paper towels. Once drained, slide them onto the serving plate, sprinkle with salt, and eat immediately."
  ]
}