{
  "title": "Roasted Eggplant with Olives and Sun-Dried Tomato Vinaigrette",
  "source": "Pasta - Missy Robbins",
  "servings": "Servings: 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Eggplant:",
    "907g / 4 Japanese eggplants, quartered lengthwise and widthwise",
    "9g / 1 Tbsp salt",
    "112g / ½ cup olive oil, plus more q.b.",
    "55g / ¼ cup red wine vinegar",
    "Vinaigrette Base:",
    "38g / 2 Tbsp plus 2 tsp olive oil, plus more q.b.",
    "15g / 3 cloves garlic, finely chopped",
    "48g / 3 Tbsp tomato paste",
    "100g / 1⅔ dry-packed cups sun-dried tomatoes",
    "149g / 1 cup plus 1 Tbsp pitted Taggiasca olives",
    "25g / 4 to 5 anchovies, finely chopped",
    "74g / ¼ cup plus 3 Tbsp salt-packed capers, rinsed and finely chopped",
    "1orange, ¼ peel, pith removed and finely chopped and fruit reserved",
    "½tsp Calabrian chile oil",
    "To Finish:",
    "55g / ¼ cup red wine vinegar",
    "84g / 6 Tbsp olive oil",
    "7g / 1½ tsp Calabrian chile oil",
    "2sprigs basil, stems removed"
  ],
  "directions": [
    "1. To make the eggplant, place the quarters skin side down on a sheet pan. Salt and let sit for 10 to 15 minutes. Use a paper towel to wipe off any moisture that leaches out.2. Place a large sauté pan over medium heat. Add half of the olive oil. Add half of the eggplant quarters to the pan flesh side down and cook, turning to ensure even cooking, until golden brown and tender, 6 to 8 minutes. Eggplant absorbs a lot of oil so you may need to add more as you go if the pan starts to look dry.3. Flip the eggplant over so the skin side is down and cook for another 1 to 2 minutes until the flesh is soft and cooked all the way through.4. Add half of the red wine vinegar to the pan and cook until evaporated, 1 to 2 minutes. Remove the eggplant from the pan and set aside. Repeat with the second batch of eggplant and remaining olive oil and vinegar.5. To make the vinaigrette base, place a small saucepan over low heat. Add the olive oil and the garlic and cook until aromatic but without color, 10 to 15 seconds. Add the tomato paste and cook, stirring, until it starts to turn a deeper red and is well combined with the olive oil and garlic, 3 to 5 minutes. Remove from the heat and set aside to cool.6. Place the sun-dried tomatoes in a small bowl and add warm water to cover. Set aside until just softened, 3 to 5 minutes.7. Add the olives to a food processor and pulse until very fine, but not pureed. Transfer to a mixing bowl.8. Drain the tomatoes and place in the food processor. Add the tomato paste mixture and pulse until a uniform paste forms.9. Add the paste to the bowl with the olives and add the anchovies, capers, orange peel, and the chile oil and fold to combine. Set aside 120g / ½ cup. Transfer the remainder to an airtight container, cover with a layer of olive oil and refrigerate for up to 2 weeks for another use.10. To finish, juice the orange. Add the red wine vinegar, orange juice, olive oil, and chile oil to the reserved base in a bowl and stir to combine.11. Place the eggplant in a large mixing bowl. Add the vinaigrette and gently stir to coat. You want the eggplant to maintain its shape.12. Transfer the eggplant to a serving platter and garnish with the basil leaves."
  ]
}