{
  "title": "Roasted Cippolini Torta",
  "source": "Wsj.com",
  "servings": "1",
  "categories": [],
  "ingredients": [
    "For the dough:",
    "1⅓cup flour",
    "2ounces pecorino Romano",
    "1teaspoon salt",
    "1teaspoon sugar",
    "8ounces cold butter, cubed",
    "2ounces water, room temperature",
    "For the onion filling:",
    "2pounds cippolini onions",
    "4teaspoons salt",
    "4tablespoon unsalted butter",
    "1tablespoon olive oil",
    "For the pecorino fonduta:",
    "1quart heavy cream",
    "5ounces pecorino Romano, grated",
    "1teaspoon salt",
    "For the garnish:",
    "Freshly ground black pepper",
    "1ounce grated pecorino Romano",
    "1tablespoon aged balsamic vinegar",
    "Leaves from 1-2 thyme sprigs"
  ],
  "directions": [
    "Make the dough: Place all dry ingredients in a food processor and pulse to combine. With motor running on low speed, add cold cubed butter slowly until mixture forms a ball.",
    "Wrap dough in plastic wrap and chill for at least 1 hour. (The dough can also be made up to a month in advance and frozen until ready.)",
    "Once ready to bake, preheat oven to 350 degrees and set rack in center position. Lightly flour a work surface and place chilled dough on it. Use a rolling pin to roll dough into a round about 12 inches across and ⅛-inch thick.",
    "Transfer dough to a 9-inch pie dish and trim to fit. Prick dough all over with the tines of a fork. Line dough with parchment paper and fill with uncooked beans or pie weights. Blind-bake pie crust until golden, 15-20 minutes. Remove from oven and let cool.",
    "Meanwhile, make the onion filling: Soak onions in boiling water for 2 minutes. Slice off roots and tips and slide off skin, transferring onions to a large bowl as you go. Season onions with salt. Let sit 15 minutes.",
    "In a large cast-iron or other ovenproof skillet over medium heat, melt butter and mix in olive oil. Add onions, toss to coat and turn off heat. Transfer skillet to center rack of oven. Roast onions, tossing occasionally, until deeply browned and tender, 1-1½ hours. Transfer roasted onions to a sheet tray to cool.",
    "Make the pecorino fonduta: In a saucepan over medium heat, simmer cream until reduced by half, about 30 minutes. Carefully transfer cream to a blender (or leave in pot and use an immersion blender). Add cheese and salt to hot cream and purée until smooth.",
    "Assemble the tart: Fill cooled pie crust with roasted onions. Pour a thin layer of fonduta over the onions. Sprinkle with pecorino cheese. Place pie under broiler and broil until cheese is golden and crisp, 3-4 minutes.",
    "Garnish tart with freshly ground black pepper, a drizzle of aged balsamic and thyme leaves. Serve hot or at room temperature."
  ]
}