{
  "title": "Roasted Kabocha Squash with Hot Honey and Bread Crumbs",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Bread Crumbs",
    "½loaf (228g / 8 oz) country bread, torn into pieces (about 4 cups)",
    "56g / ¼ cup olive oil",
    "10g / 2 cloves garlic",
    "Hot Honey",
    "340g / 1 cup honey",
    "45g / 3 Tbsp crushed Calabrian chiles",
    "7g / 1½ tsp Calabrian chile oil (drained from jarred Calabrian chiles)",
    "Squash",
    "30g / 2 Tbsp unsalted butter, cold and cubed",
    "42g / 3 Tbsp olive oil",
    "1.4 to 1.8kg / 3 to 4 lb kabocha squash, cut into 2-inch-thick wedges",
    "50g / 10 cloves garlic",
    "7sprigs rosemary",
    "7sprigs thyme",
    "Salt, q.b.",
    "To Finish",
    "55g / ¼ cup honey vinegar or apple cider vinegar",
    "3sprigs thyme, leaves removed from stems",
    "2sprigs rosemary, leaves removed from stems",
    "2g / 1 tsp dried red chile flakes",
    "Flaky sea salt, q.b."
  ],
  "directions": [
    "1   To make the bread crumbs, preheat the oven to 200°F.",
    "2   Spread the bread on a sheet pan and bake until dried out, 30 to 45 minutes. You do not want any color. To test for doneness, smash a shard of bread with the back of a spoon. The interior should be completely dry. Let cool.",
    "3   Once cooled, place the bread in a food processor and pulse until broken down into fine crumbs. You want them to retain some texture, so be careful not to turn them to dust.",
    "4   Place a sauté pan over medium-low heat. Add the olive oil and garlic and cook until the garlic perfumes the oil, 1 to 2 minutes. Remove the garlic and save for another use.",
    "5   Turn the heat down to low. Line a plate with paper towels. Add the bread crumbs to the pan and cook, stirring occasionally, until they are golden brown, 5 to 8 minutes. Remove from the pan and transfer to the plate to drain. Let cool.",
    "6   Measure out 20g / ⅓ cup bread crumbs and set aside. Transfer the remainder to an airtight container and store in a cool, dry place for up to 1 week for another use.",
    "7   To make the hot honey, mix together the honey, chiles, and chile oil in a small bowl. Measure out 80g / ¼ cup and set aside. Transfer the remainder to an airtight container store at room temperature for up to 2 weeks for another use.",
    "8   To make the squash, preheat the oven to 400°F.",
    "9   Place a small saucepan over low heat. Add the butter and gently melt. Remove from the heat and stir in the olive oil.",
    "10   Place the squash wedges in a large bowl. Add the butter mixture and toss or stir to coat on all sides.",
    "11   Place the squash wedges, skin side down, on a sheet pan. Arrange the garlic cloves around and on the squash and lay the rosemary and thyme sprigs on top. Sprinkle with salt q.b.",
    "12   Roast the squash until fork-tender and slightly caramelized, about 45 minutes.",
    "13   To finish, transfer the squash to a large bowl, add the vinegar, and gently stir to coat.",
    "14   Transfer the squash to a large serving platter and drizzle with the hot honey. Garnish with the thyme and rosemary leaves, chile flakes, and bread crumbs, then sprinkle with sea salt q.b. to finish."
  ]
}