{
  "title": "Roast Chicken with Red Wine Vinegar and Honey",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4",
  "categories": [
    "***NEED TO MAKE",
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "One 4-pound (1.8 kg) whole chicken",
    "1tablespoon black peppercorns",
    "2teaspoons fennel seeds",
    "1tablespoon porcini mushroom powder",
    "4teaspoons kosher salt, plus more to taste",
    "2teaspoons dried oregano",
    "1teaspoon sweet smoked paprika",
    "Olive oil, for searing",
    "5large shallots (about 1 pound/454 g), peeled and halved",
    "3tablespoons unsalted butter",
    "5garlic cloves, thinly sliced",
    "3tablespoons red wine vinegar",
    "2tablespoons honey",
    "Torn fresh parsley leaves, to taste"
  ],
  "directions": [
    "1. The day before you plan to roast it, prep and season the chicken. To spatchcock the chicken, position it on a cutting board, breast side down. Pat the chicken dry, and be sure the cavity is empty. Using kitchen shears, cut along each side of the backbone to remove it. (Freeze the backbone for the next time you make broth!) Flip over the chicken, and firmly press down between the two breasts to break the breastplate and fully flatten the chicken. Place the chicken on a sheet pan lined with a wire rack.2. Add the peppercorns and fennel seeds to a mortar, and use a pestle to grind them to a coarse powder. (Or use a spice grinder.) Transfer to a small bowl, and mix in the mushroom powder, salt, oregano, and paprika. Reserve 2 tablespoons of the spice mix for finishing the sauce later on.3. Season the chicken all over with the remaining spice rub. Place in the refrigerator, uncovered, overnight for at least 8 hours or up to 24.4. The next day, when you’re ready to roast, preheat the oven to 400°F (200°C) with a rack positioned in the center. While the oven preheats, remove the chicken from the refrigerator to temper.5. Heat a 12-inch (30 cm) cast-iron pan over medium heat, and coat the bottom with olive oil. Add the chicken, skin side down, and place another heavy pan on top to press. Sear, without disturbing the chicken, until the skin is golden brown, 7 to 10 minutes.6. Remove the second pan, and carefully flip over the chicken. Sear for another 2 minutes, this time without the second pan on top. Transfer the chicken, breast side up, to a sheet tray or large plate.7. Add the shallots, cut side down, to the pan, and sear until deeply charred, 5 or 6 minutes. Leave the shallots cut side down, and place the chicken, breast side up, on top of the shallots.8. Transfer the pan to the oven, and roast for 40 to 50 minutes, until the internal temperature of the thickest part of the breast is 160°F (71°C) and the thighs are at least 180°F (82°C). The internal temperature will increase as the chicken rests.9. Transfer the chicken to a cutting board, and let it rest for at least 15 minutes or up to 45 minutes. Remove the shallots to a serving platter.10. Meanwhile, return the pan to medium heat, and add the butter to melt. Add the reserved spice mix and the garlic, and cook, stirring, until the garlic has softened and the spices have toasted and browned, 3 or 4 minutes.11. Turn off the heat, and stir in the vinegar and honey. Fear not, this is meant to be a broken sauce! Season with salt.12. To cut the chicken, remove the leg quarters and then cut between the thighs and legs to separate. Cut through the breastbone to separate the two breasts and then cut each breast in half horizontally. (I like to keep the wing attached to the breast.)13. Pile all the chicken on the platter with the shallots, and spoon the warm sauce over the top (reheating it if needed before spooning). Garnish with a lot of torn fresh parsley leaves, and serve."
  ]
}