{
  "title": "Roasted Eggplant with Pickled Raisin & Basil Dressing",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1½pounds small eggplant, such as Fairy Tale, Italian, or Japanese",
    "1small shallot",
    "1cup basil leaves",
    "PANTRY",
    "¼cup extra-virgin olive oil, plus more for drizzling",
    "Kosher salt",
    "½cup red wine vinegar",
    "½cup golden raisins or currants",
    "2tablespoons sugar",
    "¾teaspoon red pepper flakes"
  ],
  "directions": [
    "1. Position a rack in the lower third of your oven. Preheat the oven to 450°F.",
    "2. Prep and roast the eggplant:- Trim the stems of 1½ pounds small eggplant and halve or quarter them lengthwise so that the pieces are about 1½ inches thick and will cook evenly.- Toss the eggplant pieces with ¼ cup olive oil on a large rimmed baking sheet, coating them evenly. Season with salt and arrange cut-side down. Roast until deeply caramelized on the cut side, 15 to 20 minutes. Rotate the pieces so that the uncaramelized side is down and continue roasting until very soft and golden brown, 5 to 10 minutes longer.",
    "3. While the eggplant cooks, make the dressing:- Thinly slice 1 shallot crosswise into rings and separate them.- In a small saucepan, combine ½ cup red wine vinegar, ¼ cup water, ½ cup golden raisins, 2 tablespoons sugar, ¾ teaspoon red pepper flakes, and ¾ teaspoon salt. Cook over medium-high heat, swirling occasionally, until the liquid reduces to a third, 5 to 7 minutes. It should be loose enough to drizzle. If too thick, add a teaspoon of water to loosen. Remove from heat.- Stir the shallots into the warm raisins.",
    "4. Just before serving, gently stir in 1 cup basil leaves into the warm dressing.",
    "5. Plate it up: Transfer the roasted eggplant to a serving dish. Spoon the warm dressing over top and drizzle with more olive oil."
  ]
}