{
  "title": "Roast Duck",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 (5 1/2- to 6-pound) Pekin duck, neck and giblets removed",
    "- 2 tablespoons kosher salt, divided",
    "- 1 tablespoon maltose or honey",
    "- 1 1/2 teaspoons soy sauce"
  ],
  "directions": [
    "1. Using your hands, remove large fat deposits from the bottom of the cavity. Using kitchen shears, trim excess neck skin from the top of the breast; remove the tail and first 2 segments from each wing, leaving only the drumette. Arrange the duck breast side up on a cutting board. With the tip of a sharp knife, cut slits spaced 3/4 inch apart in a crosshatch pattern in the skin and fat of the breast, being careful not to cut into the meat. Flip the duck breast side down. Cut parallel slits spaced 3/4 inch apart in the skin and fat of each thigh (do not crosshatch).",
    "2. Rub 2 teaspoons salt into the duck cavity. Rub 1 teaspoon salt into the breast, making sure to rub salt into the slits. Rub the remaining 1 tablespoon salt into the skin of the rest of the duck. Align the skin at the bottom of the cavity so one side overlaps the other by at least 1/2 inch. Use a sturdy toothpick to pin the skin layers together to close the cavity. Place the duck on a large plate and refrigerate uncovered for at least 6 hours or up to 24 hours.",
    "3. Place the duck breast side up in a 14-inch flat-bottomed wok or Dutch oven. Add water until at least half of the thighs are submerged, but most of the breast remains above water, about 6 cups. Bring to a boil over high heat, then reduce the heat to maintain a vigorous simmer. Cook, uncovered, until the thermometer inserted into the thickest part of the drumstick to the bone registers 145 to 160 degrees, 45 minutes to 1 hour. After 20 minutes of cooking, adjust the oven rack to the lower-middle position and heat the oven to 425 degrees. Combine the maltose and soy sauce in a bowl.",
    "4. Crumple a 20-inch length of aluminum foil into a loose ball. Uncrumple the foil and place it in a roasting pan. Set a V-rack on the foil and spray it with vegetable oil spray. Using tongs and a spatula, lift the duck from the wok, allowing the liquid to drain, and transfer it to the V-rack breast side up. Brush the breast and top of the drumsticks with one-third of the maltose mixture. Flip the duck and brush the remaining mixture over the back and sides. Roast until the back is golden brown and the breast registers 140 to 150 degrees, about 20 minutes.",
    "5. Remove the roasting pan from the oven. Using tongs and a spatula, flip the duck breast side up. Continue to roast until the breast registers 160 to 165 degrees, 15 to 25 minutes. Transfer the duck to a carving board and let it rest for 20 minutes. Carve the duck and serve."
  ]
}