{
  "title": "Roasted Tomato Soup With Broiled Cheddar",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 4 mugs of soup",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "soup",
    "Two 28-ounce (794-gram) cans whole tomatoes",
    "2tablespoons (30 ml) olive oil, plus a drizzle more",
    "2large or 4 small garlic cloves, unpeeled",
    "Salt and freshly ground black pepper",
    "A few fresh thyme sprigs, or ¼ teaspoon dried",
    "1tablespoon salted or unsalted butter",
    "2large shallots, minced, or about ⅓ cup minced white onion",
    "2cups (475 ml) vegetable or chicken stock",
    "A few pinches of red pepper flakes",
    "grilled cheese lid",
    "Four 1-inch slices firm sourdough or country bread, lightly toasted",
    "¼cup (30 grams) coarsely grated cheddar per slice"
  ],
  "directions": [
    "make the soup Heat the oven to 450 degrees. Pour the tomatoes into a strainer set over a bowl, and use your fingers or a fork or spoon to break them open so that they release their juices. Reserve the juices, and set aside. Put 1 tablespoon of olive oil in the bottom of a roasting pan, and spread the tomatoes out in the pan. Wrap the garlic cloves tightly in a foil packet with a few drops of olive oil inside, and place the packet in the roasting pan as well. Finish the tomatoes with a drizzle of oil, salt and pepper to taste, and thyme. Roast the tomatoes and garlic together for 30 to 35 minutes, until most of the liquid has evaporated, the tomatoes begin to color, and the garlic is tender. Discard any wiry thyme stems.",
    "Heat a large pot with the butter and 1 tablespoon olive oil over medium heat. Sauté the shallots until translucent and sweet-smelling, for 3 to 5 minutes then add the roasted tomatoes, 3 cups of the reserved tomato juices, stock, garlic squeezed from its skin, and red pepper flakes, and bring it all to a simmer. Cook with the lid slightly ajar for 20 to 25 minutes. Use an immersion blender (or transfer to a blender or food processor) to blend the soup to your desired texture.",
    "make the grilled cheese lid Heat the broiler. Arrange four ovenproof mugs on a foil-lined baking sheet. Divide the soup between mugs. Float a slice of bread on each, then top with grated cheddar. Cook under the broiler until melty and browned in spots, usually for just 1 to 2 minutes. Serve immediately.",
    ""
  ]
}