{
  "title": "Roasted Butternut Squash & Pomegranate Salad with Garlicky Honey-Dijon Dressing",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "4 to 6",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "For the Squash",
    "3tablespoons olive oil",
    "4cups ½-inch cubes peeled butternut squash (1½ pounds; from a 2¼-pound whole squash, if that’s where you’re starting from)",
    "1½teaspoons kosher salt",
    "½teaspoon freshly ground black pepper",
    "¼ to ½teaspoon cayenne pepper, to taste",
    "For the Dressing",
    "2tablespoons white wine vinegar or apple cider vinegar",
    "1tablespoon Dijon mustard",
    "1tablespoon honey",
    "1clove garlic, grated or smashed into a paste",
    "¼teaspoon kosher salt",
    "¼teaspoon freshly ground black pepper",
    "3tablespoons olive oil",
    "For the Salad",
    "5cups baby arugula",
    "½cup pomegranate seeds (see Tip)",
    "¼cup pumpkin seeds, lightly toasted",
    "½small red onion, thinly sliced",
    "½cup crumbled goat cheese (4 ounces)",
    "Freshly ground black pepper"
  ],
  "directions": [
    "ROAST THE SQUASH: Preheat the oven to 400°F. Line a rimmed baking sheet with foil and pour 2 tablespoons of the oil on the lined sheet. Place the oiled sheet in the oven (yep, nothing on it) and heat until very hot but not smoking, about 8 minutes.",
    "In a large bowl, toss the squash with the remaining 1 tablespoon oil, the salt, pepper, and cayenne until coated. Using an oven mitt, remove the hot baking sheet from the oven and quickly pour the squash onto the sheet (you should hear some sizzling); take a few extra seconds to make sure the flat sides of the squash are hitting that hot oiled pan. Roast until the undersides are golden, about 15 minutes. Remove the squash from the oven, shake the pan (or flip the squash with tongs if you’re down with OCD, yeah you know me), return to the oven, and roast until the new underside is golden brown, 10 to 15 minutes. Let cool to room temp or just warm (so it doesn’t murder the greens when you drop them on).",
    "MAKE THE DRESSING: In a screw-top jar, shake the vinegar, mustard, honey, garlic, salt, pepper, and oil until it’s creamy. (If it separates, just shake it again.)",
    "MAKE THE SALAD: Arrange the arugula on a platter. Top with the roasted squash, pomegranate seeds, and pumpkin seeds. Scatter the onion and goat cheese on top. Drizzle with the dressing to taste and sprinkle with pepper."
  ]
}