{
  "title": "Roasted Chicken With Harissa And Warm Bulgur Salad",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2¼cups chicken broth",
    "1½cups medium-grind bulgur",
    "1sprig fresh dill, plus 2 tablespoons minced",
    "1garlic clove, lightly crushed and peeled",
    "1teaspoon table salt, divided",
    "3pounds bone-in chicken pieces (split breasts, drumsticks, and/or thighs), trimmed",
    "½teaspoon pepper, divided",
    "3tablespoons extra-virgin olive oil, divided",
    "1teaspoon grated lemon zest plus 3 tablespoons juice",
    "1English cucumber, cut into ½-inch pieces",
    "1cup jarred roasted red peppers, chopped",
    "3tablespoons harissa",
    "1cup plain Greek yogurt"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 450 degrees. Bring broth, bulgur, dill sprig, garlic, and ¼ teaspoon salt to boil in large saucepan over medium-high heat. Reduce heat to low, cover, and simmer gently until bulgur is tender, 16 to 18 minutes. Off heat, let bulgur sit for 10 minutes. Fluff bulgur gently with fork, discard dill and garlic, and cover to keep warm.",
    "2. Pat chicken dry with paper towels and sprinkle with ½ teaspoon salt and ¼ teaspoon pepper. Heat 1 tablespoon oil in 12-inch ovensafe skillet over medium-high heat until just smoking. Cook chicken skin side down until well browned, 5 to 7 minutes. Flip chicken, transfer skillet to oven, and roast until breasts register 160 degrees and drumsticks/thighs register 175 degrees, 15 to 20 minutes.",
    "3. Meanwhile, whisk lemon zest and juice, remaining ¼ teaspoon salt, remaining ¼ teaspoon pepper, and remaining 2 tablespoons oil together in large bowl. Add bulgur, cucumber, red peppers, and minced dill and toss gently to combine. Season with salt and pepper to taste.",
    "4. Transfer chicken to serving platter, reserving pan juices in skillet. In small bowl, whisk harissa together with 2 to 4 tablespoons pan juices, 1 tablespoon at a time, until mixture is loose and spreadable. Brush mixture onto chicken, tent with aluminum foil, and let rest for 5 to 10 minutes. Season yogurt with salt and pepper to taste. Serve chicken with bulgur salad and seasoned yogurt."
  ]
}