{
  "title": "Rolled Fig Cookies",
  "source": "The Food of Sicily - Fabrizia Lanza",
  "servings": "Makes about 20 cookies",
  "categories": [
    "Italian",
    "The Food of Sicily - Fabrizia Lanza"
  ],
  "ingredients": [
    "For the Dough:",
    "- 4 tablespoons (60 g) lard or unsalted butter, at room temperature",
    "- ¼ cup (50 g) granulated sugar",
    "- 1 large egg",
    "- 1 tablespoon whole milk",
    "- ¼ teaspoon vanilla extract",
    "- 2 cups (240 g) all-purpose flour",
    "- ½ teaspoon baking powder",
    "For the Filling:",
    "- ½ cup (50 g) walnuts, toasted and chopped",
    "- ½ cup (65 g) almonds, toasted and chopped",
    "- ¼ cup (35 g) pistachios, toasted and chopped",
    "- 5 ounces (150 g) dried figs, very finely chopped",
    "- ⅓ cup (100 g) orange or tangerine marmalade",
    "- ⅔ cup (160 ml) mosto cotto or ¼ cup (60 ml) molasses plus enough white wine to make ⅔ cup",
    "For Decoration:",
    "- 1 cup (120 g) powdered sugar",
    "- Juice of 1 lemon",
    "- Rainbow sprinkles"
  ],
  "directions": [
    "1. Make the dough: In a stand mixer fitted with a paddle, beat the lard and granulated sugar until fluffy and lightened in color, about 3 minutes.2. Add the egg, milk, and vanilla and mix until well combined.3. Add the flour and baking powder and mix until a soft, smooth dough forms.4. Wrap the dough in plastic wrap and refrigerate for at least 30 minutes.",
    "5. Make the filling: In a food processor, pulse the walnuts, almonds, and pistachios until finely ground.6. Transfer to a large bowl and add the dried figs, marmalade, and mosto cotto. Mix well.7. Pour the filling mixture into a large saucepan and cook over medium-low heat, stirring constantly, until the figs soften and the mixture thickens, 3 to 5 minutes.8. Return the filling to the bowl and let cool completely.",
    "9. Preheat the oven to 350°F (180°C). Line two baking sheets with parchment paper.",
    "10. Divide the chilled dough into 4 equal portions.11. Working with 1 portion at a time, roll out the dough into a 3-by-15-inch (7 by 38 cm) rectangle about ⅛ inch (3 mm) thick.12. Transfer the cooled fig filling to a pastry bag fitted with a #12 (⅓-inch/1 cm) plain tip, or use a small spoon.13. With a long side of the dough rectangle facing you, pipe or spoon a line of filling about two fingers’ distance from the top edge.14. Fold the bottom of the dough up over the filling, then fold the top down to enclose it.15. Turn the log seam-side down and press gently to seal and flatten slightly.16. Repeat with the remaining dough and filling."
  ]
}