{
  "title": "Roman-Style Artichokes",
  "source": "My Kitchen in Rome - Rachel Roddy",
  "servings": "Serves 4, plus one to argue over",
  "categories": [
    "Italian",
    "My Kitchen in Rome - Rachel Roddy"
  ],
  "ingredients": [
    "5large globe artichokes",
    "1lemon, halved",
    "2garlic cloves",
    "2tablespoons very finely chopped flat-leaf parsley (optional)",
    "2tablespoons very finely chopped mint, ideally mentuccia (lesser calamint)",
    "salt and freshly ground black pepper",
    "8tablespoons extra-virgin olive oil",
    "½cup white wine"
  ],
  "directions": [
    "You will need a large, heavy-bottomed pan with a tight-fitting lid, tall enough to accommodate the artichokes, which are to go in standing up.",
    "Prepare the artichokes by pulling the dark, tough outer leaves downward and snapping them off just before the base. Then, using a sharp knife, pare away the tough green flesh from the base of the artichokes and stem. As you work, rub the cut edges of the artichoke with a cut lemon or sit them in a bowl of water with lemon juice.",
    "Chop the garlic very finely. In a bowl, mix together the chopped herbs and garlic, and add a generous pinch of salt and a few grindings of black pepper. Using your thumbs, open up the artichoke flower and use a teaspoon to scrape out the hairy choke (if they are not a chokeless variety). Next, press one-fifth of the herb-and-garlic mixture into the hollow cavity. Sit the artichokes, stems upward, in the pan. Add the olive oil, wine, and enough water to come a third of the way up the leaves. Cover the pot with a damp tea towel or a piece of doubled-over paper towel and put the lid on over the towel. Bring the edges of the towel back over the top of the pan. Place the pan over medium-low heat and cook for 40 minutes. The liquid in the pan should bubble and steam purposefully but not aggressively. The artichokes are ready when a fork easily pierces the thickest part of the stem near the heart.",
    "Once cooked, use a slotted spoon to move the artichokes onto a serving plate, stems upward. Allow them to cool to room temperature. Reserve the cooking juices and pour these over the artichokes just before serving."
  ]
}