{
  "title": "Rosemary-Vinegared Mushrooms",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Serves 4 as a side",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "1garlic head",
    "Extra-virgin olive oil",
    "½pound oyster mushrooms, very well cleaned",
    "Diamond Crystal kosher salt",
    "1tablespoon fresh rosemary",
    "5 or 6fresh sage leaves",
    "Freshly ground black pepper",
    "2tablespoons white wine vinegar",
    "1tablespoon honey",
    "¼cup Cashew Cream (this page), yogurt, or ricotta cheese"
  ],
  "directions": [
    "1. Position a rack in the center of the oven and preheat to 425°F. Line a sheet pan with parchment paper.",
    "2. Slice off the top third of the garlic head to expose the cloves and drizzle with 1 tablespoon olive oil. Wrap in aluminum foil (or follow the instructions on this page) and roast it until soft, about 40 to 45 minutes.",
    "3. At the same time, peel the mushroom into small strips, following the lines of the base. Toss with 2 tablespoons olive oil and season with ¼ teaspoon salt before scattering on the lined sheet pan and transferring to the oven. Roast until they are a dark, golden crisp, 20 to 22 minutes.",
    "4. While the mushrooms are roasting, set a small sauté pan over medium heat and add 1 tablespoon olive oil, the rosemary, and sage and cook, undisturbed, until the rosemary is dark and the sage has crisped up, 2 to 3 minutes. Season with a pinch of salt and a few cracks of black pepper, then pour in the vinegar and honey. Stir to combine and let this mixture simmer until the vinegar has reduced by half and everything is syrupy, 4 to 5 minutes.",
    "5. In a small bowl, mix together the cashew cream and a pinch of salt. Squeeze in the roasted garlic cloves and mix well.",
    "6. When the mushrooms are out of the oven, spoon the vinegar and herb mixture over them and toss so that the mushrooms are lightly dressed. Swipe the garlicky cashew cream on the bottom of a plate and pile the mushrooms on top."
  ]
}