{
  "title": "Salade Niçoise",
  "source": "Modern Bistro - ATK",
  "servings": "6 servings",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "For the dressing:",
    "½cup lemon juice (3 lemons)",
    "1shallot, minced",
    "2tablespoons finely chopped fresh basil, parsley, or dill",
    "1tablespoon minced fresh thyme or rosemary",
    "2teaspoons minced fresh oregano",
    "1teaspoon Dijon mustard",
    "¾cup extra-virgin olive oil",
    "For the salad:",
    "1¼pounds small red potatoes, unpeeled, quartered",
    "Table salt for cooking vegetables",
    "2tablespoons dry vermouth",
    "2heads Boston or Bibb lettuce (1 pound), torn into bite-size pieces",
    "12ounces olive oil–packed tuna, drained",
    "3small tomatoes, cored and cut into eighths",
    "1small red onion, sliced very thin",
    "8ounces green beans, trimmed and halved crosswise",
    "6hard-cooked eggs, quartered",
    "¼cup pitted Niçoise olives",
    "10–12anchovy fillets, rinsed (optional)",
    "2tablespoons capers, rinsed (optional)"
  ],
  "directions": [
    "1. For the dressing: Whisk lemon juice, shallot, basil, thyme, oregano, and mustard together in medium bowl. Whisking constantly, slowly drizzle in oil until emulsified. Season with salt and pepper to taste. Set aside. (Dressing can be refrigerated up to 24 hours; whisk to recombine before using.)",
    "2. For the salad: Bring potatoes and 4 quarts cold water to boil in Dutch oven or stockpot over high heat. Add 1 tablespoon salt and cook until potatoes are tender when poked with paring knife, 5 to 8 minutes. Using slotted spoon, gently transfer potatoes to medium bowl (do not discard boiling water). Toss warm potatoes with vermouth and season with salt and pepper to taste; let sit for 1 minute. Toss in ¼ cup dressing; set aside.",
    "3. While potatoes cook, toss lettuce with ¼ cup dressing in large bowl until coated. Arrange bed of lettuce on very large flat platter. Place tuna in now-empty bowl and break up with fork. Add ½ cup dressing and stir to combine; mound tuna in center of lettuce. Toss tomatoes and onion with 3 tablespoons dressing in now-empty bowl and season with salt and pepper to taste. Arrange tomato mixture in mound at edge of lettuce bed. Arrange potatoes in separate mound at opposite edge of lettuce bed.",
    "4. Return water to boil; add green beans and 1 tablespoon salt. Cook until crisp-tender, 3 to 5 minutes. Meanwhile, fill large bowl halfway with ice and water. Drain green beans; transfer to ice bath; and let sit until just cool, about 30 seconds. Dry green beans well on triple layer of paper towels. Toss green beans with 3 tablespoons dressing in now-empty bowl and season with salt and pepper to taste. Arrange in separate mound at edge of lettuce bed.",
    "5. Arrange eggs, olives, and anchovies (if using) in separate mounds at edge of lettuce bed. Drizzle eggs with remaining 2 tablespoons dressing; sprinkle salad with capers (if using). Serve immediately."
  ]
}