{
  "title": "Salmon Tartare with Potato Chips",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6 to 8",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Tartare",
    "8ounces (227 g) sashimi-grade salmon",
    "1finger chile, minced",
    "1small Meyer lemon, seeded and minced",
    "1small shallot, minced",
    "3tablespoons thinly sliced fresh chives",
    "1tablespoon capers, drained and chopped",
    "1tablespoon extra virgin olive oil",
    "1⁄2 teaspoon fish sauce",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Potato Chips",
    "2large russet potatoes (about 10 ounces/283 g each), skin on, scrubbed clean, and sliced paper-thin on a mandoline",
    "1tablespoon white vinegar",
    "Canola oil, for frying",
    "Kosher salt, to taste"
  ],
  "directions": [
    "1. Dice the salmon very small, and add to a medium bowl. Place in the refrigerator to chill until you are ready to mix the tartare.2. Make the potato chips: Place the potato slices in a large pot, and rinse under cold water until the water runs clear, three or four times.3. Fill the pot with cold water to cover the potatoes by about 1 inch (2.5 cm), and add the vinegar.4. Set the pot over high heat, bring to a boil, and then immediately strain. Divide the potatoes between two large, paper towel–lined sheet trays, spread out evenly, and pat completely dry. Wipe out the pot until it is completely dry.5. Heat 11⁄2 inches (4 cm) canola oil in the pot over medium heat to 350°F (180°C).6. Carefully lower the chips, in three batches, into the hot oil using a slotted spoon or spider. Fry the chips, adjusting the heat as needed to maintain 350°F (180°C), until lightly golden and crispy, 3 or 4 minutes. (You can tell the chips are done when the sizzling from the potatoes drastically decreases.) Use a slotted spoon or a spider to transfer the chips from the hot oil to a paper towel–lined sheet tray, and immediately sprinkle with salt.7. Make the tartare: Combine the chile, lemon, shallot, chives, capers, olive oil, and fish sauce in a medium bowl. Add the chilled salmon, and gently toss. Season with salt and pepper.8. Serve immediately alongside the potato chips."
  ]
}