{
  "title": "Salt-&-Vinegar Baked Fries",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "4",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "2cups distilled white vinegar",
    "¼cup kosher salt, plus more for seasoning",
    "4large russet potatoes (about 3 pounds), skin on, scrubbed",
    "6tablespoons vegetable oil",
    "Finely chopped chives, for garnish"
  ],
  "directions": [
    "Preheat the oven to 450°F.",
    "In a large pot, combine 6 cups water, the vinegar, and ¼ cup kosher salt and bring to a boil over high heat.",
    "Meanwhile, cut the potatoes: Stand each potato up on its long side and cut it lengthwise into ½-inch-thick ovals. Stack the ovals and cut them lengthwise into batons (basically, make French-fry shapes, OK?).",
    "Line a baking sheet with a kitchen towel. Put the potatoes into the water (it’s OK if it’s not boiling yet), bring to a boil, and boil for 8 minutes. Remove with a slotted spoon (be careful not to break them; they should still be sort of firm but bendy) to the lined baking sheet to soak up all the additional liquid. Spread the potatoes out in one layer and blot them dry with paper towels. Let cool.",
    "Transfer the potatoes to a large bowl and toss with 2 tablespoons of the oil and 1 teaspoon salt. Divide the remaining 4 tablespoons oil between two large rimmed baking sheets (2 tablespoons per sheet).",
    "Heat the oiled sheets in the oven until very hot but not smoking, 5 to 6 minutes. Using an oven mitt, remove the sheets from the oven and quickly divide the potatoes between them, making sure they all actually sit on the surface of the pan. Return to the oven and bake until the undersides are brown and crisp and the top edges are darkened, about 20 minutes. Open the oven, scrape the fries with a metal spatula to turn them, then bake until the fries are golden and crisp all around, another 10 minutes. Drain on paper towels and season with more salt. Garnish with chives."
  ]
}