{
  "title": "Salted Halvah Blondies",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Makes 16 blondies",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "1¼cups all-purpose flour (5.6 oz / 163g)",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "½teaspoon baking powder",
    "6ounces (170g) white chocolate, coarsely chopped (1 cup)",
    "1stick unsalted butter (4 oz / 113g)",
    "¼cup tahini (2.5 oz / 70g)",
    "½cup packed light brown sugar (3.5 oz / 100g)",
    "1large egg (1.8 oz / 50g)",
    "2large egg yolks (1.1 oz / 32g)",
    "1tablespoon vanilla extract",
    "4ounces (113g) halvah, crumbled (about ½ cup)",
    "2tablespoons sesame seeds (0.63 oz / 18g)",
    "Flaky salt, for sprinkling the top"
  ],
  "directions": [
    "Preheat the oven and prepare the pan: Arrange an oven rack in the center position and preheat the oven to 350°F. Line an 8 × 8-inch pan with 2 sheets of foil, crossing one over the other and pressing the foil into the corners and up the sides. Butter the foil generously and set the pan aside.",
    "Mix the dry ingredients: In a medium bowl, whisk together the flour, salt, and baking powder to combine. Set aside.",
    "Melt the white chocolate mixture: In a large heatproof bowl, combine the white chocolate, butter, and tahini and set it over a medium saucepan filled with about 1 inch of simmering (not boiling) water. Warm the mixture gently, stirring occasionally, just until the white chocolate and butter are melted and the mixture is smooth. Remove the bowl from the heat and let cool slightly.",
    "Add the sugar and eggs: Whisk the brown sugar into the white chocolate mixture. It will look grainy and you might see some of the fat start to separate from the rest of the mixture, which is normal. Add the whole egg, egg yolks, and vanilla and whisk vigorously until the mixture comes back together and looks very thick, smooth, and glossy and is starting to pull ever so slightly away from the sides of the bowl.",
    "Add the dry ingredients and halvah: Add the flour mixture and stir with a flexible spatula just until the dry ingredients are evenly incorporated into the batter. Add the crumbled halvah and fold in gently to avoid breaking it into smaller bits.",
    "Bake the blondies: Scrape the batter into the prepared pan, spreading it in an even layer all the way to the corners. Sprinkle the sesame seeds across the surface of the batter, then top with flaky salt. Bake until the blondies are puffed across the surface, golden brown around the edges, and slightly jiggly in the center, 20 to 25 minutes.",
    "Let cool and serve: Allow the blondies to cool completely in the pan. Use the ends of the foil to lift the blondies out of the pan and slice into 16 bars."
  ]
}