{
  "title": "Salty Nut Tart with Rosemary",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 12",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Special Equipment: 9-inch removable-bottom tart pan, food processor (for the Sweet Tart Dough)",
    "1cup pine nuts (5 oz / 143g) ①",
    "1cup walnuts (4 oz / 113g), coarsely chopped",
    "¼cup honey (3 oz / 85g)",
    "¼cup sugar (1.8 oz / 50g)",
    "¼cup heavy cream (2 oz / 57g)",
    "¼cup extra-virgin olive oil (2 oz / 57g)",
    "2tablespoons light corn syrup (1.4 oz / 40g)",
    "½teaspoon Diamond Crystal kosher salt",
    "½teaspoon vanilla extract",
    "½teaspoon finely chopped fresh rosemary",
    "Sweet Tart Dough (this page), parbaked in a 9-inch removable-bottom tart pan and cooled ②",
    "¼teaspoon flaky salt, for serving"
  ],
  "directions": [
    "Preheat the oven and toast the nuts: Arrange an oven rack in the center position and preheat the oven to 350°F. Scatter the pine nuts and chopped walnuts on a small rimmed baking sheet and toast, shaking halfway through, until they’re golden brown and fragrant, 6 to 9 minutes. After 5 minutes keep a watchful eye since pine nuts burn easily! Remove them from the oven and set the nuts aside to cool. (Leave the oven on.)",
    "Cook the filling: In a small saucepan, combine the honey, sugar, heavy cream, olive oil, and corn syrup and cook over medium-low heat, stirring gently with a heatproof spatula to dissolve the sugar. Increase the heat to medium and bring the mixture to a rapid simmer. Cook the mixture without stirring, swirling the pan often, until it has thickened slightly, about 5 minutes. This is an approximate end point—the idea is to cook off some moisture and make sure all the ingredients are well combined, not to cook it until it’s caramel. The mixture will still be quite liquid. Remove the saucepan from the heat and stir in the kosher salt, vanilla, and ¼ teaspoon of the rosemary. Add the toasted nuts and stir well to combine. Set aside.",
    "Fill the tart and bake: Place the cooled, parbaked tart crust on a large foil-lined rimmed baking sheet. Scrape the filling mixture into the tart, distributing all the nuts across the bottom so the liquid pools evenly around them. Bake until the filling around the nuts is bubbling and the surface is deep golden brown, 25 to 30 minutes. Remove from the oven and set the tart aside to cool slightly.",
    "Top with rosemary salt: While the tart is still warm, in a small bowl, combine the flaky salt and remaining ¼ teaspoon rosemary and rub between your fingertips for a few seconds to release the fragrant oils. Sprinkle the mixture over the tart and let the tart cool completely (it will set as it cools).",
    "Serve: Pop the tart out of the ring. Slide a thin metal spatula between the tart base and the bottom of the tart to loosen it, then carefully slide it onto a serving plate and cut into wedges."
  ]
}