{
  "title": "Same-Day Focaccia",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 6 to 10",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "1(¼-ounce) packet instant dry yeast or 2¼ teaspoons",
    "2teaspoons honey",
    "2tablespoons olive oil, plus lots more for coating the bowl and pan",
    "2cups warm-ish water",
    "5cups bread flour (all-purpose flour will also do the trick here, although the dough might be slightly less elastic), plus more for the work surface",
    "1teaspoon kosher salt",
    "1small red onion, thinly sliced into rings (about ⅛ inch thick)",
    "Flaky sea salt"
  ],
  "directions": [
    "1 Whisk the yeast, honey, 2 tablespoons olive oil, and water in a large bowl. Add the flour and, using a wooden spoon, mix to casually blend (it will still be a craggy mess; that’s fine). Add the kosher salt and continue to mix until it goes from craggy to kind of wet and shaggy (the dough is going to be too wet and sticky to knead at this stage, so don’t worry about getting it nice and smooth yet). Cover tightly with plastic wrap and let sit in a warm spot until it doubles in size, about an hour or so.",
    "2 Turn the dough out onto a lightly floured surface and, using the palm of one hand, press into the dough, turning and folding it onto itself (a.k.a. kneading) a few times (the dough will still be sticky but much more manageable) until it comes together and starts looking smooth and elastic. Feel free to dust with flour occasionally but not too much.",
    "3 Once the dough is looking nice and smooth, drizzle a bit of olive oil into that same bowl to grease it up and put dough back. Cover the bowl tightly with plastic wrap and let sit in a warm spot until it doubles in size again, another 45 to 60 minutes.",
    "4 Pour enough olive oil onto a rimmed baking sheet (approximately 12¾ by 17¾ inches) to generously coat the entire sheet. Using your hands, spread it all around. Turn the dough onto the baking sheet and again using your hands, coax the dough into a flat, even layer. (It doesn’t need to stretch to the exact size of the sheet pan; it’ll puff up and fill in as it proofs and bakes.) Drizzle the top with lots more olive oil and lightly drape a piece of plastic over for its final nap, letting it rest in a warm spot for another 45 to 60 minutes.",
    "5 Preheat the oven to 425°F.",
    "6 To know when the dough is ready to bake, it should look light, puffy, and buoyant. To test this, use your fingertips to press the dough lightly. It should bounce back ever so slightly. (If it sinks and deflates, well, you’ve overproofed the dough and it might never recover. But let’s not assume the worst. Even then, you’ll still have something edible; just call it flatbread.) Using the tips of your fingers to lightly dimple the surface, kind of like you’re playing the piano, scatter the top with the onion rings and drizzle again with, yes, more olive oil, and sprinkle with flaky salt. Bake, rotating if needed to avoid hot spots, until the bread is deeply golden brown and the onion rings are caramelized and cooked through, 35 to 45 minutes.",
    "7 Remove from the oven and let cool slightly before slicing and serving."
  ]
}