{
  "title": "Saucy Eggs all’Amatriciana",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 1 large yellow or white onion",
    "- 5 garlic cloves",
    "- 2 pounds cherry or Sungold tomatoes",
    "- 2 oregano or marjoram sprigs",
    "DAIRY",
    "- 2 ounces grated Parmesan or pecorino cheese (½ cup), plus more for serving",
    "- 4 large eggs",
    "MEAT",
    "- 8 ounces bacon or pancetta",
    "PANTRY",
    "- ¼ loaf of crusty bread (about 4 ounces)",
    "- 4 tablespoons extra-virgin olive oil",
    "- Kosher salt",
    "- ¾ teaspoon red pepper flakes"
  ],
  "directions": [
    "1. Preheat the oven to 425°F.",
    "2. Make the croutons:",
    "- Tear ¼ loaf of crusty bread into irregular, 2-inch pieces. Toss on a rimmed baking sheet with 2 tablespoons olive oil and ½ teaspoon salt. Bake until deeply golden brown and crisp, 7 to 9 minutes.",
    "3. Do your mise:",
    "- Chop 1 large onion. Not sure how to properly chop an onion? I got you.- Thinly slice 5 garlic cloves.- Dice 8 ounces bacon into roughly ½-inch pieces.",
    "4. Start the Amatriciana sauce:",
    "- Transfer the bacon to a 12-inch cast-iron skillet and set over medium heat. Cook, stirring occasionally, until lightly golden brown and crisp, 8 to 11 minutes.- Add the onion, garlic, ½ teaspoon red pepper flakes, and 1 teaspoon salt to the skillet and cook over medium heat until the onion is softened and translucent, 6 to 8 minutes longer.- Add 2 tablespoons olive oil and the cherry tomatoes to the skillet. Increase the heat to medium-high and cook, stirring often and smashing some of the tomatoes with the back of a wooden spoon as they begin to burst, encouraging them to release some of their juices. Continue to simmer until about half of the tomatoes have burst and the sauce has thickened slightly, 6 to 8 minutes longer. Remove from the heat and stir in 2 ounces grated Parmesan cheese (½ cup). Taste and season with more salt if necessary.",
    "5. Cook the eggs:",
    "- Nestle the croutons into the tomato sauce so they are half submerged.- Using a large spoon, create 4 divots in the tomato sauce. Working one at a time, crack an egg into each divot. Season the tops of the eggs with salt and the remaining ¼ teaspoon red pepper flakes. Return the skillet to medium heat and cover with a tight-fitting lid (or a baking sheet if you don’t have a lid of the right diameter). Cook until the egg whites are just set and no longer translucent, but the yolks are still soft and runny, 8 to 12 minutes.",
    "6. Serve:",
    "- Scatter the leaves of 2 oregano sprigs over the top, along with more grated Parmesan. Serve the eggs right out of the skillet."
  ]
}