{
  "title": "Savory Pancakes (Okonomiyaki)",
  "source": "The Gaijin Cookbook - Ivan Orkin",
  "servings": "Serves 4 as a drinking snack",
  "categories": [
    "Japanese",
    "The Gaijin Cookbook - Ivan Orkin"
  ],
  "ingredients": [
    "1cup all-purpose flour",
    "2½teaspoons baking powder",
    "1½teaspoons sugar",
    "1teaspoon kosher salt",
    "1large egg",
    "1tablespoon vegetable oil (plus an additional 2 tablespoons if making a vegetarian version)",
    "2¼cups tightly packed shredded green cabbage",
    "11ounces thinly sliced skinless pork belly (see Thinly Sliced Meat) or uncured bacon",
    "Garnishes",
    "Kewpie mayonnaise",
    "Bull-Dog tonkatsu sauce",
    "Aonori (powdered dried green seaweed)",
    "Chopped scallions",
    "Katsuobushi (bonito flakes)"
  ],
  "directions": [
    "1. Combine the flour, baking powder, sugar, and salt in a medium bowl. Whisk the egg and 1 tablespoon oil together with ¾ cup water in another bowl. Add the wet ingredients to the dry and mix briefly until most of the lumps of dry flour are gone. Fold in the shredded cabbage.",
    "2. Set a nonstick skillet over medium-high heat and lay 3 strips of pork belly or bacon next to each other in it. Once the pork begins to sizzle, let it cook for 2 minutes to render some of the fat. Spoon half the batter on top and spread into a ½-inch-thick layer. (If you’re making a vegetarian version, coat the pan with a tablespoon of vegetable oil before adding the batter.)",
    "3. Cook for 3 to 4 minutes, then sneak a peek underneath. Once the bottom is crisp and brown, give the pancake a flip with a spatula. Do it confidently and quickly to avoid making a mess. Cook for another 3 to 4 minutes, until the okonomiyaki is golden brown on both sides. The inside should be cooked through, but it’s fine if it’s still a bit moist—the cabbage will give up a fair amount of water.",
    "4. Slide the okonomiyaki onto a plate and top freely with squiggles of Kewpie mayo and Bull-Dog sauce. Sprinkle with aonori, scallions, and a big handful of katsuobushi (unless you’ve made a vegetarian version). Serve immediately, then use the remaining pork and batter to make and serve the second okonomiyaki."
  ]
}