{
  "title": "Savory Fennel-Apple Tarte Tatin",
  "source": "Modern Bistro - ATK",
  "servings": "4 to 6",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "1(9½ by 9-inch) sheet puff pastry, thawed",
    "3tablespoons extra-virgin olive oil, divided",
    "1tablespoon sugar",
    "½teaspoon plus pinch table salt, divided",
    "2fennel bulbs, stalks discarded (1 bulb cut into 6 wedges, 1 bulb halved, cored, and cut lengthwise into ½-inch-thick slices)",
    "2Granny Smith apples, peeled, cored, halved, and sliced ½ inch thick",
    "4teaspoons chopped fresh sage",
    "2teaspoons sherry vinegar",
    "¼teaspoon Dijon mustard",
    "6ounces (6 cups) watercress, torn into bite-size pieces",
    "2tablespoons chopped toasted and skinned hazelnuts",
    "2ounces (½ cup) goat cheese, crumbled (optional)"
  ],
  "directions": [
    "1  Adjust oven rack to middle position and heat oven to 375 degrees. Unfold pastry onto lightly floured counter and roll into 11-inch square. Using pizza cutter or sharp knife, cut pastry into 11-inch circle. Transfer to parchment paper–lined rimmed baking sheet, cover loosely with plastic wrap, and refrigerate while preparing filling.",
    "2  Swirl 2 tablespoons oil over bottom of 10-inch ovensafe nonstick skillet, then sprinkle with sugar and ¼ teaspoon salt. Arrange fennel wedges in pinwheel shape, fanning out from center of circle. Fill in gaps with sliced fennel. Cook, without stirring, over high heat until fennel turns deep golden brown, 7 to 9 minutes (if pan is not sizzling after 2 minutes, adjust cook time accordingly).",
    "3  Off heat, sprinkle with apples, sage, and ¼ teaspoon salt. Carefully transfer chilled dough to skillet, centering over filling. Being careful of hot skillet, gently fold excess dough up against skillet wall (dough should be flush with skillet edge). Using paring knife, pierce dough evenly over surface 10 times. Transfer skillet to oven and bake until crust is deep golden brown, about 45 minutes. Transfer skillet to wire rack and let cool for 10 minutes.",
    "4  Meanwhile, whisk vinegar, mustard, remaining 1 tablespoon oil, and remaining pinch salt together in large bowl. Add watercress and hazelnuts and toss to coat. Season with salt and pepper to taste.",
    "5  Run paring knife around edge of crust to loosen. Using dish towels or potholders, carefully place serving platter on top of skillet, and, holding platter and skillet firmly together, invert tart onto serving platter. Transfer any fennel slices that stick to skillet to tart. Sprinkle with goat cheese, if using, and serve with salad.",
    "Assembling Savory Fennel-Apple Tarte Tatin1. Arrange fennel wedges in pinwheel shape in skillet.2. Fill in remaining gaps with sliced fennel.3. Slide prepared puff pastry on top of filling in skillet and press any excess dough up sides of skillet."
  ]
}