{
  "title": "Scaccia from Ragusa with Tomatoes and Basil",
  "source": "The Food of Sicily - Fabrizia Lanza",
  "servings": "Serves 4 to 6",
  "categories": [
    "Italian",
    "The Food of Sicily - Fabrizia Lanza"
  ],
  "ingredients": [
    "- 1 teaspoon active dry yeast",
    "- ½ teaspoon sugar",
    "- ¾ cup (180 ml) lukewarm water",
    "- 1½ cups (240 g) semolina flour, plus more for rolling",
    "- ½ teaspoon fine sea salt",
    "- 1 cup (240 ml) good-quality tomato sauce, homemade or store-bought",
    "- ½ cup (10 g) fresh basil leaves",
    "- 1 tablespoon olive oil"
  ],
  "directions": [
    "1. In a small bowl, mix together the yeast, sugar, and 2 tablespoons of the water. Set aside at room temperature until creamy, about 5 minutes. If the yeast doesn’t bubble at all, throw it out and start over with new yeast.2. In a large bowl, mix together the semolina, salt, yeast mixture, and the remaining water. Transfer the dough to a work surface and knead until firm and smooth, about 8 minutes. Shape into a ball and cover with a clean kitchen towel. Let rise in a warm, draft-free place until doubled in size, about 1 hour.3. Preheat the oven to 425°F (220°C). Line a baking sheet with parchment paper.4. Generously dust the work surface with semolina. Using a rolling pin, roll the dough out into a very thin rectangle about 16 by 24 inches (40 by 61 cm).5. With a 16-inch (40 cm) side facing you, spread a thin layer of tomato sauce evenly over the center third of the dough. Sprinkle some basil over the sauce.6. Fold the bottom third of the dough over the filling, spread a thin layer of sauce across the folded dough, and add a few basil leaves. Fold the top third of the dough over the filling, spread a thin layer of sauce across the newly folded dough, and add some basil leaves. Fold the left third over to the center, spread another thin layer of tomato sauce on the newly folded dough, and add the remaining basil leaves. Finally, fold the right third over the top. The finished scaccia should be roughly 6 by 9 inches (15 by 23 cm).7. Transfer to the prepared baking sheet, with the folded side on the bottom. Drizzle with the olive oil.8. Bake until golden brown, 30 to 35 minutes. Remove from the oven and cover with a clean kitchen towel. Let cool for at least 30 minutes before slicing."
  ]
}