{
  "title": "Scallops with Green Curry, Corn, Shrimp, and Tomatoes",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 4",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "GREEN CURRY SAUCE",
    "2cans plus ½ cup Chef’s Choice unsweetened coconut milk",
    "½cup packed Thai basil leaves",
    "2tablespoons canola oil",
    "½cup plus 1 tablespoon Green Curry Paste",
    "2tablespoons Red Boat fish sauce, or to taste",
    "2tablespoons palm sugar, or more to taste",
    "8fresh kaffir lime leaves",
    "Freshly squeezed lime juice to taste",
    "SCALLOPS",
    "16U-10 sea scallops, patted dry",
    "Kosher salt",
    "5tablespoons canola oil",
    "2cups fresh corn kernels",
    "8large shrimp (21–25), peeled and deveined",
    "½cup quartered grape tomatoes (about 12)",
    "1cup blanched sugar snap peas, cut on the bias into ½-inch slices",
    "Freshly squeezed lime juice to taste",
    "¼cup coconut cream",
    "¼cup fresh cilantro leaves",
    "2fresh kaffir lime leaves, very thinly sliced",
    "TO SERVE",
    "Steamed Jasmine Rice"
  ],
  "directions": [
    "1. Prepare the green curry sauce: Combine 2 cans of the coconut milk and the basil in a blender and blend until smooth.",
    "2. Heat the oil and remaining ½ cup coconut milk in a medium saucepan over high heat until the mixture begins to shimmer. Add the curry paste and cook, stirring constantly, for about 5 minutes, until it begins to deepen in color and becomes fragrant, stirring constantly so that it does not burn, about 5 minutes longer, until it begins to look curdled. Deglaze with the fish sauce and palm sugar, and cook for 1 minute, stirring constantly.",
    "3. Add the basil–and–coconut milk mixture, bring to a boil, reduce the heat to medium-low. Add the kaffir lime leaves and cook, stirring occasionally, for about 20 minutes, until the flavors have melded and the sauce has reduced slightly. Season with lime juice to taste. Remove from the heat, cover, and keep warm while you prepare the rest of the dish.",
    "4. Prepare the scallops: Season the scallops on both sides with salt. Heat ¼ cup of the oil in a large nonstick pan over high heat until the oil begins to shimmer. Add the scallops and cook for about 2 minutes, until the bottoms are golden brown and the scallops are cooked about three-quarters of the way. Turn the scallops over and cook for 30 seconds longer. Remove the scallops to a plate.",
    "5. Add 1 tablespoon of the oil to the pan and heat until it begins to shimmer. Add the corn and press into a single layer and cook for about 2 minutes, until the bottom is golden brown and slightly charred. Turn over and cook until the other side is golden brown and charred, 2 minutes longer.",
    "6. Stir in the shrimp and cook for 2 minutes. Add the tomatoes and snap peas and cook, stirring a few times until just warmed through, about 3 minutes longer. Add lime juice to taste and season with salt.",
    "7. To serve: Ladle some of the green curry sauce onto a plate, top with some of the vegetable mixture, then top that mixture with 4 scallops. Drizzle some of the coconut cream over and garnish with cilantro leaves and the remaining 2 kaffir lime leaves. Serve with rice."
  ]
}