{
  "title": "Scallion Rice",
  "source": "Thewoksoflife.com",
  "servings": "Serves: 4",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "5cups cooked jasmine rice",
    "(from 1⅔ cups/300g uncooked)",
    "12large scallions (rinsed clean and wiped dry)",
    "3tablespoons neutral oil (ideally, Chinese cai zi you)",
    "1slice ginger (1/8-inch thick, 1-2 inches/3-5 cm long)",
    "3cloves garlic (roughly chopped)",
    "1-3teaspoons green Sichuan peppercorn infused oil (to taste)",
    "1teaspoon sea salt (to taste, be conservative at first if you'd also like to add MSG, below)",
    "1/4teaspoon MSG (optional)"
  ],
  "directions": [
    "Leftover rice is ideal for this recipe, but if you need to cook the rice, do that first. Let it cool on the counter until it’s warm, not hot. If using cold leftover rice, break it up with a wooden spoon or chopsticks. You want the rice to be easy to stir-fry.",
    "Cut the green parts of the scallions into 2-inch lengths, leaving behind the light green and white parts (i.e., the bottom 3-4 inches of the scallion). In a food processor, puree the green parts of the scallions until you have a chunky paste.",
    "Add the scallion paste to the cooked rice, and stir with a rubber spatula until evenly distributed.",
    "Then, in the food processor, process the white parts of the scallions until finely chopped.",
    "AD",
    "Set your wok over medium-high heat, and add the oil along with the ginger. Cook for 30 seconds. Add the white parts of the scallions and fry for about 1-2 minutes, just until the raw edge is gone. You don’t want any browning.",
    "Add the rice, and stir-fry, spreading the rice out in a single layer so that it’s evenly fried.",
    "Add the garlic, and stir-fry the rice again, spreading it out into another layer. Add the green Sichuan peppercorn oil, salt, and MSG (if using).",
    "Stir to combine, cooking for a total of about 5 minutes. Once again, you don’t want the rice or scallions to caramelize or brown. The final dish should be a lovely bright green color.",
    "Serve as a side with just about anything! It’s delicious with seared or grilled salmon, chicken, tofu, etc. We sense that this scallion rice will be on our table many times this summer!",
    "Leftover rice is ideal for this recipe, but if you need to cook the rice, do that first. Let it cool on the counter until it’s warm, not hot. If using cold leftover rice, break it up with a wooden spoon or chopsticks. You want the rice to be easy to stir-fry.",
    "Cut the green parts of the scallions into 2-inch lengths, leaving behind the light green and white parts (i.e., the bottom 3-4 inches of the scallion). In a food processor, puree the green parts of the scallions until you have a chunky paste.",
    "Add the scallion paste to the cooked rice, and stir with a rubber spatula until evenly distributed. Then, in the food processor, process the white parts of the scallions until finely chopped.",
    "Set your wok over medium-high heat, and add the oil along with the ginger. Cook for 30 seconds. Add the white parts of the scallions and fry for about 1-2 minutes, just until the raw edge is gone. You don’t want any browning. Add the rice, and stir-fry, spreading the rice out in a single layer so that it’s evenly fried.",
    "Add the garlic, and stir-fry the rice again, spreading it out into another layer. Add the green Sichuan peppercorn oil, salt, and MSG (if using).",
    "AD",
    "Stir to combine, cooking for a total of about 5 minutes. Once again, you don’t want the rice or scallions to caramelize or brown. The final dish should be a lovely bright green color."
  ]
}