{
  "title": "Scallion Pancakes",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 1/2 cups (7 1/2 ounces) plus 1 tablespoon all-purpose flour, divided",
    "- 3/4 cup boiling water",
    "- 7 tablespoons vegetable oil, divided",
    "- 1 tablespoon toasted sesame oil",
    "- 1 teaspoon kosher salt, divided",
    "- 4 scallions, sliced thin, divided",
    "- 1 recipe Soy-Vinegar Dipping Sauce (this page)"
  ],
  "directions": [
    "1. Using wooden spoon, mix 1 1/2 cups flour and boiling water in bowl to form rough dough. When cool enough to handle, transfer dough to lightly floured counter and knead until tacky (but not sticky) ball forms, about 4 minutes (dough will not be perfectly smooth). Cover loosely with plastic wrap and let rest for 30 minutes. Stir 1 tablespoon vegetable oil, sesame oil, and remaining 1 tablespoon flour together in bowl; set aside.",
    "2. Divide dough in half. Cover 1 half of dough with plastic and set aside. Roll remaining dough into 12-inch round on lightly floured counter. Drizzle with 1 tablespoon oil-flour mixture and use pastry brush to spread evenly over entire surface. Sprinkle with 1/2 teaspoon salt and half of scallions. Roll dough into cylinder. Coil cylinder into spiral, tuck end underneath, and flatten spiral with your palm. Cover with plastic and repeat with remaining dough, oil-flour mixture, salt, and scallions.",
    "3. Roll first spiral into 9-inch round. Cut 1/2-inch slit in center of pancake. Cover with plastic. Roll second spiral and cut slit in pancake. (Pancakes can be stacked between layers of parchment paper, wrapped tightly in plastic, and refrigerated for up to 24 hours or frozen for up to 1 month. If frozen, thaw pancakes in single layer for 15 minutes before cooking.)",
    "4. Meanwhile, place 10-inch cast-iron skillet over low heat and preheat for 10 minutes. Place 2 tablespoons vegetable oil in skillet and increase heat to medium-low. Place 1 pancake in skillet (oil should sizzle). Cover and cook, shaking skillet occasionally, until pancake is slightly puffy and golden brown on underside, 1 to 1 1/2 minutes. (If underside is not browning after 1 minute, turn heat up slightly. If it is browning too quickly, turn heat down slightly.)",
    "5. Drizzle 1 tablespoon vegetable oil over pancake. Use pastry brush to distribute over entire surface. Carefully flip pancake. Cover and cook, shaking skillet occasionally, until second side is golden brown, 1 to 1 1/2 minutes. Uncover skillet and continue to cook until bottom is deep golden brown and crispy, 30 to 60 seconds. Flip and cook until deep golden brown and crispy, 30 to 60 seconds. Transfer to wire rack. Repeat with remaining 3 tablespoons vegetable oil and remaining pancake. Cut each pancake into 8 wedges and serve with dipping sauce."
  ]
}