{
  "title": "Scampi-Style Chicken",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4 to 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2large eggs",
    "1teaspoon table salt, divided",
    "¾cup plus 1 tablespoon all-purpose flour, divided",
    "2pounds chicken tenderloins, trimmed",
    "6tablespoons extra-virgin olive oil, divided",
    "1red bell pepper, stemmed, seeded, and sliced thin",
    "8garlic cloves, sliced thin",
    "1¼cups chicken broth",
    "¾cup dry white wine",
    "4tablespoons unsalted butter, cut into 4 pieces",
    "2tablespoons chopped fresh parsley"
  ],
  "directions": [
    "1. Lightly beat eggs and ½ teaspoon salt together in shallow dish. Spread ¾ cup flour in second shallow dish. Pat chicken dry with paper towels and season with salt and pepper. Working with 1 piece of chicken at a time, dip in eggs, allowing excess to drip off, then dredge in flour, shaking off any excess. Transfer to large plate.",
    "2. Heat 2 tablespoons oil in 12-inch nonstick skillet over medium-high heat until just smoking. Cook half of chicken until golden brown on both sides and registers 160 degrees, about 6 minutes. Transfer chicken to clean plate and tent with aluminum foil. Wipe skillet clean with paper towels and repeat with 2 tablespoons oil and remaining chicken; transfer to plate.",
    "3. Wipe skillet clean with paper towels. Heat remaining 2 tablespoons oil in now-empty skillet over medium-high heat until just smoking. Add bell pepper and remaining ½ teaspoon salt and cook until softened and well browned, 5 to 7 minutes. Add garlic and cook until fragrant and golden brown, about 1 minute. Stir in remaining 1 tablespoon flour and cook for 1 minute.",
    "4. Stir in broth and wine and bring to boil, scraping up any browned bits. Cook until mixture is reduced to about 1½ cups, 5 to 7 minutes. Reduce heat to low and stir in butter until melted. Return chicken to skillet and cook, turning to coat with sauce, until heated through, about 2 minutes. Season with salt and pepper to taste. Transfer to platter and sprinkle with parsley. Serve."
  ]
}