{
  "title": "Scooped Pear Sticky Toffee Pudding In Mugs",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Makes 4 large mugs",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "1large Bosc pear, halved, cored, and cubed",
    "3tablespoons / 43g salted butter, chilled",
    "1teaspoon baking soda",
    "Diamond Crystal kosher salt",
    "⅓cup / 73g granulated sugar",
    "⅓cup / 70g dark brown sugar",
    "2large eggs",
    "¾cup plus 2 tablespoons / 123g all-purpose flour",
    "1teaspoon vanilla extract",
    "Toffee Topping",
    "2tablespoons / 28g salted butter",
    "2tablespoons / 25g dark brown sugar",
    "1tablespoon / 15ml heavy cream",
    "Diamond Crystal kosher salt"
  ],
  "directions": [
    "1. Position a rack so that the tops of the mugs are 5 to 6 inches below the top of the oven and preheat the oven to 350°F.",
    "2. In a food processor, combine half the pear, the butter, baking soda, ¼ teaspoon salt, the granulated sugar, brown sugar, eggs, flour, and vanilla. Process until the batter is just combined; there will still be some flecks of pear in there, and it’ll look a bit grainy.",
    "3. Stir in the remaining cubes of pear and evenly portion the batter into four ovenproof mugs. Any size will work, but 10- to 12-ounce mugs work best. Place these on a baking sheet and bake until the batter has set, 25 to 30 minutes. The baking time will vary, based on how deep your mugs are.",
    "4. Meanwhile, make the toffee topping: Set a small saucepan over medium heat and add the butter and brown sugar and cook down, stirring often, until the toffee is softly bubbling, 5 to 7 minutes. Drizzle in the cream and stir to combine. Turn the heat to medium-low and cook for another 3 to 4 minutes to let the toffee thicken. Turn off the heat and stir in ¼ teaspoon salt.",
    "5. When the mugs are set, remove them from the oven and set the oven to broil on high. Spoon 1 tablespoon of toffee over each mug, then broil until the toffee is bubbling and sticky all over, 2 to 3 minutes.",
    "6. Remove the mugs from the oven and let them cool until they are warm to the touch. Serve with the extra toffee and a few scoops of vanilla ice cream."
  ]
}