{
  "title": "Scotty’s Good-With-Everything Collard Greens",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Serves 4 to 6 (Makes about 6 cups)",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "4bunches collard greens (about 10 ounces each)",
    "6tablespoons unsalted butter",
    "6 to 8garlic cloves, finely chopped",
    "5tablespoons white sugar",
    "⅓cup red wine vinegar, or more if you like",
    "⅓cup unseasoned rice vinegar",
    "⅓cup Louisiana-style hot sauce",
    "1tablespoon plus 2 teaspoons Zatarain’s Creole Seasoning, or more if you like",
    "1tablespoon gochugaru (Korean chile flakes) or other red chile flakes",
    "2teaspoons granulated chicken bouillon (preferably Totole brand, see this page; optional but optimal)",
    "2teaspoons kosher salt (Diamond Crystal or about half as much Morton), or more if you like"
  ],
  "directions": [
    "Tear the leaves from the stems of the collards, discarding the stems, and chop into 1- to 2-inch pieces. You’ll have about 10 cups, packed. Set them aside for a sec.",
    "Melt the butter in a large, heavy pot over medium heat. Add the garlic and cook, stirring, until fragrant but not browned, about 1 minute. Add the sugar, red wine and rice vinegars, hot sauce, Creole seasoning, chile flakes, chicken bouillon, and salt along with 8 cups water. Turn the heat to high to bring the mixture to a simmer and cook for a minute or two, so the flavors meld and develop.",
    "In a few batches, add the collard greens, stirring and letting them wilt a bit before adding the next batch. When you’ve added all the collards, crank up the heat to bring it all to a simmer, then adjust the heat to maintain a low simmer. Cook until they’re nice and soft (you might even say a bit mushy) and, just as important, the liquid has reduced to a rich, heavenly broth (this is pot likker, if you didn’t already know) that’s an inch or so deep, about 2½ hours. Season with more salt, Creole seasoning, and red wine vinegar until you’re happy, then simmer for another couple of minutes.",
    "Serve hot or let the collards cool in the pot likker, transfer to an airtight container, and keep in the fridge for up to 1 week.",
    ""
  ]
}