{
  "title": "Seared Steaks with Basil Béarnaise",
  "source": "Dinner in French",
  "servings": "4",
  "categories": [],
  "ingredients": [
    "FOR THE BÉARNAISE",
    "3tablespoons white wine vinegar, plus more if needed",
    "¼cup dry white wine or dry white vermouth",
    "1tablespoon minced shallots",
    "3tablespoons minced fresh basil leaves",
    "⅛teaspoon freshly ground black pepper",
    "Pinch of salt",
    "3egg yolks",
    "2tablespoons cold unsalted butter, divided",
    "½cup (1 stick) unsalted butter, melted",
    "FOR THE STEAKS",
    "4(6- to 8-ounce) hanger steaks (or use your favorite boneless steak), about 1 inch thick",
    "Kosher salt, to taste",
    "Freshly ground black pepper, to taste",
    "2tablespoons unsalted butter",
    "1tablespoon extra-virgin olive oil",
    "Chopped fresh chives, for serving”"
  ],
  "directions": [
    "1. Make the béarnaise sauce: In a heavy nonreactive (i.e., stainless-steel, not cast-iron) 9- or 10-inch skillet or medium-size pot, bring the vinegar, wine, shallots, basil, pepper, and salt to a simmer over medium heat. Cook until the liquid has reduced to 2 tablespoons, about 5 minutes. Let the mixture cool slightly.",
    "2. In a small bowl, whisk the egg yolks until they become thick and sticky, about 1 minute. Slowly pour the vinegar mixture into the egg yolks, whisking constantly. Add 1 tablespoon of the cold butter, but do not beat it in.",
    "3. Scrape the egg mixture back into the skillet, and place it over very low heat. Whisk the yolks until they thicken, 1 to 2 minutes. Whisk in the remaining 1 tablespoon cold butter, and then whisk in the melted butter in a slow steady stream, whisking constantly until the sauce thickens like mayonnaise. Taste, and add salt and/or vinegar if necessary. Keep the sauce warm, not hot, for serving.",
    "4. Cook the steaks: Season the steaks with salt and pepper. Heat a cast-iron or other heavy skillet over medium-high heat. Stir in the butter and oil, then add the steaks and sear them until browned on both sides, about 3 minutes per side for medium-rare, 4 minutes per side for medium. (If your steaks are thinner than 1 inch, cook them a bit less; thicker steaks might need another minute or two per side.) Transfer the steaks to a cutting board and let them rest for 5 minutes before slicing and serving with the béarnaise and chives."
  ]
}