{
  "title": "Seared Tuna Steaks With Wilted Frisée And Mushroom Salad",
  "source": "Modern Bistro - ATK",
  "servings": "4",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "3tablespoons Harissa, divided",
    "1tablespoon lemon juice plus lemon wedges for serving",
    "6tablespoons extra-virgin olive oil, divided",
    "1–3tablespoons hot water (110 degrees)",
    "1shallot, halved and sliced thin",
    "1¼pounds cremini mushrooms, trimmed and halved if small or quartered if large",
    "12ounces shiitake mushrooms, stemmed and sliced ½ inch thick",
    "1teaspoon table salt, divided",
    "1head frisée (6 ounces), cut into 1-inch pieces",
    "4(6- to 8-ounce) tuna steaks, 1 inch thick",
    "¼teaspoon pepper",
    "½teaspoon sugar",
    "2tablespoons chopped fresh mint"
  ],
  "directions": [
    "1. Whisk 2 tablespoons harissa, lemon juice, and 1 tablespoon oil together in bowl. Whisk in hot water, 1 tablespoon at a time, until sauce is pourable; set aside until ready to serve.",
    "2. Heat 2 tablespoons oil in 12-inch nonstick skillet over medium heat until shimmering. Add shallot and cook until softened, about 2 minutes. Add cremini mushrooms, shiitake mushrooms, and ½ teaspoon salt, cover, and cook, stirring occasionally, until mushrooms have released their liquid, 8 to 10 minutes.",
    "3. Uncover skillet, add 2 tablespoons oil, and cook, stirring occasionally, until mushrooms are deep golden brown and tender, 10 to 12 minutes. Add remaining 1 tablespoon harissa and cook until fragrant, about 30 seconds. Transfer mushrooms to large bowl, add frisée, and toss to combine; set aside. Wipe skillet clean with paper towels.",
    "4. Pat tuna dry with paper towels and sprinkle with remaining ½ teaspoon salt and pepper. Sprinkle sugar evenly over 1 side of each steak. Heat remaining 1 tablespoon oil in now-empty skillet over medium-high heat until just smoking. Place steaks sugared sides down in skillet and cook, flipping every 1 to 2 minutes, until center is translucent red when checked with tip of paring knife and registers 110 degrees (for rare), 2 to 4 minutes.",
    "5. Transfer steaks to cutting board and slice ½ inch thick. Sprinkle mint over mushroom mixture and season with salt and pepper to taste. Drizzle tuna with reserved harissa sauce and serve with salad and lemon wedges."
  ]
}