{
  "title": "Sesame Balls",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Makes: 8 balls",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 1/2 cups (8 1/4 ounces) glutinous rice flour",
    "- 1/2 teaspoon baking powder",
    "- 1/8 teaspoon table salt",
    "- 1/3 cup (2 1/3 ounces) sugar",
    "- 8 teaspoons smooth sweetened red bean paste",
    "- 1/2 cup sesame seeds",
    "- 2 quarts peanut or vegetable oil for frying"
  ],
  "directions": [
    "1. Whisk flour, baking powder, and salt together in large bowl. Bring 3/4 cup water and sugar to boil in small saucepan over high heat until sugar has dissolved. Using rubber spatula, stir hot syrup into flour mixture until combined and no dry flour remains. Transfer dough to clean counter and knead with hands until smooth, about 3 minutes. Return dough to bowl, cover tightly with plastic wrap, and let rest for 30 minutes.",
    "2. Meanwhile, divide bean paste into 1 teaspoon portions. Using lightly moistened hands, roll each portion into ball and transfer to plate. Cover loosely with plastic and refrigerate until ready to use.",
    "3. Divide dough into 8 equal pieces (about 2 ounces each). Cover with damp towel. Working with 1 piece of dough at a time, use hands to roll into ball. Place ball on counter and flatten with palm of hand into 2-inch-wide circle. Place 1 portion of bean paste in center of circle. Gather sides of dough around paste, pushing out air pockets, and pinch top to seal, enclosing paste in center. Remoisten hands and roll ball, smoothing any cracks with your fingertips. Cover with damp towel.",
    "4. Place 1/2 cup water in small bowl. Place sesame seeds in shallow plate. Working with 1 ball at a time, roll in water, letting excess drip off, then coat with sesame seeds, pressing gently to adhere. Transfer to plate.",
    "5. Line rimmed baking sheet with triple layer of paper towels. Add oil to 14-inch flat-bottomed wok or large Dutch oven until it measures about 1 1/2 inches deep and heat over medium-high heat to 325 degrees. Using spider skimmer or slotted spoon, carefully add balls, 1 at a time, to hot oil. Cook, stirring constantly, until balls begin to float, about 4 minutes. Adjust burner, if necessary, to maintain oil temperature between 300 and 325 degrees.",
    "6. Using spider skimmer, fully submerge each ball, gently pressing it against side or bottom of wok to deflate by about 1/2 inch, then release. Continuously submerge, press, and release balls until puffy and light golden brown, about 4 minutes. Using spider skimmer, transfer sesame balls to prepared sheet. Let cool for 5 minutes. Serve."
  ]
}