{
  "title": "Shanghai Pan-Fried Pork Buns",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "20 buns",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "Soup",
    "- 1½ pounds chicken wings",
    "- 5 cups water",
    "- 1 (2-inch) piece ginger, sliced into ¼-inch-thick rounds",
    "- 3 scallions, cut into 2-inch lengths",
    "- ¼ ounce dried shiitake mushrooms, rinsed",
    "Dough",
    "- 3½ cups (17½ ounces) all-purpose flour",
    "- 3½ tablespoons cornstarch",
    "- 1¾ teaspoons instant or rapid-rise yeast",
    "- 1 teaspoon sugar",
    "- ¼ teaspoon table salt",
    "- 1½ cups water, room temperature",
    "Filling",
    "- 12 ounces ground pork",
    "- 1 scallion, minced",
    "- 2 teaspoons Shaoxing wine",
    "- 2 teaspoons soy sauce",
    "- 1½ teaspoons dark soy sauce",
    "- 1½ teaspoons toasted sesame oil",
    "- 1 teaspoon sugar",
    "- 1 teaspoon grated fresh ginger",
    "- ⅛ teaspoon table salt",
    "- ⅛ teaspoon white pepper",
    "- 4 teaspoons vegetable oil",
    "- ⅓ cup water",
    "- 1 scallion, sliced thin",
    "- 1 teaspoon black sesame seeds, toasted"
  ],
  "directions": [
    "1. For the soup: Bring chicken and water to a boil in a large saucepan over medium-high heat, skimming off any scum that surfaces.",
    "2. Reduce heat to low, partially cover, and simmer for 1 hour. Add ginger, scallions, and mushrooms; continue simmering for 2 more hours.",
    "3. Strain soup into a large bowl, discard solids, and skim fat. Return soup to the pot and simmer until reduced to 1 cup, 5 to 10 minutes.",
    "4. Transfer to a 9-inch round pan, cool 30 minutes, cover, and refrigerate until fully gelatinized, about 4 hours. Mash jellied soup into ⅛-inch pieces.",
    "5. For the dough: In a mixer bowl, whisk flour, cornstarch, yeast, sugar, and salt. With dough hook on low, slowly add water and mix until cohesive.",
    "6. Increase speed to medium-low and knead for about 10 minutes until dough is smooth. Knead by hand for 30 seconds to form a smooth ball.",
    "7. Place dough seam side down in a greased bowl, cover with plastic, and let rise for 30 minutes until slightly puffy.",
    "8. For the filling: In a clean mixer with paddle, beat pork, scallion, wine, soy sauces, sesame oil, sugar, ginger, salt, and pepper on medium for 2 minutes.",
    "9. Add jellied soup and mix on medium-low for 1 minute until incorporated. Divide into heaping 1-tbsp portions and roll into balls. Freeze 15 minutes, then refrigerate.",
    "10. Brush a 12-inch nonstick skillet with oil. Deflate dough, divide in half, and roll one half into a 12-inch log. Cut into 12 equal pieces and roll each into a ball.",
    "11. Flatten each ball into a 2-inch disk. Cover with damp towel. Roll each disk into a 4-inch round wrapper with tapered edges.",
    "12. Place a filling ball in the center of a wrapper. Pleat and pinch the dough to enclose the filling, forming a purse shape. Seal the top and twist off excess dough.",
    "13. Place buns pleated side down in the skillet. Repeat with remaining dough and filling to make 10 buns. Arrange in concentric circles and loosely cover with greased plastic.",
    "14. Repeat with second half of dough and filling to make 10 more buns. Let buns rise until puffy and just touching, about 30 minutes.",
    "15. Remove plastic. Cover skillet and cook buns over medium heat until bottoms are golden brown, 6 to 8 minutes.",
    "16. Reduce heat to medium-low, add water around skillet’s edge (careful—it will spatter), and cook covered until water evaporates and bottoms crisp, about 7 minutes.",
    "17. Sprinkle with sliced scallion and sesame seeds. Serve immediately."
  ]
}