{
  "title": "Shanghai Soup Dumplings",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "40 dumplings",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "Soup:",
    "- 3 pounds chicken wings",
    "- 6 cups water",
    "- 1 (2-inch) piece ginger, sliced into 1/4-inch-thick rounds",
    "- 3 scallions, cut into 2-inch lengths",
    "- 1/4 ounce dried shiitake mushrooms, rinsed",
    "Dough:",
    "- 2 cups (10 ounces) all-purpose flour",
    "- 3/4 cup boiling water, plus extra as needed",
    "- 1 teaspoon vegetable oil",
    "Filling:",
    "- 1 pound ground pork",
    "- 1 tablespoon Shaoxing wine",
    "- 1 tablespoon soy sauce",
    "- 1 scallion, minced",
    "- 2 teaspoons toasted sesame oil",
    "- 1 teaspoon grated fresh ginger",
    "- 1 teaspoon sugar",
    "- 1/2 teaspoon table salt",
    "- 1/8 teaspoon white pepper",
    "For Serving:",
    "- Chinese black vinegar",
    "- Fresh ginger, peeled and cut into thin matchsticks"
  ],
  "directions": [
    "1. Bring chicken and water to a boil in a large saucepan. Skim any scum off the surface. Reduce heat, partially cover, and simmer gently for 1 hour.",
    "2. Add ginger, scallions, and mushrooms. Simmer for 2 more hours. Strain through a fine-mesh strainer, discard solids, and skim off excess fat. Clean pot.",
    "3. Return soup to the pot, simmer until reduced to 2 cups (10–15 minutes). Pour into a 13x9-inch dish. Cool for 30 minutes, then refrigerate for about 4 hours until jellied. Scrape hardened fat, and mash jelly into 1/8-inch pieces.",
    "4. Place flour in a stand mixer. With the mixer on medium-low, slowly add boiling water and oil until dough forms a ball (2–4 minutes). Knead on the counter for 2–3 minutes until mostly smooth. Wrap in plastic wrap and rest for 30 minutes to 4 hours.",
    "5. In a stand mixer, beat pork and all filling ingredients on medium speed until sticky and lightened (about 2 minutes). Scrape down bowl, add jellied soup, and mix on medium-low until combined (about 1 minute). Divide into 1-tbsp portions, roll into balls, and freeze until firm (about 15 minutes). Refrigerate until needed.",
    "6. Roll rested dough into a 12-inch cylinder, divide into 4 equal pieces. Roll one into an 8-inch log and cut into 14 pieces. Roll each into a ball, press into 2-inch disks, and cover with a damp towel.",
    "7. Working one at a time, roll disks into 4-inch wrappers with thinner edges. Keep covered with a damp towel. Line baking sheets with parchment and dust lightly with flour.",
    "8. Place wrapper on your hand, center a filling ball. Pinch and pleat the edges using thumb and index fingers, forming a round purse shape. Support the base as you go. Gently twist and pinch the top to seal. Trim excess dough if needed.",
    "9. Place dumplings pleated side up on prepared sheets. Cover with plastic. Repeat with remaining dough and filling. Dumplings can be refrigerated for 1 hour or frozen for up to 1 month (no thawing needed; steam frozen for 10 minutes).",
    "10. Boil 4 cups water in a 14-inch wok. Line bamboo steamers with parchment (poke holes) or napa cabbage. Arrange 10 dumplings in each steamer, not touching. Stack baskets, cover, and steam over vigorous simmer until wrappers are translucent and glossy (about 8 minutes). Serve immediately with vinegar and ginger. Replenish water and line baskets with new parchment before second batch."
  ]
}