{
  "title": "SHEET PAN DUCK BREAST SSÄM",
  "source": "Shop.momofuku.com",
  "servings": "",
  "categories": [],
  "ingredients": [
    "1tablespoon Momofuku Tingly Seasoned Salt",
    "½tablespoon Kosher salt",
    "½tablespoon cinnamon",
    "2Long Island duck breasts (about 8 oz each)",
    "Ssäm-building supplies:",
    "bibb lettuce",
    "quick-pickled cucumbers",
    "steamed rice",
    "sliced scallions",
    "Momofuku Sweet & Savory Korean BBQ Sauce"
  ],
  "directions": [
    "Mix Momofuku Tingly Seasoned Salt, Kosher Salt, and cinnamon in a small bowl. Pat the duck breasts completely dry with a paper towel and rub them with the salt mixture. Place duck breasts uncovered in the refrigerator for at least 3 hours, and ideally 24.",
    "Heat oven to 400°F. Place one rack in the second slot from the top (under the broiler) and one rack in the middle of the oven.",
    "Remove duck breasts from the refrigerator and, using a sharp knife, score the top of the skin, being careful not to pierce all the way through. Transfer duck breasts to a sheet pan.",
    "When the oven is hot, turn the broiler on high and let it heat for 1 minute to be sure it is fully lit. Place the duck breasts on the second rack from the top and broil for about 3 minutes, watching closely. (The skin should be browned and crisped, but not burned. You may need another 20–30 seconds to get the right color.)",
    "Remove the duck breasts from the oven and lower the oven temperature to 375°F.",
    "Return the duck breasts to the center rack and roast for an additional 5 minutes, or until an internal thermometer reads 135°F.*",
    "Remove the duck breasts from the oven and let them rest for 5 minutes before slicing. Serve with your favorite ssäm-building supplies, like lettuce cups, quick pickles, steamed rice, and scallions. Level it up with our Momofuku Sweet & Savory Korean BBQ Sauce and our Momofuku Chili Crunch.",
    "*The USDA recommends cooking duck breasts to an internal temperature of 165°F, but we prefer to cook the meat medium-rare or about 135°F."
  ]
}