{
  "title": "Sheep’s Milk Ricotta–Filled Occhi with Lemon and Bottarga",
  "source": "Pasta - Missy Robbins",
  "servings": "Servings: 6 to 8",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Filling",
    "348g / 1½ cups sheep’s milk ricotta (see “whipped” ricotta, this page)",
    "348g / 1½ cups cow’s milk ricotta",
    "Salt, q.b.",
    "To Finish",
    "1batch egg dough (this page)",
    "75g / 5 Tbsp unsalted butter, cold and cubed",
    "Peel of 1 lemon, pith removed and peel finely chopped",
    "About ¼ lobe bottarga, or q.b."
  ],
  "directions": [
    "1. To make the filling, put the sheep’s milk ricotta and cow’s milk ricotta in a food processor and pulse just until they are as smooth as cake frosting and have a sheen, being careful not to process the mixture longer or it will break. Transfer to a bowl.",
    "2. Season the ricotta mixture with salt q.b. It should taste well seasoned. Refrigerate until ready to use.",
    "3. To finish, following the instructions for occhi on this page, make 90 pieces with the pasta dough and filling.",
    "4. Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "5. Add the occhi to the water and turn down the heat to bring the water to a gentle simmer instead of a rolling boil. The shape and filling are very delicate and will break if cooked over high heat. Cook for 1 to 2 minutes, until tender at the thickest closure point and the filling is warm and oozes when you cut into it.",
    "6. While the pasta is cooking, place a large sauté pan over very low heat. Add the butter and 2 to 3 ladles (115 to 170g / ½ to ¾ cup) pasta cooking water. Swirl the contents of the pan to emulsify.",
    "7. Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Swirl the pasta in the sauce for 30 to 45 seconds to marry, using a spoon to gently turn the pasta over and coat all sides. If the sauce begins to tighten, add a splash of pasta cooking water to loosen and continue swirling to marry. When the pasta is properly married, it will cling to the sauce and have a glossy sheen.",
    "8. Transfer the pasta to a large serving platter or divide onto plates in a single layer. Add a few drops of pasta water to the sauté pan to loosen the sauce and drizzle over the platter or plates. Garnish with the lemon peel and, using your Microplane, a generous grating of bottarga."
  ]
}