{
  "title": "Sheep’s Milk Cheese–Filled Agnolotti with Saffron, Dried Tomato, and Honey",
  "source": "Pasta - Missy Robbins",
  "servings": "4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Filling",
    "604g / 2⅔ cups sheep’s milk ricotta (see “whipped” ricotta, this page)",
    "150g / 5¼ oz block high-quality feta in brine",
    "42g / 2 Tbsp honey",
    "Salt, q.b.",
    "Dried Tomatoes",
    "1large (794g / 28 oz) can whole San Marzano tomatoes",
    "13g / 1 Tbsp sugar",
    "9g / 1 Tbsp salt",
    "14g / 1 Tbsp olive oil",
    "10g / 2 cloves garlic, thinly sliced",
    "15sprigs thyme",
    "To Finish",
    "1batch egg-based dough (this page, this page, and beginning on this page)",
    "14g / 1 Tbsp olive oil",
    "10g / 2 cloves garlic, sliced",
    "1½tsp saffron threads",
    "145g / 10 Tbsp unsalted butter, cold and cubed",
    "14g / 2 tsp honey",
    "2sprigs thyme, stems removed",
    "Peel of 1 lemon, pith removed and peel finely chopped",
    "½tsp ground red chile",
    "Black pepper, q.b."
  ],
  "directions": [
    "1. To make the filling, put the ricotta into a food processor and pulse just until it is as smooth as cake frosting and has a sheen, being careful not to process it longer or it will break. Transfer to a bowl and set aside.",
    "2. Add the feta to the processor bowl and blend, pulsing to start and then running the machine just until the cheese is smooth. Add the feta to the ricotta along with the honey and season with salt q.b. Fold together until all the ingredients are well integrated. It should taste well seasoned. Cover and refrigerate until ready to use.",
    "3. To make the dried tomatoes, preheat the oven to 200°F. Line a sheet pan with parchment paper.",
    "4. Drain the tomatoes and save the juice for another purpose. Split the tomatoes in half lengthwise and remove the seeds. Lay the tomatoes, cut side up, in a single layer on the prepared sheet pan. Season them with the sugar and salt. Drizzle with the olive oil and evenly top with the garlic and thyme.",
    "5. Bake the tomatoes until they have mostly dried but retain a bit of softness, 2 to 3 hours. You don’t want to end up with tomato leather. Set aside.",
    "6. To finish, following the instructions for agnolotti on this page, make 48 pieces with the pasta dough and filling.",
    "7. Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "8. Place a large sauté pan over low heat and add the olive oil. Add the garlic and gently cook until aromatic but without color, 10 to 15 seconds. Add the dried tomatoes and swirl to warm gently.",
    "9. Add 2 to 3 ladles (115g to 170g / ½ to ¾ cup) pasta cooking water to the pan. Add the saffron and let it bloom in the water for 30 seconds to 1 minute. It should turn the mixture in the pan a bright yellow.",
    "10. Add the butter and gently swirl the contents of the pan to emulsify. Set aside.",
    "11. Add the agnolotti to the water and turn down the heat to bring the water to a gentle simmer instead of a rolling boil. The filling is very delicate and will break if cooked over high heat. Cook for 1 to 2 minutes, until the pasta is tender to the touch and the filling is warm and oozes when you cut into an agnolotto.",
    "12. Using a spider or pasta basket, remove the pasta from the pot and gently transfer to the sauté pan. Place the pan back over low heat and swirl the contents for 45 seconds to 1 minute to marry the pasta and the sauce.",
    "13. Divide the agnolotti onto plates or into flat-bottomed bowls. Add a splash of pasta cooking water to the sauté pan to loosen the sauce remaining in the pan and then spoon over the pasta. Drizzle each serving with the honey and top with the thyme, lemon peel, ground chile, and with pepper q.b."
  ]
}