{
  "title": "Shrimp Cocktail with Dilly Horseradish Cream",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 2 to 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1small shallot",
    "½cup dill leaves",
    "2lemons",
    "DAIRY",
    "½cup crème fraîche or sour cream",
    "SEAFOOD",
    "1pound (size U10 or U15) shell-on shrimp",
    "PANTRY",
    "Kosher salt",
    "¼cup sugar",
    "2tablespoons prepared horseradish",
    "Freshly ground black pepper"
  ],
  "directions": [
    "1. Build the poaching liquid: Combine ¼ cup salt, ¼ cup sugar, and 6 cups water in a medium pot and bring to a boil over medium-high heat.",
    "2. Prep the shrimp: Using a pair of scissors, snip through the shrimp shells down the backs of each shrimp, stopping right where the tail begins. If you see any dark veins running down the line that you snipped, use a paper towel to pull them out. Here’s a quick tutorial on deveining shrimp if you’ve never done it before.",
    "3. Cook the shrimp: Have a timer at the ready—shrimp can overcook VERY easily, so you need to be prepared. Once the water comes to a boil, turn off the heat, add the shrimp, and cover. Set the timer for 4 minutes; the shrimp should be pink and have turned opaque.",
    "4. Shock the shrimp: Meanwhile, fill a large bowl with ice and water. Drain the shrimp and plunge them into the ice bath. Let sit until very chilled, 10 to 15 minutes.",
    "5. Make the dilly horseradish cream:",
    "- In a medium bowl, stir together ½ cup crème fraîche and 2 tablespoons prepared horseradish.",
    "- Finely chop 1 shallot.",
    "- Finely chop ½ cup dill leaves. Add the dill to the crème fraîche along with the chopped shallot.",
    "- Finely grate the zest of ½ lemon into the crème fraîche mixture and squeeze in the juice. Cut 1½ lemons into wedges for serving.",
    "- Season with salt and lots of black pepper.",
    "6. Peel and serve: When the shrimp are completely chilled, peel them, leaving just the tails attached. Transfer to a shallow serving bowl full of ice cubes (or over crushed ice if you’re fancy). Cold shrimp is key! Serve with the lemon wedges and horseradish cream.",
    ""
  ]
}