{
  "title": "Shrimp and Pork Fried Rice",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "1/2ounce dried shiitake mushrooms, rinsed",
    "1/4cup oyster sauce",
    "1tablespoon soy sauce",
    "2large eggs",
    "3tablespoons vegetable oil, divided",
    "8ounces small shrimp (51 to 60 per pound), peeled, deveined, and tails removed",
    "4scallions, white and green parts separated and sliced thin",
    "2garlic cloves, minced",
    "1cup frozen peas",
    "8ounces char siu (Chinese barbecue pork) or lap cheong (Chinese sausage), cut into 1/2-inch pieces",
    "4cups cooked jasmine rice, room temperature, large clumps broken up with fingers",
    "2ounces (1 cup) bean sprouts"
  ],
  "directions": [
    "1. Microwave 1 cup water and mushrooms in covered bowl until steaming, about 1 minute. Let sit until softened, about 5 minutes. Lift mushrooms from bowl with fork and discard liquid. Squeeze mushrooms dry, remove stems, and slice into 1/4-inch-thick strips; set aside. Combine oyster sauce and soy sauce in small bowl; set aside.",
    "2. Beat eggs in separate bowl until well combined. Heat empty 14-inch flat-bottomed wok over high heat until just beginning to smoke. Reduce heat to medium-high, drizzle 2 teaspoons oil around perimeter of wok, and heat until just smoking. Add eggs and cook, stirring constantly, until very little liquid egg remains, 30 to 60 seconds. Transfer to large plate.",
    "3. Add 1 teaspoon oil to now-empty wok and reduce heat to medium. Add shrimp and cook, stirring constantly, until opaque and just cooked through, about 30 seconds. Transfer to plate with eggs.",
    "4. Add remaining 2 tablespoons oil to now-empty wok and increase heat to high. Add scallion whites and garlic and cook, stirring constantly, until fragrant, 15 to 30 seconds. Add peas, mushrooms, and char siu and cook, stirring constantly, until ingredients are warmed through, about 1 minute. Sprinkle rice over char siu and vegetables and stir until combined. Spread into even layer. Cook, stirring and pressing on rice with spatula to break up clumps, until grains are separate and heated through, 2 to 5 minutes. Add oyster sauce mixture, eggs, shrimp, bean sprouts, and scallion greens and cook, stirring constantly and using edge of spatula to break eggs into small pieces, until warmed through, about 2 minutes. Serve."
  ]
}