{
  "title": "Shrimp Cocktail",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 6 to 10",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "FOR THE SAUCE",
    "2cups Heinz ketchup",
    "¼cup fresh lemon juice, plus more to taste",
    "3tablespoons yuzu kosho or harissa paste, plus more to taste",
    "1tablespoon Worcestershire or Maggi sauce",
    "Kosher salt and freshly ground black pepper",
    "Freshly grated or prepared horseradish (if you must)",
    "FOR THE SHRIMP",
    "2–3pounds large raw, unpeeled shrimp",
    "Kosher salt",
    "1large onion, quartered",
    "A handful of black peppercorns",
    "3lemons, 1 halved crosswise and 2 quartered",
    "Olives or cornichons (optional)",
    "Lemony Aioli (recipe follows, optional)"
  ],
  "directions": [
    "1 Make the sauce. Combine the ketchup, ¼ cup lemon juice, yuzu kosho, and Worcestershire sauce in a medium bowl. Season with salt, pepper, and more lemon juice, if you like. If you’re a real purist, go ahead and add a spoonful or two of horseradish, or simply season with more yuzu kosho. Set aside to serve with the shrimp, or eat shamelessly with a spoon.",
    "2 Prepare the shrimp. Peel but do not devein the shrimp (otherwise they will get all curly when they cook). If the idea of eating undeveined shrimp really, really bothers you, go ahead and devein them, but it’s really not a big deal, I promise!",
    "3 Bring a large pot of highly salted (salty like the sea!) water to a boil and add the onion and peppercorns. Working in batches as needed, lower the shrimp into the pot and cook just until they’re bright pink and opaque, 3 to 4 minutes. Drain or remove using a slotted spoon and transfer to a rimmed baking sheet so they can cool down as quickly as possible. (Should you miraculously have space in your refrigerator, place them in there to chill faster.) Continue to cook the shrimp, as needed.",
    "4 To serve: Squeeze some of the halved lemon over the shrimp. Fill a large bowl with ice and then place shrimp atop with the lemon wedges; there’s no need to arrange them concentrically or anything, just however you think looks nice. If desired, scatter a few olives or tiny cornichons onto the ice as well. Be sure to provide a little dish for tails.",
    "5 Serve with cocktail sauce and lemony aioli for dipping."
  ]
}