{
  "title": "Shrimp Toast",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 6 to 8",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 pound shrimp (any size), peeled, deveined, and tails removed, divided",
    "- 1 large egg white",
    "- 2 teaspoons grated fresh ginger",
    "- 1 garlic clove, minced",
    "- 1 teaspoon sugar",
    "- 1/2 teaspoon table salt",
    "- Pinch white pepper",
    "- 6 slices hearty white sandwich bread",
    "- 2 tablespoons sesame seeds",
    "- 2 quarts peanut or vegetable oil for frying",
    "- 2 scallions, sliced thin"
  ],
  "directions": [
    "1. Finely chop half of shrimp. Cut remaining shrimp into 1/2-inch pieces. Using a wooden spoon or 4 bundled chopsticks, vigorously stir all of the shrimp, egg white, ginger, garlic, sugar, salt, and pepper in a bowl until the mixture tightens and becomes very sticky, about 3 minutes.",
    "2. Remove crusts from bread and trim slices to measure roughly 3 1/2 inches square. Spread shrimp mixture evenly over 1 side of each bread slice, then sprinkle with sesame seeds, pressing gently to adhere. (Coated bread can be covered and refrigerated for up to 24 hours.)",
    "3. Set wire rack in a rimmed baking sheet and line half of the rack with a triple layer of paper towels. Add oil to a 14-inch flat-bottomed wok or large Dutch oven until it measures about 1 1/2 inches deep, and heat over medium-high heat to 350°F. Using a spider skimmer or slotted spoon, carefully lower 3 slices of bread shrimp side down into hot oil and cook until edges of bread are golden brown, about 3 minutes. Adjust burner if necessary to maintain oil temperature between 325°F and 350°F. Using tongs, flip toasts and continue to cook until bread is uniformly golden brown, 30 to 45 seconds.",
    "4. Using a spider skimmer, transfer toasts shrimp side up to paper towel–lined side of the rack. Let drain for 1 minute, then move to the unlined side of the rack. Return oil to 350°F and repeat with remaining toasts. (Before cooking the second batch, line the rack with fresh paper towels.) Let toasts cool for 5 minutes. Halve toasts diagonally and transfer to serving platter. Sprinkle with scallions and serve."
  ]
}