{
  "title": "Shu Mai",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Makes: 40 dumplings",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 2 tablespoons soy sauce",
    "- 1/2 teaspoon unflavored gelatin",
    "- 3/4 ounce dried shiitake mushrooms, rinsed",
    "- 1 pound boneless country-style pork ribs, cut into 1-inch pieces",
    "- 8 ounces shrimp (any size), peeled, deveined, and tails removed",
    "- 1/4 cup water chestnuts, chopped",
    "- 2 tablespoons cornstarch",
    "- 2 tablespoons minced fresh cilantro",
    "- 1 tablespoon toasted sesame oil",
    "- 1 tablespoon Shaoxing wine",
    "- 1 tablespoon Chinese white rice vinegar",
    "- 2 teaspoons sugar",
    "- 2 teaspoons grated fresh ginger",
    "- 1/2 teaspoon table salt",
    "- 1/4 teaspoon white pepper",
    "- 1 (1-pound) package 3 1/2-inch round dumpling wrappers",
    "- 2 tablespoons tobiko (optional)"
  ],
  "directions": [
    "1. Combine soy sauce and gelatin in small bowl. Set aside to allow gelatin to bloom, about 5 minutes. Microwave 1 cup water and mushrooms in covered bowl until steaming, about 1 minute. Let sit until softened, about 5 minutes. Lift mushrooms from bowl with fork and discard liquid. Squeeze mushrooms dry, remove stems, and chop.",
    "2. Meanwhile, place half of pork in food processor and pulse until coarsely ground into approximate 1/8-inch pieces, about ten 1-second pulses; transfer to large bowl. Add shrimp and remaining pork to food processor and pulse until coarsely chopped into approximate 1/4-inch pieces, about five 1-second pulses. Transfer to bowl with more finely ground pork. Stir in soy sauce mixture, mushrooms, water chestnuts, cornstarch, cilantro, sesame oil, Shaoxing wine, vinegar, sugar, ginger, salt, and pepper.",
    "3. Lightly dust 2 parchment paper–lined rimmed baking sheets with flour. Working with 6 wrappers at a time, brush edges of each round lightly with water. Place heaping tablespoon of filling into center of each round. Form dumplings, crimping wrapper around sides of filling and leaving top exposed. Transfer to prepared sheet, cover with damp dish towel, and repeat in batches of 6 with remaining wrappers and filling. (Shu mai can be refrigerated for up to 24 hours or frozen on sheet until solid, then transferred to zipper-lock bag and stored in freezer for up to 1 month. Do not thaw shu mai before cooking; increase steaming time by 5 minutes.)",
    "4. Bring 4 cups water to boil in 14-inch flat-bottomed wok. Poke about 20 small holes in two 9-inch parchment rounds and lightly coat with vegetable oil spray. Place rounds in two 10-inch bamboo steamer baskets. Arrange 10 dumplings evenly in each prepared basket, leaving at least 1/2-inch space between each dumpling; stack baskets and cover. Reduce heat to maintain vigorous simmer and set steamer in wok. Steam until filling is no longer pink and dumpling wrappers have translucent, glossy sheen, 8 to 10 minutes. Top dumplings with tobiko, if using. Serve immediately. (Before cooking second batch of dumplings, replenish water in wok and line steamer baskets with fresh parchment rounds.)"
  ]
}