{
  "title": "Sichuan Chili Crisp",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "Makes 3 cups",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "- 2 cups / 480ml Sichuan rapeseed or neutral oil",
    "- 1 piece cassia bark",
    "- 2 pieces star anise",
    "- 1 or 2 pieces cardamom",
    "- 2 Tbsp minced garlic",
    "- 1 Tbsp minced ginger",
    "- ¼ cup / 50g preserved black beans",
    "- ½ cup / 125g Ground Chili Powder (this page)",
    "- 2 Tbsp mushroom powder",
    "- 2⅓ Tbsp kosher salt",
    "- 2 tsp Ground Roasted Sichuan Pepper",
    "- 2 Tbsp toasted sesame oil",
    "- 2 Tbsp fried shallots, store-bought",
    "- 2 Tbsp fried minced garlic, store-bought"
  ],
  "directions": [
    "1. In a large wok or frying pan over high heat, warm the rapeseed oil to 350°F / 175°C on an instant-read thermometer. Add the cassia bark, star anise, and cardamom and fry for 3 to 4 minutes, until their fragrances have been released into the oil. (You’ll know when this has happened when the spices stop bubbling in the oil.) Pour the oil through a fine-mesh strainer and discard the spices.2. Add the garlic, ginger, and preserved black beans to the oil and fry for 2 to 3 minutes until fragrant. Bring the oil to 260°F / 125°C and add the chili powder, mushroom powder, salt, and roasted Sichuan pepper, stirring to combine and making sure the salt is fully dissolved. Remove the wok from the heat and let the ingredients simmer in the hot oil for a few minutes.3. Stir in the sesame oil, shallots, and garlic. Allow the mixture to cool.4. Transfer the sauce to an airtight container and store at room temperature for up to 6 months or in the refrigerator for up to 12 months. You can use the chili crisp right away, but since the flavor develops over time, you’ll find it intensifying after a few days and even more so after a few weeks. Since the solid bits will settle at the bottom, make sure to always mix up the chili oil with a spoon before each use!"
  ]
}