{
  "title": "Silkiest Chocolate Buttercream",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Makes about 4 cups",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "2large eggs (3.5 oz / 100g), at room temperature",
    "2large egg yolks (1.1 oz / 32g), at room temperature",
    "¾cup sugar (5.3 oz / 150g)",
    "2½sticks unsalted butter (10 oz / 283g), cut into tablespoons, at room temperature",
    "8ounces (227g) semisweet chocolate (preferably 68 to 70% cacao), melted and cooled",
    "1teaspoon Diamond Crystal kosher salt (0.11oz / 3g)",
    "2teaspoons vanilla extract"
  ],
  "directions": [
    "Have all of your ingredients ready to go: Since the first part of making the buttercream requires simultaneous operations, have all the ingredients measured out. Put the whole eggs and yolks in the bowl of a stand mixer and attach the whisk. In a small saucepan, combine the sugar and 3 tablespoons water (1.5 oz / 43g) and set aside. Make sure your butter is thoroughly at room temperature and your chocolate is melted and cooled.",
    "Start to beat the eggs: Turn the mixer on medium-low just to break up the eggs, then add the salt and increase to medium speed. Continue to beat until the mixture is very light and pale and it falls off the end of the whisk and onto itself in a slowly dissolving ribbon, about 5 minutes. While you’re waiting for this, pivot to the sugar.",
    "Cook the sugar syrup: Heat the sugar mixture over medium-high heat, stirring with a heatproof spatula until dissolved and you have a clear syrup. Stop stirring when the mixture comes to a boil, then use a wet pastry brush to brush down the sides of the pan, dissolving any sugar crystals. Using an instant-read thermometer or clipping a candy thermometer to the side of the pan, boil, swirling the pan occasionally, until the mixture registers 230°F. Reduce the heat to medium-low and continue to cook, swirling the pan, until the syrup hits 238°F. While all this is happening, keep an eye on the eggs and stop the mixer if they’ve formed a ribbon. Don’t walk away! You want the sugar and eggs to be ready at the same time.",
    "Stream the sugar into the eggs: When the syrup reaches 238°F, remove it from the heat immediately. If you’ve stopped the mixer, turn it on medium-high and slowly and carefully stream the syrup down the side of the bowl into the egg mixture. Avoid pouring onto the whisk because this will splatter sugar around the bowl; aim for the point just where the eggs meet the side of the bowl. Continue to steadily pour in the syrup until you’ve added it all. The eggs should get thicker, paler, and denser.",
    "Beat until cool: Increase the mixer to high and continue to beat until the egg mixture is very light and dense and the sides of the bowl are completely cool to the touch, 5 to 8 minutes.",
    "Beat in the butter, then beat some more: When the egg mixture is very room temperature, add the butter one piece at a time, making sure each piece incorporates smoothly into the mixture before adding the next. If the eggs are still a bit warm when you start to add the butter, the residual heat will cause the butter to melt and your buttercream will look soupy. If this happens, just keep beating the mixture. If the butter is too cold, it won’t emulsify smoothly into the eggs and the buttercream will have a curdled look. In either case, just keep beating to let the temperature equalize. I promise the buttercream will come back together. Scrape down the sides of the bowl often and keep gradually adding the butter until it’s all incorporated and you have a smooth, glossy, light buttercream.",
    "Beat in the chocolate: Stop the mixer, scrape down the sides, and add the chocolate and vanilla. Beat on medium speed until no streaks remain, scraping the bottom and sides again if needed. The buttercream is now ready to use."
  ]
}