{
  "title": "Simple Fried Rice",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "4",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "3large eggs",
    "1 1/2teaspoons kosher salt, divided",
    "2tablespoons vegetable oil, divided",
    "1carrot, peeled and cut into 1/4-inch pieces",
    "4ounces ham steak, cut into 1/2-inch pieces (3/4 cup)",
    "4scallions, white and green parts separated and sliced thin",
    "4cups cooked jasmine rice, room temperature, large clumps broken up with fingers",
    "1/4teaspoon pepper",
    "1/2cup frozen peas"
  ],
  "directions": [
    "1. Beat eggs and 1/4 teaspoon salt in a bowl until well combined. Heat an empty 14-inch flat-bottomed wok over high heat until just beginning to smoke. Reduce heat to medium-high, drizzle 2 teaspoons oil around the perimeter of the wok, and heat until just smoking. Add eggs and cook, stirring constantly, until very little liquid egg remains, 30 to 60 seconds. Transfer to a large plate.",
    "2. Add 1 teaspoon oil to the now-empty wok and reduce heat to medium. Add carrot and 1/4 teaspoon salt and cook, tossing slowly but constantly, until the carrot is just beginning to brown, 2 to 4 minutes. Add ham and cook, stirring constantly, until the ham is warmed through, 1 to 2 minutes. Transfer to the plate with the eggs.",
    "3. Add scallion whites and remaining 1 tablespoon oil to the now-empty wok. Cook, stirring constantly, until fragrant, about 1 minute. Sprinkle rice over scallion whites and stir until combined. Spread into an even layer. Sprinkle pepper and remaining 1 teaspoon salt evenly over the rice. Continue to cook, stirring frequently and pressing on the rice with a spatula to break up clumps, until grains are separate and heated through, 2 to 5 minutes.",
    "4. Add peas, egg mixture, and scallion greens and cook, stirring constantly and using the edge of the spatula to break eggs into small pieces, until peas are warmed through, about 2 minutes. Serve."
  ]
}