{
  "title": "Singapore Noodles",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Servings: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 6 ounces mei fun (dried rice vermicelli)",
    "- 12 ounces large shrimp (26 to 30 per pound), peeled, deveined, and tails removed",
    "- 1/2 teaspoon table salt, divided",
    "- 6 tablespoons vegetable oil, divided",
    "- 6 ounces char siu (Chinese barbecue pork), sliced thin",
    "- 4 large eggs",
    "- 2 large shallots, halved and sliced thin",
    "- 1 red or green bell pepper, stemmed, seeded, and sliced thin",
    "- 3 garlic cloves, minced",
    "- 1 teaspoon grated fresh ginger",
    "- 2 tablespoons curry powder",
    "- 1/8 teaspoon cayenne pepper",
    "- 2 tablespoons soy sauce",
    "- 1 teaspoon sugar",
    "- 4 ounces (2 cups) bean sprouts",
    "- 4 scallions, sliced thin"
  ],
  "directions": [
    "1. Bring 4 quarts water to boil in large pot. Off heat, add noodles and let sit until just tender, about 3 minutes, stirring once halfway through soaking. Drain noodles and transfer to greased wire rack set in rimmed baking sheet; set aside.",
    "2. Cut shrimp in half lengthwise, pat dry with paper towels, and sprinkle with 1/4 teaspoon salt. Heat empty 14-inch flat-bottomed wok over high heat until just beginning to smoke. Drizzle 1 tablespoon oil around perimeter of wok and heat until just smoking. Add shrimp and cook, tossing slowly but constantly, until opaque throughout, about 2 minutes. Add char siu and cook, stirring frequently, until heated through, about 1 minute; transfer to bowl.",
    "3. Beat eggs and remaining 1/4 teaspoon salt in separate bowl until well combined. Heat now-empty wok over high heat until just smoking. Drizzle 2 teaspoons oil around perimeter of wok and heat until just smoking. Add eggs and cook, stirring constantly, until very little liquid egg remains, 30 to 60 seconds; transfer to bowl with shrimp mixture.",
    "4. Drizzle 1 tablespoon oil around perimeter of now-empty wok and heat over medium-high heat until just smoking. Add shallots and bell pepper and cook, tossing slowly but constantly, until crisp-tender, about 2 minutes. Push vegetables to 1 side of wok and add 1 teaspoon oil, garlic, and ginger to clearing. Cook, mashing mixture into wok, until fragrant, about 30 seconds. Stir garlic-ginger mixture into vegetables, then transfer to bowl with shrimp, char siu, and eggs.",
    "5. Drizzle remaining 3 tablespoons oil around perimeter of now-empty wok and heat over medium heat until just smoking. Off heat, add curry powder and cayenne. Cook, stirring constantly, until fragrant and darkened in color, about 2 minutes. Stir in 1/4 cup water, soy sauce, and sugar until sugar has dissolved.",
    "6. Return wok to medium heat, add noodles, and toss gently until well coated. Add shrimp mixture and bean sprouts and cook, tossing gently, until heated through, about 1 minute. Sprinkle with scallions and serve."
  ]
}