{
  "title": "Skillet Chicken Thighs and Peaches",
  "source": "Bonappetit.com",
  "servings": "2–4 servings",
  "categories": [],
  "ingredients": [
    "1½lb. skin-on, bone-in chicken thighs (about 4 small)",
    "Kosher salt",
    "2tsp. all-purpose flour",
    "1Tbsp. extra-virgin olive oil",
    "1medium red onion, sliced into 2\"-thick wedges",
    "6garlic cloves, coarsely chopped",
    "4sprigs thyme, plus more for serving",
    "⅓cup apple cider vinegar",
    "2Tbsp. Dijon mustard",
    "2Tbsp. honey",
    "1Tbsp. Worcestershire sauce",
    "1tsp. freshly ground pepper",
    "11-lb. bag frozen sliced peaches"
  ],
  "directions": [
    "Preheat oven to 350°. Pat 1½ lb. skin-on, bone-in chicken thighs (about 4 small) dry and season generously all over with kosher salt. Sprinkle evenly on both sides with 2 tsp. all-purpose flour.",
    "Heat 1 Tbsp. extra-virgin olive oil in a large cast-iron or high-sided skillet over medium. Cook chicken thighs, skin side down, undisturbed, until thighs release easily from pan, 7–9 minutes. Turn chicken over and cook on other side until golden brown underneath, about 5 minutes. Transfer chicken to a plate and arrange skin side up (they won’t be fully cooked through at this point).",
    "Cook 1 medium red onion, sliced into 2\"-thick wedges, in same pan, stirring occasionally, until slightly softened and starting to turn golden brown, about 5 minutes. Add 6 garlic cloves, coarsely chopped, and 4 thyme sprigs and cook, stirring, until garlic is fragrant, 1–2 minutes.",
    "Pour in ⅓ cup apple cider vinegar, scraping up any browned bits. Add 2 Tbsp. Dijon mustard, 2 Tbsp. honey, 1 Tbsp. Worcestershire sauce, 1 tsp. freshly ground pepper, and ¼ cup water and stir to combine. Remove pan from heat and mix one 1-lb. bag frozen sliced peaches into onion mixture. Return chicken to skillet, arranging skin side up.",
    "Transfer pan to oven and bake just until peaches and chicken thighs are cooked through (an instant-read thermometer inserted into the thickest part of a thigh without touching the bone should register 165°), 17–20 minutes.",
    "Remove pan from oven and scatter a few more thyme sprigs over chicken to serve."
  ]
}