{
  "title": "Skillet-Roasted Chicken in Lemon Sauce",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "½cup table salt for brining",
    "3pounds bone-in chicken pieces (2 split breasts halved crosswise, 2 drumsticks, and 2 thighs), trimmed",
    "1teaspoon vegetable oil",
    "2tablespoons unsalted butter",
    "1large shallot, minced",
    "1garlic clove, minced",
    "4teaspoons all-purpose flour",
    "1cup chicken broth",
    "4teaspoons grated lemon zest, divided, plus ¼ cup juice (2 lemons)",
    "1tablespoon fresh parsley leaves",
    "1teaspoon fresh oregano leaves"
  ],
  "directions": [
    "1. Dissolve salt in 2 quarts cold water in large container. Submerge chicken in brine, cover, and refrigerate for 30 minutes to 1 hour. Remove chicken from brine and pat dry with paper towels.",
    "2. Adjust oven rack to lower-middle position and heat oven to 475 degrees. Heat oil in ovensafe 12-inch skillet over medium-high heat until just smoking. Place chicken skin side down in skillet and cook until skin is well browned and crisp, 8 to 10 minutes. Transfer breasts to large plate. Flip thighs and legs and continue to cook until browned on second side, 3 to 5 minutes longer. Transfer thighs and legs to plate with breasts.",
    "3. Pour off and discard fat in skillet. Return skillet to medium heat; add butter, shallot, and garlic and cook until fragrant, 30 seconds. Sprinkle flour evenly over shallot-garlic mixture and cook, stirring constantly, until flour is lightly browned, about 1 minute. Slowly stir in broth and lemon juice, scraping up any browned bits, and bring to simmer. Cook until sauce is slightly reduced and thickened, 2 to 3 minutes. Stir in 1 tablespoon zest and remove skillet from heat. Return chicken, skin side up (skin should be above surface of liquid), and any accumulated juices to skillet and transfer to oven. Cook, uncovered, until breasts register 160 degrees and thighs and legs register 175 degrees, 10 to 12 minutes.",
    "4. While chicken cooks, chop parsley, oregano, and remaining 1 teaspoon zest until finely minced and well combined. Remove skillet from oven and let chicken stand for 5 minutes.",
    "5. Transfer chicken to serving platter. Whisk sauce, incorporating any browned bits from sides of pan, until smooth and homogeneous, about 30 seconds. Whisk half of herb-zest mixture into sauce and sprinkle remaining half over chicken. Pour some sauce around chicken. Serve, passing remaining sauce separately."
  ]
}