{
  "title": "Skirt Steak with Red Chimichurri",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "2garlic cloves",
    "1small shallot, or ¼ small red onion",
    "1red Fresno chile or jalapeño",
    "MEAT",
    "1pound skirt steak, trimmed",
    "PANTRY",
    "Kosher salt",
    "⅓cup red wine vinegar or sherry vinegar",
    "2teaspoons sugar",
    "2teaspoons sweet smoked paprika",
    "⅓cup plus 2 tablespoons extra-virgin olive oil",
    "½cup drained roasted red peppers",
    "Flaky sea salt",
    ""
  ],
  "directions": [
    "Marinate the steak:",
    "✦Pat 1 pound of skirt steak dry with paper towels. Cut it crosswise into 3 equal pieces. Season all over with 1½ teaspoons kosher salt. Transfer to a shallow bowl or baking dish.",
    "✦Finely grate 2 garlic cloves into a glass measuring cup. Add ⅓ cup red wine vinegar, 2 teaspoons sugar, 2 teaspoons smoked paprika, and ⅓ cup olive oil and whisk to combine. Pour half of that marinade over the steak, turning to coat. Let sit at least 15 minutes at room temperature or up to 4 hours in the refrigerator.",
    "Make the chimichurri sauce:",
    "✦Finely chop 1 shallot. Not totally sure how? Right this way for a quick demo.",
    "✦Thinly slice 1 Fresno chile crosswise, discarding the stem and seeds, and finely chop it.",
    "✦Finely chop ½ cup roasted red peppers. Add the shallot, chile, and roasted red peppers to the remaining marinade. Season with kosher salt.",
    "Cook the steak:",
    "✦Preheat a dry 12-inch cast-iron skillet over medium-high heat for at least 4 minutes to be sure it’s nice and hot right off the bat. You should be able to see some very light wisps of smoke coming off the pan.",
    "✦Remove the steak from the marinade, allowing any excess liquid to drip back into the bowl. Pat dry with paper towels.",
    "✦Working in 2 batches, add 1 tablespoon olive oil to the pan, allow it to heat up for about 30 seconds, then add half the steak and cook, undisturbed, until charred on the underside, 2 to 3 minutes. Flip and cook 1 minute on the second side. Transfer to a cutting board to rest for 5 minutes.",
    "Serve: Look at the steak and figure out which way the grain is running (i.e., which way the muscle fibers run). Thinly slice crosswise against the grain, perpendicular to the fibers. Not sure what the grain is or how to find it? Right this way. Transfer to a platter along with any juices on the cutting board (that’s FLAVOR—don’t leave it behind). Spoon some of the chimichurri over the steak and serve the remainder alongside. Season with flaky sea salt.",
    ""
  ]
}