{
  "title": "Slow-Roasted Salmon with Vermouth-Fennel Soubise",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Salmon",
    "11⁄2 teaspoons kosher salt",
    "1teaspoon packed dark brown sugar",
    "1⁄2 teaspoon fennel seeds, crushed in a mortar and pestle or spice grinder",
    "1⁄2 teaspoon freshly cracked black pepper",
    "One 11⁄2-pound (680 g) center-cut salmon fillet, pin bones and skin removed",
    "1lemon, thinly sliced and seeds removed",
    "1⁄4 cup (60 ml) olive oil",
    "Vermouth-Fennel Soubise",
    "2tablespoons unsalted butter",
    "1large yellow onion, thinly sliced",
    "1⁄2 large fennel bulb, cored and thinly sliced (fronds reserved)",
    "1⁄3 cup (80 ml) dry vermouth",
    "Kosher salt, to taste",
    "1⁄3 cup (80 ml) heavy cream",
    "For Serving",
    "1⁄2 large fennel bulb, cored and thinly sliced on a mandoline",
    "1lemon",
    "Kosher salt, to taste"
  ],
  "directions": [
    "1. Prepare the salmon: Mix the salt, brown sugar, fennel seeds, and pepper in a small bowl.2. Place the salmon on a small sheet tray, season all over (top and bottom) with the spice rub, and then place in the refrigerator while you make the sauce.3. Make the soubise: Melt the butter in a small saucepan over medium heat. Add the onion, fennel, and vermouth, and season with salt. Reduce the heat to medium-low, cover, and cook, uncovering to stir every now and then, until the onions and fennel are very soft but not brown and the pan is nearly dry, 40 to 45 minutes. Reduce the heat if needed to prevent any browning.4. Preheat the oven to 275°F (135°C) with a rack positioned in the center.5. Transfer the onion mixture to a blender along with the cream. Carefully (the mixture will be hot), with the blender vented, blend until very smooth.6. Lay the lemon slices on the bottom of a small (at least 1-quart/1 L) baking dish. Place the salmon on top of the lemon slices, and drizzle with the olive oil.7. Bake the salmon for 35 to 45 minutes, until the thickest part reads 125°F to 130°F (52°C to 54°C) on an instant-read thermometer for medium doneness. The cook time will heavily depend on the thickness of your salmon, so keep an eye on it.8. When the salmon is just about done, toss the fennel in a small bowl with the juice of half of the lemon and some salt to taste. Cut the remaining half of the lemon into wedges to serve on the side. I like to do this just a few minutes before the salmon is done so the fennel stays nice and crisp.9. To serve, add as much soubise as you like to the bottom of a platter. Gently break the salmon into about four large pieces, and place on top. Top with the dressed fennel, some reserved fronds, and the lemon wedges alongside, and serve."
  ]
}