{
  "title": "Slow-Roasted Piri-Piri(ish) Chicken with Crushed Potatoes & Aioli",
  "source": "Molly Baz - Cook This Book",
  "servings": "4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1whole garlic head",
    "2red Fresno or serrano chiles or 1 Thai bird’s-eye chile",
    "2pounds baby Yukon Gold potatoes",
    "2lemons",
    "DAIRY",
    "2large egg yolks",
    "MEAT",
    "1(3½- to 4-pound) whole chicken",
    "PANTRY",
    "Kosher salt",
    "4tablespoons extra-virgin olive oil",
    "2tablespoons double-concentrated tomato paste",
    "1tablespoon smoked paprika",
    "2tablespoons red wine vinegar or sherry vinegar",
    "1cup vegetable oil"
  ],
  "directions": [
    "① Preheat the oven to 400°F.",
    "② Season the chicken: Place the chicken on a rimmed baking sheet. Season the chicken all over with 4 teaspoons salt, being sure to season the cavity as well.",
    "③ Make the chile paste:",
    "✦Lightly smash and peel 6 garlic cloves. Using a Microplane, finely grate 4 of the cloves into a small bowl. Set the remaining 2 cloves aside for making the aioli later on. Cut what’s left of the head of garlic in half crosswise for roasting alongside the chicken. Lots of garlic in this dish—no wonder it’s so good!",
    "✦Finely grate 2 Fresno chiles into the bowl, discarding the stem. You can also finely chop the chiles and mash them to a paste with the side of your chef’s knife.",
    "✦Whisk in 2 tablespoons olive oil, 2 tablespoons tomato paste, 1 tablespoon smoked paprika, and 2 tablespoons red wine vinegar until combined.",
    "✦Using a pastry brush or the back of a small spoon, rub the entire chicken with all of the chile paste, getting in all the nooks and crannies—no need to coat the inside of the cavity.",
    "④ Season the potatoes: On the baking sheet with the chicken, toss 2 pounds baby Yukon Gold potatoes and the halved garlic with 2 tablespoons olive oil and season with salt. Arrange them around the chicken (the chicken sits directly on the baking sheet, not on top of any of the vegetables; this will ensure that all of the potatoes cook at the same rate).",
    "⑤ Roast the chicken and potatoes: Transfer the chicken and potatoes to the oven to roast for 10 minutes, then reduce the heat to 325°F.1 Continue to roast until the legs are so tender that when wiggled with a pair of tongs you could almost pull them off the carcass, 2½ to 3 hours, and the potatoes are tender and easily pierced with the tines of a fork. While roasting, baste the chicken two or three times: shake the pan, then tilt the pan toward you slightly to collect some of the accumulated juices in a spoon and pour it back over the chicken.",
    "⑥ Make the aioli:",
    "✦Finely grate the reserved 2 garlic cloves into a medium bowl. Add 2 egg yolks and whisk well to combine. Place a damp kitchen towel under the bowl to stabilize it.",
    "✦Slowly whisk in 1 cup vegetable oil in a very thin stream at first, then more generously once the aioli starts to thicken and lighten in color. Fear not: this is a pretty foolproof aioli, since it has 2 eggs to help bind the oil. Still need a little assistance with that aioli? Pull up this video to see how it’s done.",
    "✦Once all of the oil has been incorporated, add the juice of 1 lemon and season well with salt.2 Cover the aioli until you’re ready to serve.",
    "⑦ Serve: Let the chicken rest for at least 15 minutes. Cut 1 lemon into wedges for serving. Carve the chicken. You can pull the legs right off the carcass without a knife, but if you want a refresher on how to carve a chicken, pull up this video. Serve it with the potatoes, halved garlic, lemon wedges, aioli, and any juices left in the skillet."
  ]
}