{
  "title": "Slow-Roasted Shoulder of Lamb with Herb Dumplings",
  "source": "Complete Irish Pub Cookbook",
  "servings": "Serves 4–6",
  "categories": [
    "Complete Irish Pub Cookbook",
    "England/Ireland"
  ],
  "ingredients": [
    "2large carrots, cut into thin sticks",
    "1onion, sliced",
    "3 1/4-pound bone-in shoulder of lamb",
    "2–3fresh bay leaves",
    "1sage sprig",
    "Small bunch parsley",
    "Salt and pepper",
    "2 1/2cups meat stock",
    "Herb-flavored dumplings",
    "1cup all-purpose flour",
    "1teaspoon baking powder",
    "1/2teaspoon salt",
    "1/4teaspoon black pepper",
    "1 1/2tablespoons finely chopped fresh parsley",
    "1 1/2tablespoons finely chopped fresh mint or herb of your choice",
    "2tablespoons lightly salted butter",
    "1egg",
    "2tablespoons milk"
  ],
  "directions": [
    "1. Preheat the oven to 450°F. Scatter the carrots and onion over the bottom of a roasting pan slightly larger than the meat. Place the meat on top, tucking the herbs underneath. Season with salt and pepper, then pour in enough stock to not quite cover the vegetables.",
    "2. Cover the pan with thick aluminum foil, sealing the edges well. Roast in the preheated oven for 20 minutes, then reduce the heat to 325°F and roast for an additional 3 hours.",
    "3. To make the dumplings, sift the flour, baking powder, and salt into a bowl. Mix in the black pepper and herbs. Rub in the butter until the mixture resembles coarse bread crumbs. Beat together the egg and milk in a pitcher, then stir into the flour mixture to make a soft, slightly sticky dough.",
    "4. With floured hands, divide the dough into 12 pieces and roll into balls. Drop into a large saucepan of boiling salted water. Partially cover and cook for 15 minutes. Using tongs, gently lift the dumplings into a colander and let drain for a few minutes. Transfer to a plate until needed.",
    "5. Just before the meat is ready, heat the remaining stock in a small saucepan. Remove the meat from the oven and open up the foil. Arrange the dumplings around the meat and pour in the hot stock. Reseal the foil and roast for another 15 minutes.",
    "6. Transfer the meat to a warm platter and discard the herbs. Arrange the dumplings and vegetables around the meat. Strain the juices into a pitcher and serve with the meat."
  ]
}