{
  "title": "Smashed Cucumber Salad With Salted Peanuts And Wasabi Peas",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 4 servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "2large seedless cucumbers (a little shy of 2 pounds or 1 kilogram)",
    "1teaspoon kosher salt, plus more to taste",
    "2tablespoons (30 ml) plus 1 teaspoon (5 ml) sake",
    "1tablespoon (15 ml) rice vinegar",
    "2teaspoons (10 ml) toasted sesame oil",
    "Hot pepper flakes, to taste",
    "2tablespoons (20 grams) salted peanuts, crushed or coarsely chopped",
    "2tablespoons (15 grams) wasabi peas, crushed or coarsely chopped"
  ],
  "directions": [
    "Cut the cucumbers in half crosswise, then split lengthwise. Put on an apron (you’ll thank me) and, on a solid work surface, lay the cucumbers cut side down and whack them firmly with the flat side of a meat pounder or the bottom of a cast-iron skillet until the skin has torn and the seeds largely separate. Use your hands to swipe out any loose or lingering seeds, then tear or chop the cucumbers into rough 1-to-2-inch pieces. Toss in a bowl with 1 teaspoon salt and 2 tablespoons sake, then let sit in a colander set over a bowl for 10 to 15 minutes at room temperature, or up to a few hours in the fridge.",
    "Discard the liquid in the bowl, wipe it out, and drop the cucumbers back into it. Pour in the rice vinegar, sesame oil, last teaspoon of sake, and salt and hot pepper flakes to taste. Scatter generously with crushed peanuts and wa-sabi peas, and eat immediately.",
    "note I promise, this isn’t nearly as boozy at is sounds—most of the first glugs of sake drain off with the salt, leaving just a kiss of flavor behind. It’s only that last spoonful that goes right onto your plate. But if you want to omit it, simply add a couple of pinches of sugar to the initial liquid.",
    "do ahead (or don’t) The cucumbers get slippery pretty quickly, so it’s better not to dress or garnish them until you’re ready to eat."
  ]
}