{
  "title": "Smashed Honeynut Beans with Crispy Shrooms",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Serves 4",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "1small honeynut squash (8 ounces), seeded and halved",
    "1garlic bulb",
    "Extra-virgin olive oil",
    "½pound oyster mushrooms",
    "Diamond Crystal kosher salt",
    "3cups vegetable stock",
    "1teaspoon Calabrian chili paste, plus more for garnish",
    "2(15-ounce) cans butter beans or any white bean, drained and rinsed",
    "12fresh sage leaves, chopped",
    "1tablespoon fresh thyme leaves, chopped",
    "1tablespoon fresh rosemary, chopped",
    "Freshly ground black pepper",
    "2ounces (about ⅔ cup) freshly grated Parmesan cheese, for serving"
  ],
  "directions": [
    "1. Equally stagger two racks in the oven and preheat it to 400°F. Line a sheet pan with parchment paper.",
    "2. Place the squash halves cut-sides down on the lined sheet pan. Cut off the top off of the garlic bulb to expose the cloves. Drizzle the garlic with 1 tablespoon olive oil and wrap in aluminum foil. Roast both on the bottom rack of the oven until softened, 25 to 30 minutes—setting a timer for 12 minutes; that’s when you’ll add the mushrooms.",
    "3. While the squash is roasting, tear the mushrooms into thin strips. Add them to another sheet pan. Drizzle with 1 tablespoon olive oil and season with salt.",
    "4. Slide the sheet pan of mushrooms onto the top rack of the oven and roast until the mushrooms are dark brown and extremely crispy, 15 to 18 minutes.",
    "5. Let the squash cool, then remove the skin and add the squash to a blender along with the vegetable stock. Squeeze in the roasted garlic cloves, add the chili paste and ¼ teaspoon of salt, and blend until smooth.",
    "6. Set a large Dutch oven over medium heat and add 2 tablespoons olive oil to the pan. Add the beans and swirl in the oil. Add the sage, thyme, and rosemary and cook for another minute.",
    "7. Pour in the honeynut broth and bring to a gentle simmer. While the broth is simmering, use a spatula or a spoon to gently smash the beans. You want almost no pieces still whole, making the soup a chunky, creamy texture. Simmer for 5 to 8 minutes, until the soup has thickened, smashing as you go. Taste and season with salt and black pepper.",
    "8. To serve, portion into four bowls and top each with the crispy mushrooms and a generous grating of cheese. Dot with chili paste to taste."
  ]
}