{
  "title": "Smoked Salmon, Dill & Horseradish Tartlets",
  "source": "Complete Irish Pub Cookbook",
  "servings": "Makes 6",
  "categories": [
    "Complete Irish Pub Cookbook",
    "England/Ireland"
  ],
  "ingredients": [
    "Pastry dough",
    "1cup all-purpose flour, plus extra for dusting",
    "Pinch of salt",
    "5 1/2tablespoons cold salted butter, cut into pieces, plus extra for greasing",
    "Filling",
    "1/2cup crème fraîche, or 1/4 cup sour cream mixed with 1/4 cup heavy cream",
    "1teaspoon creamed horseradish",
    "1/2teaspoon lemon juice",
    "1teaspoon capers, chopped",
    "3egg yolks",
    "8ounces smoked salmon trimmings",
    "Bunch of fresh dill, chopped, plus extra sprigs to garnish",
    "Salt and pepper"
  ],
  "directions": [
    "1. Grease six 3 1/2-inch loose-bottom fluted tart pans. Sift the flour and salt into a food processor, add the butter, and process until the mixture resembles fine bread crumbs. Transfer the mixture to a large bowl and add just enough cold water to bring the dough together.",
    "2. Turn out onto a floured surface and divide into six equal pieces. Roll out each dough piece to a circle to fit the tart pans. Carefully fit each dough circle into a tart pan, pressing it to fit well. Roll the rolling pin over the pan to neaten the edges and trim the excess dough. Put a piece of parchment paper in each pan, fill with pie weights or dried beans, and chill in the refrigerator for 30 minutes. Meanwhile, preheat the oven to 400°F.",
    "3. Bake the pastry shells in the preheated oven for 10 minutes, then carefully remove the paper and weights.",
    "4. Meanwhile, to make the filling, put the crème fraîche, horseradish, lemon juice, and capers into a bowl with salt and pepper to taste and mix well. Add the egg yolks, smoked salmon, and chopped dill and carefully mix again. Divide this mixture among the pastry shells and return to the oven for 10 minutes. Let cool in the pans for 5 minutes before serving, garnished with dill sprigs."
  ]
}