{
  "title": "Smoky Sheet Pan Chicken With Cauliflower",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 4 servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "for the chicken",
    "2tablespoons (30 ml) olive oil",
    "1tablespoon (15 ml) white wine vinegar",
    "4garlic cloves, minced",
    "1tablespoon (10 grams) sweet smoked paprika (you can replace any portion of this with hot paprika if you wish)",
    "1½teaspoons kosher salt",
    "2pounds (roughly 1 kilogram) chicken thighs, drumsticks, or halved chicken breasts (all skin-on, bone-in)",
    "for the vegetables",
    "1¼pounds (565 grams) Yukon Gold potatoes (about 4 medium)",
    "1¾pounds (795 grams) cauliflower (1 small or ½ very large head)",
    "½large red onion",
    "⅔cup (120 grams) green olives, pitted",
    "2tablespoons (30 ml) olive oil, plus more for the pan(s)",
    "2teaspoons fresh thyme leaves, minced",
    "Salt and freshly ground black pepper",
    "to finish",
    "A few juliennes of red bell pepper",
    "1tablespoon (15 ml) white wine vinegar",
    "½teaspoon kosher salt",
    "A pinch or two of granulated sugar",
    "2tablespoons roughly chopped fresh flat-leaf parsley"
  ],
  "directions": [
    "marinate the chicken Combine the olive oil, vinegar, garlic, paprika, and salt in a bowl. Add the chicken parts, and toss to coat. Set aside to marinate while you prepare your vegetables (or leave it in the fridge for up to 1 day).",
    "assemble the chicken and vegetables When you’re ready to cook the dish, heat your oven to 400 degrees and line a half sheet pan (13-by-18-inch) or two quarter sheet pans (9-by-13-inch) with foil and coat with 1 tablespoon olive oil.",
    "Peel your potatoes if you wish, and cut them into approximately ¾-inch chunks. Cut the cauliflower to about 1-inch florets. Cut your onion half into eight thin wedges. Spread the vegetables on the prepared tray(s), and use your hands to toss them with 2 tablespoons olive oil, the thyme, and salt and pepper. (If you’d like to add the chorizo, scatter it over the vegetables now.)",
    "Make spaces throughout the pan of vegetables, and add the chicken pieces, skin side up. Cook for 30 minutes, at which point check the tray and toss the potato and cauliflower to ensure they’re cooking evenly, then return the pan to the oven for 10 to 15 minutes more, or until the chicken and vegetables are cooked through.",
    "to finish Toss the pepper strips together with the wine vinegar, salt, and a pinch or two of sugar in a small dish, and set aside until needed.",
    "When the chicken and vegetables are cooked, top with the pepper strips and parsley."
  ]
}