{
  "title": "Smooshed & Crispy Potatoes with Salt ’n’ Vinegar Sour Cream",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "2pounds baby Yukon Gold potatoes",
    "DAIRY",
    "¾cup sour cream",
    "PANTRY",
    "Kosher salt",
    "⅓cup extra-virgin olive oil",
    "Freshly ground black pepper",
    "6tablespoons distilled white vinegar"
  ],
  "directions": [
    "1. Position a rack in the center of your oven. Preheat the oven to 450°F.",
    "2. Cook the potatoes:- Place 2 pounds baby Yukon Gold in a large pot and fill with 3 quarts water and 1 cup salt. Bring to a boil over medium-high heat. Reduce the heat to maintain a simmer. Simmer the potatoes until tender and easily pierced with a knife, 5 to 10 minutes. The time will vary depending on the size of your potatoes; be careful not to overcook or they’ll fall apart when smashed. Drain in a colander and let sit for a few minutes to allow some water to evaporate.",
    "3. Smash the potatoes:- Transfer the potatoes to a large rimmed baking sheet. Use the bottom of a glass measuring cup or a flat mug to crush each potato until it’s about ½ inch thick. Drizzle ⅓ cup olive oil over the potatoes, gently turning them to coat all sides. Taste a potato; if it needs more salt (it probs does), re-season. Top with a few good cranks of black pepper.",
    "4. Roast the potatoes:- Roast until crispy and golden brown on the underside, 20 to 25 minutes. Remove the potatoes from the oven and drizzle 3 tablespoons distilled white vinegar evenly over. Flip the potatoes with a spatula and continue to cook until very crisp and golden brown around the edges, 10 to 20 minutes longer. Remove from the oven. Taste and season the potatoes with more salt if they need it.",
    "5. Make the salt ’n’ vinegar sour cream:- In a small bowl, stir together ¾ cup sour cream, 3 tablespoons distilled white vinegar, and ½ teaspoon salt.",
    "6. Serve:- Spread the sour cream in a shallow bowl or serving platter. Top with the potatoes and a few more cranks of black pepper."
  ]
}