{
  "title": "Snickerdoodle Cake",
  "source": "Sallysbakingaddiction.com",
  "servings": "Yield: 12-14 servings",
  "categories": [
    "Cake"
  ],
  "ingredients": [
    "3and 2/3 cups (433g) cake flour* (spoon & leveled)",
    "1teaspoon salt",
    "1teaspoon baking powder",
    "3/4teaspoon baking soda",
    "1and 1/2 cups (345g) unsalted butter, softened to room temperature",
    "1and 2/3 cups (330g) granulated sugar",
    "3large eggs + 2 additional egg whites, at room temperature*",
    "1Tablespoon pure vanilla extract (yes, Tbsp!)",
    "1and 1/2 cups (360ml) buttermilk, at room temperature*",
    "Cinnamon Swirl",
    "1/2cup (100g) packed light or dark brown sugar",
    "1/3cup all-purpose flour (41g) or cake flour (38g)",
    "1Tablespoon ground cinnamon*",
    "1/4cup (4 Tbsp; 60g) unsalted butter, melted",
    "Brown Sugar Cinnamon Buttercream",
    "1and 1/4 cups (2.5 sticks; 290g) unsalted butter, softened to room temperature",
    "8ounces (224g) full-fat block cream cheese, room temperature and sliced into 4 pieces*",
    "3/4cup (150g) packed light or dark brown sugar",
    "1Tablespoon ground cinnamon*",
    "5and 1/2 cups (660g) confectioners’ sugar",
    "1/4cup (60ml) heavy cream or whole milk",
    "1teaspoon pure vanilla extract",
    "1/8teaspoon salt, plus more as needed",
    "optional for garnish: snickerdoodle cookies"
  ],
  "directions": [
    "Preheat oven to 350°F (177°C). Grease three 9-inch cake pans, line with parchment paper, then grease the parchment paper. Parchment paper helps the cakes seamlessly release from the pans.",
    "Make the cake: Whisk the cake flour, salt, baking powder, and baking soda together. Set aside.",
    "Using a handheld or stand mixer fitted with a paddle or whisk attachment, beat the butter and sugar together on high speed until smooth and creamy, about 3 minutes. Scrape down the sides and up the bottom of the bowl with a rubber spatula as needed. Beat in the 3 eggs, 2 egg whites, and vanilla extract on high speed until combined, about 2 minutes. (Mixture will look curdled as a result of the egg liquid and solid butter combining.) Scrape down the sides and up the bottom of the bowl as needed. With the mixer running on low speed, slowly add the dry ingredients. With the mixer still running on low speed, slowly pour in the buttermilk then mix just until combined. You may need to whisk it all by hand to make sure there are no lumps at the bottom of the bowl. The batter will be slightly thick.",
    "Pour batter evenly into cake pans. If desired, weigh them with a kitchen scale to ensure accuracy. Set aside for a few minutes as you make the cinnamon swirl.",
    "For the cinnamon swirl: With a fork, mix the brown sugar, flour, and cinnamon together until combined. Pour the melted butter on top and mix just until combined. Use immediately in the cake batter (next step) because the longer it sits out, the harder it will get as a result of the butter solidifying.",
    "Drop small spoonfuls of the cinnamon swirl on each of the unbaked cakes. Use a knife to gently swirl the spoonfuls into the batter. Some pieces will remain as chunks (that’s fine!) and some will swirl into the batter.",
    "Bake for around 23-26 minutes or until the cakes are baked through. To test for doneness, insert a toothpick into the center of the cake. If it comes out clean, it’s done. Allow cakes to cool completely in the pans set on a wire rack. The cakes must be completely cool before frosting and assembling.",
    "Make the frosting: In a large bowl using a hand-held mixer or stand mixer fitted with a whisk or paddle attachment, beat the butter on medium speed until creamy, about 2 minutes. Switch the mixer up to medium-high speed and add the cream cheese one piece at a time, mixing until each has combined before adding the next. Once the cream cheese is combined, add the brown sugar and beat on medium-high speed until combined, about 1 minute. Stop the mixer and add the cinnamon, confectioners’ sugar, heavy cream, vanilla extract, and salt. Turn the mixer on low speed and beat for 30 seconds, then turn the mixer up to medium-high speed and beat until completely combined and creamy. Add more confectioners’ sugar if frosting seems too thin– I usually add another 1/4 cup (30g) of confectioners’ sugar. You can add more heavy cream if frosting seems too thick or an extra pinch of salt if frosting is too sweet. (I usually add another pinch of salt.) If you crave extra flavor, add a little more cinnamon and/or vanilla extract.",
    "Level the cakes & add the crumb coat: Using a large serrated knife, slice the domes off the cooled cakes (a semi-thin layer) to create a flat surface. Discard domes (or crumble over ice cream!). Place 1 cake layer on a cake stand, cake turntable, or serving plate. Evenly spread about 1 and 1/2 cups of frosting on top. Top with 2nd cake layer and evenly spread another 1 and 1/2 cups of frosting on top. Top with the third cake layer. I decorated my snickerdoodle cake with a crumb coat, which makes it a semi-naked style cake. To recreate this, spread a thin layer of frosting around the sides and top of the cake (save extra frosting for the top in the next step). An icing spatula and bench scraper are helpful for creating this look. (If you need a visual, see my Naked Cake video tutorial.) Chill the crumb coated cake uncovered in the refrigerator or freezer for at least 30 minutes to help set the crumb coat.",
    "Spread a little extra frosting on top of the cake and use any leftover frosting to pipe detail around the edges, if desired. I used Wilton 8B piping tip. Garnish with snickerdoodles if desired.",
    "Refrigerate cake for at least 30-60 minutes before slicing and serving. This helps the cake hold its shape when cutting.",
    "Cover leftover cake tightly and store in the refrigerator for up to 5 days."
  ]
}