{
  "title": "Socca With Sautéed Onions And Rosemary",
  "source": "Modern Bistro - ATK",
  "servings": "4 to 6 servings (makes four 10-inch pancakes)",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "For the socca:",
    "1½cups water",
    "1⅓cups (6 ounces) chickpea flour",
    "¼cup extra-virgin olive oil, divided, plus extra for drizzling",
    "1teaspoon table salt",
    "¼teaspoon ground cumin",
    "For the sautéed onions:",
    "2tablespoons extra-virgin olive oil",
    "2cups thinly sliced onions",
    "½teaspoon table salt",
    "1teaspoon chopped fresh rosemary"
  ],
  "directions": [
    "1. For the socca: Adjust oven rack to middle position and heat oven to 200 degrees. Set wire rack in rimmed baking sheet and place in oven. Whisk water, flour, 4 teaspoons oil, salt, and cumin in bowl until no lumps remain. Let batter rest while preparing onions, at least 10 minutes. (Batter will thicken as it sits.)",
    "2. For the sautéed onions: Heat oil in 10-inch nonstick skillet over medium-high heat until just smoking. Add onions and salt and cook until onions start to brown around edges but still have some texture, 7 to 10 minutes. Add rosemary and cook until fragrant, about 1 minute. Transfer onion mixture to bowl; set aside. Wipe skillet clean with paper towels.",
    "3. Heat 2 teaspoons oil in now-empty skillet over medium-high heat until just smoking. Lift skillet off heat and pour ½ cup batter into far side of skillet; swirl gently in clockwise direction until batter evenly covers bottom of skillet.",
    "4. Return skillet to heat and cook socca, without moving it, until well browned and crisp around bottom edge, 3 to 4 minutes (you can peek at underside of socca by loosening it from side of skillet with heatproof spatula).",
    "5. Flip socca with heatproof spatula and cook until second side is just cooked, about 1 minute. Transfer socca, browned side up, to prepared wire rack in oven. Repeat 3 more times, using 2 teaspoons oil and ½ cup batter per batch.",
    "6. Transfer socca to cutting board and cut each into 8 wedges. Top with sautéed onions, drizzle with extra oil, sprinkle with flake sea salt, and serve."
  ]
}