{
  "title": "Soft Dinner Rolls",
  "source": "Sallysbakingaddiction.com",
  "servings": "Yield: 14-16 rolls",
  "categories": [],
  "ingredients": [
    "1cup (240ml) whole milk, warmed to about 110°F (43°C)",
    "2and 1/4 teaspoons Platinum Yeast from Red Star instant yeast (1 standard packet)",
    "2Tablespoons granulated sugar, divided",
    "1large egg",
    "1/4cup (56g) unsalted butter, softened to room temperature and cut into 4 pieces",
    "1teaspoon salt",
    "3cups (390g) all-purpose flour or bread flour* (spooned & leveled)",
    "optional topping: 2 Tablespoons (28g) melted unsalted butter mixed with 1 Tablespoon honey"
  ],
  "directions": [
    "Prepare the dough: Whisk the warm milk, yeast, and 1 Tablespoon of sugar together in the bowl of your stand mixer. Cover and allow to sit for 5 minutes.If you do not own a stand mixer, you can do this in a large mixing bowl and in the next step, mix the dough together with a large wooden spoon/rubber spatula. It will take a bit of arm muscle. A hand mixer works, but the sticky dough repeatedly gets stuck in the beaters. Mixing by hand with a wooden spoon or rubber spatula is a better choice.",
    "Add the remaining sugar, egg, butter, salt, and 1 cup flour. With a dough hook or paddle attachment, mix/beat on low speed for 30 seconds, scrape down the sides of the bowl with a rubber spatula, then add the remaining flour. Beat on medium speed until the dough comes together and pulls away from the sides of the bowl, about 2 minutes. If the dough seems too wet to a point where kneading (next step) would be impossible, beat in more flour 1 Tablespoon at a time until you have a workable dough, similar to the photos above. Dough should be soft and a little sticky, but still manageable to knead with lightly floured hands.",
    "Knead the dough: Keep the dough in the mixer and beat for an additional 3 full minutes or knead by hand on a lightly floured surface for 3 full minutes.",
    "1st Rise: Lightly grease a large bowl with oil or nonstick spray. Place the dough in the bowl, turning it to coat all sides in the oil. Cover the bowl with aluminum foil, plastic wrap, or a clean kitchen towel. Allow the dough to rise in a relatively warm environment for 1-2 hours or until double in size. (I always let it rise on the counter. Takes about 2 hours. For a tiny reduction in rise time, see my answer to Where Should Dough Rise? in my Baking with Yeast Guide.)",
    "Grease a 9×13 inch baking pan or two 9-inch square or round baking pans. You can also bake the rolls in a cast iron skillet or on a lined baking sheet.*",
    "Shape the rolls: When the dough is ready, punch it down to release the air. Divide the dough into 14-16 equal pieces. (Just eyeball it– doesn’t need to be perfect!) A bench scraper is always helpful for cutting dough. Shape each piece into a smooth ball. Arrange in prepared baking pan.",
    "2nd Rise: Cover shaped rolls with aluminum foil, plastic wrap, or a clean kitchen towel. Allow to rise until puffy, about 1 hour.",
    "Adjust oven rack to a lower position and preheat oven to 350°F (177°C). (It’s best to bake the rolls towards the bottom of the oven so the tops don’t burn.)",
    "Bake the rolls: Bake for 20-25 minutes or until golden brown on top, rotating the pan halfway through. If you notice the tops browning too quickly, loosely tent the pan with aluminum foil. Remove from the oven, brush with optional honey butter topping, and allow rolls to cool for a few minutes before serving.",
    "Cover leftover rolls tightly and store at room temperature for 2-3 days or in the refrigerator for up to 1 week."
  ]
}