{
  "title": "Soft and Crispy Focaccia",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves: Makes 1 half-sheet pan",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "1(¼ oz / 7g) envelope active dry yeast (2¼ teaspoons)",
    "6cups bread flour (24 oz / 780g)",
    "2tablespoons Diamond Crystal kosher salt (0.6 oz / 17g)",
    "½cup extra-virgin olive oil (5 oz / 110g), plus ¼ cup for topping plain focaccia and more for oiling hands",
    "Optional Toppings (recipes follow)",
    "Flaky salt, for sprinkling the top"
  ],
  "directions": [
    "Dissolve the yeast: In a small saucepan, gently warm ½ cup water (4 oz / 113g) over low heat, swirling the pan, just until it’s lukewarm but not hot, about 105°F on an instant-read thermometer (you can do this in the microwave, too, but beware of overheating). Pour the water into the bowl of a stand mixer and whisk in the yeast to dissolve. Set aside until the mixture is cloudy and slightly puffed, about 5 minutes.",
    "Mix the dough: Place the bowl on the mixer and attach the dough hook. Add 2½ cups room-temperature water (20 oz / 567g) to the yeast mixture, then add the flour and kosher salt. Mix on the lowest speed until a very loose dough comes together, about 1 minute, then increase the speed to medium-high and mix until the dough is smooth and wrapping around the hook, about 5 minutes. Turn off the mixer, cover the bowl with a damp towel, and let the dough rest for 10 minutes. Turn the mixer back on to medium-high and continue to mix until the dough is very smooth, extremely elastic, and pulling away from the sides of the bowl, another 10 to 15 minutes. It will still be very sticky, but don’t add more flour.",
    "Let the dough rise once: Pour ¼ cup of the oil into a separate large bowl and swirl to coat. Use a flexible spatula or dough scraper to scrape the dough into the oiled bowl. Use your fingertips to dab some of the pooling oil across the surface of the dough. Take a photo so you can more easily gauge how the dough rises over time, then cover it with a damp kitchen towel and let it sit at room temperature until the dough is doubled in size, 1 to 1½ hours.",
    "Prepare any toppings: While the dough is rising, if you’re making one of the toppings, follow the directions in the individual recipes.",
    "Fold the dough and transfer it to the pan: Drizzle ¼ cup oil across a standard half-sheet pan, rubbing with your fingers to coat the entire bottom and sides. With oiled hands, loosen the risen dough from the sides of the bowl. Slide your hands down around either side of the dough and lift it up out of the bowl, letting the weight of the dough pull itself downward. This stretching motion gives more structure to the dough so it rises higher. Return the dough to the bowl, letting it fold onto itself, then rotate the bowl 90 degrees and repeat the same stretching and folding process. Rotate and stretch the dough two more times, finally placing it on the oiled baking sheet instead of back in the bowl after the final stretch. Stretch the dough in all directions to fill out the pan until it starts to spring back, then cover the pan with an oiled sheet of plastic wrap and let the dough rest for 15 minutes.",
    "Proof the dough a second time: Uncover the dough and use your fingers to stretch it all the way to the sides and into the corners so it fills the sheet completely. Cover the dough again with the same sheet of plastic wrap. At this point, the dough can be refrigerated up to 24 hours. It should rise slowly in the refrigerator until nearly doubled in height, but if it hasn’t by the time you’re ready to bake, let it sit at room temperature until it does.",
    "If you’re going to bake the focaccia straightaway, let it sit at room temperature until the dough is nearly doubled in height (it should reach near the top of the sheet pan), another 40 to 55 minutes.",
    "Preheat the oven: While the dough is rising, arrange two oven racks in the highest and lowest positions and preheat the oven to 450°F.",
    "Dimple the dough: Uncover the risen dough. With oiled hands and fingers spread wide, press your fingertips down into the dough through to the bottom of the pan, making lots of dimples across the entire surface (you’ll see big air bubbles form—that’s good!).",
    "Top the focaccia as desired: For plain focaccia, drizzle the surface with the remaining ¼ cup olive oil and sprinkle generously with flaky salt. For any of the other toppings, top as directed in those recipes.",
    "Bake the focaccia: Bake the focaccia on the lower rack until the corners of the dough are pulling away from the pan, 20 to 25 minutes. Transfer the focaccia to the top rack and continue to bake until the top is very well browned (some of the bubbles might even start to char), about 5 minutes longer. The bake time could vary depending on the topping, so judge by the surface color.",
    "Cool: Let the focaccia cool in the pan for 10 minutes, then use a thin spatula to loosen it from the bottom and sides of the sheet pan (some sticking might occur, so use a scraping motion and some elbow grease). Let the focaccia cool completely on a wire rack."
  ]
}