{
  "title": "Sour Cream Coffee Cake",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 20 to 24 servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "cake",
    "½cup (115 grams) unsalted butter, melted and cooled slightly",
    "½cup (100 grams) granulated sugar",
    "¼cup (60 ml) milk",
    "1½cups (360 grams) sour cream, at room temperature",
    "2large eggs, ideally at room temperature",
    "1teaspoon (5 ml) vanilla extract",
    "2teaspoons instant yeast (not active dry; from one ¼-ounce or 7-gram packet)",
    "2⅔cups (345 grams) all-purpose flour",
    "1teaspoon fine sea salt",
    "crumbs",
    "1cup (235 ml) melted butter, no need to cool",
    "⅔cup (130 grams) granulated sugar",
    "1cup (190 grams) light- or dark-brown sugar",
    "1teaspoon ground cinnamon",
    "½teaspoon fine sea salt",
    "3⅓cups (435 grams) all-purpose flour",
    "2teaspoons baking powder",
    "to finish",
    "Powdered sugar"
  ],
  "directions": [
    "make the cake Combine all of the cake ingredients in a medium-sized mixing bowl, stirring till the mixture becomes cohesive, then stirring for 2 minutes more. In a stand mixer, you can mix this with the paddle attachment at low-medium speed for 2 to 3 minutes. Scrape down the sides of the bowl, cover with plastic wrap, and let rise in a draft-free place for 60 minutes, until it’s slightly puffy. (It won’t double; this is fine.)",
    "meanwhile, make the crumbs Heat the oven to 350 degrees. Mix the melted butter, sugars, cinnamon, and salt in a bowl. Add the first two cups of flour and the baking powder, and stir. Then add the remaining flour, about ½ a cup at a time. The mixture is going to be very stiff and you’re going to think it cannot be mixed, but keep working it in, making the flour disappear, breaking it into the rubble, cutting and mashing it together with a spoon. Press the crumbs into the bottom of your bowl; set aside until needed.",
    "assemble the cake Butter a 9-by-13-inch cake pan and line the bottom with parchment paper. Break up the crumbs with a fork into large and small rubble and sprinkle into the bottom of the pan.",
    "Pour the batter over the crumbs in a thin sheet. Use an offset spatula to smooth it out. Cover again with plastic wrap (don’t let it drape in and touch the top of the batter) and set aside for another 30 minutes.",
    "bake the cake For 40 to 45 minutes until the top is lightly browned and a toothpick inserted deep into the cake portion comes out batter-free.",
    "Let the cake cool on a wire rack for 5 minutes, then run a knife along the edge to loosen and flip the cake out onto a serving plate.",
    "to serve Dust generously with powdered sugar."
  ]
}