{
  "title": "Sourdough Challah",
  "source": "Lionsbread.com",
  "servings": "Servings 2",
  "categories": [
    "Sourdough"
  ],
  "ingredients": [
    "Levain",
    "45g ripe sourdough starter refreshed 8-10 hours prior",
    "55g water room temperature, filtered",
    "110g unbleached all purpose flour",
    "Final Challah Dough",
    "all of the levain",
    "65g warm water, filtered, approx. 90 degrees F",
    "2large eggs, plus 1 egg yolk plus 1 for the egg wash",
    "55g avocado oil, or any neutral oil",
    "70g raw honey",
    "10g kosher salt, I like Morton's",
    "50g whole wheat flour",
    "375g unbleached all purpose flour"
  ],
  "directions": [
    "Make the Levain",
    "This levain is very stiff compared to traditional sourdough levains. In a medium size bowl, combine the ripe sourdough starter and the water. Use a whisk or a Danish dough whisk to break up the sourdough until it dissolves in the water. Add the all purpose flour, and stir until completely combined. Use your hands to knead the dough (in the bowl or on a work surface) until the surface is smooth, about 2-3 minutes. Place the levain in the bowl, and cover tightly with plastic wrap. Allow to ferment 8-12 hours, or overnight, at room temperature. The levain should at least double or even triple in size.",
    "Mix the Final Dough",
    "In a large bowl, combine the warm water and all of the levain. Use your fingers or a Danish dough whisk to break up the levain until it dissolves in the water.",
    "Add the eggs and egg yolk, avocado oil, and honey to the bowl. Whisk to thoroughly combine all of the wet ingredients.",
    "Add the all purpose flour, whole wheat flour, and kosher salt to the bowl. Use a wooden spoon or your hands to incorporate the flours and salt. The dough should be tacky. Move the dough to a lightly floured work surface, and knead by hand for about 10 minutes. The dough may slightly stick to the board as you go, so lightly sprinkle with flour if necessary. You don't want to add much more flour here. Use a bench scraper to scrape the dough off the board, and continue kneading until the dough smooth, and elastic.",
    "Place the dough in a large bowl, and cover with plastic wrap. Allow to rise at room temperature for 3.5 to 4 hours.",
    "Shape the Challah",
    "Pour the dough out onto your lightly floured work surface. Divide the dough in half, and then divide each half into 4 pieces, for a total of 8 equal pieces of dough. If you want to do a 3-strand braid, divide your dough into 6 pieces.",
    "Use a rolling pin to roll each piece of dough out into a long, thin 12\" x 3\" rectangle, about 1/8\" thick. With the long edge facing you, roll the dough up, so it makes a long rope, and pinch the seam closed. Repeat with the remaining pieces of dough.",
    "Line a baking sheet with parchment paper. Take 4 of the ropes, and braid them using your favorite braiding technique. Check out my Instagram for braiding tutorials. Repeat with the remaining 4 ropes of dough. Places the shaped loaves on the prepared baking sheet. Spray a piece of plastic wrap with nonstick cooking spray, and cover the loaves with the plastic wrap, oiled side down. Let proof at room temperature for 5 hours, until the loaves are puffy.",
    "Preheat the oven to 350 degrees F. In a small bowl, beat the remaining egg. Brush the loaves with the beaten egg. When the oven reaches temperature, brush the loaves with the beaten egg again. Leave the loaves plain, or sprinkle with sesame, nigella seeds, pumpkin or poppy seeds. Be creative!",
    "Bake the loaves for 35-40 minutes, rotating the pan halfway through the bake, so the loaves brown evenly. Allow the challahs to cool completely before slicing."
  ]
}