{
  "title": "Sourdough Baguettes",
  "source": "Solomonbakery.com",
  "servings": "3 12-14 inch baguettes",
  "categories": [
    "Sourdough"
  ],
  "ingredients": [
    "Levain Ingredients",
    "33g sourdough starter",
    "33g water (~80 degrees)",
    "17g all purpose flour",
    "17g rye flour",
    "Dough Ingredients",
    "390g bread flour",
    "100g whole wheat flour",
    "320g water (~80 degrees)",
    "100g levain",
    "10g sea salt",
    "Additional Ingredients:",
    "dusting flour"
  ],
  "directions": [
    "Thoroughly mix the levain ingredients in a tall jar. Cover loosely and let rest in a warm environment for 4-6 hours until peaked (the top has flattened off).",
    "~1 hour before the levain is ready, mix the bread flour (390g) and whole wheat flour (100g) in a medium bowl. Add the water (320G) and mix just until all the flour in incorporated. Cover with a damp towel.",
    "When ready, add the levain and salt over the dough. Stretch the edges of the dough out and over teh levain and salt to cover it. Begin incorporating by squeezing around the dough until the dough begins to feel homogeneous.",
    "Knead the dough on a clean surface with the slap and fold method by lifting and slapping down the dough, followed by folding the end closest to you over and rotating 90 degrees before repeating. Repeat quickly for 3-4 minutes until smooth.",
    "Transfer the dough back to the bowl and cover with a damp towel.",
    "Proof for 2 hours, performing a stretch and fold every 30 minutes (3 total), by taking a corner of the dough and stretching it over to the other end, followed by stretching and folding the other 3 corners. End by flipping the dough over so the seam is on the bottom.",
    "After the last stretch and fold, proof an additional 3-6 hours until nearly doubled.",
    "Fully and tightly cover the bowl with plastic wrap and let rest in fridge overnight.",
    "Divide the dough into 3 equal pieces, roughly 300g each. Shape each piece into a tight ball. Lightly dust with flour and cover. Let rest 30 minutes.",
    "One at a time, gently stretch the corners out to resemble square. Take the end closest to you and fold it over 2/3 of the dough. Take the end furthest from you and fold all the way over it towards you, sealing it with your palm to create a tube. Roll the tube out until it is 12-14 inches long, tapering the ends.",
    "After each baguette is shaped, transfer to a pizza peel lined with parchment paper. Dust the tops lightly with flour and cover with a dry towel. Let rest 2-3 hours until well puffed and nearly doubled.",
    "1 hour before baguettes are fully proofed, preheat oven to 500 F with a baking stone on the middle rack.",
    "Lower oven to 475 F. Slide baguettes onto the baking stone and bake for 20 minutes with steam. Remove steam, rotate baguettes 180 degrees and bake for an additional 10-15 minutes until deep drown.",
    "Cool on a wire rack 30 minutes before slicing."
  ]
}