{
  "title": "Sourdough",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Makes 1 small loaf",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "1cup / 234g water, between 90° and 95°F",
    "½cup / 60g activated starter (see this page)",
    "1½cups / 210g bread flour",
    "¾cup / 90g whole-wheat flour",
    "2teaspoons / 6g Diamond Crystal kosher salt",
    "Rice flour, for dusting"
  ],
  "directions": [
    "In a large bowl, mix together the water and starter. Use your hand to ensure the starter is fully dissolved and the water appears foamy.",
    "Add both flours and use your hands to mix into a shaggy dough. Cover with a damp cloth and let sit for 20 minutes.",
    "Prepare a small water bowl to the side. Sprinkle the salt over the top of the dough, then dip your working hand into the small water bowl to dampen it and prevent it from sticking to the dough. Pull one edge of the dough up until it feels taut, then fold it over the top of the dough, encasing the salt. Rotate the bowl 90 degrees and repeat with another edge. Repeat this process four or five times, until the dough completely encapsulates the salt. Dampen your hand again and pinch across the dough, pressing the salt in to combine. Rotate the bowl 180 degrees and pinch again. Dampen your hand and repeat the folding and pinching process, until the salt is well incorporated.",
    "Using your hand in a scoop shape, scoop underneath the dough and lift it out of the bowl, then gently place it back in the bowl, letting the edges fold under each other, rotating the bowl 180 degrees each time. Do this a few times, until the dough looks like a smooth mound. Cover the bowl with a damp cloth and let sit for 30 minutes.",
    "Lightly dampen a work surface and transfer the dough onto it. Using both hands, lift the dough off the work surface, then gently slap and fold it onto itself. Rotate your hands 90 degrees, then lift and repeat again. Do this a few times, until the dough is in a very tight mound. Cover with a damp towel and let sit for 30 minutes.",
    "Repeat this same step 30 minutes later. Then cover and repeat again after another 30 minutes. Transfer the dough to a clear bowl.",
    "Cover and let the dough rise until just under double in size, with a slightly domed top and some bubbles on the sides of the bowl and just a few on the surface, 4 to 5 hours.",
    "Transfer the dough to a lightly floured work surface. Pull one edge of the dough up until it feels taut, then fold it over the top of the dough, shaping the dough into an upside-down ball. Rotate the dough 90 degrees and repeat with another edge. When you have all the edges pinched in, use a bench scraper to flip the dough over so it looks like a tight ball. Cup your hands around the edges and gently pull the dough toward you, letting the seam of the dough grip against the work surface and tighten up. Rotate and repeat a few times. Let it sit for 20 to 30 minutes.",
    "Prepare a proofing basket with a liberal dusting of rice flour. Flip the dough back over to reveal the seam. Gently tug at the edges to form a big rectangle. Fold one-third of the dough over itself, then the opposite third, pinch the edges down the center, then roll the dough from the top to the bottom, making a tight oblong loaf.",
    "Scoop up the loaf with your bench scraper, giving the seam one last seal, and flip, seam-side up, into the proofing basket. Cover with a loose plastic bag, punch a few air holes in it, and set this to proof in the fridge for 24 to 48 hours.",
    "When it’s time to bake, set a Dutch oven on the center rack of the oven and preheat the oven to 500°F.",
    "When the Dutch oven has been preheated for about 45 minutes, flip the loaf seam-side down onto a piece of parchment paper. Use a razor or sharp knife to score the top in one long cut down the center. Score about ⅓ inch (1 cm) deep. Immediately transfer to the Dutch oven and cover.",
    "Bake, covered, for 20 minutes.",
    "Uncover and bake until it’s deeply burnished, 5 to 7 minutes.",
    "Let it cool for 2 hours before cutting."
  ]
}