{
  "title": "Sour Cherry Pie",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "2recipes flaky all-butter pie dough, almond variation (this page)",
    "All-purpose flour, for rolling out",
    "8cups fresh pitted sour cherries (2.5 lb / 1.12kg), from about 3 pounds (1.36kg)",
    "1¼cups granulated sugar (8.8 oz / 250g)",
    "5tablespoons cornstarch (1.6 oz / 44g)",
    "2teaspoons finely grated lemon zest",
    "2teaspoons vanilla extract",
    "½teaspoon ground cinnamon",
    "¼teaspoon ground cardamom",
    "¼teaspoon Diamond Crystal kosher salt",
    "¼teaspoon almond extract",
    "1large egg, beaten",
    "Demerara sugar, for sprinkling the top"
  ],
  "directions": [
    "Preheat the oven: Arrange an oven rack in the lowest position and preheat the oven to 425°F.",
    "Roll out the pie dough: Remove one piece of pie dough from the refrigerator and let it soften at room temperature for about 5 minutes. Unwrap the dough and place it on a lightly floured surface. Use a rolling pin to beat the dough all across the surface to make it more pliable. Dust over top and underneath the dough with more flour, then roll it out, dusting with more flour as needed, until you have a round about 13 inches in diameter and ⅛ inch thick.",
    "Lower the round into the pie plate, letting the pastry slump down the sides. Firmly press the pastry into the bottom and up the sides of the plate to ensure full contact. Use scissors to trim around the edge, leaving a ¾-inch overhang of dough. Refrigerate the bottom crust in the pie plate while you roll out the second crust just as you did the first. Cut the second round into 1-inch-wide strips. Transfer the strips to a dinner plate and refrigerate while you make the filling.",
    "Mix the filling: In a large bowl, combine the cherries, granulated sugar, cornstarch, lemon zest, vanilla, cinnamon, cardamom, salt, and almond extract and toss to combine.",
    "Assemble the pie: Remove the bottom crust and dough strips from the refrigerator and scrape the filling into the lined pie plate, mounding and pressing firmly on the cherries to eliminate air pockets. Use a pastry brush to dab beaten egg all around the edge of the pastry. Arrange the two longest strips of dough perpendicular to each other across the center of the pie. Start arranging the next longest strips parallel to the first two in both directions, spacing about ½ inch apart and weaving in an alternating under-over pattern. You’ll have to fold every other strip up and back as you work, replacing them over each new strip placed in the opposite direction. Continue to weave the remaining strips, alternating the under-over motion to form a lattice. Press firmly where the strips come into contact with the egg wash on the bottom crust and then trim off the excess. Brush the overhang again with more egg and fold it up and inward onto itself. Pinch all the way around to seal the pastry, then crimp the edge, using floured hands if necessary to prevent sticking. Brush the top of the pie, including the entire lattice and crimped edge, with egg, then sprinkle generously with demerara sugar.",
    "Bake the pie and cool: Set the pie on a foil-lined rimmed baking sheet (to catch drips—there will be drips!) and bake for 20 minutes. Reduce the oven temperature to 350°F and continue to bake, tenting any areas of the crust that are browning faster than everywhere else, until the juices are bubbling in the center of the pie, another 1½ to 2 hours. Remove from the oven and let cool completely, at least 4 hours."
  ]
}