{
  "title": "Sourdough Sandwich Bread",
  "source": "bakerbettie.com",
  "servings": "Yield: 2 loaves",
  "categories": [
    "Sourdough"
  ],
  "ingredients": [
    "FOR A FULL BATCH (MAKES 2 LOAVES)",
    "650grams water at 90-95 F (32-35 C)",
    "300grams mature sourdough starter",
    "1000grams bread flour or unbleached all purpose flour",
    "50grams oil neutral flavored oil (canola, vegetable, sunflower, or avocado)",
    "40grams sugar or honey",
    "20grams kosher salt or fine sea salt",
    "FOR A HALF BATCH (MAKES 1 LOAF)",
    "325grams water",
    "150grams mature sourdough starter",
    "500grams bread flour or unbleached all purpose flour",
    "25grams oil neutral flavored oil (canola, vegetable, sunflower, or avocado)",
    "20grams sugar or honey",
    "10grams kosher salt or fine sea salt"
  ],
  "directions": [
    "Get Starter Ready for Dough: If you are making a full batch of bread, you will need 300 gr of active fed starter to go into your dough. For this amount, I do a 1:3:3 feeding so that my starter is usually ready to go into the dough at about the 5 hr mark and can be used until about the 10 hr mark after feeding. I take 50 grams starter and feed that with 150 grams flour and 150 grams water to give me 350 grams total starter. 300 grams will go into the dough with 50 grams leftover for the next days feeding. You can use whatever ratios work best for you and your timing as long as you have at least 300 grams to go into your dough. If you are confused about how feedings work, please watch my video on understanding sourdough starter for clarification.",
    "Mix Dough: In a large mixing bowl measure out your slightly warm water. Add your starter, flour, oil, sugar or honey, and salt on top. I like to start mixing the dough with a silicone spatula or a dough whisk first. Once the dough is starting to come together, use clean hands to thoroughly mix the dough until all of the ingredients are very well incorporated and there are no dry patches of flour. This will take about 2-3 minutes of mixing to make sure it is well combined. Cover the bowl with plastic wrap, or a shower cap and let sit at room temperature (72-75 F, 22-23 C) for 30 minutes.",
    "Stretch and Folds: Over the 2 hours perform 4 rounds of stretch and folds (see video if you are unfamiliar with this technique) about every 30 minutes. The timing between the rounds does not need to be exact. Drizzle a tiny bit of oil over the dough after the last stretch and fold and cover it with plastic wrap or a shower cap to prevent it from drying out.",
    "Retard Dough (optional): If you would like to bake your bread the same day, you can skip this step. However, if you would like, you can refrigerate your dough at this point to increase flavor, sourness, and provide some flexibility with baking time. to do this, place your dough in the refrigerator for at least 24 hours and up to 4 days.",
    "Bulk Ferment: If you did not retard your dough, let it continue sitting at room temperature after your last round of stretch and folds for about 3 hours. If you did retard your dough, bring it out of the fridge and let it sit out for about 5-6 hours to finish bulking. Your dough will likely look like it hasn't risen much or at all when you first take it out of the fridge. You know bulk is finished when the dough is full of air and is rounding on the sides of the bowl. You can also perform the dough float test (see video) if you are unsure your dough is ready.",
    "Shaping: Oil your 8.5 x 4.5\" (22 x 11 cm) loaf pans. Turn your dough out onto your very lightly floured work surface. Divide the dough in half if you made a full batch. Shape the dough into a tight sandwich loaf (see video for shaping demonstration). Be cautious about not using too much flour on the bench or on top of your dough as this makes it difficult to build tension and to get the dough to stick to itself. Transfer the dough to the loaf pan, seam side down. Gently press down on the dough to ensure it is evenly filling the pan and that no air pockets are trapped inside the dough.",
    "Proof: Cover the pans with plastic wrap or a shower cap and let proof until the dough begins to crown the pan and is full of air. This should take around 2 1/2 hours at a room temperature of about 72 F (22 C). Your timing will be quicker if your room is warmer, or longer if your room is cooler. You can also perform the dent test to see how far along your dough is with proofing. Take a well floured finger and gently press down into your dough about 1/2\" down. If the dough immediately fills back in, then it needs a bit more time. If the dent very slowly fills back in, then you are well proofed. If the dough feels like it might collapse or does collapse, you have gone too far and your dough is over proofed. You can still bake it, but it will be very dense.",
    "Prepare Oven: About 30 minutes before baking, prepare your oven. Place an oven rack in the center position and another in the bottom of the oven. On the bottom rack, place a roasting pan or other metal pan (not glass or ceramic) in the oven and fill it with about 2 cups (480 ml) of water. Set a baking stone on the middle rack. If you do not have a baking stone, you can use 2 sheet pans stacked and turned upside down. Preheat the oven to 400 F (200 C). Preheating with the water already in the oven will make your oven moist and steamy when your bread goes in and will help with a good oven spring.",
    "Bake: If you have a water spray bottle, spray the tops of the proofed loaves with water. If you don't, you can just sprinkle some water over the top of the loaves with clean hands. Transfer the loaves onto the preheated baking stone or sheet pans and bake for 15 minutes with the pan of water in the oven. After 15 minutes, very carefully remove the pan of water from the oven. Continue baking for 15-20 more minutes until the loaves are golden grown and sound hollow when thumped. The center of the loaf should also read 200 F (93 C) if you are unsure if they are baked through.",
    "Cool: Transfer the baked loaves into a cooling rack and gently tip out of the pans. Allow to cool completely before slicing. Cool a minimum of 2 hours before slicing, and preferably longer. Loaves of bread can have a gummy texture if sliced into before cooling and it will also cause them to stale more quickly.",
    "Store: After sliced, I keep my sandwich bread cut side down and unwrapped in my bread box. If you do not have a bread box, and your climate isn't extremely dry, you can keep it cut side down out on your cutting board in the open air. Or you can wrap it in a kitchen towel and place it in a paper bag as the next best option if your climate is very dry. If you would like to store it in a ziplock bag, make extra certain that it is cooled completely before you do so and that there is no moisture present before you seal it, otherwise it can get moldy. This is how I store the bread for up to 72 hours. After that, I slice what is left and transfer it to the freezer in a ziplock back. Toast to refresh."
  ]
}