{
  "title": "Sous Vide Peri Peri Chicken",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2–5arbol chiles, stemmed",
    "1shallot, chopped",
    "2tablespoons extra-virgin olive oil",
    "1tablespoon table salt",
    "1tablespoon tomato paste",
    "2teaspoons sugar",
    "1½teaspoons paprika",
    "1½teaspoons five-spice powder",
    "1teaspoon garlic powder",
    "1teaspoon grated lemon zest plus 2 tablespoons juice, plus lemon wedges for serving",
    "½teaspoon pepper",
    "¼teaspoon cayenne pepper",
    "2bay leaves, crumbled",
    "4(12-ounce) bone-in split chicken breasts, trimmed"
  ],
  "directions": [
    "1. Process arbols, shallot, oil, salt, tomato paste, sugar, paprika, five-spice powder, garlic powder, lemon zest and juice, pepper, cayenne, and bay leaves in blender until smooth, scraping down sides of blender jar as needed, about 1 minute. Place chicken and chile paste in 1-gallon zipper-lock freezer bag and toss to coat. Seal bag, pressing out as much air as possible. Refrigerate chicken for at least 6 hours or up to 24 hours.",
    "2. Using sous vide circulator, bring water to 150 degrees in 7-quart container. Gently lower bag into prepared water bath until chicken is fully submerged, and then clip top corner of bag to side of water bath container, allowing remaining air bubbles to rise to top of bag. Reopen 1 corner of zipper, release remaining air bubbles, and reseal bag. Cover and cook chicken for at least 1½ hours or up to 3 hours. (Chicken and accumulated juices can be rapidly chilled in ice bath [see this page] and then refrigerated in zipper-lock bag after step 2 for up to 5 days. To reheat, return sealed bag to water bath set to 150 degrees for 20 minutes. Proceed with step 3.)",
    "3. Adjust oven rack 6 inches from broiler element and heat broiler. Set wire rack in aluminum foil–lined rimmed baking sheet and spray with vegetable oil spray. Transfer chicken skin side up to prepared rack and let rest while preparing sauce.",
    "4. Pour accumulated juices into 8-inch skillet, bring to simmer over medium heat, and cook until reduced by two-thirds, 3 to 5 minutes. Brush chicken with sauce and broil until skin is crisp and lightly charred, 6 to 8 minutes. Serve with lemon wedges."
  ]
}