{
  "title": "Southern Curry Chicken Wings",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 4",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "MARINADE",
    "1quart buttermilk",
    "1batch (1 quart) Southern Curry Paste",
    "2teaspoons sriracha",
    "2tablespoons Squid Brand fish sauce",
    "1½teaspoons kosher salt",
    "ASSEMBLE",
    "4pounds chicken wings, trimmed, rinsed well, and patted dry",
    "4cups all-purpose flour",
    "6cups canola oil",
    "½cup chopped fresh cilantro leaves"
  ],
  "directions": [
    "1. Make the marinade: Whisk together the buttermilk, ⅓ cup of the curry, the sriracha, fish sauce, and salt in a large bowl.",
    "2. Assemble: Add the chicken wings and toss to coat in the marinade. Cover and marinate in the refrigerator for at least 8 hours and up to 24 hours.",
    "3. Remove the wings from the marinade. Set a baking rack over a half sheet pan.",
    "4. Place 2 cups of the flour in a large baking dish, dredge the wings in the flour in batches, and tap off any excess. Place the wings on the rack and place in the refrigerator for 30 minutes.",
    "5. Heat the oil in a wok or high-sided sauté pan over medium heat until it reaches 300 degrees F on a deep-fry thermometer. Line a baking sheet with paper towels.",
    "6. Dredge the wings once more, in batches, in the flour and tap off any excess. Fry the wings, in batches, for about 5 minutes, until light golden brown. Remove with a slotted spoon to the baking sheet. (This part can be done several hours ahead and up to 1 day ahead, and stored, covered, in the refrigerator.)",
    "7. Raise the heat of the oil to 350 degrees F. Fry the wings again, in batches, until deep golden brown and crispy, 5 to 7 minutes longer. The internal temperature should reach 165 degrees F on an instant-read thermometer.",
    "8. Place the remaining curry in a bowl, add the chicken wings, and toss to coat. Remove with a slotted spoon to a large platter and garnish with chopped cilantro leaves."
  ]
}