{
  "title": "Soy-Braised Brisket with Caramelized Honey and Garlic",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 6 to 10",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "3½- to 4-pound boneless beef brisket, fat trimmed",
    "Kosher salt and freshly ground black pepper",
    "2tablespoons canola oil",
    "⅓cup honey",
    "2heads of garlic, halved crosswise to expose the cloves (you can leave the paper on—it’s okay)",
    "2large yellow onions, quartered",
    "1cinnamon stick",
    "3star anise pods",
    "3-inch piece of fresh ginger, peeled and sliced",
    "4chiles de arbol, or ½ teaspoon crushed red pepper flakes, plus more",
    "2dried or fresh bay leaves",
    "4cups beef or chicken broth",
    "1¼cups low-sodium soy sauce",
    "½cup rice wine vinegar",
    "2tablespoons fish sauce",
    "4cups fresh cilantro, mint, and/or basil, tender leaves and stems",
    "¼cup thinly sliced chives or scallions",
    "Cooked rice noodles or plain rice, for serving (optional)",
    ""
  ],
  "directions": [
    "1 Season the brisket with salt and pepper. Do this as far ahead as possible (somewhere between 5 minutes and 48 hours is great).2 Heat the oil in a large, heavy-bottomed Dutch oven (make sure it’s got a fitted lid) over medium-high heat. Add the brisket, fattiest side down (if there is not a clear winner, any side will do) and sear, occasionally pressing with tongs to ensure even contact with the pot, until it’s deeply golden brown, 8 to 10 minutes. Flip the brisket and sear on the other side until similarly, deeply, golden brown. Sometimes a brisket will have a third (or even fourth) side, depending on the shape and cut, so sear on all sides if applicable.3 Transfer the brisket to a plate or platter and drain the pot of any residual fat into a heatproof container (no need to wipe it out). Return the pot to medium-high heat and add the honey. Let it sizzle and bubble and start to caramelize, about 2 minutes. (If the pot is dark and you can’t see it, don’t worry, you’ll smell it. It will smell like a rich, deep caramel.)4 Reduce the heat to medium-low and add the garlic, onion, cinnamon, star anise, ginger, chiles, and bay leaves. Stir to coat in the caramelized honey and cook until they take on some color and soften a bit, 2 to 3 minutes.5 Add the beef broth, soy sauce, vinegar, and fish sauce. Return the brisket to the pot, nestling it in there. If the brisket is not at least three-fourths covered, add more broth or water until it is.6 Bring the liquid to a simmer, reduce the heat to medium-low, and cover. Simmer gently, peeking only when you absolutely can’t stand how good it smells and need to check on it to make sure it’s not ready (it’s not), until it’s totally, completely, impossibly tender, 3 to 3½ hours.7 Using tongs or two spatulas, remove the brisket and transfer to a cutting board, reserving the braising liquid. If you like, use a slotted spoon or strainer to remove and discard the vegetables and spices from the pot (this is unnecessary, but a nice touch if you don’t want to fish them out later).8 Slice the brisket and return it to the pot with the liquid (you can also shred it, if that is your preference).9 Toss the herbs and chives together in a medium bowl. Season with salt and pepper.10 Serve brisket out of the pot or inside a shallow bowl, ladling some of the braising liquid over. Top with herbs and maybe a pinch of red pepper flakes. Serve with additional braising liquid for spooning over or drinking, and with rice noodles or rice, if you like."
  ]
}