{
  "title": "Soy-Braised Short Ribs",
  "source": "Saltfatacidheat.com",
  "servings": "Serves 6 to 8",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "5pounds meaty short ribs on the bone, 2-3 inches thick",
    "Salt",
    "Neutral tasting oil, such as canola or grapeseed",
    "¼cup (60 grams)",
    "soy sauce",
    "¼cup (55 grams) dark brown sugar",
    "¼cup (58 grams)",
    "mirin (rice wine)",
    "1teaspoon toasted sesame oil",
    "1tablespoon finely grated fresh ginger",
    "4garlic cloves, finely grated or pounded with a pinch of salt",
    "¼teaspoon cayenne",
    "About 1 cup (228 grams)",
    "dashi",
    "1/4cup coarsely chopped cilantro leaves and tender stems",
    "4scallions, green and white parts slivered"
  ],
  "directions": [
    "Prep the ribs the day before you want to cook. Season the meat lightly with salt and let it sit for 30 minutes. Keep in mind that the marinade consists mostly of soy sauce, which is salty, so use only about half as much salt as you otherwise would.",
    "In the meantime, whisk together the soy sauce, brown sugar, mirin, sesame oil, ginger, garlic, and cayenne. Place the meat in a resealable plastic bag and pour in the marinade. Seal the bag and squish the marinade around so all the meat is evenly coated. Refrigerate overnight.",
    "A few hours before you want to cook the ribs, pull them out of the fridge to come up to room temperature. Adjust oven rack to middle position and preheat to 400°F.",
    "Set a large cast-iron skillet over medium-high heat to preheat. When pan is hot, drop the temperature to medium-low, add just enough oil to coat the bottom. Working in batches so as not to crowd pan, brown a few short ribs at a time on all three meaty sides, adding more oil if necessary before each batch. Reduce heat as necessary to achieve browning gradually; it may take 4 to 5 minutes per side for well-browned ribs.",
    "Transfer the ribs, bone-side down, to a large Dutch oven or a",
    "large, deep ceramic or pyrex roasting dish, then pour the marinade over the meat. It’s fine if the ribs are snug, but they should all fit in a single layer. Add enough dashi to go about",
    "¾-inch up the sides of the ribs, then cover with lid or",
    "parchment and aluminum foil.",
    "Slide into the oven and cook until the liquid simmers, about 30 minutes, then reduce heat to 325°F and cook until meat is very tender and falling off the bone, 3 to 4 hours more.",
    "Uncover pot or dish and crank oven to 450°F. Brush ribs with the braising juices and cook for about until shiny and brown, about 8 to 12 minutes.",
    "Serve warm, garnished with cilantro and slivered scallions.",
    "Cover and refrigerate leftovers for up to 3 days"
  ]
}