{
  "title": "Spaghetti with Colatura, Garlic, and Bread Crumbs",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Bread Crumbs",
    "30g / 1 piece fresh country bread, crust removed and bread torn into pea-size pieces",
    "28g / 2 Tbsp olive oil",
    "To Finish",
    "624g / 1 lb 6 oz extruded spaghetti (this page)",
    "42g / 3 Tbsp olive oil",
    "15g / 3 cloves garlic, finely chopped",
    "40g / 6 to 8 oil-packed anchovy fillets, finely chopped",
    "15g / 1 Tbsp colatura",
    "20g / ¼ cup finely chopped parsley",
    "2g / 1 tsp dried red chile flakes",
    "1lemon, cut in half and seeds removed"
  ],
  "directions": [
    "1   To make the bread crumbs, spread the bread out on a sheet pan. Let sit at room temperature until crunchy on the outside with a bit of give in the interior, 2 to 3 hours.",
    "2   Line a plate with a paper towel. Place a small saucepan over medium heat and add the olive oil. Add the bread crumbs and cook, stirring occasionally, until golden brown, 5 to 7 minutes.",
    "3   Transfer the bread crumbs to the plate and let cool.",
    "4   To finish, bring a large pot of water to a boil over high heat. Generously salt the water.",
    "5   Add the spaghetti to the water and cook for 5 to 8 minutes, until al dente.",
    "6   While the pasta is cooking, place a large sauté pan over low heat and add the olive oil. Add the garlic and gently cook until aromatic but without color, 10 to 15 seconds.",
    "7   Add the anchovies and stir to break them up. Add 2 to 3 ladles (115g to 170g / ½ to ¾ cup) pasta cooking water and stir to combine.",
    "8   Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Toss for 1 to 2 minutes to marry the pasta and the sauce. If the sauce begins to tighten, add a splash of room-temperature water to loosen and continue tossing to marry. (Colatura and anchovies have a high level of salinity, so adding too much pasta cooking water during the marriage can tip the dish into too-salty territory. Feel free to alternate between pasta water and fresh water or use only fresh water.)",
    "9   Remove from the heat. Add the colatura and toss to incorporate. Add the parsley and chile flakes and continue tossing. Squeeze in the juice from the lemon halves and toss again to combine.",
    "10   Divide the pasta into bowls and garnish with the bread crumbs."
  ]
}