{
  "title": "Spaghetti With Garlic Four Ways (Spaghetti con Aglio in Quattro Modi)",
  "source": "Pasta - Missy Robbins",
  "servings": "4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Caramelized Cloves",
    "- 56g / ¼ cup olive oil, plus more q.b. if storing",
    "- 125g / 25 cloves garlic",
    "Crispy Garlic",
    "- 224g / 1 cup olive oil",
    "- 50g / 10 cloves garlic, very thinly sliced (1/16 inch thick) on a mandoline",
    "To Finish:",
    "- 624g / 1 lb 6 oz extruded spaghetti",
    "- 112g / ½ cup olive oil",
    "- 5 bulbs and stalks spring garlic, sliced into ⅛-inch-thick pieces",
    "- 36g / 7 cloves garlic, very thinly sliced (1/16 inch thick) on a mandoline",
    "- 3g / 1½ tsp dried red chile flakes",
    "- 20g / ¼ cup finely chopped parsley"
  ],
  "directions": [
    "1. To make the caramelized cloves, place a sauté pan over low heat and add the olive oil. Add the garlic cloves in a single layer and cook, making sure to regularly move them in the pan, until they are light golden brown, caramelized on all sides, and mash easily when pressed, 15 to 20 minutes. This will yield your sweet garlic flavor.",
    "2. Set aside to cool until ready to use or transfer to a lidded glass jar, add olive oil to cover, and store in the refrigerator for up to 1 week.",
    "3. To make the crispy garlic, line a plate with paper towels. Place another sauté pan over low heat and add the olive oil. Add the garlic and cook, stirring occasionally, until the slices begin to turn golden at the edges and harden slightly, 3 to 5 minutes. They will curl up a bit and cluster together as they cook, so be sure to stir occasionally to ensure even coloring.",
    "4. Using a slotted spoon, remove the garlic and place in one layer on the paper towels to drain. They will crisp up as they drain and dry.",
    "5. To finish, bring a large pot of water to a boil over high heat. Generously salt the water.",
    "6. Place a large sauté pan over medium-low heat and add the olive oil. Add the spring garlic and cook until it softens but is without color, 1 to 2 minutes.",
    "7. Add the sliced garlic and continue to cook until it is aromatic and without color, 30 seconds to 1 minute. Add a splash of water to stop the cooking and set aside.",
    "8. Add the spaghetti to the water and cook for 5 to 8 minutes, until al dente.",
    "9. While the pasta is cooking, return the sauté pan to low heat and add 3 ladles (170g / ¾ cup) pasta cooking water and swirl to combine.",
    "10. Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium and add the caramelized garlic cloves and the chile flakes. Toss for 1 to 2 minutes to marry the pasta and the sauce. If the sauce begins to tighten, add a splash of pasta cooking water to loosen and continue tossing.",
    "11. Remove from the heat. Add the parsley and continue to toss until evenly distributed, adding another splash of pasta cooking water if the sauce tightens up.",
    "12. Divide the pasta into bowls and garnish with the crispy garlic."
  ]
}