{
  "title": "Spaghetti with Lemon, Pine Nuts, and Parmigiano",
  "source": "Pasta - Missy Robbins",
  "servings": "4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "80g / ⅔ cup pine nuts",
    "624g / 1 lb 6 oz extruded spaghetti",
    "28g / 2 Tbsp olive oil",
    "5g / 1 garlic clove, thinly sliced",
    "45g / 3 Tbsp unsalted butter, cold and cubed",
    "8g / ⅔ lemon peel, pith removed and finely chopped",
    "118g / 1⅓ cups finely grated parmigiano-reggiano",
    "4lemons, cut in half and seeds removed"
  ],
  "directions": [
    "1. Preheat the oven to 325°F. Spread the pine nuts in a single layer on a sheet pan and toast until lightly golden brown, 5 to 7 minutes, checking every few minutes to avoid burning. Set aside to cool, about 15 minutes. Once cooled, finely chop and set aside.2. Bring a large pot of water to a boil over high heat. Generously salt the water.3. Add the spaghetti to the water and cook for 5 to 8 minutes, until al dente.4. While the pasta is cooking, place a large sauté pan over low heat and add the olive oil. Add the garlic and gently cook until aromatic but without color, 10 to 15 seconds.5. Add the butter and 3 to 4 ladles (170g to 230g / ¾ to 1 cup) of pasta cooking water. Swirl to emulsify.6. Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Toss for about 1 minute to marry the pasta and the sauce.7. Add the lemon peel and a little less than half of the pine nuts, continuing to toss to combine.8. Remove from heat and slowly add half of the parmigiano, tossing until well incorporated.9. Squeeze the juice from the lemon halves into the pan and continue tossing. If the sauce tightens, add a splash of pasta cooking water to loosen it. When properly married, the pasta should cling to the sauce and have a glossy sheen.10. Divide the pasta into bowls and garnish with the remaining pine nuts and parmigiano."
  ]
}