{
  "title": "Spaghetti alla Carbonara (Pasta with Eggs, Guanciale, and Pecorino)",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Ragù",
    "1(170g / 6 oz) piece guanciale, finely diced",
    "180g / 10 egg yolks",
    "68g / ¾ cup finely grated parmigiano-reggiano",
    "68g / ¾ cup finely grated pecorino romano, plus 15g / 2½ Tbsp for garnish",
    "Black pepper, q.b.",
    "624g / 1 lb 6 oz extruded spaghetti (this page)"
  ],
  "directions": [
    "1 - Bring a large pot of water to a boil over high heat. Salt the water. Use slightly less you might for other pastas, as the cheese and pork add quite a bit of salinity to the dish.",
    "2 - Place a large sauté pan over low heat. Add the guanciale and cook slowly until the fat has rendered and the meat parts start to get crispy, 5 to 7 minutes. Line a plate with paper towels. Using a slotted spoon, transfer the crisped guanciale to the paper towels to drain. Reserve 55g / ¼ cup of the rendered fat.",
    "3 - Add the egg yolks to a large bowl. Use a spoon or spatula to stir them into a smooth liquid. Do not whip them. Add the parmigiano and 68g / ¾ cup of the pecorino and stir to make a paste. Slowly stir in the reserved rendered fat. Add a hefty amount (about 40 grinds) of pepper and half of the reserved guanciale. Stir to combine.",
    "4 - Add the spaghetti to the water and cook for 5 to 8 minutes, until al dente.",
    "5 - Add 2 ladles (115g / ½ cup) pasta cooking water to the bowl in a slow, steady stream while stirring. This will further temper the eggs so they don’t curdle and will also loosen the mixture to form your sauce.",
    "6 - Using tongs or a pasta basket, remove the spaghetti from the pot and transfer to the bowl. Quickly but gently toss the pasta and cheese–egg yolk paste. As the sauce tightens, continue to add pasta cooking water a splash at a time until you have a smooth, silky sauce coating the pasta.",
    "7 - Divide into bowls and garnish with the remaining 15g / 2½ Tbsp pecorino, the reserved guanciale, and with pepper q.b."
  ]
}