{
  "title": "Spaghetti all’Assassina (Assassin’s Spaghetti)",
  "source": "The-pasta-project.com",
  "servings": "4",
  "categories": [
    "Italian",
    "Italian Pasta"
  ],
  "ingredients": [
    "320g spaghetti or vermicelli (12oz) fine spaghetti is better. I used spaghetti Di Martino",
    "400g tomato passata (14oz) homemade or store-bought",
    "1-2tbsp tomato paste/concentrate",
    "100ml extra virgin olive oil. (1/2 cup)",
    "2-3garlic cloves peeled and 1-2 chopped, 1 left whole",
    "1fresh peperoncino (red chili pepper) or 1/2 tbsp flakes or according to taste",
    "1-2tsp sugar optional",
    "salt and pepper to taste",
    "12cherry tomatoes optional"
  ],
  "directions": [
    "Peel the garlic and chop 1-2 cloves finely. If using a fresh red chilli cut into small pieces. Remove the seeds if you prefer it less spicy.",
    "Prepare a broth made with water, 2/3 of the tomato passata/purée (1:1), and the tomato paste and salt, and bring to a boil and simmer. You want the broth to be a bright red and tasty, but still a broth. This broth needs to be hot when you add it to the spaghetti, otherwise you will lower the cooking temperature for the pasta.",
    "In a cast iron pan, add ½ cup of olive oil, 2 garlic cloves (one whole one chopped), and red chili pepper according to how spicy you want your spaghetti to be. Cook the garlic over a high flame until golden then remove the whole garlic clove and pour in the 1/3 of undiluted tomato passata/purée. To temper the acidity from the tomatoes, you can add 1 tsp. sugar.",
    "Spread the passata over the whole pan with a wooden spoon and let it reduce and thicken slightly. At this point put the uncooked spaghetti in the pan, distributing the pasta a way that it lies on top of the sauce. NB the passata will spit when first poured into the pan so take care not to get burnt",
    "Wait for the underside of the spaghetti to start caramelizing before turning it over. This must be done carefully, a little at a time using a spatula. Let the otherside of the spaghetti start to crisp a little and then pour in a ladle of the hot tomato broth. It’s better not to pour it over the spaghetti but to add it to the sides of the pan.",
    "At this point the spaghetti should start to soften enough that you can move and stir it gently with a wooden spoon. Move any pasta strands that might have stuck to the bottom of the pan and allow the tomato broth to spread. Once the tomato broth has reduced and the spaghetti starts to stick a little again add more broth.",
    "Keep repeating this step (adding tomato broth and stirring the spaghetti) until the spaghetti is coated in the sauce and cooked. If you run out of tomato broth, you can add a little water. NB when finished, this dish is relatively dry and crispy, not saucy.",
    "I added cherry tomatoes which I had first sautéed in the iron pan before starting on the pasta. I removed them from the pan and then just added them back when my spaghetti all’assassina was ready. This step is optional.",
    "Serve your spaghetti all’assassina immediately topped with Parmigiano, stracciatella or just as is."
  ]
}