{
  "title": "Spaghetti alla Chitarra con Pallottine (Pasta with Abruzzese Meatballs and Lamb Sugo)",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Pallottine",
    "20g / 1 piece day-old country bread, crust removed",
    "118g / ½ cup milk",
    "227g / 8 oz ground beef",
    "22g / ¼ cup finely grated pecorino romano",
    "18g / 1 egg yolk",
    "14g / 1 Tbsp olive oil, plus more q.b.",
    "4g / 1¼ tsp salt",
    "Sugo",
    "454g / 1 lb bone-in lamb shoulder",
    "Salt, q.b.",
    "75g / ¼ fennel bulb, cored",
    "75g / 1 stalk celery",
    "63g / ¼ onion",
    "112g / ½ cup olive oil",
    "55g / 11 cloves garlic, finely chopped",
    "73g / ⅓ cup dry white wine",
    "577g / 2¼ cups whole San Marzano tomatoes, crushed by hand",
    "¾tsp black peppercorns",
    "1fresh bay leaf",
    "½tsp dried red chile flakes",
    "1sprig rosemary",
    "To Finish",
    "1batch egg dough (this page)",
    "Ground red chile, q.b.",
    "30g / ⅓ cup finely grated pecorino romano"
  ],
  "directions": [
    "1 - To make the pallottine, break down the bread into pea-size or smaller pieces by rubbing the pieces between your palms. Place the bread in a small bowl and cover with the milk. Let soak until completely softened, 20 to 30 minutes.",
    "2 - While the bread is soaking, place the beef, pecorino, egg yolk, olive oil, and salt in a bowl and mix until well incorporated.",
    "3 - Drain the milk from the bread, reserving the milk. Press and squeeze the bread to force out most of the excess liquid. Make sure the bread is separated into small, crumb-like pieces. Measure 20g / 1 Tbsp plus 1 tsp of the drained milk and discard the rest.",
    "4 - Add the bread and measured milk to the beef mixture and mix well. Make a small patty to test your seasoning.",
    "5 - Place a small sauté pan over medium heat and add a drizzle of oil. Add the test patty and cook, turning once, until cooked through but still slightly pink in the center, about 3 minutes. Check your seasoning and add more salt to the pallottine mixture q.b.",
    "6 - Cover and refrigerate the mixture for 30 minutes to 1 hour. (You can skip this step, but the mixture is quite wet and can be challenging to work with at room temperature.)",
    "7 - Oil a sheet pan. Form the mixture into 70 to 80 pallottine, each weighing 3 to 4g, placing them on the prepared pan as you shape them. (You can weigh the first few to get comfortable with the size and then go from there.)",
    "8 - Chill the pallottine in the refrigerator for 30 minutes to 1 hour to help them hold their shape.",
    "9 - To make the sugo, season the lamb on all sides with salt q.b. Let sit for at least 1 hour or up to 24 hours in the refrigerator. If refrigerated, bring to room temperature.",
    "10 - Fit your meat grinder with the small die. Chop the fennel, celery, and onion into ½- to 1-inch pieces. Put the fennel, celery, and onion through the meat grinder. Once all are ground, gather them in cheesecloth and wring to squeeze out the excess liquid. This is your soffritto.",
    "11 - Place a large, heavy sauce pot or Dutch oven over medium heat and add 56g / ¼ cup of the oil. Add the lamb and sear, turning as needed, until golden brown, 3 to 5 minutes on each side. Transfer the lamb to a plate and keep warm.",
    "12 - If a lot of brown bits from the lamb are left in the pot, wipe out the pot and return it to the heat. Add the remaining 56g / ¼ cup olive oil and the soffritto, turn down the heat to low, and gently cook, stirring frequently, until softened but without color, 6 to 8 minutes.",
    "13 - Toward the very end of cooking, add the garlic and gently cook until aromatic but without color, 10 to 15 seconds. Add the wine and simmer until reduced by half, 3 to 5 minutes.",
    "14 - Add the lamb back to the pot. Add the tomatoes and their juice and enough water (237 to 474g / 1 to 2 cups) just to cover the lamb.",
    "15 - Make a sachet with cheesecloth for the peppercorns, bay leaf, chile flakes, and rosemary and add to the pot. Cover the pot and gently simmer until the lamb is tender and falling off the bone, 2 to 3 hours.",
    "16 - Remove from the heat and let cool.",
    "17 - Once cooled, remove the sachet from the pot and discard. Remove the lamb from the liquid and let cool. Using two forks, pull the meat apart into fine strands, run a knife through to cut into smaller pieces, and then add back to the pot.",
    "18 - Measure 750g / 3¼ cups sugo and set aside. Transfer the remainder to an airtight container and refrigerate for up to 5 days or freeze for another use.",
    "19 - To finish, following the instructions for spaghetti alla chitarra on this page, make 624g / 1 lb 6 oz with the pasta dough.",
    "20 - Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "21 - Place a large sauté pan over medium-low heat and add the sugo. Then add the pallottine and cook them gently in the sauce, stirring to keep them poaching evenly, until cooked through, 3 to 4 minutes.",
    "22 - Add the spaghetti alla chitarra to the water and cook for 2 to 3 minutes, until tender but not soft.",
    "23 - Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Fold for 1 to 2 minutes to marry the pasta and the sugo. Add a generous pinch of ground chile and continue folding. If the sugo begins to tighten, add a splash of pasta cooking water to loosen and continue folding to marry. The sugo should nicely coat the pasta without clumping.",
    "24 - Divide the pasta into bowls and garnish with the pecorino and with ground chile q.b."
  ]
}