{
  "title": "Spaghetti With Pancetta, Black Pepper, And Spring Onions (Spaghetti con Pancetta, Pepe Nero e Cipollotti)",
  "source": "Pasta - Missy Robbins",
  "servings": "Servings 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "1(227g / 8 oz) piece pancetta",
    "624g / 1 lb 6 oz extruded spaghetti",
    "15g / 3 cloves garlic, finely chopped",
    "30g / 2 Tbsp unsalted butter, cold and cubed",
    "Black pepper, q.b.",
    "25g / ½ cup thinly sliced spring onion tops",
    "45g / ½ cup finely grated parmigiano-reggiano"
  ],
  "directions": [
    "1. Chill the meat grinder and the larger of the two dies (or the medium die if you have three) for at least 1 hour before grinding. Cut the pancetta into ½- to 1-inch cubes and chill in the freezer until cold, about 15 minutes. You do not want them frozen, but you do want them colder than they will get in the refrigerator.",
    "2. Fit the grinder with the large (or medium) die. Grind the pancetta twice.",
    "3. Place a large sauté pan over very low heat and add the pancetta. Slowly cook, stirring occasionally, until the fat is rendered and the meat is cooked but not crispy, 10 to 15 minutes. Separate the meat from the fat, reserving both.",
    "4. Bring a large pot of water to a boil over high heat. Lightly salt the water. (Pancetta has a high salt content. Go too heavy with your pasta water and your finished dish will end up very salty.)",
    "5. Add the spaghetti to the water and cook for 5 to 8 minutes, until al dente.",
    "6. While the pasta is cooking, place a large sauté pan over low heat and add 55g / ¼ cup of the rendered pork fat. Add the garlic and gently cook until aromatic but without color, 10 to 15 seconds.",
    "7. Add the cooked pancetta and 3 ladles (170g / ¾ cup) pasta cooking water to the pan and stir to combine.",
    "8. Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Toss for 1 to 2 minutes to marry the pasta and the sauce. Because of the high level of fat, the sauce will tighten quickly, so you will need to add more pasta cooking water to emulsify.",
    "9. Add the butter to the pan and continue tossing to emulsify.",
    "10. Remove the pan from the heat and add a very generous amount—20 to 30 grinds—black pepper and toss to incorporate. Add half of the spring onion tops and toss. Add half of the parmigiano and continue tossing. If your sauce tightens again, add a bit more pasta cooking water to loosen until the pasta glides easily in the pan. When properly married, it should have a glossy sheen.",
    "11. Divide the pasta into bowls and garnish with the remaining spring onion tops and parmigiano."
  ]
}