{
  "title": "Spaghetti Vongole",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Clams",
    "3dozen littleneck clams",
    "224g / 1 cup olive oil",
    "25g / 5 cloves garlic, sliced",
    "660g / 3 cups white wine",
    "10sprigs thyme",
    "2g / 1 tsp dried red chile flakes",
    "To Finish",
    "624g / 1 lb 6 oz extruded spaghetti (this page)",
    "42g / 3 Tbsp olive oil",
    "5g / 1 clove garlic, finely chopped",
    "30g / 2 Tbsp unsalted butter, cold and cubed",
    "Peel of 1 lemon, pith removed and peel finely chopped, and fruit halved and reserved for juicing",
    "20g / ¼ cup finely chopped parsley",
    "Dried red chile flakes, q.b."
  ],
  "directions": [
    "1 - To prepare the clams, place them in a bowl of cold water to soak. Every 10 minutes, drain, rinse away the grit that has accumulated at the bottom of the bowl, and refill with fresh water, continuing until you see no grit after draining, after at least 1 hour of soaking.",
    "2 - Place a large sauté pan over medium heat and add the olive oil. Add the sliced garlic and cook until aromatic but without color, 10 to 15 seconds.",
    "3 - Working in batches, add the clams to the pan along with the wine, thyme, and chile flakes and cook, stirring occasionally, until the first clam opens. If you want to speed up this process, cover the pan to cook the clams, but begin checking them after 1 minute, removing each one as soon as it opens and transferring it to a bowl.",
    "4 - When the clams are cooked, strain the cooking liquid through a fine-mesh strainer. Measure out 228g / 1 cup liquid and set aside.",
    "5 - Remove the meat from each clam and discard the shells. Chop half of the clams and add them back to the bowl with the whole clams.",
    "6 - To finish, bring a large pot of water to a boil over high heat. Generously salt the water.",
    "7 - Add the spaghetti to the water and cook for 5 to 8 minutes, until al dente.",
    "8 - While the pasta is cooking, place a large sauté pan over low heat. Add the olive oil and chopped garlic and cook until aromatic but without color, 10 to 15 seconds. Add the reserved clam cooking liquid to the pan. Add the butter and swirl to emulsify.",
    "9 - Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Toss for 1 to 2 minutes to marry the pasta and the sauce.",
    "10 - Add the chopped and whole clams and continue to toss for about 30 seconds to distribute the clams evenly and to continue marrying the pasta and the sauce. If the sauce begins to tighten, add a splash of pasta cooking water to loosen and continue tossing. (Check your seasoning, and if it’s already quite briny, use a splash of fresh water to loosen instead.) When the pasta is properly married, it will cling to the sauce and have a glossy sheen.",
    "11 - Add the lemon peel and parsley, season with chile flakes q.b., and toss to combine.",
    "12 - Remove from the heat. Squeeze in the juice from the lemon halves and divide into bowls."
  ]
}