{
  "title": "Spaghetti Meatballs",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Meatballs",
    "100g / scant 2 cups torn day-old country bread",
    "474g / 2 cups milk",
    "112g / ½ cup olive oil, plus more q.b.",
    "250g / 1 onion, very finely chopped",
    "15g / 3 cloves garlic, very finely chopped",
    "454g / 1 lb ground beef",
    "454g / 1 lb ground pork",
    "150g / 3 eggs",
    "45g / ½ cup finely grated pecorino romano",
    "45g / ½ cup finely grated parmigiano-reggiano",
    "6g / 1 Tbsp fennel seed",
    "7g / 2 tsp salt, plus more q.b.",
    "6g / 1 Tbsp dried red chile flakes",
    "4g / 1½ tsp garlic powder",
    "50grinds black pepper, plus more q.b.",
    "2.25kg / 9 cups simple red sauce (this page)",
    "To Finish",
    "624g / 1 lb 6 oz extruded spaghetti (this page)",
    "22g / ¼ cup finely grated pecorino romano",
    "Olive oil, q.b.",
    "3sprigs marjoram, leaves removed from stems",
    "3sprigs basil, small leaves removed from stems"
  ],
  "directions": [
    "1 - To make the meatballs, break down the bread into pea-size pieces by rubbing the pieces between your palms. Place the bread in a small bowl and cover with the milk. Let soak until completely softened, 30 to 45 minutes.",
    "2 - While the bread is soaking, place a sauté pan over low heat and add 56g / ¼ cup of olive oil. Add the onion and gently cook until very soft but without color, about 10 minutes. Add the garlic and gently cook until aromatic but without color, 10 to 15 seconds. Transfer the mixture to a large bowl to cool.",
    "3 - Once the onion mixture is cool, add the beef and pork and fold to combine.",
    "4 - Add the eggs, both cheeses, fennel, salt, chile flakes, garlic powder, and pepper and mix well.",
    "5 - Drain the milk from the bread. Press and squeeze the bread to force out most of the excess liquid. Make sure the bread is separated into small, crumb-like pieces. Add to the meat mixture and mix well.",
    "6 - Gradually add the remaining 56g / ¼ cup olive oil while mixing by hand to integrate. The mixture should be wet, but you should still be able to form balls that hold together. Make a small patty to test your seasoning.",
    "7 - Place a small sauté pan over medium heat and add a drizzle of olive oil. Add the test patty and cook, turning once, until cooked through, 2 to 3 minutes on each side. Check your seasoning and add more salt to the meatball mixture q.b.",
    "8 - Cover and refrigerate the mixture for 30 minutes to 1 hour.",
    "9 - Oil a sheet pan. Form the mixture into 17 to 20 balls, each about 112g. Place them on the prepared sheet pan.",
    "10 - Chill the balls in the refrigerator for 30 minutes to 1 hour to help them keep their shape.",
    "11 - Preheat the oven to 400°F.",
    "12 - Place the meatballs in the oven and bake until golden brown on the outside but not cooked all the way through, 10 to 15 minutes.",
    "13 - While the meatballs are in the oven, place a large, heavy sauce pot or Dutch oven over low heat. Add the red sauce.",
    "14 - Transfer the meatballs to the sauce and continue cooking over low heat until cooked through, about 15 minutes. (Do not boil your sauce or you’ll end up with tough meatballs.)",
    "15 - To finish, bring a large pot of water to a boil over high heat. Generously salt the water.",
    "16 - Place a large sauté pan over low heat. Add 563g / 2¼ cups of the sauce from your pot of meatballs. Add 1 to 2 ladles (55 to 115g / ¼ to ½ cup) pasta cooking water and stir to combine.",
    "17 - Add the spaghetti to the water and cook for 5 to 8 minutes, until al dente.",
    "18 - Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Toss for 1 to 2 minutes to marry the pasta and the sauce. If the sauce begins to tighten, add a splash of pasta cooking water to loosen and continue tossing to marry.",
    "19 - Divide the pasta into bowls and garnish with the pecorino, a drizzle of olive oil, and the marjoram and basil. Transfer the meatballs and sauce to a serving bowl and serve alongside the pasta."
  ]
}