{
  "title": "Spanish Zucchini Tortilla",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 to 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Red Pepper Almond Sauce",
    "3⁄4 cup (95 g) blanched slivered almonds",
    "1⁄2 cup (114 g) roughly chopped roasted red peppers",
    "1⁄4 cup (60 ml) olive oil",
    "2garlic cloves, smashed",
    "Juice of 1 lemon",
    "1⁄2 teaspoon sweet smoked paprika",
    "1⁄4 teaspoon cayenne",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Tortilla",
    "1⁄2 cup (120 ml) olive oil",
    "1large zucchini (about 12 ounces/340 g), sliced into rounds 1⁄8 inch (3 mm) thick on a mandoline",
    "1teaspoon kosher salt, plus more to taste",
    "1large Yukon Gold potato (about 8 ounces/227 g), sliced into rounds 1⁄8 inch (3 mm) thick on a mandoline",
    "1small white onion, sliced into rounds 1⁄8 inch (3 mm) thick on a mandoline",
    "Freshly cracked black pepper, to taste",
    "8eggs"
  ],
  "directions": [
    "1. Prepare the almonds for the sauce: Place the almonds in a small bowl, and cover with 2 inches (5 cm) of boiling water. Soak for 1 hour at room temperature and then strain, reserving 1⁄4 cup (60 ml) of the soaking liquid.2. Meanwhile, preheat the oven to 350°F (180°C) with a rack positioned in the center.3. Make the tortilla: Heat the olive oil in a 10-inch (25 cm) well-seasoned carbon-steel or oven-safe nonstick skillet over medium-high heat. Add the zucchini in two batches, and fry, stirring often, until golden, 6 to 8 minutes. (Doing this in batches is essential to get nicely golden zucchini.) Transfer to a paper towel, sprinkle with a little salt, and repeat with the remaining zucchini.4. Add the potato and onion to the skillet in an even layer, and season with a touch of salt and pepper. Reduce the heat to medium-low, cover, and cook, uncovering the pan to stir occasionally, until the potatoes are just fork-tender (not overly soft), 8 to 12 minutes. The goal is to cook the potatoes through, not to brown them, so adjust the heat as needed.5. Meanwhile, whisk together the eggs and 1 teaspoon salt in a large bowl until homogeneous.6. When the potatoes and onions are cooked, drain them from the oil using a slotted spoon and add them to the eggs along with the fried zucchini. Stir to combine.7. Increase the heat to medium, and heat the oil left in the pan. When hot, add the egg mixture, and cook, stirring as you would for scrambled eggs, until the eggs are somewhat cooked but still quite soft and runny, 1 or 2 minutes. Turn off the heat, and flatten the egg mixture into an even layer.8. Transfer to the oven, and bake for 10 to 15 minutes, until just set.9. Run a spatula around the sides of the tortilla to loosen, and shake the pan to ensure the eggs are fully released from the pan. Invert onto a plate. The tortilla should be golden. Set aside.10. Make the sauce: Place the almonds, reserved almond soaking liquid, peppers, olive oil, garlic, lemon juice, paprika, and cayenne in a high-powered blender, and blend on high until very smooth. Season with salt and pepper.11. Cut the tortilla into wedges, and serve with the sauce on the side."
  ]
}