{
  "title": "Speculoos Babka",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 2 babkas",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "Dough",
    "1cup speculoos cookie butter (9.9 oz / 280g)",
    "2tablespoons plus 1½ sticks unsalted butter (7 oz / 200g), melted and cooled",
    "1tablespoon plus 2 teaspoons ground cinnamon",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "1⅓cups all-purpose flour (6.1 oz / 173g), plus more for rolling out",
    "½cup packed light brown sugar (3.5 oz / 100g)",
    "Sweet Yeast Dough (this page)",
    "1large egg, beaten"
  ],
  "directions": [
    "Prepare the pans: Brush the bottom and sides of two standard loaf pans with a thin layer of melted butter. Line the bottom and two longer sides of each pan with a long piece of parchment paper, leaving an overhang of a couple of inches on either side. Brush the parchment lightly with butter and set the pans aside.",
    "Make the filling: In a small bowl, combine the speculoos cookie butter, 2 tablespoons of the melted butter, 1 tablespoon of the cinnamon, and ½ teaspoon of the salt and stir until the mixture is smooth. Cover and set the cookie butter mixture aside.",
    "Make the brown sugar crumble: In a medium bowl, combine the flour, brown sugar, and the remaining 1½ sticks (6 oz / 170g) melted butter, 2 teaspoons cinnamon, and ½ teaspoon salt. Use a fork to work the butter fully into the other ingredients until you have a uniformly crumbly mixture that holds together easily when squeezed. Set the crumble aside.",
    "Roll out the dough: Turn the dough out onto a lightly floured surface. Divide the dough in half (each piece will weight about 1½ lbs), then cover one half and put it back in the refrigerator. Use the heel of your hand to press down all over the other half of the dough to expel the built-up gas from the first rise. Tugging at the edges to form four corners, stretch the dough to coax it into an even rectangular shape. Dust the top and underside of the dough with more flour and roll it out, dusting with more flour as needed, into a thin rectangle measuring about 18 × 10 inches. Make sure a long side of the dough is facing you, with the shorter sides to your left and right.",
    "Fill the dough and twist: Scrape half of the cookie butter mixture onto the dough and spread with a small offset spatula in an even layer across the entire surface, leaving a ½-inch border along the long side that’s farther from you. Starting at the long side closer to you, roll up the dough like a jelly roll into a tight spiraled log, then pinch firmly along the seam to seal it and rest it seam-side down on the surface. Squeeze the log where it’s a bit thicker in the center and tug outward to elongate and even out the thickness. Bring the ends of the dough together, lining up the two sides of the log so they’re parallel to each other and bending at the midpoint to maintain the alignment (like the shape of a tuning fork). Twist the lengths of dough around each other twice to form a short, tight corkscrew, then transfer the coil to one of the prepared loaf pans. Press down gently on the twist to flatten it into the pan, then cover with plastic wrap and set aside. Repeat the rolling, filling, and twisting process with the remaining piece of dough and cookie butter mixture.",
    "Proof the babkas: Let the babkas sit covered at room temperature until the dough is very puffy and the babkas are about 50 percent expanded in size, 40 to 60 minutes.",
    "Preheat the oven: Meanwhile, arrange an oven rack in the center position and preheat the oven to 350°F.",
    "Top with the crumble and bake: Uncover the pans and brush the surfaces of both babkas with the egg. Heap the crumble over the dough, breaking up any larger pieces and dividing evenly. Make sure the dough is completely covered, but let the crumbs fall down around the sides if they want. Bake the babkas side by side until the tops are risen, very well browned, and firm to the touch and an instant-read thermometer inserted into the center of each loaf registers 185°F, 55 to 65 minutes.",
    "Let cool and serve: Remove from the oven and let the babkas cool in their pans for 20 to 25 minutes. Use a small offset spatula or paring knife to cut down between the babkas and the shorter sides of the pans, then use the parchment to lift out the babkas and transfer to a wire cooling rack. Let cool completely before slicing and serving."
  ]
}