{
  "title": "Spicy Cumin Lamb Biang Biang Noodles",
  "source": "Thewoksoflife.com",
  "servings": "Serves: 2 servings",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "For the noodles:",
    "1½cups bread flour",
    "¼teaspoon salt",
    "½cup, plus 1 tablespoon water",
    "For the lamb & sauce:",
    "8oz. fatty lamb shoulder or chuck, thinly sliced",
    "1tablespoon vegetable oil, plus 3 tablespoons (divided)",
    "1tablespoon rice wine, plus 2 tablespoons (divided)",
    "1teaspoon cornstarch",
    "1½tablespoons cumin seeds",
    "2teaspoons coriander seeds",
    "¼teaspoon freshly ground white pepper",
    "1tablespoon grated ginger",
    "2scallions, chopped (white parts and green parts separated)",
    "7cloves garlic, minced",
    "1long hot red or green chili pepper, de-seeded and thinly sliced",
    "3tablespoons chili oil, preferably homemade",
    "1teaspoon sugar",
    "1teaspoon black vinegar or rice vinegar",
    "1tablespoon soy sauce",
    "½teaspoon salt",
    "1small red onion, thinly sliced",
    "½cup finely diced Chinese celery or regular celery (optional)",
    "3cabbage leaves, roughly chopped",
    "½cup garlic chives, roughly chopped (optional)"
  ],
  "directions": [
    "First, make the noodle dough. In the bowl of a stand mixer, add the bread flour, salt and water. Combine the mixture with your hands or a fork until it starts to form a scraggly dough. Once the dough has come together a bit, attach the bowl to the mixer fitted with the dough hook attachment, and turn it on low speed (setting “2” on a KitchenAid). Allow the mixer to knead the dough for 20 minutes. By the end, the dough will have formed a ball that: doesn’t stick to the sides of the bowl, is smooth and elastic, and isn’t too dry.",
    "You’ll know the dough is done when you can rip off a piece of it and stretch it slowly by a couple inches without it breaking apart. If the dough breaks, knead for another 3-5 minutes (to allow the dough to absorb more moisture). If it still won’t stretch, try adding a tablespoon of water and kneading by hand to incorporate the water. Then transfer it to the mixer once again and allow the dough hook to do its work for another 5 minutes. You need to give the dough time to absorb the moisture uniformly.",
    "If, on the other hand, your kitchen is humid and the dough is a bit sticky, sprinkle in some more flour and knead for another 3-5 minutes.",
    "Once the dough has reached the right consistency, cover it with plastic wrap or an overturned bowl (as long as the bowl is not touching the dough) and allow it to rest for 1 to 2 hours.",
    "Now, get the rest of your ingredients ready. Combine the sliced lamb with 1 tablespoon vegetable oil, 1 tablespoon rice wine, and 1 teaspoon cornstarch. Set aside to marinate.",
    "In a clean, dry pan over medium heat, add the cumin seeds, coriander seeds, and white pepper. Toast the spices until fragrant, about 5 minutes. Coarsely grind the spices in a spice grinder or mortar & pestle. Set aside. Prepare all your vegetables, and set those aside as well.",
    "Now you’re ready to make the noodles. Line a baking sheet with parchment paper, and transfer the rested dough to a clean, oiled surface. Press the dough into a half-inch thick, relatively even rectangle about 10 inches in length. Cut the rectangle into 10 equal strips. Take each strip and lay flat on the counter. Use your palm to flatten the strip into a long, wide, flat noodle––don’t worry about it being perfectly straight or even.",
    "Now, the next step is how this noodle got its name. Pick up the noodle on both ends, lift it, and gently slap it repeatedly on the counter while stretching it out. You can also use your hands to flatten it out further so that the noodle has a relatively uniform thickness. The noodles should be about the thickness of spaghetti––if they are translucent at all, they’re too thin. Lay them onto your parchment-lined baking sheet, and repeat the process until you have all 10 noodles. If you run out of space on the parchment paper, just put another layer of parchment on top. You can keep the noodles this thick, or if you like thinner ones, you can slice each noodle in half lengthwise using a sharp knife. Cover the noodles with plastic wrap so they don’t dry out.",
    "Bring a large pot of water to a boil. The noodles will take approximately 90 seconds to cook, so make sure you time it right so that they’re cooked and drained around the same time that your sauce is done.",
    "To make the sauce, heat 3 tablespoons of vegetable oil in a large wok over medium heat. Add the ginger and scallion whites and cook for 1 minute. Add the garlic and chili pepper, and cook for another 30 seconds. Crank up the heat to high and add the marinated lamb. Stir-fry the lamb until just browned, and immediately add 2 tablespoons rice wine, along with your prepared spice mixture, the chili oil, sugar, vinegar, soy sauce, salt, onions, and celery (if using). If things are starting to stick to the bottom of the wok, add a ¼ cup or so of water to deglaze it.",
    "While that’s going, throw your noodles and the cabbage into boiling water, and cook for 90 seconds to 2 minutes.",
    "Transfer the cooked noodles and cabbage to the wok along with the garlic chives and scallion greens, and toss until everything is completely coated in the sauce.",
    "Serve!"
  ]
}