{
  "title": "Spicy Salmon Bibimbap/Korean Rice Bowl",
  "source": "Ladyandpups.com",
  "servings": "Serves: 4",
  "categories": [
    "Korean"
  ],
  "ingredients": [
    "SPICY SALMON TARTARE:",
    "14oz (400 grams) skinless sashimi-grade salmon fillet",
    "1clove garlic, smashed",
    "2tbsp finely diced scallion",
    "1 1/2tbsp (21 grams) soy sauce",
    "1tbsp (25 grams) gochujang/Korean chili paste",
    "1 1/2tsp toasted sesame oil",
    "1 1/2tsp toasted sesame seeds",
    "1/2tsp gochugaru/Korean chili flakes",
    "1/4tsp (2 grams) honey",
    "1/8tsp freshly ground black pepper",
    "BIBIMBAP SAUCE:",
    "1/4cup (96 grams) gochujang/Korean chili paste",
    "1tbsp (19 grams) honey",
    "1grated garlic",
    "1tsp water to loosen",
    "quick pickled cucumber banchan",
    "finely diced kimchi",
    "raw egg yolks",
    "steamed short grain rice, warm or room-temperature",
    "toasted sesame oil to drizzle"
  ],
  "directions": [
    "MAKE SPICY SALMON TARTARE: Start at least 6 hours or the day before. With a very sharp knife, cut the salmon fillet into thin slice, then thin strips, then dice into tiny cubes. Mix evenly with smashed garlic, diced scallion, soy sauce, gochujang, toasted sesame oil and seeds, chili flakes, honey and ground black pepper. Cover and let marinate in the fridge for at least 6 hours to overnight. I find it best in between 12 ~24 hour, but it will keep fresh up to 2 days in the fridge.",
    "MAKE BANCHAN (SMALL DISHES): You can buy these “small dishes” in Korean grocery stores, but they are actually super easy to make at home. I like to keep the seasoning on the mild side because remember, you have to leave room for saltiness from the bibimbap sauce. Again, start a few hours ahead or the day before. They will keep up to 4 days in the fridge.",
    "SPINACH AND SESAME PASTE BANCHAN: Place 10.6 oz (300 grams) of cleaned and cut spinach into a large bowl. Toss evenly with 1 1/2 tsp of salt and let sit for 3 min. Then massage/knead the salt into the spinach until wilted and let sit for another 3 min. Fill the bowl with clean water to wash away the salt, then squeeze the spinach in small handfuls to get rid of as much water as you can, then set aside. Heat 1 tbsp toasted sesame oil in a skillet over high heat, then cook the spinach for 2 min until cooked through. Transfer into a bowl, and toss with 1 tsp toasted sesame paste, 1 tsp toasted sesame seeds and 1/8 tsp of ground black pepper. Let sit for a few hours until needed.",
    "SOY BEAN SPROUT BANCHAN: Place 7 oz (200 grams) cleaned soy bean sprouts in a large bowl. Toss evenly with 1 tsp salt and let sit for 3 min. Then massage/knead the salt into the bean sprouts until slightly wilted, and let sit for another 3 min. Fill the bowl with clean water to wash away the salt, then squeeze out as much water out of the bean sprout as you can. Set aside. Heat 1 1/2 tbsp toasted sesame oil in a skillet over high heat, then cook the bean sprouts for 2~3 min until cooked through. Transfer into a bowl and toss with 1/2 tsp toasted sesame seeds, 1/2 tsp chili flakes and 1/8 tsp ground black pepper. Let sit for a few hours until needed.",
    "CARAMELIZED MUSHROOMS BANCHAN: Wash and thinly slice 10 oz (280 grams) assorted mushrooms. Heat 1 1/2 tbsp toasted sesame oil and 1 tbsp olive oil in a large skillet over high heat. Add the mushrooms and 1/4 tsp ground black pepper, toss briefly, then leave them unmoved for 2 min until the first sides are deeply caramelised. Flip and turn, and cook for a few min more until evenly caramelised on all sides (they should lose almost 2/3 of the volume). Add 2 finely minced garlic, 1 tsp soy sauce and 1/4 tsp rice vinegar, then toss and cook for another 1 min. Transfer into a bowl and toss with 1/2 tsp toasted sesame seeds. Let sit for a few hours until needed.",
    "MISO LENTIL BANCHAN: Bring a small pot of water to boil, then add 3/4 cup (120 grams) washed lentils. Cook for 15 ~ 18 min until soft, then drain really well through a sieve. Transfer into a bowl, then add 2 tbsp diced scallion, 1/2 tsp grated ginger, 2 tsp miso paste, 2 tsp toasted sesame oil, 1 tsp toasted sesame seeds, 1/8 tsp black pepper, and a small pinch of sugar. Toss to evenly combine, and let sit for a few hours until needed.",
    "QUICK PICKLED CUCUMBER BANCHAN: Thinly slice 2 baby cucumbers (about 175 grams) and place in a large bowl. Evenly mix with 1 tsp of salt and let sit for 3 min. Massage/knead the salt into the the slices until slightly wilted, then let sit for another 2 min. Rinse off the excess salt and squeeze as much liquid out of the cucumbers as you can. Then transfer to a bowl and mix with 1/2 grated garlic, 1 1/2 tsp toasted sesame oil, 1/2 tsp toasted sesame seeds, 1/4 tsp rice vinegar and a small pinch of sugar. Let sit for a few hours until needed.",
    "TO ASSEMBLE: I like to keep the ratio between rice and toppings at around 1:1. Place a bed of luke warm if not room-temperature rice on the bottom of the bowl, then top it with equal and small amount of each vegetable banchan, diced kimchi, and spicy salmon tartare (I like a bit more spicy salmon in proportion). Place a raw egg yolk in the middle and 2~3 tsp of bibimbap sauce, then drizzle with 1 tsp of toasted sesame oil over the top. Mix the whole thing together and serve. PS: this recipe makes for a great lunch box or picnic option!"
  ]
}