{
  "title": "Spiced Sticky Date Cake",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "Makes 12 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "- Unsalted butter for greasing the pan",
    "- 1 lb / 450g fresh soft dates, pitted",
    "- 2 tsp baking soda",
    "- 2¼ cups / 530ml very hot water",
    "- 1 vanilla bean",
    "- 1½ cups / 300g granulated sugar",
    "- 1 egg, plus an additional yolk",
    "- 2 cups / 270g low-gluten cake flour",
    "- 2 tsp baking powder",
    "Sauce",
    "- 2¼ cups / 400g packed dark brown sugar",
    "- ⅓ cup / 70g unsalted butter",
    "- 1 cup / 240ml heavy cream",
    "- 2½ Tbsp whiskey, or as needed",
    "- 2 tsp ground chili flakes, or as needed",
    "- ½ tsp Ground Roasted Sichuan Pepper (this page), or as needed",
    "- Ice cream for serving",
    "- Sichuan Chili Crisp (optional; this page)"
  ],
  "directions": [
    "1. Preheat the oven to 350°F / 175°C. Butter a 10 by 14-inch / 25 by 36cm glass or metal baking dish.",
    "2. In a small bowl, combine the dates and baking soda. Pour the hot water over both and mix with a fork for about 5 minutes, until mostly dissolved and pulpy.",
    "3. In a medium bowl, scrape the seeds from the vanilla bean, add the sugar, egg, and additional yolk, and whisk for about 4 to 5 minutes, until the mixture is pale yellow and creates smooth ribbons when lifted with a spoon. Stir in the date mixture and incorporate completely, about a minute.",
    "4. In a small bowl, sift together the flour and baking powder. Gently fold the flour mixture into the date mixture just until incorporated.",
    "5. Pour the batter into the prepared baking dish and bake until a toothpick inserted in the center comes out clean, 40 to 45 minutes. Turn off the oven and let the cake rest in the oven for 40 minutes.",
    "6. To make the sauce: While the cake is baking, in a large heavy-bottomed saucepan over low heat, stir the brown sugar into the butter, melting the butter and dissolving the brown sugar. As soon as the sugar has dissolved, pour in the cream in a slow and steady stream, whisking constantly. Remove the saucepan from the heat and whisk in the whiskey, chili flakes, and roasted Sichuan pepper. Adjust as necessary to taste.",
    "7. Remove the cake from the oven. Pierce it all over about twenty times with a butter knife and spread half of the sauce over the top, allowing it to seep into the holes on the cake. Set the cake and the remaining sauce aside until ready to serve.",
    "8. When ready to serve, reheat the cake in the oven at 300°F / 150°C and the remaining sauce in a small pan over low heat. Drizzle the remaining sauce on top of the cake and serve with ice cream. Try adding chili crisp to your ice cream as well! The cake can be stored at room temperature in the baking dish covered in plastic wrap for 1 day or in the refrigerator for up to 3 days."
  ]
}