{
  "title": "Spicy Green Marinated Mushrooms",
  "source": "By Heart - Hailee Catalano",
  "servings": "Makes about 1 quart (1 L)",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "6tablespoons plus 1⁄2 cup (120 ml) olive oil, divided",
    "2pounds (907 g) cremini (also known as baby bella) mushrooms, cleaned, stems trimmed, and halved or quartered if larger than 1 inch (2.5 cm)",
    "2teaspoons kosher salt, plus more to taste",
    "Freshly cracked black pepper, to taste",
    "11⁄2 ounces (43 g) fresh dill fronds and tender stems (from about 1⁄4 large bunch)",
    "11⁄2 ounces (43 g) fresh parsley leaves and tender stems (from about 1 large bunch)",
    "1ounce (28 g) fresh basil leaves (from about 1⁄2 large bunch)",
    "Zest of 2 lemons",
    "Juice of 1 lemon",
    "2tablespoons honey",
    "1teaspoon dried oregano",
    "4oil-packed anchovy fillets",
    "2serrano peppers, roughly chopped (seeded and deveined if you’re timid with spice)",
    "1garlic clove, finely grated"
  ],
  "directions": [
    "1. Coat a large skillet with 3 tablespoons olive oil, and heat over high heat until the oil is very hot and has just started to smoke.2. Add half of the mushrooms, cap side down and in an even layer, and let them cook, without stirring, until deeply seared, about 5 minutes.3. Flip and char the second side, about 2 minutes more. Season with a hefty pinch of salt and a few grinds of pepper. Transfer to a sheet tray or large plate, and repeat with another 3 tablespoons oil and the remaining mushrooms. Let cool completely to room temperature.4. While the mushrooms cool, bring a small pot of water to a boil over high heat. Prepare a large ice bath.5. Add the dill, parsley, and basil to the boiling water, and blanch for 30 seconds.6. Immediately transfer to the ice bath to shock and cool. Squeeze out all excess moisture from the herbs.7. Roughly chop the herbs and then transfer to a blender along with the remaining 1⁄2 cup (120 ml) oil, lemon zest, lemon juice, honey, 2 teaspoons salt, oregano, anchovies, serranos, and garlic. Blend until smooth.8. Transfer the mushrooms to a medium bowl, add the green sauce, and toss to coat.9. Serve right away (they are so perfectly yummy as is), or transfer to an airtight container to marinate in the refrigerator for a few hours or overnight.10. Store in the refrigerator for up to 3 days. The mushrooms won’t be as green after marinating in the refrigerator for some time, but they will be extra delicious."
  ]
}