{
  "title": "Spiced Date and Pecan Sticky Buns",
  "source": "By Heart - Hailee Catalano",
  "servings": "Makes 9 Buns",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Dough",
    "195grams (11⁄2 cups) all-purpose flour",
    "200grams (11⁄2 cups) bread flour",
    "2tablespoons granulated sugar",
    "1tablespoon kosher salt",
    "11⁄2 teaspoons instant yeast (I like Saf-instant brand)",
    "260grams (1 cup plus 1 tablespoon) whole milk",
    "4tablespoons unsalted butter, at room temperature, plus more for greasing",
    "Filling",
    "145grams (about 8 large) Medjool dates, pitted",
    "3tablespoons unsalted butter, at room temperature",
    "3tablespoons honey",
    "2teaspoons ground cinnamon",
    "1⁄2 teaspoon ground cardamom",
    "1⁄2 teaspoon kosher salt",
    "Caramel",
    "120grams (1⁄2 cup) heavy cream",
    "55grams (1⁄4 cup) packed dark brown sugar",
    "3tablespoons honey",
    "1teaspoon kosher salt",
    "1teaspoon vanilla bean paste",
    "120grams (1 cup) finely chopped pecans, toasted (see Tip)",
    "Flake salt, for topping"
  ],
  "directions": [
    "1. Make the dough: Add the all-purpose flour, bread flour, sugar, salt, yeast, milk, and butter to the bowl of a stand mixer fitted with a dough hook. Mix on low to combine.",
    "2. Increase the speed to medium, and mix until the dough is smooth and has pulled away from the sides of the bowl, about 4 minutes. Increase the speed to medium-high, and mix until the dough can be stretched out fairly thin without tearing, 8 to 10 minutes. You may need to hold onto the mixer to stabilize it during this process!",
    "3. Transfer the dough to a large, greased bowl, cover with plastic wrap, and let rise until it doubles in size, about 2 hours. (This time will depend on how warm your kitchen is, but it shouldn’t take longer than 21⁄2 hours.)",
    "4. Meanwhile, make the filling: Add the dates to a small bowl, and cover with hot water to soak until softened, 15 minutes. Drain.",
    "5. Add the soaked dates, butter, honey, cinnamon, cardamom, and salt to a food processor, and process until mostly smooth. A few small chunks are okay!",
    "6. Grease a 9-inch (23 cm) square baking dish all over with butter.",
    "7. Make the caramel: Heat the cream, brown sugar, honey, salt, and vanilla in a small saucepan over medium heat. Cook, whisking, until bubbly and slightly thick, 3 to 5 minutes. Stir in the pecans and then pour the caramel into the baking dish and spread to cover the bottom. Set aside while you prepare and shape the rolls.",
    "8. When the dough has risen, roll it out to an 11 × 14-inch (28 × 35.5 cm) rectangle on a lightly floured surface.",
    "9. Add the filling, and spread it out edge to edge. Starting with the longest side, roll up the dough as tight as you can into a log. Using a sharp knife (serrated works great), cut the log into thirds. Cut each third into thirds to form 9 even buns.",
    "10. Place the buns on top of the caramel in the baking dish, and lightly cover with a kitchen towel.",
    "11. Let the buns rise until doubled in size and touching, 1 to 11⁄2 hours.",
    "12. Preheat the oven to 375°F (190°C) with a rack positioned in the center.",
    "13. Bake for 35 to 45 minutes, until the buns are deeply golden brown and an instant-read thermometer reads 195°F (90°C) in the center of the bun.",
    "14. Let cool for 10 minutes and then carefully invert the buns onto a serving plate. Serve warm, sprinkled with a touch of flake salt. Store any leftovers in an airtight container for up to 2 days at room temperature. Reheat on a sheet tray in a 350°F (175°C) oven for 10 to 15 minutes. You also can do a quick reheat in the microwave.",
    "TIP. Toast the pecans on a sheet tray at 375°F (190°C) until golden and aromatic, 8 to 12 minutes."
  ]
}