{
  "title": "Spiced and Braised Short Ribs with Creamy Potatoes",
  "source": "Allison Roman - Not So Fancy",
  "servings": "4",
  "categories": [],
  "ingredients": [
    "5pounds bone-in short ribs, 1½-2 inches thick",
    "Kosher salt and freshly ground black pepper 2 tablespoons canola or vegetable oil",
    "1½pounds Yukon Gold potatoes (about 4), quartered lengthwise",
    "2small yellow onions, quartered",
    "6garlic cloves, thinly sliced",
    "4whole chiles de arbol, or 1 teaspoon crushed red pepper flakes, plus more for serving",
    "2tablespoons cumin seeds",
    "2tablespoons fennel seeds",
    "1tablespoon coriander seeds",
    "½teaspoon ground cinnamon",
    "2tablespoons tomato paste",
    "1/2cup white wine vinegar",
    "3cups beef or chicken broth, or water",
    "1lemon, seeds removed, finely chopped"
  ],
  "directions": [
    "1 Season the short ribs with salt and lots of pepper. If you can do this the day before, even better (just store them uncovered and refrigerated).",
    "2 Preheat the oven to 325°F.",
    "3 Heat the oil in a large (at least 8-quart) Dutch oven over medium heat. Working in batches, sear the short ribs until deeply golden brown all on all sides, 12 to 15 minutes. Using tongs, transfer the short ribs to a large serving platter or rimmed baking sheet.",
    "4 Carefully (the pot is hot!) drain excess fat from the pot, leaving behind about 2 tablespoons of fat and any of the good bits.Add the potatoes, cut side down, and season with salt and pep-per. Cook, without disturbing, until they're nicely browned on one side, about 5 minutes. Give them a stir and continue to cook until browned a little more evenly. Using a slotted spoon, transfer the potatoes to the tray with the meat, leaving any bits and fat behind.",
    "5 Add the onion and garlic to the pot and season with salt and pepper. Cook, stirring occasionally, until the onions have a nice golden brown color, 5 to 8 minutes. Add the 4 whole chiles, cumin seeds, fennel seeds, coriander seeds, and cinna-mon, stirring to coat and toast the spices.Nothing Fancy",
    "6 Add the tomato paste and cook, stirring constantly, until it's started to caramelize on the bottom of the pot (adjust the heat as needed to make sure it doesn't burn before it caramelizes), about 2 minutes. Add the vinegar, broth, and half the lemon and bring to a simmer, scraping up all the bits on the bottom of the pot.",
    "7 Return the short ribs and potatoes to the pot, nestling everything in (if it's a tight squeeze, just make sure the short ribs get priority seating on the braise train, which is to say make sure they are submerged even if the potatoes are not). Cover and place the pot in the oven to roast until the short ribs are fall-ing-off-the-bone tender and the potatoes are impossibly creamy to the point of almost mush (but not yet mush), 2½ to 3 hours.",
    "8 Increase the oven temperature to 425°F and remove the lid.Continue to cook until the short ribs and any potatoes on top are browned and starting to crisp, and the liquid has reduced to a very nice, rich sauce, 25 to 35 minutes.",
    "9 Scatter the meat and potatoes with the remaining lemon, plus a bit of crumbled chile before serving."
  ]
}