{
  "title": "Spicy Cumin Lamb Burger",
  "source": "Ethanchlebowski.com",
  "servings": "Yield:4",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "For the meat:",
    "454g (1 lb) boneless lamb leg or lamb stew meat or ground lamb",
    "8g salt (1.5 tsp)",
    "15g (2 tbsp) cornstarch",
    "30g ( 2 tbsp) neutral oil for wok frying",
    "Aromatics + spices",
    "1scallion, sliced",
    "Knob of ginger, grated",
    "2garlic cloves, grated",
    "10g (2 tbsp) ground cumin seeds",
    "5g (1 tbsp) Chinese dry red chile powder (substitute: Cayenne)",
    "1/4red onion, sliced",
    "1longhorn or thai chile pepper, sliced (optional)",
    "Pinch of MSG (optional)",
    "250g flour",
    "5g salt",
    "3g yeast",
    "1g pinch (1/8 tsp) baking powder",
    "1g pinch (1/8 tsp) sugar",
    "125g room temp water"
  ],
  "directions": [
    "Slice the lamb into thin pieces roughly 1/8 inch (3 mm) thick. Add the sliced lamb to a mixing bowl with the salt, cornstarch. Mix together with your hands.",
    "Set a wok over high heat. Add 30 grams of the oil. Once shimmering just below the smoke point, add the scallion, ginger, and garlic. Stir fry for 30 seconds until fragrant, being careful not to burn. Immediately add the lamb and stir fry until it has developed nice browning on the exterior, about 5 minutes.",
    "Turn the heat to low, add the cumin, chile powder, onions, longhorn pepper. Stir everything to combine, cook for one more minute. Taste it, add a pinch of msg if using.",
    "Serve on top of noodles, over rice, or in a bread roll with the pickled onions and cilantro",
    "In a mixing bowl, add the flour, yeast, baking powder, sugar, and water. Mix with your hands to combine. Once formed into a rough dough, knead in the bowl for 3 to 5 minutes. Cover with plastic wrap and let rest for 20 minutes during which the dough will relax.",
    "After resting, knead the dough again for a minute and roll it into a rough log shape. Cut the dough into 4 equal pieces. Place the dough piece on the counter and grip it will rolling it into a ball against the counter into a round mound. Repeat with each piece.",
    "When rounded, flatten each piece with your hand and using a rolling pin roll it into a round cake about 4 inches across and about xx inch high. Repeat with each piece.",
    "Set a skillet over medium heat and let heat for 3 minutes. Turn the heat to low. Place a piece of dough on the pan and cover the pan. Cook the bread for a bout 1 minute a side until some brown spots appear. Flip each side once more to cook to ensure the dough is fully cooked. If there are any gray spots, the dough is still raw. The exterior should be browned and lightly crisp while steamy in the inside.",
    "Serve fresh or let cool to room temp and store in a plastic bag. Use as a vessel for spicy lamb burgers or any other creations."
  ]
}