{
  "title": "Spicy Chicken Thigh Roaster Sandwich",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes 4",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "Chicken",
    "¼cup kosher salt (Diamond Crystal or about half as much Morton)",
    "2tablespoons white sugar",
    "4boneless skinless chicken thighs (about 1½ pounds total)",
    "¼cup Nate’s Spicy Chicken Spices (this page)",
    "½juicy lemon",
    "Sandwiches",
    "4teaspoons unsalted butter, room-temp so it’s mayo-soft",
    "4Martin’s potato sandwich rolls",
    "Mayo (Duke’s or bust) for swiping",
    "8bun-size pieces iceberg lettuce",
    "12 to 16drained dill pickle chips",
    "1cup French’s Crispy Fried Onions"
  ],
  "directions": [
    "To brine and roast that chicken: Up to 12 hours or as little as 2 hours ahead, brine the chicken. Combine 4 cups water with the salt and sugar in a medium pot and set it over medium heat. Stir occasionally, just until the sugar and salt dissolve, then let it cool completely. If you’ve got the space in your fridge, stick the chicken thighs in the pot so they’re submerged in the brine and put it in the fridge. Otherwise, put the thighs and brine in a resealable bag and seal it.",
    "Get your oven to 400°F.",
    "Drain the chicken, pat it dry, and season all over with the chicken spices. Roast on a baking sheet until the center is cooked through (just cut into it and peek inside), about 15 minutes. Immediately squeeze on the lemon juice and let the chicken hang out while you toast your rolls.",
    "To assemble those sandwiches: Get a well-seasoned cast-iron skillet or griddle good and hot over medium heat.",
    "Swipe ½ teaspoon butter onto the cut side of each roll half, then cook the cut sides in batches until they’re dark golden brown. It goes quick, like 30 seconds to 1 minute. When they’re done, move them to the counter to build your sandwich.",
    "If the chicken thighs are big, cut them to fit on the rolls. Evenly swipe about 1 teaspoon mayo on each roll half. On each roll bottom, pile 2 lettuce leaves, 3 or 4 pickle chips, the chicken, and then ¼ cup of the fried onions. Top with the other half of the roll and go at it. Simple but awesome."
  ]
}