{
  "title": "Spicy Chicken, Eggplant, And Caramelized Onion Quesadillas With Mixed Tomato Salsa",
  "source": "Mesa Grill - Bobby Flay",
  "servings": "4",
  "categories": [
    "Mesa Grill - Bobby Flay"
  ],
  "ingredients": [
    "Spicy Chicken And Eggplant:",
    "- ¼ cup plus 3 tablespoons olive oil",
    "- ¼ cup fresh lime juice (2 to 3 limes)",
    "- 2 jalapeño chiles, coarsely chopped",
    "- 3 tablespoons chopped fresh cilantro",
    "- 3 cloves garlic, coarsely chopped",
    "- 1 (8-ounce) boneless, skinless chicken breast halves",
    "- Kosher salt and freshly ground black pepper",
    "- 2 medium Japanese eggplants, halved lengthwise",
    "Caramelized Onions:",
    "- 2 tablespoons olive oil",
    "- 2 large red onions, halved and thinly sliced",
    "- 2 tablespoons balsamic vinegar",
    "- 2 tablespoons finely chopped fresh cilantro",
    "- Kosher salt and freshly ground black pepper",
    "Quesadillas:",
    "- 12 (6-inch) flour tortillas",
    "- ¾ cup grated Monterey Jack cheese (3 ounces)",
    "- ¾ cup grated white Cheddar cheese (3 ounces)",
    "- Kosher salt and freshly ground black pepper",
    "- 2 tablespoons canola oil",
    "- 2 teaspoons ancho chile powder",
    "- ¼ cup grated cotija cheese (1 ounce)",
    "Mixed Tomato Salsa"
  ],
  "directions": [
    "1. To marinate the chicken, in a blender, combine the ¼ cup oil, the lime juice, jalapeños, cilantro, and garlic and blend until smooth.",
    "2. Put the chicken in a medium bowl, pour the marinade over it, cover, and refrigerate for at least 1 hour and up to 4 hours.",
    "3. Preheat a grill to high or a grill pan over high heat.",
    "4. To cook the chicken and the eggplant, remove the chicken from the marinade and pat dry with paper towels; discard the marinade. Season the breast halves on both sides with salt and pepper. Grill for about 4 minutes per side, until golden brown and just cooked through. Remove to a cutting board, let rest for 5 minutes, and then slice into ¼-inch-thick slices on the bias.",
    "5. Keep the grill on, or if using a grill pan, wipe it out and return to high heat. Brush the eggplant on both sides with the 3 tablespoons oil and season with salt and pepper. Grill for 3 to 4 minutes on each side, until just cooked through. Remove to a cutting board and coarsely chop.",
    "6. To caramelize the onions, heat the oil in a medium sauté pan over medium heat. Add the onions and cook, stirring occasionally, until soft and caramelized, 20 to 25 minutes. Add the balsamic vinegar and cilantro and cook until the liquid has evaporated, about 5 minutes; season with salt and pepper.",
    "7. Preheat the oven to 425 degrees F.",
    "8. To make the quesadillas, place 8 of the tortillas on a flat surface. Divide, in order, the Monterey Jack and Cheddar cheeses, chicken, onions, and eggplant among the tortillas and season with salt and pepper. Stack the tortillas to make four 2-layer tortillas and top each with one of the remaining tortillas.",
    "9. Transfer to a baking sheet (you may need 2). Brush the tops with the oil and sprinkle with the ancho powder and cotija cheese. Bake for 8 to 10 minutes, until the tortillas are lightly golden brown and the cheese has melted.",
    "10. Cut into quarters and garnish with the mixed tomato salsa."
  ]
}