{
  "title": "Spicy Lamb Hand-Ripped Noodles",
  "source": "Munchies.vice.com",
  "servings": "Servings: 2",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "for the noodles:",
    "14 1/8ounces|400 grams wheat flour",
    "3/4teaspoon fine salt",
    "vegetable oil, for brushing",
    "for the soup:",
    "7ounces|200 grams lamb meat, thinly sliced",
    "1tablespoon shaoxing wine",
    "1large egg white",
    "1tablespoon vegetable oil",
    "1tablespoon ground cumin",
    "1tablespoon soy sauce, plus more on the side to taste",
    "1 1/4teaspoons granulated sugar",
    "1teaspoon fine salt",
    "1/2cup|40 grams chopped scallions",
    "1red onion, thinly sliced",
    "chili oil, to taste",
    "black vinegar, to taste",
    "3 ⅓cups all-purpose flour or high-gluten noodle flour",
    "½teaspoon salt",
    "¾cup room temperature water",
    "3tablespoons vegetable oil (Canola is good), plus more to keep the dough pieces from sticking",
    "1tablespoon Chinese black vinegar",
    "1tablespoon soy sauce",
    "1teaspoon kosher salt",
    "2leaves Napa cabbage, cut into 2-inch pieces",
    "1teaspoon chili powder",
    "1teaspoon garlic puree",
    "1scallion, thinly sliced",
    "1/2celery rib, diced",
    "1/2stalk chive flowers, diced"
  ],
  "directions": [
    "1. For the noodles: Mix together the flour and salt in a stand mixer fitted with a hook attachment or by hand in a large basin. Slowly add about 1 cup cold water with the mixer on low speed until dough is formed into one piece and the mixing bowl has little to no residual dough/powder or pieces stuck to it. Shape the dough a bit into a big block and then use a knife to cut it up up into long rectangular slabs, then cut each long rectangular slab into small pieces, about 4-by-2-by-3/8 inches. Cover the pieces with vegetable oil and place them in the refrigerator right away to prevent sticking.",
    "2. For the soup: Mix together the sliced lamb, wine, and egg white and marinate for 20 minutes at room temperature.",
    "3. Heat the vegetable oil in a large skillet over high until smoking. Add the lamb and egg mixture and cook, tossing, until the meat is almost done, about 3 minutes. Add the cumin, soy sauce, sugar, and salt and cook to let the flavor set in, 3 minutes, and then remove from the heat. Stir in the scallions and onion (the heat of the meat is enough to cook them even with fire off).",
    "4. Bring a large pot of water to a boil. When the water is almost boiling, take 2 pieces of the dough from the refrigerator. Press the dough flat on a non-floured work surface and take one end of the piece in each hand and pull. Slap the dough on the table until it becomes elongated into a wide noodle. Rip this noodle down the middle, creating a longer, continuous, circular noodle and throw it into the boiling water. Repeat with the rest of the pieces for more servings of noodles. Boil the noodles until cooked through, and then drain and transfer to a bowl. Add in the lamb, and toss with soy sauce, chili oil, and black vinegar to taste.",
    "1. Making the dough: Place flour into a stand mixer with a dough hook attached. In a Pyrex container, or a container that has a mouth to pour, stir salt into the room temperature water until dissolved. Start the mixer at a low speed. Slowly add the salt water from the side of the mixer, until all of the water is evenly incorporated. Keep running the mixer until the sides of the mixing bowl are flour-free and the dough is nice and smooth. If the dough doesn’t seem to be coming together, you can add up to ¼ cup more of water, but be patient! Alternatively, if mixing by hand in a bowl, add the water ¼ cup at a time, using your hands to knead the mixture into a ball of dough. Knead until a dough is formed, approximately 8 to 10 minutes.",
    "2. Remove the dough from your mixing bowl and knead on a floured board. You’ll need to use a bit of muscle, as the dough will be quite tough at first. But it will get smoother and springier the longer you work it. Knead until relatively smooth and springy.",
    "3. Cover with a moist towel, and let rest for 5 minutes. Then, knead the dough for a minute or so with clean hands on a floured board. Let rest again for another 5 minutes. Repeat this rest-then-knead process twice more. In total, you should have rested the dough 15 minutes, and kneaded it on a board three times.",
    "4. Flatten the dough into a rectangle to the best of your ability, and cut the dough into 3.5-ounce pieces (about 6 pieces for one batch of dough). Use a rolling pin to roll each piece into flat rectangles, a little over ¼ of an inch thick, 4-5 inches long, and about 1.5 inches wide.",
    "5. Brush the pieces of the dough with vegetable oil, and place sideways in a container without overlapping. Store in the refrigerator until ready to use. You should rest the dough at least an hour before using it, but you can store it in the refrigerator, covered in plastic wrap, for up to 3 days.",
    "6. Pulling & Cooking the Noodles: These noodles cannot sit after being pulled, and are best eaten fresh. Be prepared to immediately boil them, sauce them, and serve and slurp them down. Bring a large pot of water to a boil.",
    "7. Each serving of noodles will require two pieces of dough. Take the pieces out of the refrigerator, and warm them with your hands by flattening them on the counter.",
    "8. Keep pushing the dough into an evenly flat rectangular shape until it is about 6 inches long and 3 inches wide. Then grab the ends of the rectangle with your thumbs and forefingers (as if you are checking if a bill is counterfeit in the light), and start to slightly pull and bounce the noodle flat against the counter, in an up-and-down motion.",
    "9. Keep pulling and slapping the dough against the counter until the noodles are almost 4 feet long. Be careful not to pull too quickly or grip too tight, as you’ll break the noodle. If the noodle does break, just grab onto the broken part and try to pull from there.",
    "10. When the noodle is the right length, pick it up at the middle and rip it into two pieces like string cheese, making sure to pull all the way until it reaches the end, without pulling it all the way through. Make sure to even out the ends of the strands if they are too thick.",
    "11. Throw the noodles into the boiling pot of water and stir with tongs to make sure they do not stick. They should be “swimming” in the water.",
    "12. Boil for 2 minutes. If the water is about to spill out, lower the fire slightly until it calms slightly, but keep it at a boil. Add cold water to the boil if necessary, but your total boiling time should be capped at 2 minutes.",
    "13. Transfer the noodles to a small saucepan with the black vinegar, soy sauce, salt along with the cabbage. Put the garlic purée, chili powder, diced scallions, celery, and chive flowers all on top of the noodles in a little mound. Heat up the 3 tablespoons vegetable oil in a small pot on the stove just until smoking point, be careful not to overheat. Once the oil is at smoking point, pour onto the little mound of aromatics on top of the noodles, and then mix together immediately and serve."
  ]
}