{
  "title": "Spice-Rubbed Turkey Breast with Sour Orange Sauce",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 8 to 10",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "Turkey",
    "2tablespoons vegetable oil, divided",
    "2teaspoons five-spice powder",
    "1½teaspoons ground cumin",
    "1½teaspoons table salt",
    "1teaspoon pepper",
    "1teaspoon garlic powder",
    "¼teaspoon cayenne pepper",
    "¼teaspoon ground cardamom",
    "1(6- to 7-pound) bone-in whole turkey breast, trimmed",
    "Sour Orange Sauce",
    "1tablespoon vegetable oil",
    "1shallot, minced",
    "1garlic clove, minced",
    "2cups chicken broth",
    "2cups orange juice (4 oranges)",
    "2tablespoons white wine vinegar, plus extra for seasoning",
    "1tablespoon cornstarch",
    "1tablespoon water",
    "2teaspoons chopped fresh tarragon"
  ],
  "directions": [
    "1. For the turkey combine 1 tablespoon oil, five-spice powder, cumin, salt, pepper, garlic powder, cayenne, and cardamom in bowl. Using your fingers, carefully separate turkey skin from meat. Rub paste evenly under skin. Place turkey breast on large plate, cover with plastic wrap, and refrigerate for at least 6 hours or up to 24 hours.",
    "2. Adjust oven rack to middle position and heat oven to 325 degrees. Heat remaining 1 tablespoon oil in Dutch oven over medium heat until just smoking. Place turkey, skin side down, in Dutch oven and cook, turning breast on its sides as needed, until lightly browned, 8 to 10 minutes.",
    "3. Rotate turkey skin side up and transfer pot to oven. Roast until turkey registers 160 degrees, about 1½ hours. Transfer turkey to carving board, tent with aluminum foil, and let rest, uncovered, for 20 minutes.",
    "4. For the sour orange sauce Meanwhile, heat oil in large saucepan over medium heat until shimmering. Add shallot and cook until softened, about 3 minutes. Add garlic and cook until fragrant, about 30 seconds. Stir in broth, orange juice, and vinegar, increase heat to high, and bring to boil. Cook, stirring occasionally, until sauce is reduced to 1¼ cups, about 20 minutes.",
    "5. Whisk cornstarch and water together in small bowl, then whisk mixture into sauce and cook until thickened, about 1 minute; remove from heat and cover to keep warm.",
    "6. Stir 1 tablespoon turkey pan drippings and tarragon into orange sauce. Season with salt, pepper, and additional vinegar to taste. Remove skin if desired, carve turkey, and serve with sauce."
  ]
}