{
  "title": "Spicy Carrot Rigatoni",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 to 6",
  "categories": [
    "***NEED TO MAKE",
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Pasta",
    "1pound (454 g) carrots (6 to 8 medium) with tops, peeled and cut into 1-inch (2.5 cm) pieces, green tops reserved",
    "4garlic cloves",
    "1⁄2 cup (55 g) grated pecorino Romano, plus more for serving",
    "1⁄2 cup (120 ml) olive oil",
    "1⁄4 cup (60 ml) water",
    "1tablespoon chopped jarred Calabrian chiles in oil",
    "1tablespoon pine nuts, toasted",
    "Kosher salt and freshly cracked black pepper, to taste",
    "1pound (454 g) dry rigatoni",
    "Topping",
    "1⁄4 cup (20 g) finely chopped reserved carrot tops",
    "1⁄4 cup (15 g) finely chopped fresh parsley",
    "1⁄4 cup (60 ml) olive oil",
    "Zest of 1 lemon",
    "Juice of 1⁄2 lemon",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Ricotta cheese, for topping, optional"
  ],
  "directions": [
    "1. Make the pasta: Set up a steamer over medium heat, and bring the water to a low boil.2. Add the carrots and garlic, cover, and cook until very tender, 12 to 15 minutes.3. Transfer to a blender along with the pecorino Romano, olive oil, water, chiles, and pine nuts, and blend (vented, to account for the hot carrots) on high until very, very smooth and creamy. Season with salt and pepper. Set aside.4. Bring a large pot of water to a boil over high heat.5. Meanwhile, make the topping: Mix the carrot tops, parsley, olive oil, lemon zest, lemon juice, salt, and pepper in a small bowl. Set aside.6. Heavily salt the boiling water from step 4, and drop in the rigatoni. Cook according to the package directions until al dente.7. Drain the pasta, reserving at least 2 mugsful of pasta water. Return the pasta to the pot, and set over low heat.8. Add the carrot sauce and a couple splashes of pasta water, and toss to combine. Add as much pasta water as needed to thin out the sauce so it coats the pasta evenly without being too thick. (You are looking for an elegantly coated pasta, not a gloppy one! I like a very saucy vibe here.) Season with more salt and pepper, if needed.9. Serve the pasta, drizzled with the herby topping, a dollop of ricotta, if using, pepper, and more grated pecorino Romano."
  ]
}