{
  "title": "Spiced, Grilled & Swaddled Chicken Thighs with the Works",
  "source": "Molly Baz - Cook This Book",
  "servings": "4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "2medium red onions",
    "5garlic cloves",
    "2lemons",
    "1bunch mint or cilantro",
    "DAIRY",
    "1¾cups plain whole-milk yogurt",
    "MEAT",
    "2pounds boneless, skinless chicken thighs (about 6 small thighs)",
    "PANTRY",
    "1cup distilled white vinegar",
    "½cup sugar",
    "Kosher salt",
    "1tablespoon vegetable oil, plus more for the grill",
    "1tablespoon sweet smoked paprika",
    "1tablespoon ground cumin",
    "¾teaspoon ground cinnamon",
    "½teaspoon cayenne pepper",
    "4pitas",
    ""
  ],
  "directions": [
    "① Pickle the red onions:",
    "✦Slice 2 red onions crosswise into ⅛-inch-thick rings.",
    "✦In a small saucepan, heat 1 cup white vinegar, 1½ cups water, ½ cup sugar, and 1 tablespoon salt over medium heat, stirring often to dissolve. Once the vinegar mixture comes to a simmer, remove from the heat and immediately add the onions. Let cool to room temperature. The onions can be made up to several days in advance; they only get better with time.",
    "② Make the garlic yogurt:",
    "✦Finely grate 1 garlic clove into a small bowl and stir in 1 cup plain yogurt. Season with salt and set aside for serving.",
    "③ Marinate the chicken:",
    "✦Finely grate 4 garlic cloves into a large bowl.",
    "✦Stir in ¾ cup plain yogurt, the juice of 1 lemon, 1 tablespoon vegetable oil, 2½ teaspoons salt, 1 tablespoon smoked paprika, 1 tablespoon cumin, ¾ teaspoon cinnamon, and ½ teaspoon cayenne pepper and whisk well to combine.",
    "✦Add 2 pounds boneless, skinless chicken thighs to the marinade and turn to coat. Let sit at room temperature for at least 30 minutes while you prepare a grill for medium heat (or heat a cast-iron grill pan over medium heat). If you’re going to marinate them longer (which you totes should; they only improve with time), cover and keep chilled in the refrigerator for up to 6 hours and pull them out 30 minutes before cooking.",
    "④ Back to grilling that chicken:",
    "✦Once the grill is preheated to medium (you should be able to hold your hand over the grate for about 5 seconds before it gets too hot), lightly oil the grill grates.",
    "✦Remove the chicken from the marinade with tongs, letting any excess drip back into the bowl, and transfer it to the grill. Cook, undisturbed, until it’s nicely charred underneath and naturally releases from the grates, 5 to 6 minutes. Pay attention to the hot spots of your grill or grill pan, and move the thighs around accordingly to ensure even browning. Flip the thighs and cook until just cooked through, 4 to 7 minutes longer. (An instant-read thermometer should register 165°F in the thickest part of the thigh.) This will vary depending on how large your chicken thighs are, so keep an eye on temperature more than timing in this case! Let the chicken thighs rest on a plate while you grill the pitas.",
    "⑤ Warm the pitas and serve:",
    "✦Warm the pitas on the grill while the chicken rests, about 1 minute per side.",
    "✦Cut a lemon into 4 wedges and pick the leaves from 1 bunch of mint.",
    "✦Slice the chicken against the grain into ½-inch-thick strips and serve on a big platter alongside the pitas, pickled onions, garlic yogurt, lemon wedges, and mint for a build-your-own kinda sitch."
  ]
}