{
  "title": "Spicy Orange Chicken",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "1tablespoon soy sauce",
    "1tablespoon Shaoxing wine or dry sherry",
    "2teaspoons toasted sesame oil",
    "½teaspoon cornstarch",
    "1½pounds boneless, skinless chicken breasts, trimmed and sliced ¼ inch thick",
    "3tablespoons hoisin sauce",
    "2teaspoons grated orange zest plus ¾ cup juice (2 oranges)",
    "3tablespoons vegetable oil, divided",
    "3garlic cloves, minced",
    "2teaspoons grated fresh ginger",
    "½teaspoon red pepper flakes",
    "1red bell pepper, stemmed, seeded, and cut into ⅛-inch-wide strips",
    "2scallions, sliced thin"
  ],
  "directions": [
    "1. Whisk soy sauce, Shaoxing wine, sesame oil, and cornstarch together in large bowl. Add chicken and toss to coat. Whisk hoisin and orange zest and juice together in second bowl; set aside. Combine 2 teaspoons vegetable oil, garlic, ginger, and red pepper flakes in small bowl; set aside.",
    "2. Heat 2 teaspoons vegetable oil in 12-inch nonstick skillet or 14-inch flat-bottomed wok over medium-high heat until just smoking. Add half of chicken, increase heat to high, and cook, tossing slowly but constantly, until no longer pink, 2 to 6 minutes. Transfer chicken to clean, dry large bowl and cover with aluminum foil. Repeat with 2 teaspoons vegetable oil and remaining chicken; transfer to bowl.",
    "3. Heat remaining 1 tablespoon oil in now-empty pan until just smoking. Add bell pepper and cook, tossing constantly, until bell pepper is just softened, about 3 minutes. Push bell pepper to sides of pan and reduce heat to medium. Add garlic mixture and cook, mashing mixture into pan, until fragrant, about 30 seconds. Stir garlic mixture into bell pepper.",
    "4. Add chicken and any accumulated juices to pan. Whisk sauce to recombine, then add to pan. Increase heat to high and cook until sauce is thickened, about 30 seconds. Sprinkle with scallions and serve."
  ]
}