{
  "title": "Spicy Hummus And Zucchini Quesadillas With White Bean-Poblano Relish",
  "source": "Mesa Grill - Bobby Flay",
  "servings": "4",
  "categories": [
    "Mesa Grill - Bobby Flay"
  ],
  "ingredients": [
    "Spicy Hummus:",
    "- 1½ cups canned chickpeas (1 15.5-ounce can), rinsed and drained",
    "- 6 cloves roasted garlic",
    "- ½ teaspoon chile de árbol powder",
    "- 2 tablespoons fresh lemon juice",
    "- 2 tablespoons tahini",
    "- 2 tablespoons olive oil",
    "- Kosher salt and freshly ground black pepper",
    "- 3 tablespoons finely chopped fresh cilantro",
    "Quesadillas:",
    "- 12 (6-inch) flour tortillas",
    "- 1½ cups grated white Cheddar cheese (6 ounces)",
    "- 1 medium zucchini, cut into matchsticks",
    "- 8 ounces fresh goat cheese, crumbled",
    "- Kosher salt and freshly ground black pepper",
    "- 2 tablespoons canola oil",
    "- 1 tablespoon ancho chile powder",
    "White Bean–Poblano Relish (recipe follows)"
  ],
  "directions": [
    "1. To make the hummus, combine the chickpeas, garlic, chile de árbol powder, lemon juice, and tahini in the bowl of a food processor and process until smooth. Slowly add the olive oil, process until combined, and season with salt and pepper to taste.",
    "2. Transfer the hummus to a bowl and stir in the cilantro. This can be made up to 1 day in advance and refrigerated.",
    "3. Preheat the oven to 425 degrees F.",
    "4. To make the quesadillas, place 8 of the tortillas on a work surface. Spread 3 tablespoons of the hummus on each tortilla. Divide, in order, the Cheddar cheese, zucchini, and goat cheese among the tortillas and season with salt and pepper to taste. Stack the tortillas to make four 2-layer tortillas and top each with one of the remaining tortillas. Brush the tops of the tortillas with the oil and sprinkle with the ancho powder.",
    "5. Transfer the tortillas to a baking sheet (you may need 2). Bake for 8 to 10 minutes, until the tortillas are lightly golden brown and the cheese has melted.",
    "6. Cut into quarters and top each quarter with a large spoonful of the white bean–poblano relish."
  ]
}