{
  "title": "Spicy Three-Cup Chicken",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "4 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "- 2 lb / 900g boneless chicken thighs, skin on, chopped into 1-inch / 2.5cm pieces",
    "- 2 cups / 480ml water",
    "- 1 Tbsp kosher salt",
    "- ¼ cup / 60ml sesame oil",
    "- 4 or 5 (⅛ inch / 0.3cm)slices ginger",
    "- 5 or 6 garlic cloves",
    "- 1 or 2 pieces dried chili pepper",
    "- ¼ cup / 60ml Shaoxing wine",
    "- ¼ cup / 60ml light soy sauce",
    "- 2 tsp dark soy sauce",
    "- 2 Tbsp Sichuan Chili Crisp",
    "- 2 Tbsp granulated sugar",
    "- 1 bunch Thai basil leaves",
    "- White rice for serving"
  ],
  "directions": [
    "1. Place the chicken in a large resealable bag. Combine the water and the salt to make a brine and pour it into the bag with the chicken. This will ensure a more tender texture of the chicken. Let the chicken sit for 30 minutes to 1 hour until you’re ready to cook. Drain and set the chicken aside in a bowl.",
    "2. In a large wok or clay pot set over medium-low heat, add the oil and bring to a sizzle. Add the ginger, garlic, and chili pepper, letting the aromatics infuse the oil for about 5 minutes. Increase the heat to medium high and add the chicken, searing until golden brown on all sides, 15 to 20 minutes. Add the wine, light and dark soy sauces, chili crisp, and sugar and stir to coat the chicken.",
    "3. Bring the liquid to a boil, then turn down the heat to medium low, cover, and simmer for about 20 more minutes. Remove the lid, turn up the heat to high, and cook until the remainder of the sauce is reduced and it turns into a dark, shiny glaze, stirring often to prevent burning, 2 to 3 minutes.",
    "4. Remove the wok from the heat and toss in the basil. Transfer the chicken and sauce onto a large serving dish or serve directly in the clay pot (if using). Serve hot with white rice."
  ]
}