{
  "title": "Spinach, Mushroom, and Goat Cheese Slab Frittata",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 12 squares of frittata",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "Butter, softened, for baking dish",
    "5ounces (225 grams) baby spinach",
    "1tablespoon (15 ml) olive oil",
    "½pound (225 grams) breakfast sausage, removed from casings (optional)",
    "1small yellow onion, finely chopped",
    "2garlic cloves, minced",
    "½pound (225 grams) white or cremini mushrooms, thinly sliced",
    "⅓cup (80 ml) heavy cream",
    "1teaspoon kosher or coarse sea salt, plus more to taste",
    "Freshly ground black pepper",
    "A pinch of nutmeg (optional)",
    "4scallions, thinly sliced",
    "One 4-ounce (115-gram) log goat cheese, crumbled",
    "12large eggs"
  ],
  "directions": [
    "Heat the oven to 350 degrees, and butter a 9-by-13-inch baking dish.",
    "prepare the vegetables If you’ve just washed your spinach, no need to dry it before wilting it in the pan. If it’s already dry, bring ½ inch water to a boil in a very large heavy skillet, then add the spinach and cook, turning with tongs, until wilted, for about 1 minute, then cook, covered, over moderately high heat, until the spinach is tender, 1 to 2 minutes more. Drain in a colander, and cool under cold running water. Gently squeeze handfuls of spinach to remove as much liquid as possible, then coarsely chop it. You will have about ½ cup fairly tightly packed cooked spinach.",
    "Wipe the skillet dry, turn the heat to medium-high, then add olive oil to the skillet. Once the oil is hot, add the sausage (if using) and cook until browned breaking it up with a spatula, for about 5 minutes. Remove with a slotted spoon, and discard all but 1 tablespoon of drippings. Stir the onion and garlic into skillet. Cook over medium-low heat until the onion is tender, about 5 minutes. Add the mushrooms, increase heat to medium-high, and cook, stirring, until the mushrooms have softened and exuded liquid, and that liquid has cooked off, about 5 minutes. Stir in the cream, salt, pepper, nutmeg (if using), chopped spinach, and reserved sausage (if using) and bring to a simmer. Remove the skillet from heat and let cool slightly.",
    "bake the frittata In a large bowl, whisk together the eggs, salt, and pepper. Stir in the vegetable mixture, scallions, and goat cheese. Pour into the prepared dish, and bake until golden and set, about 30 minutes.",
    "to serve Cool on a rack for 5 minutes before serving in squares."
  ]
}