{
  "title": "Spinach and Ricotta-Filled Tortelli with Brown Butter and Ricotta Salata",
  "source": "Pasta - Missy Robbins",
  "servings": "6 to 8 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Filling:",
    "114g / 4 cups Swiss chard leaves",
    "114g / 3 cups loosely packed baby spinach",
    "171g / ¾ cup unsalted butter, cold and cubed",
    "116g / ½ cup ricotta (see “whipped” ricotta, this page)",
    "112g / ½ cup mascarpone",
    "45g / ½ cup finely grated parmigiano-reggiano",
    "Salt, q.b.",
    "To Finish:",
    "1batch egg dough (this page)",
    "28g / 2 Tbsp olive oil",
    "5g / 1 clove garlic, thinly sliced",
    "75g / 5 Tbsp unsalted butter, cold and cubed",
    "1small (57g / 2 oz) piece ricotta salata"
  ],
  "directions": [
    "1. To make the filling, remove and discard the stems and ribs from the Swiss chard and set the leaves aside.2. Bring a pot of water to a boil over high heat. Generously salt the water. Prepare a salted ice-water bath and set a colander in it.3. Drop the spinach into the boiling water and cook until tender but still bright green, 10 to 15 seconds. Transfer the spinach to the ice-water bath to stop the cooking. Drain the spinach, transfer to a kitchen towel, and squeeze out the excess water.4. Repeat the same process with the chard but cook for 30 seconds to 1 minute, as it will take a bit longer to become tender.5. Transfer the greens to a high-speed blender and puree until smooth. (You may need to add a splash of water to get the blade moving.) Set aside.6. Place a small saucepan over medium heat. Add the butter and cook until just past golden brown, 3 to 4 minutes. Measure out 52g / ¼ cup, and set aside in a small saucepan. You will use this to finish your pasta.7. Turn the blender on low and drizzle in the remaining 60g / ⅓ cup brown butter to gently emulsify. Transfer the greens and butter mixture to a bowl.8. Put the ricotta into a food processor and pulse just until it is as smooth as cake frosting and has a sheen, being careful not to process it longer or it will break.9. Fold the ricotta, mascarpone, and parmigiano into the spinach and chard mixture until they are fully incorporated and the mixture is a uniform green. Season with salt q.b. It should taste well seasoned. Cover and refrigerate until ready to use.10. To finish, following the instructions for tortelli on this page, make 75 to 100 pieces with the pasta dough and filling.11. Bring a large pot of water to a boil over high heat. Generously salt the water.12. Add the tortelli to the water and turn down the heat to bring the water to a gentle simmer instead of a rolling boil. The filling is very delicate and will break if cooked over high heat. Cook for 3 to 5 minutes, until tender at the thickest closure point.13. While the pasta is cooking, place a large sauté pan over low heat and add the olive oil. Add the garlic and gently cook until aromatic but without color, 10 to 15 seconds. Add 2 to 3 ladles (115g / ½ cup) pasta cooking water and the butter. Swirl the contents of the pan to emulsify.14. Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Swirl the pasta in the sauce for 30 seconds to 1 minute to marry, using a spoon to gently turn the pasta over and coat all sides. If the sauce begins to tighten, add a splash of pasta cooking water to loosen and continue swirling in the pan.15. Place the saucepan with the reserved brown butter over low heat and gently warm the butter.16. Transfer the pasta to a large serving platter or divide into flat-bottomed bowls. Spoon the remaining sauce from the pan over the top, then drizzle on the brown butter. Use a Microplane to finely grate the ricotta salata over the top."
  ]
}