{
  "title": "Spinach and Artichoke Ziti",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 to 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "One 14-ounce (397 g) can quartered artichoke hearts, drained and patted dry",
    "2large shallots, halved",
    "1head garlic, top trimmed to expose the cloves",
    "1⁄3 cup (80 ml) olive oil, plus more for drizzling",
    "Kosher salt and freshly cracked black pepper, to taste",
    "5ounces (142 g) baby spinach",
    "1⁄4 cup (60 ml) cold water",
    "1pound (454 g) dry ziti",
    "1⁄2 cup (55 g) finely grated pecorino Romano, plus more for serving",
    "Extra virgin olive oil, for drizzling",
    "Toasted panko breadcrumbs, to taste",
    "Lemon zest, to taste"
  ],
  "directions": [
    "1. Preheat the oven to 425°F (220°C).2. Place the artichokes, shallots, and garlic in a small baking dish. Drizzle with a little olive oil, season with salt and pepper, and toss to coat. Arrange the garlic heads cut side down.3. Roast for 35 to 45 minutes, tossing occasionally, until the artichokes are golden and the shallots and garlic are soft. Let cool enough to handle and then squeeze out the garlic from the bulb.4. Bring a large pot of water to a boil over high heat. Prepare a large ice bath.5. Add the spinach to the boiling water to blanch for 30 seconds. Immediately transfer the spinach with a slotted spoon to the ice bath to shock and cool. Squeeze out all the excess water from the spinach, and roughly chop. Set aside.6. Reduce the heat to low, and keep the pot covered for boiling the pasta later.7. Add the artichokes, shallots, garlic, 1⁄3 cup (80 ml) olive oil, and cold water to a blender. Blend (vented, in case the ingredients are very warm) on high until very smooth. Add the spinach, and blend again until very smooth and creamy. Season with salt and pepper.8. Increase the heat under the pot of water to high, and bring back to a boil. Heavily season with salt. Add the ziti, and cook according to the package directions until al dente. Drain the pasta, reserving at least 2 mugsful of pasta water.9. Return the pasta to the pot, and set over low heat. Add the artichoke sauce, a couple of splashes of pasta water, and the pecorino Romano, and toss to combine.10. Add more splashes of pasta water as needed to thin the sauce so it coats the pasta evenly without being too thick. (You’re looking for an elegantly coated pasta, not a gloppy one!) Season with more salt and pepper.11. Serve, topped with a drizzle of extra virgin olive oil, more pecorino Romano, panko, and lemon zest."
  ]
}