{
  "title": "Spring Rolls (Cantonese Egg Rolls)",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Makes: 16 spring rolls",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 1/2 ounces dried shiitake mushrooms, rinsed",
    "- 2 ounces dried mung bean glass noodles",
    "- 2 tablespoons vegetable oil",
    "- 6 scallions, white and green parts separated and sliced thin",
    "- 4 garlic cloves, minced",
    "- 4 teaspoons grated fresh ginger",
    "- 2 tablespoons soy sauce",
    "- 1 tablespoon Shaoxing wine",
    "- 1 teaspoon toasted sesame oil",
    "- 1/2 teaspoon table salt",
    "- 1/4 teaspoon white pepper",
    "- 4 cups shredded napa cabbage",
    "- 3 carrots, peeled and cut into 2-inch-long matchsticks",
    "- 2 tablespoons cornstarch",
    "- 16 (8-inch) square spring roll wrappers",
    "- 2 quarts peanut or vegetable oil for frying"
  ],
  "directions": [
    "1. Microwave 1 cup water and mushrooms in covered bowl until steaming, about 1 minute. Let sit until softened, about 5 minutes. Lift mushrooms from bowl with fork and discard liquid. Squeeze mushrooms dry, remove stems, and chop. Soak noodles in 4 cups hot water in bowl for 15 minutes. Drain and rinse under cold water until chilled. Drain noodles again and chop into 1-inch lengths; set aside.",
    "2. Heat empty 14-inch flat-bottomed wok over high heat until just beginning to smoke, about 3 minutes. Reduce heat to medium-high, drizzle vegetable oil around perimeter of wok, and heat until just smoking. Add mushrooms and cook, stirring constantly, until heated through, about 2 minutes. Add scallion whites, garlic, and ginger and cook, stirring constantly, until fragrant, about 1 minute. Stir in soy sauce, Shaoxing wine, sesame oil, salt, and pepper and cook until thickened to glaze, about 30 seconds.",
    "3. Add cabbage and carrots and cook, tossing slowly but constantly, until cabbage is just softened, about 2 minutes. Off heat, add scallion greens and noodles and toss to combine. Transfer vegetable mixture to large plate, spread into even layer, and refrigerate until cool enough to handle, about 5 minutes.",
    "4. Whisk cornstarch and 2 tablespoons water in bowl until combined. Arrange 1 wrapper on counter so 1 corner points toward edge of counter. Place 2 heaping tablespoons filling on lower half of wrapper and mold it with your fingers into neat 4-inch-long cylinder parallel to edge of counter. Using pastry brush, apply light layer of cornstarch slurry onto top corner of wrapper, being sure to coat edges.",
    "5. Fold bottom corner of wrapper over filling and press gently along length of filling to remove air pockets. Fold side corners over to enclose filling snugly; gently roll to form cylinder. Transfer spring roll seam side down to parchment paper–lined platter. Press gently on spring roll to flatten slightly, and cover with damp paper towel while shaping remaining spring rolls; do not stack. Wipe any excess moisture from counter and repeat with remaining wrappers and filling. (Spring rolls can be frozen until solid, then transferred to zipper-lock bag and stored in freezer for up to 1 month. Do not thaw before frying; increase frying time by 2 minutes.)",
    "6. Set wire rack in rimmed baking sheet and line half of rack with triple layer of paper towels. Add peanut oil to clean, dry, 14-inch flat-bottomed wok or large Dutch oven until it measures about 1 1/2 inches deep and heat over medium-high heat to 375 degrees. Using tongs, carefully add 5 spring rolls to hot oil and cook until light golden brown, 5 to 7 minutes, turning as needed for even browning. Adjust burner, if necessary, to maintain oil temperature between 350 and 375 degrees.",
    "7. Using spider skimmer or slotted spoon, transfer spring rolls to paper towel–lined side of prepared rack and let drain for 1 minute, then move to unlined side of rack. Return oil to 375 degrees and repeat with remaining spring rolls in 2 batches. (Before cooking each batch of spring rolls, line rack with fresh layer of paper towels.) Let cool for 5 minutes. Serve."
  ]
}