{
  "title": "Spring Pancakes",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Makes: 12 pancakes",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 1/2 cups (7 1/2 ounces) all-purpose flour",
    "- 3/4 cup boiling water",
    "- 2 teaspoons toasted sesame oil",
    "- 1/2 teaspoon vegetable oil"
  ],
  "directions": [
    "1. Using a wooden spoon, mix flour and boiling water in a bowl to form a rough dough. When cool, transfer dough to a lightly floured counter and knead until it forms a ball that is tacky but no longer sticky, about 4 minutes (dough will not be perfectly smooth). Cover loosely with plastic wrap and let rest for 30 minutes.",
    "2. Roll dough into a 12-inch-long log on a lightly floured counter and cut into 12 equal pieces. Turn each piece cut side up and pat into a rough 3-inch disk. Brush 1 side of 6 disks with sesame oil; top each oiled side with unoiled disk to form 6 pairs, lightly pressing each pair together. Roll disks into 7-inch rounds, lightly flouring counter as needed.",
    "3. Heat vegetable oil in a 12-inch nonstick skillet over medium heat until shimmering. Using paper towels, carefully wipe out oil. Place 1 pancake in the skillet and cook without moving it until air pockets begin to form between layers and the underside is dry, 40 to 60 seconds. Flip pancake and cook until a few light brown spots appear on the second side, 40 to 60 seconds. Transfer to a plate and, when cool enough to handle, peel apart into 2 pancakes. Stack pancakes moist side up and cover loosely with plastic wrap. Repeat with remaining pancakes. Cover pancakes tightly and keep warm while preparing mu shu. (Pancakes can be wrapped tightly in plastic wrap, then aluminum foil, and refrigerated for up to 3 days or frozen for up to 2 months. Thaw wrapped pancakes at room temperature. Unwrap and place on a plate. Invert a second plate over pancakes and microwave until warm and soft, 60 to 90 seconds.)"
  ]
}