{
  "title": "St. Louis Gooey Butter Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 12",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "Cake",
    "1teaspoon active dry yeast (0.11 oz / 3g)",
    "½cup whole milk (4 oz / 113g)",
    "⅓cup granulated sugar (2.3 oz / 66g)",
    "3large egg yolks (1.8 oz / 50g)",
    "1large egg (1.8 oz / 50g)",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "2½cups all-purpose flour (11.4 oz / 325g)",
    "1stick unsalted butter (4 oz / 113g), cut into tablespoons, at room temperature, plus more for the pan",
    "Topping",
    "¼cup heavy cream (2 oz / 57g), at room temperature",
    "2tablespoons light corn syrup (1.4 oz / 40g)",
    "1tablespoon vanilla extract",
    "10tablespoons unsalted butter (5 oz / 142g), at room temperature",
    "1cup granulated sugar (7 oz / 200g)",
    "¼cup packed light brown sugar (1.8 oz / 50g)",
    "1teaspoon Diamond Crystal kosher salt (0.11 oz / 3g)",
    "1large egg (1.8 oz / 50g), at room temperature",
    "1cup all-purpose flour (4.6 oz / 130g)",
    "Powdered sugar, for serving"
  ],
  "directions": [
    "Dissolve the yeast: In a small saucepan, gently warm ¼ cup water (2 oz / 57g) over low heat, swirling the pan, just until it’s lukewarm but not hot, about 105°F on an instant-read thermometer (you can do this in the microwave, too, but beware of overheating). Pour the water into the bowl of a stand mixer fitted with the paddle attachment and whisk in the yeast to dissolve. Set aside until the mixture is cloudy and slightly puffed, about 5 minutes.",
    "Make the yeasted cake batter: To the bowl with the yeast mixture, add the milk, granulated sugar, egg yolks, whole egg, salt, and 2 cups of the flour (9.2 oz / 260g) and mix on low until the ingredients are combined. Increase the speed to medium and continue to beat, scraping down the sides of the bowl once or twice, until you have a smooth, thick batter, about 1 minute. With the mixer still on medium, add the butter one piece at a time, beating thoroughly after each addition. Switch to the dough hook and, with the mixer on medium, add the remaining ½ cup flour (2.3 oz / 65g) 1 tablespoon at a time, mixing until you have a smooth, very soft, somewhat sticky dough that just barely pulls away from the sides of the bowl (you may not need to use all the flour).",
    "Let the cake rise and prepare the pan: Cover the bowl with plastic wrap and let it rise in a warm place until nearly doubled in size, 1 to 1½ hours. Generously butter the bottom and sides of the pan and set aside.",
    "Pat the dough into the pan and chill overnight: Scrape the risen dough into the prepared pan and press it into a single layer, working it all the way into the corners. If the dough sticks to your hands, butter your fingertips and proceed. If your pan is glass, mark the outside with a piece of tape to indicate the starting height of the dough (so you can easily gauge the rise on day two). Tightly cover the pan with a sheet of plastic wrap and refrigerate at least 8 hours and up to 12.",
    "Preheat the oven: Arrange an oven rack in the center position and preheat the oven to 350°F.",
    "Make the topping: In a small bowl, whisk together the heavy cream, corn syrup, and vanilla until combined and set aside.",
    "In a stand mixer fitted with the paddle attachment, beat the butter, granulated sugar, brown sugar, and salt on medium-high, scraping down the sides once or twice, until the mixture is light and fluffy, about 5 minutes. Add the egg and beat just until combined. Reduce the speed to low and add half of the flour, followed by the cream mixture, then the remaining flour, scraping down the sides of the bowl and mixing after each addition just until combined. When the batter is smooth, transfer it to a large pastry bag or 1-gallon resealable bag. Twist or seal the bag to close, pressing out any air, and snip off a 1½-inch opening.",
    "Top the cake: Remove the pan of dough from the refrigerator and uncover. Pipe a wide snake of topping all across the surface of the dough, using the entire amount (you can also just dollop it with a spoon, but piping it gives a more even application). Use the back of a spoon or small offset spatula to spread the topping across the surface in an even layer all the way to the edges. The dough will likely have already risen to 1½ times its height while in the refrigerator overnight (use the tape as a point of reference), but if it hasn’t, cover the pan again and let the cake sit at room temperature until risen.",
    "Bake and cool: Bake the cake (be sure to remove the piece of tape) until the edges are deep golden brown and firm to the touch but the center is still shiny and jiggles slightly when the pan is shaken, 30 to 40 minutes. Let the cake cool completely in the pan on a wire rack (as it cools, the filling will fall in places, forming gooey valleys in the cake).",
    "Serve: Dust lightly with powdered sugar and cut into squares before serving."
  ]
}