{
  "title": "Steak Night Dinner Anchovy-Basted Rib Eye with Dilly Creamed Spinach",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 2",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Steak",
    "One 2-inch-thick (5 cm) bone-in rib eye (about 11⁄2 pounds/680 g)",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Olive oil, for searing",
    "4tablespoons unsalted butter",
    "4oil-packed anchovy fillets, chopped",
    "4garlic cloves, smashed",
    "5fresh thyme sprigs",
    "2dried bay leaves",
    "Spinach",
    "1tablespoon olive oil",
    "15ounces (425 g) baby spinach",
    "2tablespoons unsalted butter",
    "2large shallots, minced",
    "2garlic cloves, minced",
    "1⁄2 cup (120 ml) heavy cream",
    "2ounces (57 g) garlic and herb Boursin cheese (see Tip)",
    "1⁄4 cup (28 g) grated Parmesan",
    "Pinch of ground nutmeg",
    "Kosher salt and freshly cracked black pepper, to taste",
    "1⁄4 cup (10 g) loosely packed fresh dill, roughly chopped"
  ],
  "directions": [
    "Make the steak:1. Season the steak liberally all over with salt and pepper. Place on a sheet tray lined with a wire rack, and set aside at room temperature while you preheat the oven. (You also can season the steak the night before and leave it uncovered in the refrigerator until you are ready to cook.)2. Preheat the oven to 250°F (120°C).3. Bake the steak on the wire rack–lined sheet tray for 60 to 65 minutes, until the internal temperature of the thickest part reaches 115°F (46°C). The cook time will depend on the thickness of your steak, so just keep an eye on it.4. Meanwhile, make the spinach: Heat the olive oil in a medium pot over medium heat. Add the spinach, and stir to coat in the oil. Cover and cook, uncovering and stirring occasionally, until the spinach is wilted, 2 or 3 minutes.5. Transfer the spinach to a strainer over a bowl. Using a spoon, press the spinach in the strainer to remove as much liquid as you can. Discard the liquid, and roughly chop the spinach.6. Wipe out the skillet, add the butter, and melt over medium heat. Add the shallots and minced garlic, and cook until translucent, 3 or 4 minutes.7. Add the cream, Boursin, and Parmesan, and reduce the heat to medium-low. Cook, stirring, until the cheeses melt and the mixture is bubbly, 1 or 2 minutes. Stir in the reserved spinach, and cook, stirring, until slightly thickened, 2 or 3 minutes. The cream mixture should lightly coat the back of a spoon.8. Season with nutmeg, salt, and pepper. Remove from the heat, and cover while the steak finishes.9. Remove the steak from the oven. Coat the bottom of a large cast-iron pan with olive oil, and heat over medium-high heat. Add the steak, and sear until golden, 3 to 5 minutes. Using tongs, hold the steak up on its fatty side (the fat cap), and sear until golden and slightly rendered, 1 or 2 minutes.10. Flip the steak onto its second side, and add the butter, anchovies, smashed garlic, thyme, and bay leaves. Sear the steak on the second side, basting with the anchovy butter (the anchovies will melt into the butter as you baste), until the internal temperature is between 120°F and 125°F (49°C and 52°C), 2 or 3 minutes.11. Transfer the steak to a wire rack on top of a sheet tray or a plate, and let rest for 10 minutes. While the steak rests, reheat the creamed spinach over medium heat until warm. Stir in the dill.12. Slice the steak against the grain, and serve with the warm anchovy butter (discard the bay leaves) spooned on top and the creamed spinach on the side."
  ]
}