{
  "title": "Steak Au Poivre with Brandied Cream Sauce",
  "source": "Modern Bistro - ATK",
  "servings": "4",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "For the sauce:",
    "4tablespoons unsalted butter, divided",
    "1shallot, minced",
    "1cup beef broth",
    "¾cup chicken broth",
    "5tablespoons brandy, divided",
    "¼cup heavy cream",
    "1teaspoon lemon juice or champagne vinegar",
    "For the steaks:",
    "4(8- to 10-ounce) boneless strip steaks, ¾ to 1 inch thick, trimmed",
    "½teaspoon table salt",
    "1tablespoon black peppercorns, crushed",
    "1tablespoon vegetable oil"
  ],
  "directions": [
    "1. For the sauce: Melt 1 tablespoon butter in a 12-inch skillet over medium heat; add shallot and cook, stirring occasionally, until softened, about 2 minutes. Add beef and chicken broths, increase heat to high, and boil until reduced to about ½ cup, about 8 minutes. Set aside reduced broth mixture.",
    "2. For the steaks: Meanwhile, pat steaks dry with paper towels and sprinkle both sides with salt; rub 1 side of each steak with crushed peppercorns and, using your fingers, press peppercorns into steaks to make them adhere.",
    "3. Heat oil in a clean, dry skillet over medium heat until hot, about 4 minutes. Add steaks, unpeppered side down, and increase heat to medium-high. Firmly press on steaks with the bottom of a cake pan or flat pot lid, remove pan, and cook steaks without moving them until well browned on the first side, about 6 minutes. Flip steaks. Firmly press down on steaks with the bottom of a cake pan or flat pot lid, remove pan, and cook on peppered side until meat registers 115 to 120 degrees (for rare), 120 to 125 degrees (for medium-rare), or 130 to 135 degrees (for medium), about 3 to 5 minutes. Transfer steaks to a plate and tent with aluminum foil.",
    "4. Pour ¼ cup brandy, cream, and reduced broth mixture into now-empty skillet; increase heat to high and bring to a boil, scraping up any browned bits. Simmer until deep golden brown and thick enough to heavily coat the back of a metal tablespoon or soupspoon, about 5 minutes. Off heat, whisk in lemon juice, remaining 3 tablespoons butter, remaining 1 tablespoon brandy, and any accumulated steak juices. Season with salt to taste. Set steaks on individual plates, spoon portion of sauce over steaks, and serve immediately."
  ]
}