{
  "title": "Sticky Toffee Waffles",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 12 waffles",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "waffles",
    "2cups (11¾ ounces or 335 grams) dates",
    "1½cups (355 ml) boiling water",
    "6tablespoons (85 grams) unsalted butter, melted, plus more for brushing waffle iron",
    "2large eggs",
    "1teaspoon baking powder",
    "½teaspoon baking soda",
    "¼teaspoon fine sea or table salt",
    "1½cups (195 grams) all-purpose flour",
    "¼cup (20 grams) cornstarch",
    "toffee sauce",
    "4tablespoons (55 grams) unsalted butter",
    "½cup (120 ml) heavy or whipping cream",
    "½cup (95 grams) dark- or light-brown sugar",
    "1teaspoon (5 ml) vanilla extract",
    "to serve",
    "Dollops of unsweetened softly whipped cream",
    "A few flakes of sea salt"
  ],
  "directions": [
    "prepare the dates Pit and roughly chop the dates, and place them in a heatproof bowl. Pour the boiling water over them, cover the bowl, and set aside for 30 minutes.",
    "meanwhile, make the sauce Combine the butter, cream, and sugar in a larger saucepan than you think you’ll need, over medium heat, and bring to a very low simmer. Cook for 8 to 10 minutes, stirring occasionally, until the mixture thickens slightly. Stir in the vanilla.",
    "heat the oven To 350 degrees. Place a heatproof wire rack on a rimmed baking sheet nearby.",
    "make the waffles Blend the date-water mixture with butter in a blender or food processor until smooth. Add the eggs, one at a time and blend. Sprinkle in the baking powder, baking soda, and salt, and blend until combined. Add the flour along with the cornstarch and pulse just until flour disappears.",
    "cook the waffles Heat your waffle iron. In my waffle iron, I find a low-medium setting to be best for these waffles. Brush the iron with melted butter, or coat with a nonstick cooking spray. Pour the waffle batter into the iron in about ½ cup scoopfuls. If it seems too thick to be pourable, you can stir in 1 to 2 tablespoons extra water. Cook the waffles according to manufacturer’s directions. As they finish, transfer them to the prepared rack. They will be soft. When all the waffles are done, finish them in the heated oven for 5 minutes, which will crisp them up.",
    "to serve If the sauce has firmed, gently rewarm it. Ladle the sauce generously over each single waffle, then finish with a dollop of whipped cream and a few flakes of sea salt. Enjoy with abandon."
  ]
}