{
  "title": "Sticky Chili Chicken with Hot-and-Sour Pineapple",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 6 to 8",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "4pounds bone-in, skin-on chicken (legs, thighs, breasts, and/or wings all work)",
    "Kosher salt and freshly ground black pepper",
    "½cup light brown sugar",
    "½cup unseasoned rice wine vinegar",
    "½cup sambal or other chili paste",
    "¼cup fish sauce",
    "¼cup fresh lime juice",
    "2teaspoons crushed red pepper flakes",
    "2garlic cloves, finely grated",
    "½pineapple, peeled and cored, cut into 1½-inch spears or wedges",
    "½shallot or 4 scallions, thinly sliced",
    "1cup fresh cilantro, tender leaves and stems, coarsely chopped",
    "2tablespoons toasted sesame seeds",
    ""
  ],
  "directions": [
    "1 Season the chicken with salt and pepper and place in a large resealable plastic bag or large baking dish.2 Combine the brown sugar, vinegar, sambal, fish sauce, lime juice, crushed red pepper flakes, and garlic in a medium bowl, whisking to dissolve the sugar. Pour over the chicken, massaging to make sure everything gets equal love. Seal the plastic bag or wrap the baking dish and let sit at least 30 minutes, refrigerated.3 Preheat the oven to 425°F. Place the chicken and pineapple on a rimmed baking sheet (for easier clean-up, line with foil or parchment). Drizzle the remaining marinade over everything and place in oven.5 Roast until the chicken is deeply browned, caramelized, and cooked through (if you have a pastry or BBQ brush, feel free to baste the chicken and pineapple periodically with the rendered chicken fat juices), 50 to 60 minutes. By this time, the pineapple will also be impossibly golden and juicy, giving up all the goods, which makes for a delicious, sticky sauce.6 Remove from the oven and transfer to a serving platter, carving up the chicken and slicing the pineapple for easier serving, if you like. Scatter with the shallot, cilantro, and sesame before serving."
  ]
}