{
  "title": "Stir-Fried Cumin Lamb",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Servings: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 2 (14- to 16-ounce) lamb shoulder chops (blade or round bone), 3/4 to 1 inch thick, trimmed",
    "- 1 tablespoon water",
    "- 1/4 teaspoon baking soda",
    "- 1 tablespoon cumin seeds, ground",
    "- 2 teaspoons Sichuan chili flakes",
    "- 11/4 teaspoons Sichuan peppercorns, ground",
    "- 1/2 teaspoon sugar",
    "- 4 teaspoons dark soy sauce",
    "- 1 tablespoon Shaoxing wine",
    "- 1/2 teaspoon cornstarch",
    "- 1/4 teaspoon table salt",
    "- 5 teaspoons vegetable oil, divided",
    "- 4 garlic cloves, minced",
    "- 1 tablespoon grated fresh ginger",
    "- 1/2 small onion, sliced 1/4 inch thick",
    "- 2 tablespoons coarsely chopped fresh cilantro"
  ],
  "directions": [
    "1. Cut bones from lamb and trim all visible connective tissue from meat; discard bones. (You should have about 1 pound of lamb after trimming.) Transfer lamb to plate and freeze until firm, about 15 minutes. Slice meat against grain on bias 1/4 inch thick. Combine water and baking soda in medium bowl. Add lamb and toss to coat; let sit for 5 minutes.",
    "2. Combine cumin, chili flakes, peppercorns, and sugar in small bowl. Add soy sauce, Shaoxing wine, cornstarch, and salt to lamb mixture and toss to coat.",
    "3. Heat empty 14-inch flat-bottomed wok over high heat until just beginning to smoke. Drizzle 1 teaspoon oil around perimeter of wok and heat until just smoking. Add half of lamb mixture and cook, tossing slowly but constantly, until just cooked through, 1 to 3 minutes; transfer to clean bowl. Repeat with 1 teaspoon oil and remaining lamb mixture; transfer to bowl.",
    "4. Heat remaining 1 tablespoon oil in now-empty wok over medium heat until shimmering. Add garlic and ginger and cook, stirring constantly, until fragrant, 15 to 30 seconds. Add onion and cook, tossing slowly but constantly, until onion begins to soften, 1 to 2 minutes. Return lamb mixture to wok and toss to combine. Sprinkle cumin mixture over lamb mixture and toss until onion takes on pale orange color. Sprinkle with cilantro and serve."
  ]
}