{
  "title": "Stir-Fried Beef and Gai Lan",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Servings: 4",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 (8-ounce) center-cut filet mignon, trimmed",
    "- 1 pound gai lan, stalks trimmed",
    "- 5 teaspoons Shaoxing wine, divided",
    "- 1 tablespoon soy sauce, divided",
    "- 2 teaspoons cornstarch, divided",
    "- 3/4 cup chicken broth, divided",
    "- 2 tablespoons oyster sauce",
    "- 1 1/2 teaspoons toasted sesame oil, divided",
    "- 2 tablespoons vegetable oil, divided",
    "- 1 1/2 teaspoons grated fresh ginger",
    "- 3/4 teaspoon minced garlic, divided"
  ],
  "directions": [
    "1. Cut beef into 4 equal wedges. Transfer to plate and freeze until very firm, 20 to 25 minutes. Meanwhile, remove leaves, small stems, and florets from gai lan stalks; slice leaves crosswise into 1 1/2-inch strips (any florets and stems can go into pile with leaves), and cut stalks on bias into 1/4-inch-thick pieces. Set aside. When beef is firm, stand 1 piece on its side and slice against grain 1/4 inch thick. Repeat with remaining pieces. Transfer to bowl. Add 1 teaspoon Shaoxing wine, 1 teaspoon soy sauce, and 1 teaspoon cornstarch and toss until beef is evenly coated; set aside.",
    "2. In second bowl, whisk together 1/2 cup broth, oyster sauce, 1/2 teaspoon sesame oil, remaining 4 teaspoons Shaoxing wine, remaining 2 teaspoons soy sauce, and remaining 1 teaspoon cornstarch; set aside. In third bowl, combine 4 teaspoons vegetable oil, ginger, and 1/4 teaspoon garlic.",
    "3. Heat empty 14-inch flat-bottomed wok over high heat until just beginning to smoke. Drizzle 1 teaspoon vegetable oil around perimeter of wok and heat until just smoking. Add gai lan stalks and cook, stirring slowly but constantly, until spotty brown and crisp-tender, 3 to 4 minutes; transfer to separate bowl.",
    "4. Add remaining 1 teaspoon sesame oil, remaining 1 teaspoon vegetable oil, and remaining 1/2 teaspoon garlic to now-empty wok and cook, stirring constantly, until garlic is fragrant, about 15 seconds. Add gai lan leaves and cook, stirring frequently, until vibrant green, about 1 minute. Add remaining 1/4 cup broth and cook, stirring constantly, until broth evaporates, 2 to 3 minutes. Spread mixture evenly in serving dish.",
    "5. Add ginger-garlic mixture to now-empty wok and cook, stirring constantly, until fragrant, about 30 seconds. Add beef mixture and cook, stirring slowly but constantly, until no longer pink, about 2 minutes. Return stalks to wok and add oyster sauce mixture. Cook, stirring constantly, until sauce thickens, 30 to 60 seconds. Place mixture on top of leaves. Serve."
  ]
}