{
  "title": "Stir-Fried Chicken in Black Bean Sauce",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 4 (5- to 7-ounce) bone-in chicken thighs, trimmed",
    "- 2 tablespoons soy sauce, divided",
    "- 1 large egg white",
    "- 1 teaspoon cornstarch",
    "- 1/4 teaspoon table salt",
    "- Pinch black pepper",
    "- 2 tablespoons water",
    "- 2 teaspoons sugar",
    "- 2 teaspoons Shaoxing wine",
    "- 1/2 teaspoon toasted sesame oil",
    "- 1 cup peanut or vegetable oil",
    "- 1/2 green bell pepper, cut into 1-inch pieces",
    "- 1/2 red bell pepper, cut into 1-inch pieces",
    "- 1 small shallot, sliced thin",
    "- 4 garlic cloves, minced",
    "- 1 scallion, cut into 1-inch pieces",
    "- 1 tablespoon douchi (fermented black beans), rinsed and patted dry",
    "- 1 teaspoon grated fresh ginger"
  ],
  "directions": [
    "1. Place 1 chicken thigh skin side down on cutting board. Using a sharp paring knife, cut a slit along the length of the thigh bone to expose the bone. Use the tip of the knife to cut the meat from the bone, being careful not to cut through the skin. Slip the knife under the bone to separate it from the meat. Discard the bone and trim any remaining cartilage, keeping the skin intact. Repeat with remaining thighs. Cut chicken into 1-inch pieces.",
    "2. Combine 2 teaspoons soy sauce, egg white, cornstarch, salt, and pepper in a large bowl; add chicken and toss to coat. Cover and refrigerate for at least 30 minutes or up to 2 hours. Combine water, sugar, Shaoxing wine, sesame oil, and remaining 4 teaspoons soy sauce in a small bowl; set aside.",
    "3. Line a large plate with a triple layer of paper towels. Heat peanut oil in a 14-inch flat-bottomed wok over medium-high heat to 375 degrees. Using a spider skimmer or slotted spoon, carefully add chicken in an even layer and cook until well browned and cooked through, 8 to 10 minutes, flipping as needed. Transfer chicken to prepared plate to drain.",
    "4. Pour off all but 2 tablespoons oil from wok. Heat oil over medium-high heat until just smoking. Add bell peppers and shallot and cook, tossing slowly but constantly, until crisp-tender, about 2 minutes.",
    "5. Push vegetables to one side of the wok and add garlic, scallion, douchi, and ginger to the clearing. Cook, mashing garlic mixture into wok until fragrant, about 30 seconds. Stir garlic mixture into vegetables.",
    "6. Add chicken and sauce mixture and cook, tossing constantly, until sauce has thickened, about 30 seconds. Serve."
  ]
}