{
  "title": "Stir-Fried Udon (Yaki Udon)",
  "source": "The Gaijin Cookbook - Ivan Orkin",
  "servings": "Serves 4",
  "categories": [
    "Japanese",
    "The Gaijin Cookbook - Ivan Orkin"
  ],
  "ingredients": [
    "Noodles and Vegetables",
    "1pound frozen udon",
    "½small head cabbage, cut into 2-inch squares",
    "1large carrot, peeled and cut into matchsticks",
    "3ounces shimeji (beech) or oyster mushrooms",
    "Sauce",
    "½cup soy sauce",
    "2tablespoons sake",
    "2tablespoons mirin",
    "2tablespoons oyster sauce",
    "8ounces thinly sliced skinless pork belly (see Thinly Sliced Meat) or uncured bacon, cut into 1-inch pieces",
    "1tablespoon minced garlic",
    "4scallions, sliced lengthwise in half and cut into 1-inch lengths",
    "1red bell pepper, cored, seeded, and cut into matchsticks",
    "2teaspoons toasted sesame oil",
    "½cup tightly packed katsuobushi (bonito flakes)"
  ],
  "directions": [
    "1. For the noodles: Place the udon in a colander and run under hot water to defrost the noodles. Alternatively, put them in a bowl and microwave for 1 minute. Set aside while you prep the vegetables.",
    "2. For the vegetables: Place the cabbage and carrot in a microwave-safe container and zap them for 2 minutes. If you’ve managed to locate some shimejis, cut off the bottoms and separate the mushrooms. If you’re using oyster mushrooms, give them a quick rinse and slice them into ½-inch-wide strips.",
    "3. For the sauce: Stir all the ingredients together in a bowl; set aside.",
    "4. Set a large nonstick skillet over medium-high heat and add the pork belly or bacon. Sauté until the meat is mostly cooked through, 3 to 4 minutes.",
    "5. Add the garlic and cook until fragrant, about 30 seconds. Add the scallions and bell pepper and cook until slightly softened, about 2 minutes. Follow with the mushrooms and cook for 2 minutes. Finally, add the microwave-softened cabbage and carrots and cook until you start to see some browning along the edges of the vegetables, 3 to 4 minutes more. Scoop the pork and vegetables into a bowl and set aside. Give the pan a quick wipe with a paper towel and return it to the stove.",
    "6. Turn the heat up to high and coat the pan with the sesame oil. Add the udon and sauté until you begin to see some crisp edges on the noodles, about 2 minutes. Add the pork and vegetables and toss to combine. Add the sauce and toss to coat. Leave the pan on the heat for another minute to thicken the sauce, then fold in the katsuobushi and serve."
  ]
}