{
  "title": "Stir-Fried Rice Cakes",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "1(8-ounce) boneless pork chop, 3/4 to 1 inch thick, trimmed",
    "3tablespoons plus 1 teaspoon vegetable oil, divided",
    "5teaspoons soy sauce, divided",
    "1tablespoon water",
    "1tablespoon Shaoxing wine",
    "1teaspoon cornstarch",
    "1teaspoon toasted sesame oil, divided",
    "1/4teaspoon white pepper",
    "2teaspoons oyster sauce",
    "1 1/2teaspoons dark soy sauce",
    "2garlic cloves, minced",
    "2ounces shiitake mushrooms, stemmed and sliced thin",
    "1carrot, peeled and sliced thin on bias",
    "1pound refrigerated or frozen sliced rice cakes, thawed if necessary and rinsed",
    "1/2cup chicken broth",
    "4ounces snow peas, strings removed and halved crosswise"
  ],
  "directions": [
    "1. Transfer pork to plate and freeze until firm, about 15 minutes. Slice pork crosswise 1/4 inch thick on bias. Cut each slice lengthwise into 1/4-inch strips.",
    "2. Combine 1 teaspoon vegetable oil, 2 teaspoons soy sauce, water, Shaoxing wine, cornstarch, 1/2 teaspoon sesame oil, and pepper in medium bowl; add pork and stir to break up clumps. Cover and refrigerate for at least 15 minutes or up to 1 hour.",
    "3. Whisk oyster sauce, remaining 1 tablespoon soy sauce, dark soy sauce, and remaining 1/2 teaspoon sesame oil together in small bowl; set aside.",
    "4. Heat empty 14-inch flat-bottomed wok over high heat until just beginning to smoke. Drizzle remaining 3 tablespoons vegetable oil around perimeter of hot wok and heat until just smoking. Add pork mixture and garlic and cook, tossing slowly but constantly, until pork is no longer pink, about 1 minute. Add mushrooms and cook, tossing slowly but constantly, until beginning to soften, about 1 minute. Add carrot and cook, tossing slowly but constantly, until crisp-tender, about 1 minute.",
    "5. Push pork and vegetables to center of wok and place rice cakes on top. Add broth, cover, and cook until rice cakes are softened, about 2 minutes. Stir in snow peas and reserved sauce and cook uncovered, stirring frequently, until sauce is thickened and coats rice cakes, and snow peas are crisp tender, about 1 minute. Serve."
  ]
}