{
  "title": "Strawberry Cornmeal Layer Cake",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves 8",
  "categories": [
    "Dessert Person - Claire Saffitz",
    "Desserts"
  ],
  "ingredients": [
    "Cornmeal Cake",
    "Butter for the pan",
    "½cup yellow cornmeal (2.6 oz / 75g)",
    "1cup buttermilk (8.5 oz / 240g), at room temperature",
    "1teaspoon vanilla extract",
    "1½cups all-purpose flour (7 oz / 200g)",
    "1tablespoon baking powder (0.42 oz / 12g)",
    "½teaspoon baking soda",
    "¾teaspoon Diamond Crystal kosher salt",
    "¾cup sugar (5.3 oz / 150g)",
    "2teaspoons finely grated lemon zest",
    "10tablespoons unsalted butter (5 oz / 142g), at room temperature",
    "2large eggs (3.5 oz / 100g), at room temperature",
    "Assembly",
    "1½pounds (681g) strawberries, hulled (about 4 cups)",
    "¼cup sugar (1.8 oz / 50g)",
    "2teaspoons fresh lemon juice",
    "2cups heavy cream (16 oz / 454g)"
  ],
  "directions": [
    "Preheat the oven and prepare the pan: Arrange an oven rack in the center position and preheat the oven to 350°F. Butter the bottom and sides of the springform pan or cake pan. Line the bottom of the pan with a round of parchment paper and butter the parchment paper. Set aside.",
    "Hydrate the cornmeal: In a small bowl or 2-cup measuring cup, stir together the cornmeal, buttermilk, and vanilla (this softens the cornmeal so it’s not too crunchy in the baked cake). Set aside.",
    "Mix the dry ingredients: In a medium bowl, whisk together the flour, baking powder, baking soda, and salt. Set aside.",
    "Make the batter: In the bowl of a stand mixer, combine the sugar and lemon zest and massage the mixture with your fingertips to work the zest into the sugar until the mixture is very fragrant and resembles wet sand. Place the bowl on the mixer, attach the paddle, and add the butter. Beat on medium-high until very light and fluffy, scraping down the sides of the bowl once or twice, about 4 minutes. Add the eggs one at a time, beating well after each addition and scraping down the sides of the bowl as needed, until the mixture is very pale and light, another 2 minutes. Reduce the mixer to low and add the flour mixture in 3 additions, alternating with the buttermilk mixture in 2 additions, mixing just until the batter is smooth and homogenous. Stop the mixer and fold the batter several times by hand with a flexible spatula, scraping the bottom to make sure everything is well mixed. Scrape the batter into the prepared pan and smooth the top.",
    "Bake: Bake the cake until the surface is deeply browned, the sides have started to pull away from the pan, the center springs back when pressed, and a cake tester or toothpick inserted into the center comes out clean, 40 to 50 minutes. Remove the cake from the oven and set it aside to cool in the pan for at least 20 minutes. Cut around the sides of the cake with a paring knife or small offset spatula to loosen and invert it onto a plate. Remove the parchment paper and invert again onto a wire rack so the cake is right-side up. Let it cool completely.",
    "Macerate the berries: Select 5 of the largest strawberries you have, trim them so they’re all the same height, and set aside. Slice the remaining berries lengthwise, halving the smallest and cutting the rest into ¼-inch-thick slices. Toss the sliced berries into a large bowl with the sugar and lemon juice and let sit until juices have accumulated, at least 15 minutes.",
    "Whip the cream: Meanwhile, in a stand mixer fitted with the whisk attachment, beat the heavy cream, starting on medium-low and increasing the speed gradually to high as the cream thickens, until you have soft peaks. (Alternatively, beat the cream in a large bowl with a hand mixer.) Refrigerate the cream until you’re ready to assemble the cake (but not for more than 1 hour, or the cream will deflate).",
    "Split the cake into two layers: Using a serrated knife, score a horizontal line all around the side of the cake at the midway point. Then, using long, even strokes and positioning the knife parallel to the work surface, follow the shallow cut as a guide all the way around the cake to slice it into two even layers. Lift the top layer off the cake and set aside.",
    "Assemble the cake: Carefully transfer the bottom layer to a cake stand or serving plate, cut-side up. Arrange the 5 trimmed berries that you set aside hulled-side down over the bottom layer, placing one in the center and the other 4 spaced evenly around. These are going to act like stilts to keep the top layer elevated so you don’t squish out all the cream as you slice the cake. Spoon two-thirds of the sliced berries and any juices over the bottom layer, arranging them around the whole berries. Remove the whipped cream from the refrigerator and spoon half over the berries, spreading all the way to the edges of the cake. Carefully place the top layer of cake onto the bottom layer, cut-side down. Spread the remaining whipped cream over the top of the cake, making decorative swooshes and swirls. Spoon the remaining berries and juices on top and serve."
  ]
}