{
  "title": "Strip Steaks au Poivre",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4PRODUCE 1 large shallot 4 garlic cloves 3 thyme sprigs DAIRY 3 tablespoons unsalted butter ½ cup heavy cream MEAT 2 (1½-inch-thick) New York strip steaks (about 1½ pounds total) PANTRY Kosher salt and freshly ground black pepper 1 tablespoon whole black peppercorns 2 tablespoons vegetable oil ⅓ cup cognac, dry sherry, or brandy Flaky sea salt",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1large shallot",
    "4garlic cloves",
    "3thyme sprigs",
    "DAIRY",
    "3tablespoons unsalted butter",
    "½cup heavy cream",
    "MEAT",
    "2(1½-inch-thick) New York strip steaks (about 1½ pounds total)",
    "PANTRY",
    "Kosher salt and freshly ground black pepper",
    "1tablespoon whole black peppercorns",
    "2tablespoons vegetable oil",
    "⅓cup cognac, dry sherry, or brandy",
    "Flaky sea salt"
  ],
  "directions": [
    "Prep your mise:",
    "- Pat 2 New York strip steaks dry with paper towels. Season all over with 2½ teaspoons kosher salt and a generous amount of ground black pepper. Set aside for at least 15 minutes.",
    "- Finely chop 1 large shallot.",
    "- Thinly slice 2 garlic cloves. Firmly smash 2 additional garlic cloves to really break them open so that they are able to release a lot of flavor when they hit the skillet.",
    "- Place 1 tablespoon whole peppercorns in a sealable plastic bag, seal the bag, place it on your countertop, and crush with the bottom of a small saucepan to coarsely crack them. If you have a mortar and pestle, use that! They should be coarser than ground black pepper.",
    "Cook the steaks:",
    "- Heat a 12-inch cast-iron skillet over medium-high heat for 4 minutes.",
    "- Add 2 tablespoons vegetable oil to the skillet. Add the steaks and cook, undisturbed, until a deep golden brown crust forms underneath, about 3 minutes. Flip and cook on the second side until equally golden brown, 3 minutes longer. (If the steaks have a fat cap, upend them on their sides, stabilizing them with tongs, and sear the edges, until browned, 2 to 3 minutes per edge.)",
    "Baste: Reduce the heat to medium-low. Add 1 tablespoon butter, 3 thyme sprigs, and the 2 smashed garlic cloves to the pan. Use a spoon to continuously baste the steak, about 2 minutes. If you’ve never basted a steak and want to learn how, right this way! Insert your instant-read thermometer into the thickest part of the steak. Once it registers 120°F, transfer it to a cutting board to rest.",
    "Make the pan sauce:",
    "- Add 2 tablespoons butter to the skillet along with the sliced garlic, shallot, and crushed peppercorns. Cook, stirring often, until the shallot and garlic are softened but not browned, 4 to 5 minutes.",
    "- Turn off the heat (cognac is flammable!) and add ⅓ cup cognac. Return the skillet to medium heat and cook until the cognac has mostly evaporated and your spoon leaves streaks in the skillet when you stir, 1 to 2 minutes.",
    "- Add ½ cup heavy cream, bring to a simmer, and cook until it coats the back of a spoon, about 1 minute. Season with kosher salt.",
    "Serve:",
    "- Slice the steak against the grain. Not sure what the grain is or how to find it? Right this way. Transfer to a serving platter.",
    "- Pour any resting juices back into the skillet and stir them into the sauce. Spoon the sauce generously over the steak, season with flaky sea salt, and serve immediately."
  ]
}