{
  "title": "Stuffed Cabbage (Roru Kyabetsu)",
  "source": "The Gaijin Cookbook - Ivan Orkin",
  "servings": "Serves 4 to 6",
  "categories": [
    "Japanese",
    "The Gaijin Cookbook - Ivan Orkin"
  ],
  "ingredients": [
    "1large head green cabbage",
    "1½pounds ground beef (fattier is better)",
    "1large egg, beaten",
    "½onion, finely chopped",
    "½cup panko",
    "2tablespoons ketchup",
    "1tablespoon soy sauce",
    "2teaspoons kosher salt",
    "4cups Dashi",
    "One 28-ounce can crushed tomatoes"
  ],
  "directions": [
    "1 Fill a large pot halfway with water and bring it to a boil. Carefully cut the core out of the cabbage (don’t worry about removing all of it) and loosen the outer leaves from the base. Stick a fork into the hole where the core used to be and lower the whole head into the boiling water. Gently roll the head back and forth to submerge all of the outer leaves, then use another fork to peel them off into the water as they loosen. You’re looking to harvest 7 or 8 intact large leaves. Once you have enough, lower the heat, remove the head, and let the separated leaves simmer for 8 more minutes. Meanwhile, prepare an ice bath in a large bowl. Drain the cooked cabbage leaves in a colander, then plunge them into the ice bath to cool. Drain and pat dry. Reserve the rest of the cabbage for another use.",
    "2 Combine the ground beef, egg, onion, panko, ketchup, soy sauce, and salt in a bowl and mix with your hands until everything is blended, but don’t overwork it.",
    "3 Lay a cabbage leaf on a work surface and spoon about ½ cup of the beef mixture into the center of the leaf. Fold the sides of the leaf over, then roll it up from the ­bottom to form a cylinder. Use a couple toothpicks to secure the roll. Repeat with the remaining leaves and filling.",
    "4 Combine the dashi and crushed tomatoes in a Dutch oven or other large heavy-bottomed pot and set over medium heat. Nestle the cabbage rolls in the liquid. Don’t worry if you can’t get all of them submerged—you can move them around as they cook. Bring the liquid to a simmer, then drop the heat to low and cook until the cabbage is completely tender and the meat is cooked through, about 1 hour.",
    "5 Serve one or two cabbage rolls per plate (remember to remove the toothpicks), and top them with a big spoonful of smoky tomato sauce."
  ]
}