{
  "title": "Sunchoke Clam Chowder",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "5dozen littleneck clams",
    "1⁄4 cup (40 g) kosher salt, for cleaning the clams, plus more to season the soup",
    "1⁄4 cup (40 g) cornmeal, for cleaning the clams",
    "1cup (240 ml) dry white wine",
    "8ounces (227 g) bacon, diced",
    "3large celery stalks, diced",
    "1large yellow onion, diced",
    "Freshly cracked black pepper, to taste",
    "2tablespoons unsalted butter",
    "1⁄2 cup (65 g) all-purpose flour",
    "4cups (940 ml) low-sodium chicken broth, homemade or store-bought",
    "2dried bay leaves",
    "2large (about 1 pound/454 g) Yukon Gold potatoes, diced",
    "8ounces (227 g) sunchokes, peeled and diced",
    "1⁄2 cup (120 ml) heavy cream",
    "1lemon, zested and then cut into wedges for serving",
    "For Serving",
    "Hot sauce",
    "Celery leaves",
    "Thinly sliced fresh chives",
    "Fresh dill",
    "Oyster crackers"
  ],
  "directions": [
    "1. Place the clams in a large bowl. Rinse and scrub off any visible dirt or grit. Cover with cold water, and add 1⁄4 cup (40 g) salt and 1⁄4 cup (40 g) cornmeal. Let sit for 30 minutes to purge the clams of their sand. Lift the clams out of the water and transfer to a colander. (If there is still sand remaining in the water, change out the water and repeat the purging-and-soaking process until no sand remains.) Rinse off any remaining cornmeal, and discard any cracked or chipped clams along with any open ones that don’t close with a gentle nudge.2. Add half of the clams to a large pot along with the wine. Bring to a boil over medium-high heat, cover, and reduce the heat to medium-low. Steam the clams until they open, 6 or 7 minutes. Discard any clams that do not open. Transfer the clams to a large bowl using a slotted spoon. Add the remaining clams to the same cooking liquid, and repeat the steaming process.3. Strain the clam cooking liquid through a fine-mesh strainer into a large bowl. You should have about 2 cups (480 ml) of liquid. Rinse and dry the pot.4. Return the pot to medium heat, add the bacon, and cook, stirring often, until crispy, 6 to 8 minutes.5. Add the celery and onion, and season with salt and pepper. Cook, stirring occasionally, until the veggies soften, 6 to 8 minutes.6. Add the butter and melt. Sprinkle in the flour, and stir until the veggies are coated in a thick paste.7. Pour in the reserved clam liquid and chicken broth, and whisk to incorporate, scraping the bottom of the pot to release any brown bits. Toss in the bay leaves. Bring to a boil, scraping the bottom of the pot to prevent scorching, and reduce the heat to a low simmer.8. Stir in the potatoes and sunchokes. The soup will start to thicken. Simmer over low heat, uncovered and stirring often, until the potatoes and sunchokes are soft, 25 to 35 minutes.9. Meanwhile, remove the clam meat from the steamed clams and roughly chop.10. When the soup has thickened, remove the bay leaves. Stir in the cream and chopped clam meat. Simmer just 1 or 2 minutes longer to heat the cream and clams. Season with salt and pepper, and stir in the lemon zest.11. Serve, garnished with hot sauce, celery leaves, chives, dill, and oyster crackers and with lemon wedges on the side for squeezing."
  ]
}