{
  "title": "Sunday Brisket",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 6 to 8",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "2medium red onions",
    "1whole garlic head",
    "1large rosemary sprig",
    "1cup packed parsley leaves",
    "½lemon",
    "MEAT",
    "5 to 6pounds flat or point brisket, untrimmed",
    "PANTRY",
    "Kosher salt and freshly ground black pepper",
    "1tablespoon extra-virgin olive oil",
    "2tablespoons white miso paste",
    "1cup dry red wine",
    "1(28-ounce) can crushed tomatoes",
    "1teaspoon red pepper flakes",
    "2(14.5-ounce) cans chickpeas"
  ],
  "directions": [
    "1. Season the brisket: Set a 5- to 6-pound brisket on a rimmed baking sheet and season it all over with 3 tablespoons salt and lots of freshly ground black pepper. Transfer the brisket to the fridge to chill, uncovered, for at least 8 hours and up to 24.",
    "2. Do some prep:",
    "- Position a rack in the lower third of your oven. Preheat the oven to 300°F. Remove the brisket from the refrigerator.",
    "- Cut 2 medium red onions in half through the root end. Peel and discard the skins and then cut each half into 3 wedges through the root end.",
    "- Firmly smash and peel a head’s worth of garlic cloves. Set 1 clove aside for the gremolata.",
    "3. Build the braise:",
    "- Heat a large Dutch oven over medium-high heat for 4 to 5 minutes until it’s really hot. Pat the brisket dry. Add 1 tablespoon olive oil to the pot, swirling the pot to coat the surface. Add the brisket, fattier-side down, and cook, undisturbed, until you establish some good golden brown color, 8 to 10 minutes. Using tongs and a spatula, flip the brisket and sear the other side until golden brown, 8 minutes longer. Transfer the brisket to a rimmed baking sheet.",
    "- Spoon out and discard all but enough fat to lightly coat the bottom of the pot. Add the onions in a single layer and cook until brown on one side, 3 to 4 minutes. Flip and brown the other side, 3 to 4 minutes longer.",
    "- Stir in the smashed garlic and season with 1 teaspoon salt. Cook until the garlic just begins to take on a little bit of color and is fragrant, 1 to 2 minutes.",
    "- Add 2 tablespoons miso paste and stir to incorporate.",
    "- Add 1 cup dry red wine and cook, stirring and scraping the bottom of the pot, until it has reduced slightly, is a bit thicker and more viscous, and no longer smells as harshly alcoholic, about 4 minutes.",
    "- Stir in 1 (28-ounce) can of crushed tomatoes, 1 large rosemary sprig, 1 teaspoon red pepper flakes, and 1 teaspoon salt. Nestle the brisket back into the pot. Add enough water so that the brisket is only peeking out of the liquid by about 1 inch (about 1½ cups water). Bring the liquid to a simmer over medium-high heat.",
    "4. Braise the brisket: Cover the pot with a tight-fitting lid and transfer it to the oven to braise until the brisket is very tender when prodded in the thickest part with a fork, 3 to 4 hours total, depending on how thick your brisket is. While it cooks, once every hour, spoon the sauce up and over the brisket.",
    "5. Finish the sauce:",
    "- Let the brisket cool, uncovered, in the pot for 10 minutes. Using a pair of tongs and a large spatula, transfer the brisket to a large cutting board.",
    "- Ladle or spoon off as much of the rendered fat that has risen to the top of the pot as you can and discard it.",
    "- Drain 2 (14.5-ounce) cans of chickpeas into a fine-mesh strainer and rinse. Stir into the sauce. Set over medium heat and cook the sauce, stirring occasionally, until slightly reduced, 5 to 10 minutes longer.",
    "6. Make the gremolata: Finely chop 1 cup packed parsley leaves and transfer to a small bowl. Finely grate the zest of ½ lemon and the reserved garlic clove into the bowl. Stir with a fork to combine.",
    "7. Serve:",
    "- Once the brisket has rested for at least 10 minutes, slice into ½-inch-thick slices against the grain with a serrated knife. Not sure how to find the grain? Right this way.",
    "- Spoon some of the chickpeas and sauce into shallow serving bowls and top each with a few slices of brisket and a sprinkle of gremolata."
  ]
}