{
  "title": "Sunday Gravy",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6 to 8",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Gravy:",
    "1pound (454 g) lamb neck bones (these should be meaty), cut into 2-inch (5 cm) pieces",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Olive oil, for searing",
    "2medium yellow onions, small diced",
    "8garlic cloves, minced",
    "3tablespoons tomato paste",
    "Two 24-ounce (680 g) jars passata",
    "2dried bay leaves",
    "1tablespoon granulated sugar",
    "1⁄2 teaspoon red pepper flakes",
    "1batch Tina’s Meatballs, prepared through step 2",
    "1pound (454 g) hot Italian sausage (4 or 5 links)",
    "Braciole:",
    "1⁄2 cup (55 g) finely grated pecorino Romano",
    "1⁄2 cup (45 g) panko breadcrumbs",
    "1⁄4 cup (15 g) finely chopped fresh parsley",
    "2tablespoons olive oil",
    "3garlic cloves, finely grated",
    "1egg",
    "Kosher salt and freshly cracked black pepper, to taste",
    "8very thin slices (1 to 11⁄2 pounds/454 to 680 g) top round steak (see Note)",
    "Butcher’s twine, for securing the braciole",
    "1⁄2 cup (120 ml) water, divided",
    "For Serving:",
    "11⁄2 pounds (680 g) dry pasta of choice, cooked to al dente",
    "Freshly grated pecorino Romano, to taste"
  ],
  "directions": [
    "1. Make the gravy: Season the lamb neck bones all over with salt and black pepper. Heat a large, heavy-bottomed pot over medium heat. Coat the bottom of the pot with a thin layer of olive oil. Add the neck bones, and sear all over until golden brown, 4 to 6 minutes per side. Transfer the bones to a plate, and set aside.",
    "2. Add the onions and garlic to the pan, and cook, stirring occasionally, until softened, 5 or 6 minutes. Add the tomato paste, and cook, stirring constantly, until slightly browned, 1 or 2 minutes.",
    "3. Add the passata, bay leaves, sugar, and red pepper flakes. Season with a big pinch of salt and a good amount of black pepper. Nestle the lamb neck bones in the sauce, and bring to a simmer. Reduce the heat to low, cover, and cook, stirring occasionally to prevent scorching on the bottom, for 1 hour.",
    "4. Meanwhile, make the braciole: Mix the pecorino Romano, panko, parsley, olive oil, garlic, and egg in a medium bowl. Season with salt and black pepper.",
    "5. Lightly season one side of the beef slices with salt and black pepper. Spread a thin layer of filling over each slice of beef to cover. Starting at one of the shorter ends, roll up the beef to make a small roll. Repeat with the remaining beef and stuffing.",
    "6. Tie the rolls with two pieces of butcher’s twine to secure. Lightly season the outside of the braciole with salt and pepper.",
    "7. Heat a large cast-iron pan over medium heat, and coat the bottom of the pan with a thin layer of olive oil. Working in two batches, add the braciole and sear on all sides until golden, 4 or 5 minutes per side. Transfer to the pot with the gravy.",
    "8. Deglaze the cast-iron pan with about 1⁄4 cup (60 ml) water, and add the drippings to the pot of gravy. (Skip this step if the fond smells or looks at all burnt.)",
    "9. Reduce the heat to low, and simmer, covered, uncovering and stirring occasionally to prevent scorching, for 2 hours.",
    "10. Clean the cast-iron pan, and heat over medium-high heat. Coat the pan with a thin layer of olive oil. Add the meatballs, and sear on one side until golden, 4 or 5 minutes.",
    "11. Use a small spoon or offset spatula to carefully flip over the meatballs, and brown the other side for another 1 or 2 minutes. (The meatballs will not be fully cooked at this point; they will finish in the sauce.) Transfer the meatballs to a plate, and set aside.",
    "12. Deglaze the pan with 1⁄4 cup (60 ml) water, and add the drippings to the pot of gravy.",
    "13. Clean the cast-iron pan, and heat over medium heat. Coat the bottom of the pan with a thin layer of olive oil. Add the sausage, and sear until golden on both sides, 3 or 4 minutes per side. Set the browned sausage aside. (There won’t be any worthwhile fond here, so no need to deglaze!)",
    "14. After the braciole has cooked in the gravy for 2 hours, gently nestle in the seared meatballs and sausage. This will be a snug mixture! Simmer the sauce over very low heat, uncovered, stirring every now and then, until the sauce has reduced a bit and the meatballs and sausage are cooked through, about 1 hour.",
    "15. Remove the sausage links, cut them into 2-inch (5 cm) pieces (Tina always did this, so I do it, too!), and return them to the pot. Remove the twine from the braciole, and return them to the gravy. Tina always left the lamb bones in the gravy to serve because their meat is really tasty as well.",
    "16. Season the gravy with salt and black pepper to taste, remove the bay leaves, and enjoy the fruits of your labor over a big bowl of pasta, with a mountain of freshly grated pecorino Romano on top. I like serving this family style so people can pick and choose whatever meat they want from the pot."
  ]
}