{
  "title": "Sungold Pasta with Lemony Shellfish, Garlic, and Pistachios",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 4 to 6",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "⅓cup olive oil, plus more as needed",
    "8garlic cloves, thinly sliced",
    "1large fennel bulb, thinly sliced, fronds reserved (if available)",
    "Kosher salt and freshly ground black pepper",
    "1tablespoon fennel seeds, crushed, plus more for serving",
    "1teaspoon crushed red pepper flakes, plus more for serving",
    "1pound Sungold or cherry tomatoes, halved if especially large",
    "12ounces dried linguini or fettuccini",
    "½cup dry white wine",
    "1½pounds small littleneck or manila clams, cockles, or mussels, scrubbed and soaked",
    "1½pounds medium shrimp or prawns (head-on is optional), unpeeled or peeled",
    "½cup toasted pistachios, very finely chopped or ground",
    "Flaky sea salt",
    "1lemon, halved"
  ],
  "directions": [
    "1 Put a large pot of salted water on to boil.2 Heat the olive oil in the largest skillet or wide, heavy-bottomed pot you have over medium-high heat. Add the garlic and fennel slices and season with salt and pepper. Cook, stirring occasionally, until the garlic and fennel are lightly browned and completely tender, 8 to 10 minutes.3 Add the fennel seeds and crushed red pepper flakes, stirring to toast a bit. Add the tomatoes and season with salt and pepper. Cook until the tomatoes nearly all burst and are broken down into a jammy, sauce-y sauce, 10 to 12 minutes (using a wooden spoon or spatula to kind of gently crush them as they cook is a good idea).4 Meanwhile, the pasta water should be boiling at this point, so go ahead and drop the pasta into the pot, cooking it to a nice al dente (timing will vary depending on pasta, so best to follow instructions on the package). Drain the pasta, reserving about ½ cup pasta water.5 Add the wine and continue to cook until the sauce is reduced by about half, 4 to 5 minutes. Add the clams and if you have a lid, place it on top (if not, they will still open, just might take a few minutes more). Steam a few minutes just until they start to open (2 to 5 minutes, depending on size). Add the shrimp, season with salt and pepper, and toss to coat, continuing to cook until all the clams have opened and the shrimp are opaque and cooked through, another 3 to 5 minutes.6 Since the skillet or pot is likely getting a little crowded, I like to toss my pasta with all of the tomato-y seafood business in the largest bowl I have, adding a bit of pasta water as I toss to keep things saucy. Season with salt, pepper, and more crushed red pepper flakes, if you like.7 Transfer the mixture to a large serving bowl (or serve it straight from the mixing bowl) and top with the pistachios, flaky salt, fennel fronds, and, if you like, more fennel seeds and crushed red pepper flakes. Offer the lemon halves alongside for squeezing over."
  ]
}