{
  "title": "Supremely Creamy Tomato & Cheddar Soup",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1large Vidalia or yellow onion",
    "10scallions",
    "¾cup dill leaves, plus more for serving",
    "DAIRY",
    "3tablespoons unsalted butter, plus more for serving, if desired",
    "1½cups heavy cream",
    "3ounces sharp white cheddar cheese",
    "PANTRY",
    "Kosher salt and freshly ground black pepper",
    "1tablespoon tomato paste",
    "3(14.5-ounce) cans crushed tomatoes (preferably fire-roasted)",
    "Crusty bread, for serving (optional)",
    "Flaky sea salt"
  ],
  "directions": [
    "1. Prep your aromatics:- Finely chop 1 large Vidalia onion.- Thinly slice 10 scallions crosswise.- Coarsely chop ¾ cup dill leaves.",
    "2. Start the soup:- Heat 3 tablespoons butter in a large Dutch oven over medium heat until melted. Add the onion, scallions, 1¼ teaspoons kosher salt, and 1½ teaspoons black pepper and cook, stirring often, until the alliums are very soft but not quite brown at the edges, 7 to 8 minutes.- Add 1 tablespoon tomato paste to the onions and cook, stirring often, until the paste begins to stick to the bottom of the pot and turns a shade darker in color, about 3 minutes.- Add 3 (14.5-ounce) cans crushed tomatoes, 1½ cups heavy cream, and 1½ cups water and stir well to combine. Continue to cook until the soup has thickened slightly, letting the flavors meld together, 6 to 8 minutes.- Remove from the heat and stir in 1½ teaspoons kosher salt. Taste and add more salt if needed—canned tomatoes contain varying amounts of salt, so use your best judgment and adjust.",
    "3. Serve:- Coarsely grate 3 ounces sharp white cheddar cheese (about 1 cup).- Divide the soup among serving bowls and top each bowl with a generous handful of the grated cheddar cheese, some more black pepper, and more dill leaves.- Set out some good crusty bread and room-temperature butter (if desired) and flaky sea salt for serving."
  ]
}