{
  "title": "Swedish Cardamom Buns",
  "source": "Cooking.nytimes.com",
  "servings": "16 to 18 buns",
  "categories": [],
  "ingredients": [
    "1 1/4cups/300 milliliters whole milk",
    "2 1/4teaspoons active dry yeast (from one 1/4-ounce packet)",
    "4cups/510 grams unbleached all-purpose flour",
    "1/4cup plus 3 tablespoons/90 grams granulated sugar",
    "6tablespoons/85 grams unsalted butter (3/4 stick), softened",
    "2tablespoons ground cardamom (see Note)",
    "1teaspoon fine sea salt",
    "1cup plus 2 tablespoons/250 grams unsalted butter (2 1/4 sticks), slightly softened",
    "1cup/200 grams granulated sugar",
    "2tablespoons ground cardamom",
    "1/4teaspoon fine sea salt",
    "1large egg",
    "20green cardamom pods",
    "3tablespoons granulated sugar"
  ],
  "directions": [
    "Prepare the dough: In a small saucepan set over medium-low heat, bring the milk to 105 to 110 degrees. Remove it from the heat and pour it into a small bowl. Sprinkle the yeast on top, give it a quick whisk and let it rest a few minutes to dissolve and activate. If the yeast looks like it’s clumping, whisk it gently.",
    "In the bowl of a stand mixer fitted with the dough hook, combine the flour, sugar, butter, cardamom, salt and the yeasted milk. Mix on the lowest setting until just combined and beginning to form a dough, 1 to 2 minutes. Continue on low to knead dough, about 2 minutes. It should go from shaggy and coarse to smooth and shiny. Working inside the bowl, give the dough a couple more kneads by hand to bring it together. You can also knead the dough entirely by hand on a work surface. (It’ll take 8 minutes or so.)",
    "Line a 9-by-13-inch quarter sheet pan with parchment paper and dump the kneaded dough out onto it. Using your hands, pat and shape the dough into a large rectangular block. Make 4 or 5 shallow, 1/4-inch-deep slashes in the dough with a knife. Cover the baking sheet with a damp kitchen towel or plastic wrap, and transfer the dough to the refrigerator to chill for 2 hours.",
    "Make the filling: In the bowl of a stand mixer fitted with the paddle attachment, beat the butter, sugar, cardamom and salt on low speed just to form a granular paste. (It should resemble marzipan.) Don’t overbeat it: You don’t want it to be too soft or get fluffy. You can also do this by hand in a bowl, combining the ingredients with a spatula or bench scraper.",
    "Line two 13-by-18-inch baking sheets with parchment paper or silicone mats.",
    "Remove the dough from the refrigerator — it will have risen, but don’t be surprised if the rise isn’t significant — and let sit at room temperature for a few minutes so it’s not so stiff that you can’t roll it out. Place the dough on a thick silicone mat or a very lightly floured work surface and use a rolling pin to roll it out to a roughly 15-by-18-inch rectangle a little more than 1/8-inch thick, with the shorter side facing you. As you roll it in both directions, pause occasionally between rolls to relax the dough by patting it, lifting it and pulling it to straighten out any ripples.",
    "Dot the surface of the dough with mounds of the filling. Using an offset spatula, gently spread the filling all over the surface of the dough.",
    "With the short side of the dough facing you, fold the top third of the dough down over the middle third of the dough, then fold the bottom third up to cover the remaining dough.",
    "Go over the dough with the rolling pin a couple of times, vertically, to flatten the edges, and stretch it a few more inches before cutting and shaping. You want a 12-by-16-inch rectangle (the longer side will be facing you). If any filling oozes out, use your offset spatula to remove it so your workstation doesn’t get sticky.",
    "Using the straight edge of a ruler and a pastry cutter (or very gently using a small, sharp knife), trim any uneven edges. Cut the dough vertically into 16 1-by-12-inch-long strips. Starting from the end, gently wrap one strip around the tips of your index, middle and fourth finger (or just the index and middle if you’ve got strong hands), like a bandage, two or three times, letting the dough overlap and working cautiously so it doesn’t tear. Place your thumb on top of the wrapped dough, on the side closer to your wrist, to secure the shape, then loop the remaining end of the strand over and through the center of the bun, tucking it under at the base of the bun. You should have a rounded bun made out of bandage-like strips. The knotted part will be unexposed, hidden at the bottom.",
    "Place each bun on the prepared baking sheets as you go, patting it down for a flatter shape. Space the buns evenly (you can eyeball it). Leave them to proof at room temperature, uncovered, for about 1 hour. They should expand and soften.",
    "Meanwhile, heat oven to 450 degrees.",
    "Finish the buns: In a small bowl, using a fork or whisk, beat the egg together with 1 tablespoon water until well combined and frothy.",
    "Grind the cardamom pods in a spice grinder, making sure you break down the tough outer husks. Transfer the ground spice to a small bowl and whisk it together with the sugar.",
    "Lightly brush each bun with the egg wash, and generously sprinkle the tops of the buns with the cardamom sugar, using about 1/2 teaspoon per bun.",
    "Bake for 8 minutes, then lower temperature to 375 degrees, rotate trays completely (180 degrees and top to bottom, bottom to top) and continue baking for an additional 12 minutes. The surface of the buns should be golden brown. (Some butter may seep out of the buns and pool — that’s normal — but if you’re worried that it will burn on the trays, cover the buns with parchment paper toward the end of baking, once they’ve reached the desired color.)",
    "Let the buns cool for 10 minutes before eating, so the spiced, sweet buttery goo that pools around their edges can harden into crispy candylike edges, or let them cool entirely."
  ]
}