{
  "title": "Sweet and Salty Cream Cheese Tart",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 8 to 10",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "FOR THE CRUST",
    "5ounces Ritz crackers or Nilla wafers (see Note)",
    "2tablespoons light brown sugar",
    "4tablespoons (½ stick) unsalted butter, melted",
    "Pinch of kosher salt",
    "FOR THE FILLING",
    "1pound (2 8-ounce packages) full-fat cream cheese, preferably room temperature, or 2 cups labne",
    "1cup sour cream or full-fat Greek yogurt",
    "½cup granulated sugar",
    "2large eggs",
    "3tablespoons fresh grapefruit, lemon, lime, or orange juice",
    "Flaky sea salt",
    "Fresh citrus, halved or sliced (optional)"
  ],
  "directions": [
    "1 Preheat the oven to 325°F.2 Make the crust. Pulse the crackers in a food processor until you’ve got a fine crumb (crumb, not powder!); you can also do this by hand by placing the crackers in a resealable bag and crushing or smashing with a skillet or rolling pin. Transfer to a medium bowl and add the brown sugar and butter, followed by the salt. Using your hands, mix until the crumbs are evenly coated and you have a wet sand texture.4 Press the crust into an unlined 9-inch tart or springform pan, or cake pan lined with parchment. You can use a lined 8-inch square baking pan here, although expect a slightly thicker outcome (maybe that is your preference). Using the bottom of a measuring cup or small bowl, really press the crumb mixture in there—otherwise it can be challenging to cut later on.5 Bake the crust until it’s lightly golden brown at the edges (it gets baked one more time, so best not to overdo it here), 10 to 15 minutes.6 Make the filling. Combine the cream cheese, sour cream, and granulated sugar in the bowl of a food processor and process until impossibly smooth and well blended, scraping down the sides as needed to incorporate any stubborn chunks of cream cheese. Add the eggs, grapefruit juice, and a pinch of salt, and keep processing until it’s even smoother and creamier than before (a miracle!).7 Pour into the baked crust and bake until the whole thing is set and no longer jiggles when tapped, 25 to 35 minutes (it should not brown at all).8 Turn the oven off and open the door a crack. Let the tart sit in there for about 15 minutes before transferring it to a wire rack on a counter to cool completely. Then place in the fridge to chill at least 1 hour (this gradual cooling is to prevent any unsightly cracks from appearing on the surface, which can happen when there is a sudden or drastic change in temperature).9 To serve, sprinkle with a little flaky salt and serve with some fresh citrus of your choosing, if you like."
  ]
}