{
  "title": "Tagliatelle alla Bolognese (Pasta with Bolognese Ragù)",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Ragù",
    "1(170g / 6 oz) slab pancetta",
    "370g / 1 large onion",
    "150g / 1 large carrot, peeled",
    "150g / 2 stalks celery",
    "454g / 1 lb ground beef",
    "454g / 1 lb ground pork",
    "454g / 1 lb ground veal",
    "56g / ¼ cup olive oil",
    "130g / ½ cup tomato paste",
    "220g / 1 cup dry white wine",
    "474g / 2 cups water, plus more q.b.",
    "237g / 1 cup milk",
    "To Finish",
    "1batch egg-based dough (this page, this page, and beginning on this page)",
    "30g / 2 Tbsp unsalted butter, cold and cubed",
    "45g / ½ cup finely grated parmigiano-reggiano"
  ],
  "directions": [
    "1 - Place the meat grinder and small die in the refrigerator for at least 1 hour to chill. (You can speed the process by placing it in the freezer for 30 minutes instead.)",
    "2 - To make the ragù, fit your meat grinder with the small die. Put the pancetta through the meat grinder twice and set aside.",
    "3 - Chop the onion, carrot, and celery into ½- to 1-inch pieces. Put the carrot, celery, and onion through the meat grinder. Once all are ground, gather them in cheesecloth and wring to squeeze out the liquid. This is your soffritto.",
    "4 - Place a large, heavy sauce pot or Dutch oven over low heat. Add the pancetta and cook until the fat has rendered and the pancetta is cooked but not crispy or brown, 5 to 8 minutes.",
    "5 - Add the beef, pork, and veal and turn the heat up to medium-high. Sauté, breaking up the meat with a wooden spoon, until lightly browned, about 5 minutes.",
    "6 - Turn off the heat. Transfer the meat in the pot to a bowl and set aside. Discard any brown bits from the pot.",
    "7 - Return the pot to low heat. Add the oil and soffritto and gently cook, stirring frequently, until softened but without color, 5 to 8 minutes. Add the tomato paste and cook for 1 to 2 minutes to integrate. Add the meat back to the pot and stir to combine.",
    "8 - Add the wine and cook until reduced by about half and most of the alcohol has cooked off, 2 to 3 minutes.",
    "9 - Add the water and continue to cook over very low heat for 2 to 3 hours. The ragù is ready when the flavors have melded and the meat is fully softened. Check every 30 minutes and add more water q.b. to ensure it doesn’t dry out. It should not brown or stick to the bottom of the pot. As it cooks down, it should thickly coat your spoon as you stir.",
    "10 - Remove from the heat. Add the milk and stir to incorporate. At this point, your ragù should have a nice sheen.",
    "11 - Measure out 512g / 2¼ cups ragù and set aside. Transfer the remainder to an airtight container and refrigerate for up to 5 days or freeze for another use.",
    "12 - To finish, following the instructions for tagliatelle on this page, make 624g / 1 lb 6 oz with the pasta dough.",
    "13 - Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "14 - Place a large sauté pan over low heat. Add the ragù and 1 to 2 ladles (55 to 115g / ¼ to ½ cup) pasta cooking water and stir to combine.",
    "15 - Once the ragù mixture is warm, add the butter and stir to combine. Set aside.",
    "16 - Add the tagliatelle to the water and cook for 30 seconds to 1 minute, until tender but not soft.",
    "17 - Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Add another 1 to 2 ladles (55 to 115g / ¼ to ½ cup) pasta cooking water. Using a large spoon, gently fold together the pasta and sauce for 30 seconds to 1 minute to marry. If the sauce begins to tighten, add a splash of pasta cooking water to loosen and continue folding to marry.",
    "18 - Remove from the heat. Add half of the parmigiano and fold to integrate, adding a few more splashes of pasta water if necessary. The meat should cling to the pasta and the sauce should still have a sheen.",
    "19 - Divide the pasta into bowls and garnish with the remaining parmigiano."
  ]
}