{
  "title": "Tagliatelle With Matsutake Mushrooms, Lemon, And Mint",
  "source": "Pasta - Missy Robbins",
  "servings": "4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "1batch egg dough (this page)",
    "454g / 1 lb matsutake mushrooms",
    "168g / ¾ cup plus 14g / 1 Tbsp olive oil",
    "25g / 5 cloves garlic, finely chopped",
    "60g / ¼ cup unsalted butter, cold and cubed",
    "45g / ½ cup finely grated parmigiano-reggiano",
    "Peel of 1 lemon, pith removed and peel finely chopped",
    "20g / ¼ cup finely chopped parsley",
    "30mint leaves",
    "Black pepper, q.b.",
    ""
  ],
  "directions": [
    "1. Following the instructions for tagliatelle on this page, make 624g / 1 lb 6 oz with the pasta dough.2. Clean the dirt from the mushrooms by peeling off the first layer of flesh on the stems with a paring knife. Be careful to avoid taking off too much. With a slightly damp towel, gently but thoroughly clean away any remaining dirt.3. Slice the mushrooms very thinly, cutting through both the caps and the stems so you end up with slices about ⅛ inch thick by about 2 inches long.4. Place a large sauté pan over high heat and add 56g / ¼ cup of the olive oil. Add about one-third of the mushrooms in an even layer and sear, turning to ensure even coloring, until golden brown around the edges and cooked through, 5 to 7 minutes. (Matsutakes are very meaty mushrooms, so they will still feel firm but have a glossy sheen.) Transfer the mushrooms to a plate or bowl and set aside.5. Repeat this process, adding 56g / ¼ cup of the olive oil with each batch of mushrooms until you have cooked all of the mushrooms. Reserve the sauté pan.6. Bring a large pot of water to a boil over high heat. Generously salt the water.7. While the water is heating, return the sauté pan to low heat and add the remaining 14g / 1 Tbsp olive oil. Add the garlic and gently cook until aromatic but without color, 10 to 15 seconds. Return the mushrooms to the pan and stir to combine.8. Add the tagliatelle to the water and cook for 30 seconds to 1 minute, until tender but not soft.9. While the pasta is cooking, add 2 to 3 ladles (115g to 170g / ½ to ¾ cup) pasta cooking water to the pan. Add the butter and swirl the contents of the pan to emulsify.10. Using tongs or a pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Toss for 1 to 2 minutes to marry the pasta and the sauce.11. Remove the pan from the heat and add half of the parmigiano. Add the lemon peel and parsley and continue tossing to combine. If the sauce begins to tighten, add a splash of pasta cooking water to loosen. When the pasta is properly married, it will cling to the sauce and have a glossy sheen.12. Divide into bowls and garnish with the remaining parmigiano, the mint, and with pepper q.b."
  ]
}