{
  "title": "Taiwanese Fried Pork Chops",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Serves: 4",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 tablespoon soy sauce",
    "- 1 tablespoon michiu (Taiwanese rice wine)",
    "- 2 garlic cloves, minced to paste",
    "- 1 1/2 teaspoons sugar",
    "- 1 1/2 teaspoons water",
    "- 3/4 teaspoon five-spice powder",
    "- 1/2 teaspoon table salt",
    "- 1/4 teaspoon white pepper",
    "- 2 (8- to 10-ounce) bone-in pork rib chops, 3/4 to 1 inch thick, trimmed",
    "- 2 large eggs",
    "- 1 cup coarse sweet potato starch",
    "- 3 cups peanut or vegetable oil for frying"
  ],
  "directions": [
    "1. Whisk soy sauce, michiu, garlic, sugar, water, five-spice powder, salt, and pepper together in a large bowl.",
    "2. Place 1 chop on a cutting board. Cover with a sheet of plastic wrap and pound to 1/4-inch thickness, being careful to avoid the bone. Repeat with the remaining chop. Add chops to the bowl with marinade and toss to evenly coat. Cover and refrigerate for 1 hour or up to 4 hours.",
    "3. Beat eggs in a shallow dish. Spread sweet potato starch in a second shallow dish. Working with 1 chop at a time, remove from marinade (do not pat dry) and dip into egg, turning to coat well and allowing excess egg to drip back into the dish. Coat evenly on all sides with sweet potato starch, pressing on chop to adhere. Transfer to a rimmed baking sheet.",
    "4. Line a second rimmed baking sheet with a triple layer of paper towels. Add oil to a 14-inch flat-bottomed wok or large Dutch oven until it measures about 1/2 inch deep and heat over medium-high heat to 350째F. Using tongs, carefully lower 1 chop into oil. Fry until just starting to brown on both sides, about 1 minute per side. Transfer chop to the towel-lined sheet. Return oil to 350째F and repeat with the remaining chop; transfer to the sheet.",
    "5. Heat oil to 375째F. Return 1 chop to oil and cook until golden brown on both sides, about 1 minute per side; transfer to the sheet lined with fresh paper towels. Return oil to 375째F and repeat with the remaining chop. Let chops rest for 5 minutes. Carve meat from the bone and slice 1/2 inch thick. Serve meat with bones."
  ]
}