{
  "title": "Tandoori Chicken — Grilled or Broiled",
  "source": "Youtube.com",
  "servings": "",
  "categories": [
    "Indian"
  ],
  "ingredients": [
    "For the masala:",
    "1tablespoon cumin seeds",
    "1tablespoon coriander seeds",
    "4black cardamom pods",
    "1/2teaspoon black peppercorns",
    "1teaspoon fenugreek seeds",
    "1/2cinnamon stick",
    "For the chicken:",
    "5pounds of chicken legs and/or thighs (makes enough for dinner plus leftovers for tikka masala)",
    "salt",
    "2tablespoons Kashmiri chili powder (or some combination of cayenne pepper [hot] and paprika [not hot], depending on how hot you want it)",
    "Juice of 1 lemon",
    "1/2cup full-fat Greek yogurt",
    "2-3tablespoons ginger-garlic paste, prepackaged or freshly peeled and grated",
    "red food coloring (optional)",
    "For the vegetable side (makes enough veg for 2-3 people):",
    "1large white onion",
    "1-2green bell peppers",
    "salt",
    "high-heat oil"
  ],
  "directions": [
    "Put all the spices for the masala into a pan and toast them on medium-high heat until fragrant and just smoking. Grind them into a powder.",
    "Score the chicken pieces with several deep cuts each, and put them into a large glass or stainless-steel bowl. Scatter the pieces with a good coating of salt, followed by the masala (you probably won't need all of it) and the ginger-garlic paste. Squeeze in the lemon juice, put in the yogurt and the food coloring (if using). Mix until each piece is coated in a homogenous paste. Cover the bowl and marinate it in the fridge for up to 24 hours.",
    "IF GRILLING, get a full chimney of natural chunk charcoal lit and lay it into your grill. Spread a heavy layer of fresh charcoal on top, lay the grate over, and let it heat for 5 minutes. Your bottom vents should be all the way open. Clean and grease the grill grate, put on all the chicken pieces and immediately cover. Your lid's vents should be half-closed. Cook the first side for about 5 minutes until charred, flip the pieces, put the lid back on, and let the chicken cook undisturbed until done, 30-40 more minutes. Internal temperature should be at least 170 F.",
    "IF BROILING, put an oven-safe cooling rack onto a sheet pan and lay the chicken pieces on the rack. Get your broiler as hot as it gets, and put the chicken under it, as close as you can get the pieces without touching the element. Broiled until charred, about 10 minutes. Take the pan out and flip the pieces. Broil the second side until charred, about 10 minutes. If the drippings on the bottom of the sheet pan start to burn and smoke, pour some water into the pan. After the second side is charred, take the chicken's temperature. Internal temperature should be at least 170 F. If the chicken needs more cooking, turn the broiler off and the oven on 350 F, and put the chicken back in on a middle rack until done.",
    "For the vegetable side, peel the onion whole, cut it into thick latitudinal slices and push to separate the pieces into individual rings. Cut the top of the pepper, reach in and tear out the seeds, then cut into thick latitudinal slices. Preheat a wide pan on high heat and coat the bottom with oil. When the oil is smoking, put in the veg, sprinkle it with salt, and let it sit for a moment until brown before tossing. Let the pieces cook a few minutes more and then take them out when they seem half-cooked.",
    "Serve the chicken pieces on top of a bed of vegetables with lemon wedges on the side."
  ]
}