{
  "title": "Taters, Shrooms & Peas with Parmesan Cream",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "4 as a side dish or 2 as a main dish with an egg on top",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "For the Parmesan Cream",
    "1cup heavy cream",
    "1½cups finely grated Parmigiano-Reggiano cheese, plus more for garnish",
    "½teaspoon kosher salt",
    "A few gratings of fresh nutmeg (about ⅛ teaspoon)",
    "For the Vegetables",
    "1pound Yukon Gold potatoes, skin on, scrubbed and cut into ½-inch cubes",
    "4tablespoons olive oil",
    "½pound white mushrooms, trimmed and quartered",
    "1large shallot, thinly sliced",
    "½teaspoon dried thyme",
    "1tablespoon butter",
    "1cup frozen peas",
    "Kosher salt and freshly ground black pepper"
  ],
  "directions": [
    "MAKE THE PARMESAN CREAM: In a small saucepan, bring the cream to a simmer over medium-low heat and reduce by half, about 5 minutes. Whisk in the Parm, salt, and nutmeg. Cook 1 additional minute, whisking, then remove from the heat and cover to keep warm.",
    "COOK THE VEGETABLES: Place the potatoes in a microwave-safe bowl and add ½ inch of water to the bowl. Cover the bowl with a plate or plastic wrap, poke some holes in the plastic, and microwave on high until the potatoes can be pierced with a fork, 8 to 10 minutes (stop the microwave at 8 minutes to check the potatoes’ progress). Drain the potatoes and set aside.",
    "Meanwhile, in a large skillet, heat 2 tablespoons of the oil over medium-high heat until hot but not smoking. Add the mushrooms, spread them out in one layer, and cook, without touching them, until they get a little golden, about 3 minutes. Add the remaining 2 tablespoons olive oil and the shallots and cook until translucent, about 2 minutes.",
    "Add the potatoes and thyme and cook, stirring occasionally, until the potatoes turn a little golden, 6 to 7 minutes. Add the butter and peas and cook until the peas are heated through, about 3 minutes. Season to taste with salt and pepper (but remember that delicious salty Parm cream is gonna go in there too), cook for another minute to let the seasoning soak in, and transfer to a serving dish. Drizzle the Parmesan cream (start with about half and add more as desired) over the vegetables and gently toss. Season to taste with salt and pepper and garnish with some grated Parm."
  ]
}