{
  "title": "Temaki Party",
  "source": "The Gaijin Cookbook - Ivan Orkin",
  "servings": "Serves 6",
  "categories": [
    "Japanese",
    "The Gaijin Cookbook - Ivan Orkin"
  ],
  "ingredients": [
    "Rice",
    "As I noted earlier, properly cooked and seasoned rice is an under-appreciated component of sushi in the States. That being said, on most nights that we host a temaki party, I go the easy route and serve unseasoned short-grain rice that’s been cooked in a rice cooker, and it works great. Two cups of raw rice should make plenty for six people. But if you want to make proper sushi rice, see this recipe.",
    "Nori",
    "It’s honestly very difficult to tell the difference between various brands of nori from the packages. Eventually you’ll find a kind you like, but it may take some trial and error to land on one that’s aromatic and crisp, rather than lifeless and papery. If your options are limited, just buy what you can get—even packages of presliced, seasoned seaweed squares will be fine.",
    "If you’re working with whole sheets of nori, cut each piece into quarters and give each person about 10 squares to start. If you’re so inclined, you can toast each sheet of nori before slicing by waving it over an open flame for 10 to 15 seconds. Don’t get too close or linger too long over the flame, or the nori will shrivel and burn. But don’t be too shy either, or the seaweed won’t pick up any toasty flavor.",
    "Fillings",
    "Provide your guests with a nice mix of cooked and raw protein, plus plenty of fresh herbs and veggies. It doesn’t take much to fill a temaki, but you want to have enough of each filling so that everyone can have a taste. As for what to buy, the world is your oyster. Pick whatever you and your family like. As a guideline, here’s what I would set out for six people:",
    "Seafood (¼ to ½ lb each of 4–5 types):",
    "Tuna (sushi-grade)",
    "Sea bass (suzuki)",
    "Yellowtail (hamachi)",
    "Negitoro (chopped tuna with scallion)",
    "Scallops (hotate)",
    "Fluke (hirame)",
    "Ikura (salmon roe)",
    "Cooked items (warm or room temp, choose 1–2):",
    "Kimchi Pork Belly (Buta Kimchi)",
    "Miso-Glazed Salmon (Sake Misozuke)",
    "Seasoned Ground Chicken (Tori Soboro)",
    "Vegetables & herbs:",
    "Avocado (1–2, sliced)",
    "Cucumber (½, cut into batons)",
    "Shiso leaves (≈20)",
    "Myoga (Japanese ginger, optional)",
    "Condiments:",
    "Soy sauce (good quality)",
    "Wasabi (fresh or tube)"
  ],
  "directions": [
    "Assembly",
    "Provide each guest with a bowl of rice, a stack of nori, and a small dish of soy sauce. Arrange all fillings, vegetables, and condiments in the center of the table.",
    "Hold a nori square in one hand. Spread a small scoop of rice on the nori.",
    "Smear a little wasabi on the rice.",
    "Lay fillings in a line down the center of the rice.",
    "Roll up the nori like a taco.",
    "Lightly dip the tip in soy sauce and eat immediately."
  ]
}