{
  "title": "Ten-Spice Chicharron",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Yields: About 50 pieces",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "- One 2-pound piece of pork skin",
    "- Kosher salt",
    "- 6 cups canola oil",
    "- Ten-Spice Mix",
    "- Coconut vinegar, for serving"
  ],
  "directions": [
    "1. Preheat the oven to 300 degrees F.",
    "2. Put the pork in a large pot, cover with cold water by 2 inches, and add 1 tablespoon of kosher salt. Cover and cook until the skin is fork-tender, about 2 hours.",
    "3. Remove the skin from the water, pat dry with paper towels, and put on a large rimmed baking sheet, skin-side up. Refrigerate, uncovered, until cold, at least 8 hours and up to 24 hours. Once the skin is cold, scrape off as much of the fat as possible using a knife; discard the fat.",
    "4. Cut the skin into 1½ x 1½-inch pieces and lay them on a large rimmed baking sheet, making sure not to overlap the pieces. Place in a dehydrator set at 155 degrees F or in your oven set to its lowest setting (which can be between 150 and 170 degrees F). Allow the skin to “cook” for 12 hours (the skin will look dry and shiny and will be crisp). Remove the skin from the dehydrator or oven. At this point, you can fry the pieces if you wish to eat them immediately, or store in an airtight container and refrigerate.",
    "5. Heat the oil in a large wok or high-sided sauté pan until it registers 375 degrees F on a deep-fry thermometer. Line a rimmed baking sheet with several layers of paper towels.",
    "6. Fry the chicharrones in batches (making sure not to overcrowd the pot) and cook until golden brown, 3 to 5 minutes. Transfer (using a spider) to the prepared baking sheet and let drain for 20 seconds. Transfer the pieces to a large bowl and season with the spice mixture while still hot. Serve with coconut vinegar on the side for dipping."
  ]
}