{
  "title": "Teriyaki Chicken Thighs With Sesame Vegetables",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "8(5- to 7-ounce) bone-in chicken thighs, trimmed",
    "2tablespoons vegetable oil, divided",
    "1red bell pepper, stemmed, seeded, and cut into ¼-inch-wide strips",
    "8ounces shiitake mushrooms, stemmed and sliced thin",
    "3garlic cloves, minced, divided",
    "1tablespoon grated fresh ginger, divided",
    "8ounces snap peas, strings removed",
    "5tablespoons mirin",
    "5tablespoons soy sauce",
    "¼cup water",
    "3tablespoons sugar",
    "2teaspoons cornstarch",
    "⅛teaspoon red pepper flakes",
    "1tablespoon toasted sesame oil",
    "1tablespoon toasted sesame seeds",
    "½teaspoon table salt"
  ],
  "directions": [
    "1. Adjust 1 oven rack to lower-middle position and second rack 8 inches from broiler element. Heat oven to 450 degrees. Set wire rack in rimmed baking sheet lined with aluminum foil. Make 3 diagonal slashes through skin of each thigh with sharp knife (do not cut into meat). Brush chicken with 1 tablespoon vegetable oil. Lay chicken skin side up on half of prepared rack and roast for 20 minutes.",
    "2. Toss bell pepper and mushrooms with remaining 1 tablespoon vegetable oil, half of garlic, and 1½ teaspoons ginger. Spread vegetables over empty side of rack. Rotate rack and continue to roast for 10 minutes. Sprinkle snap peas over vegetables and continue to roast until chicken registers 165 degrees and vegetables start to brown, about 10 minutes.",
    "3. Remove sheet from oven and heat broiler. Place sheet on upper rack and broil until chicken and vegetables are well browned and chicken registers 175 degrees, 3 to 5 minutes. Meanwhile, combine mirin, soy sauce, water, sugar, cornstarch, pepper flakes, remaining garlic, and remaining 1½ teaspoons ginger in bowl and microwave, whisking occasionally, until thickened, 3 to 5 minutes.",
    "4. Remove sheet from oven, brush chicken with 3 tablespoons of sauce, and let rest for 5 minutes. Transfer vegetables to clean bowl; toss with sesame oil, sesame seeds, and salt. Serve vegetables and chicken with remaining sauce."
  ]
}