{
  "title": "Teriyaki 12.0",
  "source": "The Gaijin Cookbook - Ivan Orkin",
  "servings": "Makes 1 cup",
  "categories": [
    "Japanese",
    "The Gaijin Cookbook - Ivan Orkin"
  ],
  "ingredients": [
    "¼cup sake",
    "¼cup mirin",
    "¼cup soy sauce",
    "¼cup oyster sauce",
    "1tablespoon sugar"
  ],
  "directions": [
    "Whisk together all the ingredients in a bowl until the sugar is dissolved. Store in the fridge for up to a couple weeks.",
    "For beef or pork- Panfry or grill a piece of meat (hanger, bavette, skirt, or boneless rib-eye steaks all work well, as do boneless pork chops and pork tenderloin) to medium-rare or your desired doneness.- Allow to rest for a few minutes, then cut against the grain into ½-inch-thick slices and arrange on a platter.- Meanwhile, bring the teriyaki sauce to a simmer in a skillet over medium heat and cook until reduced to a syrupy consistency, 3 to 4 minutes.- Pour over the sliced meat and serve with warm rice.",
    "For chicken- Dust 4 or 5 boneless, skinless chicken thighs with all-purpose flour.- Brown the chicken on both sides in a well-oiled nonstick pan over medium heat.- Once the chicken is browned, add the teriyaki sauce, bring to a simmer, and cook until reduced to a syrupy consistency, 3 to 4 minutes, flipping the chicken pieces to coat them.- Serve over warm rice.",
    "For fish- Place a nonstick or well-seasoned carbon steel skillet over medium heat and coat with oil, then carefully lay a large fillet of firm fish (salmon, halibut, yellowtail, or black cod) in the pan.- Brown the fish on both sides, then add the teriyaki sauce, bring to a simmer, and cook until reduced to a syrupy consistency, 3 to 4 minutes, flipping the fish to coat it.- Serve over warm rice.",
    "For pork ribs- Slice a rack of ribs into 3-rib segments and add to a large zip-top plastic bag.- Add the teriyaki sauce and massage it into the meat. Seal the bag, forcing out as much air as you can, and marinate overnight in the fridge.- The next day, grill the ribs slowly over low heat until tender, glazing with the marinade remaining in the bag. Finish over high heat to get a nice crust on the ribs."
  ]
}