{
  "title": "Thai Fried Chicken",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "4",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "Marinade",
    "- 3 pounds chicken (drumsticks and thighs, bone in and skin on)",
    "- 5 garlic cloves, peeled",
    "- 1 teaspoon coriander seeds",
    "- 1 teaspoon whole white peppercorns",
    "- ¼ cup chopped fresh cilantro root or cilantro stems",
    "- 2 tablespoons Squid Brand fish sauce",
    "- 2 tablespoons oyster sauce",
    "- 2 teaspoons kosher salt",
    "- 1 teaspoon granulated sugar",
    "- 1 tablespoon MSG",
    "Frying",
    "- 2½ cups rice flour",
    "- 1 teaspoon kosher salt",
    "- 1 teaspoon MSG",
    "- 1 cup limestone water (or substitute seltzer mixed with baking soda)",
    "- 6 cups canola oil",
    "- 3 fresh pandan leaves",
    "- Crispy fried shallots, for garnish",
    "- Store-bought sweet chili sauce, for serving"
  ],
  "directions": [
    "1. Marinate the chicken: Pat the chicken dry with paper towels. Using a sharp knife, make shallow parallel cuts in one direction, about ½ inch apart. Rotate the chicken and make another set of cuts at angles to the first set, crossing at about 45 degrees to make a crosshatch pattern.",
    "2. Pound the garlic, coriander, white peppercorns, cilantro, fish sauce, oyster sauce, salt, sugar, and MSG in a mortar and pestle until it becomes a smooth paste, or combine all of the ingredients in the bowl of a food processor and process until smooth.",
    "3. Rub some of the marinade onto each piece of chicken, making sure to cover the entire piece. Place the chicken on a baking rack set over a baking sheet and refrigerate, uncovered, for at least 6 hours and up to 24 hours. Remove the chicken from the refrigerator 1 hour before frying to take the chill off. Doing this will keep the coating from getting too dark before the chicken is cooked through.",
    "4. Fry the chicken: Whisk ½ cup of the rice flour, the salt, and the MSG together. Slowly whisk in the limestone water and continue to whisk until smooth.",
    "5. Put the remaining 2 cups rice flour in a large baking dish.",
    "6. Heat the oil in a large wok or high-sided sauté pan until it reaches 350 degrees F. Once it reaches temperature, add the pandan leaves.",
    "7. While the oil is heating, dip each piece of chicken into the batter, making sure to evenly coat it. Immediately dredge in the flour and shake off any excess. Put on a baking rack set over a baking sheet and repeat with the remaining chicken. Let sit at room temperature for 15 minutes.",
    "8. Line another baking sheet with paper towels. Fry the chicken in batches, turning a few times, for about 12 minutes, until it is golden brown on both sides and just cooked through. Remove with a spider to the baking sheet. Repeat with the remaining chicken. Serve on a platter, topped with crispy fried shallots and sweet chili sauce on the side."
  ]
}