{
  "title": "Thai Papaya Salad (Som Tum)",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 4",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "3garlic cloves, smashed",
    "6fresh red Thai chilies, stems removed",
    "⅓cup palm sugar",
    "2tablespoons Squid Brand fish sauce",
    "1cup plus 2 tablespoons freshly squeezed lime juice (about 9 limes)",
    "½pound long beans, cut on bias into 1-inch pieces, or haricots verts, cut in half",
    "1green papaya, peeled and shredded (see Note)",
    "12cherry tomatoes, cut in half",
    "¼cup roasted unsalted peanuts",
    "¼cup dried shrimp"
  ],
  "directions": [
    "1. To make in a mortar and pestle: Combine the garlic and chilies in a large mortar and pestle and pound to a chunky paste. Add the palm sugar, fish sauce, and lime juice and keep pounding until the sugar dissolves.",
    "2. Add the long beans, papaya, and tomatoes to the mortar and lightly pound the salad, making sure that everything is coated in the dressing. Add 2 tablespoons of the peanuts and the dried shrimp and pound a bit more (the peanuts should remain chunky.) At this point you can adjust the seasoning: if you like it saltier, add a bit more fish sauce; if you like it sour, add a bit more lime juice. Transfer to a platter or shallow bowl and make sure to get all of the dressing out. Garnish with the remaining 2 tablespoons peanuts.",
    "3. To make in a food processor: Combine the garlic, chilies, palm sugar, fish sauce, and lime juice and pulse until coarsely chopped and the sugar begins to dissolve. Taste for seasoning and add more fish sauce for saltier or lime juice for more sour. Combine the beans, papaya, tomato, all but 2 tablespoons of the peanuts, and the dried shrimp in a large bowl and add the dressing and massage the ingredients for 2 minutes.",
    "4. Transfer to a platter or shallow bowl and garnish with the remaining 2 tablespoons peanuts."
  ]
}