{
  "title": "The 86'd Chicken-Fried Steak",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes 4",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "Chicken-Fried Steak",
    "1pound boneless strip or sirloin steak, fat cap trimmed, cut horizontally into 4 slices",
    "1cup buttermilk",
    "3cups all-purpose flour",
    "2½tablespoons garlic powder",
    "1tablespoon plus 1 teaspoon smoked paprika",
    "1tablespoon freshly ground black pepper",
    "2¼teaspoons kosher salt (Diamond Crystal or about half as much Morton)",
    "1teaspoon onion powder",
    "1teaspoon granulated chicken bouillon (preferably Totole brand; optional but optimal)",
    "Sandwiches",
    "Vegetable oil for deep-frying (about 2 quarts)",
    "1tablespoon Chicken Salt (this page), or more if you like",
    "6tablespoons unsalted butter, room-temp so it’s mayo-soft",
    "8thick slices soft white bread",
    "Bird Sauce (this page) for swiping",
    "Your favorite pepper jelly for swiping",
    "2cups coleslaw (see this page)",
    "20or so drained dill pickle chips"
  ],
  "directions": [
    "To prep the steak: One by one, put the steak slices between pieces of plastic wrap, put them on a cutting board, and use a meat mallet, rolling pin, or bottom of a small sturdy skillet to evenly pound the hell out of them, so they’re very thin (like, ⅛ inch at most). It’s totally OK if they get holes or tear a bit.",
    "Grab two medium mixing bowls. Pour the buttermilk into one. In the other, stir together the flour, garlic powder, paprika, black pepper, kosher salt, onion powder, and chicken bouillon.",
    "One by one, toss the steak slices in the flour mixture, patting to make sure each is evenly coated. Next, shake off any excess coating and submerge in the buttermilk. Let any excess drip back into the bowl and toss the steak in the flour mixture again, patting to evenly coat. As they’re done, put the slices on a plate. They’re ready to fry now, but they can hang out, uncovered, in the fridge for up to 12 hours.",
    "To assemble the sandwiches: Get 2 inches of oil to 350°F in a large heavy pot over medium-high heat. Line a baking sheet with a wire rack or paper towels.",
    "Working in two batches, fry the steaks, flipping them once, until they’re golden brown and super-crispy, like fried chicken, 5 to 6 minutes per batch. When they’re done, use tongs to move them to the baking sheet and season immediately on both sides with the chicken salt. (Sneak a bite and add more chicken salt, if you want.)",
    "Get a well-seasoned cast-iron skillet or griddle good and hot over medium heat. Swipe the butter on each side of the bread and toast in batches in the skillet until both sides are golden brown, 1 to 2 minutes per side. When they’re done, move them to a rack or stand them up so they lean against each other to keep from getting soggy.",
    "Generously swipe bird sauce on four of the toasted bread slices and swipe a generous amount of pepper jelly on the other four. Top each pepper jelly–slathered slice with ½ cup coleslaw, then the steak, then some pickle chips. Add the bird sauce–slathered slices and get wild."
  ]
}