{
  "title": "The Collard Melt",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes 6",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "Coleslaw",
    "6cups packed thinly sliced green cabbage",
    "Heaping ½ cup mayo (Duke’s or bust)",
    "¼cup thinly sliced white onion",
    "1½tablespoons distilled white vinegar, or more if you like",
    "1teaspoon kosher salt (Diamond Crystal or about half as much Morton), or more if you like",
    "¾teaspoon freshly ground black pepper",
    "Sandwiches",
    "1½cups Scotty’s Good-with-Everything Collard Greens (this page), or more if you like",
    "2sticks (16 tablespoons) unsalted butter, room-temp so it’s mayo-soft",
    "18slices seeded soft rye bread",
    "12thick-cut (⅛ inch) slices Swiss cheese",
    "Spicy Russian Dressing (this page) for slathering"
  ],
  "directions": [
    "To make the slaw: Combine the coleslaw ingredients in a large mixing bowl and mix really well with your hands, massaging the cabbage so it wilts to about 3 cups of coleslaw. I like it cold, so consider chilling it in the fridge, where it keeps for up to 3 days. Before you use it, taste and add more vinegar and salt, if you want.",
    "To assemble the sandwiches: Move an oven rack so it’s 4 to 6 inches from your broiler and preheat the broiler. Heat up the collards, along with a splash of pot likker or water to keep things juicy, in a small pot.",
    "Get a well-seasoned cast-iron skillet or griddle good and hot over medium heat. Swipe the butter on each side of the bread and toast in batches in the skillet until both sides are golden brown, 1 to 2 minutes per side. Once they’re all toasted, move twelve of the slices of rye to a baking sheet or two in a single layer, top each with a slice of cheese, and melt the cheese under the broiler, 1 to 2 minutes.",
    "Put a handful of the coleslaw on six of the cheesy slices of rye, top with the other cheesy slices (cheese-side up), then spoon on the collard greens (about ¼ cup per sandwich, or more if you like). Slather the remaining slices of rye with the Russian dressing and crown the sandwiches with them. Press down gently, slice in half, and serve."
  ]
}