{
  "title": "The Big Italian",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- ½ small red onion",
    "- 1 small garlic clove",
    "- 1½ pounds ripe, juicy tomatoes (any kind)",
    "- 2 cups basil leaves",
    "DAIRY",
    "- 8 ounces fresh mozzarella cheese",
    "MEAT",
    "- 1 (6-ounce) piece spicy salami or soppressata",
    "PANTRY",
    "- 6 ounces crusty sesame bread or ciabatta (about ½ loaf)",
    "- 8 tablespoons extra-virgin olive oil (½ cup), plus more for drizzling",
    "- Kosher salt",
    "- ¼ cup red wine vinegar",
    "- 1 teaspoon sugar",
    "- ¾ cup canned quartered artichokes",
    "- 12 pickled pepperoncini or other pickled peppers"
  ],
  "directions": [
    "1. Preheat the oven to 425°F.",
    "2. Toast the bread:- Cut the bread into 1-inch-thick slices. Tear the slices into roughly 1-inch irregular, craggy pieces and toss them on a large rimmed baking sheet with 2 tablespoons olive oil and ¼ teaspoon salt. Bake until golden brown on the outside and crisp, 12 to 15 minutes. Let cool.",
    "3. Macerate the onions and start the vinaigrette:- Thinly slice ½ small red onion and add it to a large bowl.- Finely grate 1 small garlic clove into the bowl. Add ¼ cup red wine vinegar, 1 teaspoon sugar, and 1 teaspoon salt and toss to combine.",
    "4. Prep and assemble the salad:- Drain the liquid from ¾ cup canned quartered artichokes and, if they are in oil, rinse them in a fine-mesh strainer and pat them dry. (That oil usually isn’t particularly tasty.)- Cut 1 (6-ounce) piece of salami in half lengthwise. Slice it crosswise into half-moons about the thickness of a nickel.- Trim and discard the stems of 12 pepperoncini. Add the artichokes, salami, and pepperoncini to the bowl.- If using large tomatoes, cut them in half. Cut around the core, into irregularly shaped 1½-inch pieces (about the size of your croutons). If using cherry tomatoes, cut them in half. Toss the tomatoes into the bowl to coat them in all those vinegary juices.- Tear 8 ounces mozzarella into pieces about the same size as the tomatoes and add them right to the bowl along with 2 cups basil and 6 tablespoons olive oil.",
    "5. Serve:- Toss everything several times to encourage the bread to soak up the juices. Taste and add more salt if you think it needs it. Drizzle with more olive oil and serve."
  ]
}