{
  "title": "The Cae Sal (Caesar Salad)",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 1 garlic clove",
    "- 1 lemon",
    "- 4 romaine hearts",
    "DAIRY",
    "- 2 large eggs",
    "- 2 ounces grated Parmesan cheese (about ½ cup), plus more for serving",
    "PANTRY",
    "- ½ crusty baguette (about 6 ounces)",
    "- 2 tablespoons extra-virgin olive oil",
    "- Kosher salt",
    "- Coarsely ground black pepper",
    "- 4 oil-packed anchovy fillets",
    "- 1 teaspoon Dijon mustard",
    "- ½ cup canola or vegetable oil",
    "- 1 teaspoon Worcestershire sauce"
  ],
  "directions": [
    "1. Make the croutons:- Preheat the oven to 350°F. Tear ½ of a baguette into irregular 1-inch pieces; you should end up with about 3 cups of torn bread. Toss on a rimmed baking sheet with 2 tablespoons olive oil, ½ teaspoon kosher salt, and a few good cranks of black pepper until well coated. Bake until deeply golden brown and crisp, 12 to 14 minutes. Let cool.",
    "2. Make the dressing:- Separate the yolks and whites of 2 large eggs. Place the yolks in a large bowl and reserve the whites for another use.- Finely grate 1 garlic clove and the zest of about half of a lemon into the large bowl. Squeeze in the juice of half of the lemon.- Finely chop 4 anchovies, then mash them to a paste, using the side of a chef’s knife until homogeneous; add to the large bowl.- Add 1 teaspoon Dijon mustard and whisk everything to combine. Place a damp kitchen towel underneath the bowl to stabilize it so it doesn’t slip as you whisk in the oil.- Start with a very thin stream, whisking constantly, and incorporate ½ cup of canola oil into the yolk mixture until it is thick, creamy, and pale yellow.- Whisk in ¾ teaspoon kosher salt, ¾ teaspoon black pepper, 1 teaspoon Worcestershire sauce, and 1 ounce grated Parmesan cheese (¼ cup). Taste the dressing on a leaf of romaine and adjust as needed.",
    "3. Prep the lettuce:- Tear the leaves of 4 romaine hearts into 2-inch pieces and transfer them to the bowl of dressing. Squeeze the juice of half of the lemon over the romaine, season with salt, and toss the leaves to coat.",
    "4. Serve:- Add the croutons and gently toss the lettuce with your hands until well coated. Add 1 ounce grated Parmesan cheese (¼ cup) and toss again. Divide among plates and top with more grated Parmesan and black pepper."
  ]
}