{
  "title": "The Cabbage Patch",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Serves 6 to 8",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "8cups very, very thinly sliced green cabbage (1 small head)",
    "1small red onion, sliced into thin half-moons",
    "1cup roughly chopped cilantro",
    "1cup Thai basil leaves, roughly chopped",
    "¼cup fresh lime juice (from 2 to 3 limes)",
    "2tablespoons thinly sliced lemongrass (tender insides only), from 1 large stalk",
    "1jalapeño, very thinly sliced",
    "Heaping 1 cup Pig Ear Cracklins Upgrade",
    "1½cups Coconut-Chile Dressing (see below)",
    "Kosher salt (optional)",
    "½cup roasted salted hulled sunflower seeds",
    "½cup Thai or Vietnamese fried garlic",
    "Coconut-Chile Dressing",
    "2tablespoons vegetable oil",
    "1small white onion, cut into ¼-inch pieces",
    "3garlic cloves, roughly chopped",
    "2dried Thai chiles or other dried Asian red chiles, stemmed",
    "One ½-inch piece fresh or thawed frozen galangal, peeled and finely chopped",
    "1tablespoon fish sauce",
    "1tablespoon white sugar",
    "2teaspoons Thai shrimp paste",
    "2teaspoons gochugaru (Korean chile flakes) or other red chile flakes",
    "1teaspoon Huy Fong Foods Sriracha",
    "1teaspoon jarred tamarind concentrate",
    "1cup unsweetened coconut milk",
    "2tablespoons fresh lime juice"
  ],
  "directions": [
    "In a large mixing bowl, toss together the cabbage, onion, cilantro, basil, lime juice, lemongrass, jalapeño, and cracklins, breaking the cracklins up a bit if they’ve clumped while frying.",
    "Add the dressing, toss really well, then taste and add some salt, if you want.",
    "Put it in a serving bowl or on a platter, sprinkle with the sunflower seeds and fried garlic, and eat up.",
    "For the Coconut-Chile Dressing:Get the oil shimmering in a small pot over medium heat. Cook the onion, garlic, Thai chiles, and galangal in there until they all soften a bit, about 5 minutes.",
    "Add the fish sauce, sugar, shrimp paste, chile flakes, sriracha, and tamarind concentrate and cook, stirring often, until the onion is fully soft, about 10 minutes. Take it off the heat.",
    "Stir in the coconut milk and lime juice, then pour it into your blender and blend until smooth. Let it cool fully.",
    "It keeps in an airtight container in the fridge for up to 10 days."
  ]
}