{
  "title": "The Minimalist Wedge",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "- 4 garlic cloves",
    "- 1 bunch chives",
    "- 2 lemons",
    "- 1 large iceberg lettuce head (about 1½ pounds)",
    "DAIRY",
    "- 1 cup plain whole-milk Greek yogurt or sour cream",
    "PANTRY",
    "- 2 tablespoons extra-virgin olive oil, plus more for drizzling",
    "- ½ cup panko bread crumbs",
    "- Kosher salt",
    "- ½ cup mayonnaise",
    "- Freshly ground black pepper"
  ],
  "directions": [
    "1. Make the garlicky panko:- Lightly smash and peel 4 garlic cloves. Set 1 aside for the dressing.- In a large nonstick skillet, cook 2 tablespoons olive oil and the 3 smashed garlic cloves over medium-low heat, swirling the pan often, until the garlic is fragrant and lightly golden brown, 3 to 5 minutes. Add ½ cup panko and stir to coat evenly in the oil. Cook, stirring often, so the panko toasts evenly, until golden brown all over, 4 to 5 minutes; season with ½ teaspoon salt.- Transfer the panko to a shallow bowl to cool. Pluck out and discard the garlic cloves.",
    "2. Make the ranchy yogurt dressing:- In a small bowl, stir together 1 cup Greek yogurt, ½ cup mayonnaise, 1 teaspoon salt, and lots of black pepper.- Finely chop 1 bunch of chives. Stir half of the chives into the dressing and set the remaining chives aside for garnish.- Finely grate the remaining 1 garlic clove and the zest of half of a lemon into the dressing. Halve and juice the lemon and stir in the juice. Add a splash or two of cold water to the dressing, stirring to combine, until it reaches a drizzle-able consistency. And of course, always taste and reseason the dressing after adding the water so it doesn’t taste flat.",
    "3. Assemble:- Remove and discard any floppy, wilty outer layers from a large head of iceberg lettuce. Cut the iceberg into quarters through the root end so you have 4 wedges, leaving the core intact.- Arrange the wedges on a serving platter. Squeeze the juice of the second lemon over the wedges, taking care to get the juice inside some of the layers of lettuce. Season each wedge (again, both inside and out) with salt and drizzle with olive oil.- Generously drizzle the dressing over each wedge, spooning some of it into the layers of leaves and allowing some to drip down onto the plate. You may have some dressing left over; serve that alongside.- Scatter the panko and reserved chives over top and finish with black pepper."
  ]
}