{
  "title": "The Wedge",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Serves 6 to 8",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "Everything-Bagel Stuff",
    "¼cup sesame seeds",
    "¼cup poppy seeds",
    "¼cup dried minced garlic",
    "¼cup dried minced onion",
    "Salad",
    "1pound slab bacon, cut into ½-inch pieces",
    "2heads iceberg lettuce",
    "Kosher salt",
    "Coarsely cracked black pepper",
    "2cups Chunky Blue Cheese Dressing (this page)",
    "2cups cherry tomatoes, halved",
    "Splash of extra-virgin olive oil",
    "½juicy lemon",
    "Small handful of tender sprigs dill, torn"
  ],
  "directions": [
    "To make the everything-bagel stuff: Put the sesame seeds, poppy seeds, dried minced garlic, and dried minced onion in a large heavy skillet; set it over medium-high heat; and stir and toss constantly until it all smells sweet and nutty, like a bagel shop, 3 to 5 minutes. Dump it all onto a plate or tray and spread it out so it cools quickly.",
    "To assemble the salad: Line a plate with paper towels. Put the bacon in the skillet, set it over medium heat, and cook, stirring occasionally, until golden brown and almost crispy, about 10 minutes. Use a slotted spoon to scoop the bacon onto the plate. (Reserve the fat to make sausage gravy, see this page, or because it’s generally great to cook with.)",
    "Whack the lettuce heads stem-side down on the counter, which makes it easier to remove the bottom nubs. Or just cut the stems off. Ditch any bruised outer leaves. Cut each head in half or into equal-size wedges (whichever you want). Put the pieces on a platter, sprinkle a pinch of salt and pepper on each one, then pour on the dressing and sprinkle on an offensive amount of the everything-bagel stuff.",
    "In a small mixing bowl, gently toss the cherry tomatoes with the oil, a generous squeeze of lemon juice, and a generous pinch of salt and pepper. Garnish the salad with the tomatoes, dill, and bacon. Some more pepper is good here, too."
  ]
}