{
  "title": "The Softshell Crab",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes 4",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "Vegetable oil or canola oil for deep-frying (about 2 quarts)",
    "1cup all-purpose flour",
    "½teaspoon kosher salt (Diamond Crystal or about half as much Morton), plus more for sprinkling",
    "½teaspoon freshly ground black pepper",
    "4big softshell crabs (5 to 6 ounces each), or 8 smaller ones, prepped",
    "6tablespoons unsalted butter, room-temp so it’s mayo-soft",
    "8thick slices soft white bread",
    "Malt Vinegar Tartar Sauce for swiping",
    "2cups shrettuce",
    "Some thinly sliced white or yellow onion",
    "1 to 2jalapeños, thinly sliced",
    "1juicy lemon",
    "Old Bay Seasoning, straight out of the container, for sprinkling",
    "Malt Vinegar Tartar Sauce",
    "¼cup chopped-up-small dill pickle",
    "1cup mayo (Duke’s or bust)",
    "¼cup malt vinegar",
    "3tablespoons chopped-up dill",
    "1teaspoon freshly ground black pepper",
    "½teaspoon kosher salt (Diamond Crystal or about half as much Morton)"
  ],
  "directions": [
    "Get 2 inches of oil to 350°F in a large heavy pot over medium-high heat. Line a baking sheet with a wire rack or paper towels.",
    "Stir together the flour, salt, and black pepper in a medium mixing bowl. One at a time, put the crabs in the flour mixture and get in there with your hands to make sure they’re totally coated, including underneath the pointy flaps on the top side. Give them a light shake, then move them to a plate.",
    "When the oil’s ready, fry the crabs in batches, if necessary, so they don’t crowd the oil, flipping once halfway through and adjusting the heat to keep the oil temp around 350°F, until they’re crispy and the claws and legs are fried in place, 5 to 7 minutes. When they’re done, use tongs to move them to the baking sheet and immediately and liberally sprinkle both sides with salt.",
    "Get a large well-seasoned cast-iron or nonstick skillet or griddle good and hot over medium heat. Swipe the butter generously on each side of the bread slices. Working in batches, cook the bread until both sides are golden brown, 1 to 2 minutes per side. When they’re done, move them to a rack or stand them up so they lean against each other to keep from getting soggy.",
    "Generously swipe the tartar sauce on all eight slices of bread. Pile the shrettuce on four slices, perch the onions and jalapeños on top, and add your crabs. Squeeze that lemon juice all over the crabs, top with the rest of the bread, and sprinkle with Old Bay to give the tops a thin, even layer of fairy dust. Cut in half and eat.",
    "Malt Vinegar Tartar SauceGive the chopped pickle a quick pat with a paper towel. Put it in a bowl with the rest of the ingredients and mix it all up.",
    "It’ll keep in the fridge for up to 10 days."
  ]
}