{
  "title": "The Mama Tried Burger",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Makes 1 awesome double cheeseburger",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "5ounces ground beef, divided into two 2-inch balls",
    "1teaspoon unsalted butter",
    "Generous ½ teaspoon Lawry’s Seasoned Salt",
    "2slices American cheese",
    "1Martin’s potato sandwich roll",
    "Mayo (Duke’s or bust) for swiping",
    "Ketchup (there is only Heinz) for swiping",
    "2bun-size pieces iceberg lettuce",
    "2thin tomato slices",
    "Some thinly sliced white or yellow onion",
    "4or so drained dill pickle chips"
  ],
  "directions": [
    "Set a medium cast-iron skillet over high heat until it’s pretty hot. While the skillet’s heating up, put a beef ball between two pieces of parchment or wax paper and evenly flatten it to make a 6-inch patty. Repeat with the other ball on separate parchment paper.",
    "Add about ½ teaspoon of the butter to the pan and swirl it around. Lower the heat to medium, then add one of the patties and season the up-side liberally with Lawry’s (a generous ¼ teaspoon per patty).",
    "Cook until the first side gets a little brown (you’re not looking for a crust here), 30 to 45 seconds. Flip the patty, add a cheese slice, and cook until the cheese starts to melt, about 45 seconds more.",
    "Move the patty to a plate and use a roll half to wipe up the buttery drippings, leaving it for a few seconds, so it gets a little toasty. Cook the other patty the same way (the butter, the Lawry’s, the slice of cheese), but this time, stack the patty on the other patty. Use the other roll half to sop up the drippings and let it get toasty, too.",
    "Now you can go wild, but here’s how I make each one: Swipe some mayo (couple of teaspoons or so) on one half of the roll and some ketchup on the other half. Add the patty stack to the bottom, then top with the lettuce, tomato, some onion, pickle chips, and the roll top. Eat."
  ]
}