{
  "title": "There Should Probably Be a Salad (Caesar)",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Serves 6 to 8",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "Dressing",
    "8 to 10oil-packed anchovy fillets, drained",
    "3medium garlic cloves",
    "3tablespoons extra-virgin olive oil",
    "1tablespoon Dijon mustard",
    "1teaspoon Worcestershire sauce",
    "1teaspoon freshly ground black pepper",
    "½teaspoon kosher salt (Diamond Crystal or about half as much Morton)",
    "2juicy lemons",
    "1cup mayo (Duke’s or bust)",
    "3ounces real Parm, finely grated (1 cup)",
    "Croutons",
    "8hot dog buns, cut into 1-inch cubes",
    "⅓cup extra-virgin olive oil",
    "1½tablespoons garlic powder",
    "1teaspoon kosher salt (Diamond Crystal or about half as much Morton)",
    "1teaspoon freshly ground black pepper",
    "Salad",
    "4hearts of romaine, trimmed and torn into 2-inch pieces",
    "1juicy lemon",
    "3ounces real Parm, finely grated (1 cup)",
    "Coarsely ground black pepper",
    "1cup thinly sliced red onion (optional)",
    "More of those nice anchovies (optional)"
  ],
  "directions": [
    "To make the dressing: Buzz the anchovies, garlic, oil, mustard, Worcestershire sauce, pepper, salt, the finely grated zest of 1 lemon, and the juice of 1½ lemons in a blender on high speed until smooth-ish, about 30 seconds. Pour it into a medium mixing bowl, add the mayo and Parm, and mix real well. Taste and add more lemon juice until you’re happy.",
    "The dressing makes about 1½ cups and keeps in the fridge for a couple of weeks.",
    "To make the croutons: Get your oven to 300°F.",
    "Toss the bun cubes with the oil in a medium mixing bowl to get them all evenly coated. Add the garlic powder, salt, and pepper and toss again.",
    "Spread the cubes evenly on a baking pan and bake them, rotating the pan once halfway through, until they’re Winnie-the-Pooh brown and crunchy to the core, 30 to 40 minutes.",
    "To assemble the salad: Put the romaine in a big honking bowl with 1 cup of the dressing (or more—I like it overdressed) and the juice of the lemon. Use your hands to toss well so the lettuce is nicely coated, then add most of the cheese and the croutons and toss again. Add the rest of the cheese, and go to crank town with a pepper grinder, if you want. Serve with the onion slices, if desired, and those anchovies laying on top, or for dangling over friends’ heads and then slowly lowering into their mouths like I imagine ancient Roman nobility ate grapes."
  ]
}