{
  "title": "Thick-Cut Sweet Potato Fries",
  "source": "Modern Bistro - ATK",
  "servings": "4 to 6",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "Spicy Fry Sauce",
    "6tablespoons mayonnaise",
    "1tablespoon chili-garlic sauce",
    "2teaspoons distilled white vinegar",
    "Fries",
    "½cup cornstarch",
    "Kosher salt for cooking sweet potatoes",
    "1teaspoon baking soda",
    "3pounds sweet potatoes, peeled and cut into ¾-inch-thick wedges, wedges cut in half crosswise",
    "3cups peanut oil for frying"
  ],
  "directions": [
    "1 For the sauce: Combine mayonnaise, chili-garlic sauce, and vinegar in a small bowl and set aside.",
    "2 For the fries: Adjust oven rack to middle position and heat oven to 200 degrees. Set wire rack in rimmed baking sheet. Whisk cornstarch and ½ cup cold water together in a large bowl.",
    "3 Bring 2 quarts water, ¼ cup salt, and baking soda to a boil in a Dutch oven. Add potatoes and return to a boil. Reduce heat to a simmer and cook until exteriors turn slightly mushy (centers will remain firm), 3 to 5 minutes. Whisk cornstarch slurry to recombine. Using a wire skimmer or slotted spoon, transfer potatoes to the bowl with slurry.",
    "4 Using a rubber spatula, fold potatoes with slurry until slurry turns light orange, thickens to paste, and clings to potatoes.",
    "5 Heat oil in a 12-inch nonstick skillet over high heat to 325 degrees. Using tongs, carefully add one-third of potatoes to oil, making sure that potatoes aren’t touching one another. Fry until crispy and lightly browned, 7 to 10 minutes, using tongs to flip potatoes halfway through frying (adjust heat as necessary to maintain oil temperature between 280 and 300 degrees). Using a wire skimmer or slotted spoon, transfer fries to prepared wire rack (fries that stick together can be separated with tongs or forks). Season with salt to taste, and transfer to oven to keep warm. Return oil to 325 degrees and repeat in 2 more batches with remaining potatoes. Serve immediately."
  ]
}