{
  "title": "Thin Bar Pie–Style Pizza Dough",
  "source": "By Heart - Hailee Catalano",
  "servings": "MAKES ENOUGH DOUGH FOR TWO 12-INCH (30 CM) BAR PIES",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "200grams (11⁄2 cups) bread flour",
    "50grams (1⁄4 cup plus 1 tablespoon) semolina flour",
    "2teaspoons kosher salt",
    "1teaspoon instant yeast (I like Saf-instant brand)",
    "150grams (1⁄2 cup plus 2 tablespoons) room-temperature water",
    "2tablespoons unsalted butter, melted and cooled slightly",
    "Olive oil, for coating the bowl and dough"
  ],
  "directions": [
    "1. The day before (or up to 3 days before) you want to make a pizza, prepare the dough: Whisk the bread flour, semolina flour, salt, and yeast in a large bowl until fully combined. Add the water and melted butter, and mix with your hands to form a shaggy dough.",
    "2. Cover with plastic wrap, and let the dough rest at room temperature for 30 minutes. The dough will have puffed up a bit but not risen significantly.",
    "3. Uncover the dough. Using damp hands, stretch and fold it: Gently pick up the north side of the dough, stretching it until you feel resistance, and fold it over to the south side of the bowl. Rotate the bowl 90 degrees, and repeat three times, until four sides have been stretched and folded. It will be a fairly stiff dough.",
    "4. Cover with plastic wrap, and let rest for another 30 minutes.",
    "5. Repeat the folding process from step 3.",
    "6. Cover with plastic wrap, and let rest for another 30 minutes. Once again, the dough will not have risen significantly.",
    "7. Divide the dough in half (about 227 g/8 ounces each), and shape each half into a ball. Place each dough ball in its own oiled small bowl (or similar-sized airtight container; I love using quart/1 L containers for this), and roll the dough around to coat it in oil. Cover with plastic wrap or a lid, and place in the refrigerator to rest for at least 12 hours or up to 3 days. Once again, the dough will not have risen much. The resting time here is mainly for the dough to develop flavor.",
    "8. See the steps for forming and baking the pizza."
  ]
}