{
  "title": "Tina's Meatballs",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 (Makes 16 to 18 meatballs)",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Meatball Mix:",
    "1⁄2 cup (55 g) finely grated pecorino Romano",
    "1⁄2 cup (45 g) panko breadcrumbs",
    "2eggs, beaten",
    "1small yellow onion, shredded on the large holes of a box grater",
    "4garlic cloves, finely grated",
    "1⁄4 cup (15 g) finely chopped fresh parsley",
    "11⁄2 teaspoons kosher salt",
    "1⁄2 teaspoon freshly cracked black pepper",
    "8ounces (227 g) ground beef (80/20)",
    "8ounces (227 g) ground pork",
    "Olive oil, for greasing your hands and searing",
    "Sauce:",
    "One 24-ounce (680 g) jar passata",
    "1⁄2 cup (120 ml) water",
    "2tablespoons granulated sugar",
    "2Parmesan rinds (if you have them)",
    "1dried bay leaf",
    "Kosher salt and freshly cracked black pepper, to taste"
  ],
  "directions": [
    "1. Make the meatballs: Add the pecorino Romano, panko, eggs, onion, garlic, parsley, salt, and pepper to a large bowl, and mix with a spoon to combine. Add the beef and pork, and mix with your hands just until combined. Try not to overwork the meat!",
    "2. Using oiled hands, form the meatball mixture into 1⁄2-inch (4 cm) meatballs (35 to 40 g each). Place the finished meatballs on a sheet tray or large plate. You should yield 16 to 18 meatballs.",
    "3. Coat the bottom of a large pot with olive oil, and heat over medium-high heat. Working in two batches, add half of the meatballs to the pot, and sear on one side until golden, 4 or 5 minutes.",
    "4. Use a small spoon or offset spatula to carefully flip over the meatballs and brown the other side for another 1 or 2 minutes. (The meatballs will not be fully cooked at this point; they will finish in the sauce.) Transfer the meatballs to a plate, set aside, and repeat with the second half of the meatballs, adding more oil to the pot as needed.",
    "5. Make the sauce: Reduce the heat under the pot to low, and carefully add the passata. Add the water to the passata jar, cover, shake to fully clean out the jar, and pour into the pot. Stir, scraping up any brown bits from the bottom of the pot.",
    "6. Add the sugar, Parmesan rinds, if using, and bay leaf, and season with salt and pepper. Add the meatballs and any accumulated juices, and gently stir to cover the meatballs in sauce.",
    "7. Bring the sauce to a simmer and then reduce the heat to low. Cover and cook, uncovering every now and then to stir, for 25 minutes.",
    "8. Uncover and cook, stirring occasionally, for another 10 minutes.",
    "9. Season with more salt and pepper, remove the bay leaf, and serve."
  ]
}