{
  "title": "Tina’s Chicken Bake",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 4 to 6",
  "categories": [
    "***NEED TO MAKE",
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Chicken Bake",
    "11⁄2 pounds (680 g/3 or 4 large) Yukon Gold potatoes, cut into wedges 1 inch (2.5 cm) thick",
    "1pound (454 g/3 or 4 medium) Roma tomatoes, cut into wedges 1 inch (2.5 cm) thick",
    "One 14-ounce (397 g) can quartered artichoke hearts, drained",
    "6large shallots, halved",
    "4large garlic cloves, grated",
    "3tablespoons olive oil, plus more for drizzling",
    "Kosher salt and freshly cracked black pepper, to taste",
    "21⁄2 to 3 pounds (1.1 to 1.3 kg) bone-in, skin-on chicken thighs (6 to 8 thighs)",
    "2teaspoons dried oregano",
    "Freshly grated pecorino Romano, for topping, optional",
    "Herb Sauce",
    "1⁄2 cup (14 g) loosely packed fresh basil leaves",
    "1⁄2 cup (14 g) loosely packed fresh dill fronds",
    "1⁄2 cup (14 g) loosely packed fresh parsley leaves",
    "1⁄4 cup (60 ml) extra virgin olive oil",
    "3tablespoons fresh lemon juice (from about 1 lemon)",
    "1teaspoon honey",
    "Kosher salt and freshly cracked black pepper, to taste"
  ],
  "directions": [
    "1. Make the chicken: Preheat the oven to 425°F (220°C).",
    "2. Add the potatoes, tomatoes, artichoke hearts, shallots, and garlic to a 9 × 13-inch (23 × 33 cm) baking dish (or 3.5-quart/3.3 L baking dish). Toss with the olive oil, and season with salt and pepper.",
    "3. Pat the chicken dry, and season all over with salt, pepper, and oregano. Place the chicken on top of the vegetables, and drizzle the chicken skin with a bit of olive oil.",
    "4. Bake for 50 to 60 minutes, until the potatoes are tender, the chicken is golden, and the internal temperature of the chicken is at least 185°F (85°C).",
    "5. About 15 minutes before the chicken is done, make the herb sauce: Add the basil, dill, parsley, extra virgin olive oil, lemon juice, honey, salt, and pepper to a high-powered blender, and blend until smooth.",
    "6. Transfer the chicken to a plate, and tent with foil to keep warm.",
    "7. Turn the broiler to high, and broil the vegetables in the baking dish until they start to char, 6 to 8 minutes. (Broilers vary in strength, so keep an eye on the vegetables as they may brown more quickly!)",
    "8. Serve the chicken and vegetables topped with some of the pan juices, the herb sauce, and pecorino Romano, if using."
  ]
}