{
  "title": "Tiny Salted Tiramisu Cookies",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Makes 21 tiny cookies",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "8tablespoons / 113g salted butter, at room temperature",
    "3tablespoons / 40g packed dark brown sugar",
    "½cup / 110g granulated sugar",
    "1tablespoon rum",
    "1teaspoon ground coffee",
    "3tablespoons / 50g mascarpone cheese",
    "1¼cups / 175g all-purpose flour",
    "Diamond Crystal kosher salt",
    "1teaspoon baking powder",
    "4ounces / 37g dark chocolate, finely chopped",
    "Flaky salt, for topping",
    "1tablespoon Dutch processed cocoa powder, for topping"
  ],
  "directions": [
    "1. Equally stagger two racks in the oven and preheat it to 375°F. Line two baking sheets with parchment paper.",
    "2. In a stand mixer fitted with the paddle attachment, cream together the butter, brown sugar, and granulated sugar until smooth, 2 to 3 minutes.",
    "3. Add the rum, coffee, and mascarpone and beat on medium speed until the dough noticeably lightens in color and doubles in size, another 3 to 4 minutes. It will look whipped.",
    "4. While the wet ingredients are mixing, in a small bowl, whisk together the flour, ½ teaspoon kosher salt, and the baking powder.",
    "5. In two rounds, add the dry ingredients to the wet, with the mixer at its lowest speed to combine. Add the chocolate to the dough and fold this in by hand with a spatula.",
    "6. Roll the dough into twenty-one tablespoon-size balls (25g each). Space the cookies 2 inches apart on lined baking sheets. Indent each in the center to encourage equal spreading. Sprinkle with the lightest touch of flaky salt.",
    "7. Bake the cookies until the tops are crinkly and the cookies have spread, 9 to 10 minutes.",
    "8. Remove the cookies from the oven and give the trays a few smacks on the counter to flatten the cookies out. While the cookies are still warm, use a cookie cutter or biscuit cutter to swirl around the cookies to make them into perfect circle (optional, for those who like perfection).",
    "9. Let the cookies cool for 20 minutes. Use a sifter or small sieve to dust the cocoa powder over the top before serving."
  ]
}