{
  "title": "Tofu Cutlets & a Bright Summery Salad",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "Serves 3",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "1(16-ounce) block extra-firm tofu",
    "2 or 3very small heirloom tomatoes, various colors, plus more as needed",
    "1small peach",
    "1teaspoon Aleppo pepper flakes",
    "1garlic clove, grated",
    "1tablespoon honey",
    "1tablespoon apple cider vinegar or fresh lemon juice",
    "1cup torn tender fresh herbs, such as basil, mint, parsley",
    "Diamond Crystal kosher salt",
    "Extra-virgin olive oil",
    "1cup panko bread crumbs",
    "⅓cup whole-wheat flour",
    "½cup milk or plant-based milk",
    "3tablespoons soy sauce",
    "3tablespoons rice vinegar",
    "Neutral oil, such as avocado, for frying"
  ],
  "directions": [
    "1. Slice the tofu horizontally into three large rectangular pieces, each a little less than 1 inch thick. Press the tofu (see this page).",
    "2. Meanwhile, cut the tomatoes into large pieces and slice the peach. In a large bowl, whisk together the Aleppo pepper, garlic, honey, and vinegar to form a dressing at the bottom of the bowl. Add the tomatoes, peach, and herbs and toss. Season with a pinch of salt, then drizzle in 1 tablespoon olive oil. Add this bowl to the fridge, while you prepare the tofu.",
    "3. To fry the tofu, set up a dredging station with four bowls: Place the panko in one shallow dish and mix in ¼ teaspoon salt. Place the flour in a second shallow dish. Pour the milk into a wide bowl. In the fourth bowl, whisk together the soy sauce and rice vinegar.",
    "4. Take the pressed tofu and quickly dip each side in the soy sauce–vinegar mixture. Immediately transfer each piece to the flour and dip to coat each side. Transfer each piece to the milk and then to the panko. Flip to coat each cutlet fully in the bread crumbs.",
    "5. Set a large high-sided sauté pan over medium heat and heat the avocado oil to 350°F on a thermometer. Add the first cutlet and fry until nicely golden on both sides, 3 to 4 minutes per side. Transfer to a paper towel to drain. Repeat with the remaining cutlets.",
    "6. To serve, take the salad out of the fridge. It will have gathered more juices in the bottom of the bowl during the time it sat, so give everything a big mix to combine again. Pile the salad generously on top of the tofu, adding more herbs as you prefer. Drizzle with any remaining juice left in the salad bowl and serve."
  ]
}