{
  "title": "Tomato Tart with Spices and Herby Feta",
  "source": "Dessert Person - Claire Saffitz",
  "servings": "Serves: 8",
  "categories": [
    "Dessert Person - Claire Saffitz"
  ],
  "ingredients": [
    "2½pounds (1.13kg) heirloom or beefsteak tomatoes",
    "1medium shallot, cut into thin wedges",
    "5garlic cloves, unpeeled",
    "2large sprigs fresh thyme, plus 1 teaspoon fresh thyme leaves",
    "¼cup extra-virgin olive oil (2 oz / 57g), plus more for drizzling",
    "½teaspoon coriander seeds, crushed with the flat side of a knife",
    "¼teaspoon crushed red pepper flakes",
    "¼teaspoon cumin seeds",
    "¼teaspoon fennel seeds",
    "Kosher salt and freshly ground black pepper",
    "Flaky All-Butter Pie Dough (this page)",
    "All-purpose flour, for rolling out",
    "8ounces (227g) feta cheese",
    "¼cup mayonnaise (2.2 oz / 60g)",
    "2tablespoons finely chopped fresh oregano leaves, plus more leaves for topping"
  ],
  "directions": [
    "Preheat the oven: Arrange an oven rack in the center position and preheat the oven to 400°F.",
    "Bake the tomatoes: Core half of the tomatoes and use a serrated knife to cut them into ¼-inch-thick slices. Scatter the sliced tomatoes, the shallot wedges, garlic, and thyme sprigs across a rimmed baking sheet. Drizzle with ¼ cup of olive oil and sprinkle with the coriander seeds, red pepper flakes, cumin seeds, and fennel seeds. Season everything with salt and pepper. Roast until the tomatoes are sizzling, darkened around the edges, and very fragrant, 35 to 40 minutes, rotating the pan halfway through. Remove the pan from the oven (leave the oven on). Carefully loosen the tomatoes with a metal spatula in case they’ve stuck. Remove the thyme sprigs and crumble the crispy thyme leaves over the tomatoes (discard the stems). Transfer the tomatoes, garlic, shallots, and any oil or spices left on the baking sheet to a plate and set aside to cool. Clean the baking sheet, line it with parchment paper, and set it aside to bake the crust.",
    "Roll out and bake the crust: Let the pie dough sit at room temperature for about 5 minutes to soften slightly. Place the dough on a lightly floured surface and use a rolling pin to beat the dough all across the surface to make it more pliable. Roll out the dough, dusting with more flour as needed to prevent sticking, until you have an oblong slab that’s a little more than ⅛ inch thick. (Don’t worry about the shape—irregular is fine, good even!) Transfer the pastry to the parchment-lined baking sheet and prick all over with the tines of a fork. If the pastry has softened and is a little sticky, chill it briefly until it’s firm, about 10 minutes. Bake the pastry until it’s deep golden brown all over, 20 to 25 minutes. Remove from the oven and set aside to cool.",
    "Make the herby feta: In a food processor, combine the feta, mayonnaise, chopped oregano, and 1 teaspoon thyme leaves. Squeeze the reserved roasted garlic cloves out of their skins and into the food processor. Season lightly with salt and pepper and process until the mixture is light and smooth. (Alternatively, you can simply mash all the ingredients together in a medium bowl with a fork until well combined; it just won’t be super smooth.)",
    "Assemble the tart: Slice the remaining tomatoes and season with salt and pepper. Scrape the feta mixture directly onto the cooled pastry and spread it with a small offset spatula or the back of a spoon all across the surface to the edges, leaving a thin border. Layer the fresh and cooked tomato slices over the feta. Top with fresh oregano leaves, drizzle with more olive oil, and serve."
  ]
}