{
  "title": "TORTILLA JIAN BING WRAPS (煎饼卷)",
  "source": "Thewoksoflife.com",
  "servings": "Serves: 2",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "1Chinese fried dough stick",
    "(youtiao; store-bought is fine)",
    "2large whole wheat flour tortillas (large enough to fit in a 10-inch / 25 cm pan)",
    "vegetable oil (or any neutral oil)",
    "2large eggs (beaten)",
    "2teaspoons sweet bean sauce (tian mian jiang) (or to taste; can also substitute hoisin sauce)",
    "2teaspoons spicy bean sauce (la doubanjiang) (or to taste)",
    "2teaspoons chili oil (optional)",
    "2teaspoons toasted sesame seeds",
    "2scallions (finely chopped)",
    "2-3tablespoons cilantro (finely chopped)"
  ],
  "directions": [
    "We use frozen, store-bought youtiao for this recipe. To toast it, pop one in the oven or toaster oven for 3-5 minutes at 350°F (lean towards the lower end of the range if it has already thawed in your refrigerator). Leave it in the oven, turned off, while you prepare the jian bing so it stays warm, but doesn’t get too crunchy and hard.",
    "Heat a large cast iron or nonstick skillet over medium heat. Add a drizzle of oil, and place a tortilla in the hot skillet, and toast each side for 15-20 seconds, until just warmed through but not crisp. Remove from the heat and set aside.",
    "With the pan still over medium heat, add 1 teaspoon of oil to the pan (you may need more if you are not using a non-stick skillet). Pour one beaten egg into the center of the pan, and immediately swirl it around into an approximate circle shape. Place the wrap on top of the egg, pressing the wrap and the egg together.",
    "Give the wrap a clockwise twist to loosen the egg from the pan. Flip the wrap, so the egg side is facing up. The egg should be tender and just cooked enough that it doesn’t drip when flipped. If bubbles form, pop them with a fork.",
    "Use a pastry brush to brush a thin layer of sweet bean sauce over the egg in a thin layer, followed by a thin layer of spicy bean paste, and a drizzle of chili oil to taste. If you’re using all three, be mindful of salt levels. A thin layer goes a long way.",
    "Sprinkle 1 teaspoon of toasted sesame seeds evenly over the top, followed by half the cilantro, and half the scallions.",
    "Place the toasted youtiao in the center. Using a spatula (or two), you can roll the jianbing one of two ways: like a burrito where you fold one side in (the ‘bottom’) and then fold the two “wings” on either side in, or simply roll it into a log with both ends open. It helps to use your spatula to make an indentation along each fold so that it stays rolled. Let cook for 1 minute on the seal-side so the jian bing stays closed and has a chance to brown lightly.",
    "Repeat with the remaining ingredients to make a second jianbing, and enjoy!"
  ]
}