{
  "title": "Tortelli di Zucca (Squash-Filled Pasta with Sage Brown Butter)",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "Filling",
    "900g / 2 lb delicata squash",
    "900g / 2 lb butternut squash",
    "60g / ¼ cup unsalted butter, cold and cubed",
    "Salt, q.b.",
    "Black pepper, q.b.",
    "42g / 3 Tbsp olive oil",
    "3sprigs rosemary",
    "5sprigs thyme",
    "40g / 8 cloves garlic",
    "232g / 1 cup ricotta (see “whipped” ricotta, this page)",
    "30g / 1½ Tbsp finely chopped apple or pear mostarda",
    "90g / 1 cup finely grated parmigiano-reggiano",
    "Whole nutmeg, q.b.",
    "To Finish",
    "1batch egg dough (this page)",
    "114g / ½ cup unsalted butter, cold and cubed",
    "10small sage leaves",
    "30g / ⅓ cup finely grated parmigiano-reggiano",
    "15g / 1 Tbsp finely crushed amaretti cookies (about 2 large cookies)",
    "Whole nutmeg, q.b.",
    "Black pepper, q.b."
  ],
  "directions": [
    "1 - To make the filling, preheat the oven to 350°F.",
    "2 - Cut the squashes in half lengthwise and clean out the seeds and fibers.",
    "3 - Place the squash halves, hollow side up, on a sheet pan and distribute the butter evenly among the cavities. Season with salt and pepper q.b. Drizzle with the olive oil, then strew with the rosemary, thyme, and garlic.",
    "4 - Bake until fork-tender, 45 minutes to 1 hour.",
    "5 - Remove from the oven and let cool. Remove the garlic and herbs from the squash halves and discard.",
    "6 - Scoop the squash flesh from the skin. You should have about 450g / 2¼ cups total. Discard the skin. Line a chinois or fine-mesh strainer with cheesecloth, set the strainer over a bowl, and spoon the flesh into the strainer. Cover the top with parchment paper or plastic wrap and weight it down with a plate (the parchment keeps the squash from adhering to the plate). Transfer to the refrigerator and let the excess liquid seep out for a minimum of 2 hours or up to overnight. This will prevent the filling from being watery and loose.",
    "7 - Place a tamis over a bowl. Pass the squash through the tamis or fine-mesh strainer.",
    "8 - Put the ricotta into a food processor and pulse just until it is as smooth as cake frosting and has a sheen, being careful not to process it longer or it will break. Transfer to the bowl holding the squash.",
    "9 - Add the mostarda and parmigiano to the bowl and mix well. Season with salt and pepper q.b. and with about 15 gratings of nutmeg (don’t add more because the spice will bloom when cooked). It should taste well seasoned. Refrigerate until ready to use.",
    "10 - To finish, following the instructions for tortelli on this page, make 60 pieces with the pasta dough and filling.",
    "11 - Bring a large pot of water to a boil over high heat. Generously salt the water.",
    "12 - Place a small saucepan over medium-low heat. Add 60g / ¼ cup of the butter and cook until just past golden brown, about 3 to 4 minutes. Add a few of the sage leaves to infuse lightly. Remove from the heat and set aside. You will drizzle this sage brown butter over the plated pasta.",
    "13 - Add the tortelli to the water and turn down the heat to bring the water to a gentle simmer instead of a rolling boil. It is important to cook these gently at a simmer instead of a boil. The filling is delicate and can break if cooked over high heat. Cook for 3 to 5 minutes, until tender at the thickest closure point.",
    "14 - While the pasta is cooking, place a large sauté pan over low heat. Add 1 to 2 ladles (55 to 115g / ¼ to ½ cup) pasta cooking water. Add the remaining butter and swirl to emulsify.",
    "15 - Using a spider or pasta basket, remove the pasta from the pot and transfer to the sauté pan. Turn the heat up to medium. Swirl for 1 to 2 minutes to marry the pasta and the sauce, using a spoon to gently turn the pasta over and coat all sides. If the sauce begins to tighten, add a splash of cooking water to loosen and continue swirling.",
    "16 - Divide into bowls and drizzle with the reserved sage brown butter. Garnish with the parmigiano, amaretti, the remaining sage, and with grated nutmeg and pepper q.b."
  ]
}