{
  "title": "Tortilla Soup",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 8",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "8(6-inch) corn tortillas, cut into ½-inch-wide strips",
    "2tablespoons vegetable oil, divided",
    "1½pounds bone-in split chicken breasts, trimmed",
    "8cups chicken broth",
    "1white onion, quartered, divided",
    "4garlic cloves, peeled, divided",
    "8–10sprigs fresh cilantro, plus leaves for serving",
    "1sprig fresh oregano",
    "½teaspoon plus ⅛ teaspoon table salt, divided",
    "2tomatoes, cored and quartered",
    "½jalapeño chile",
    "1tablespoon minced canned chipotle chile in adobo sauce",
    "1avocado, halved, pitted, and diced",
    "8ounces cotija cheese, crumbled (2 cups)",
    "Lime wedges"
  ],
  "directions": [
    "1. Adjust oven rack to middle position and heat oven to 425 degrees. Toss tortilla strips with 1 tablespoon oil and bake on rimmed baking sheet until crisp and deep golden, about 14 minutes, stirring occasionally. Season with salt to taste, and let cool on paper towel–lined plate.",
    "2. Meanwhile, bring chicken, broth, 2 onion quarters, 2 garlic cloves, cilantro sprigs, oregano sprig, and ½ teaspoon salt to boil over medium-high heat in Dutch oven. Reduce heat to low, cover, and simmer gently until chicken registers 160 degrees, about 20 minutes. Transfer chicken to cutting board, let cool slightly, and shred into bite-size pieces; discarding skin and bones. Strain broth through fine-mesh strainer.",
    "3. Puree tomatoes, jalapeño, chipotle, remaining 2 onion quarters, and remaining 2 garlic cloves in food processor until smooth. Heat remaining 1 tablespoon oil in now-empty Dutch oven over high heat until shimmering. Add tomato-onion puree and remaining ⅛ teaspoon salt and cook, stirring frequently, until mixture has darkened in color, about 10 minutes.",
    "4. Stir in strained broth and bring to boil, then reduce heat to low and simmer gently until flavors meld, 15 to 20 minutes.",
    "5. Stir in shredded chicken and let heat through, about 2 minutes. Place portions of tortilla strips in serving bowls, ladle soup over top, and serve with avocado, cotija, lime wedges, and cilantro leaves."
  ]
}