{
  "title": "Trofie al Pesto Genovese",
  "source": "Pasta - Missy Robbins",
  "servings": "Yields 4 to 6 servings",
  "categories": [
    "Italian",
    "Italian Pasta",
    "Pasta - Missy Robbins"
  ],
  "ingredients": [
    "1batch semolina dough (this page)",
    "Pesto Genovese",
    "180g / 1½ cups pine nuts",
    "210g / 10½ cups basil leaves, plus extra for garnish",
    "5g / 1 clove garlic",
    "150g / ⅔ cup olive oil",
    "36g / ⅓ cup plus 1 Tbsp finely grated parmigiano-reggiano",
    "36g / ⅓ cup plus 1 Tbsp finely grated fiore sardo, plus more q.b.",
    "36g / ⅓ cup plus 1 Tbsp finely grated pecorino romano"
  ],
  "directions": [
    "1 - Following the instructions for trofie on this page, make 624g / 1 lb 6 oz with the pasta dough.",
    "2 - To make the pesto, preheat the oven to 325°F. Spread the pine nuts in a single layer on a sheet pan and toast until very lightly golden brown, 5 to 7 minutes, checking their progress every few minutes to ensure they don’t burn. Set aside to cool, about 15 minutes.",
    "3 - Bring a large pot of water to a boil over high heat. Generously salt the water. Prepare an ice water bath and set a colander in it. Add the basil to the pot and cook for 5 seconds. Remove from the water and transfer to the ice water bath to stop the cooking.",
    "4 - Remove the basil from the ice water, squeeze out any excess water, and add to the bowl of a high-speed blender. Puree until smooth, adding a splash of water to get it going if needed.",
    "5 - Add 150g / 1¼ cups of the pine nuts and puree until they are incorporated.",
    "6 - Transfer the pine nut and basil puree to a large mixing bowl. Using a Microplane, grate the clove of garlic into the bowl. Add the olive oil and all three cheeses and fold together until well incorporated.",
    "7 - Measure out 320g / 1¼ cups of pesto and set aside. Transfer the remainder to a container, cover with a layer of olive oil, and refrigerate for up to 3 days for another use. Coarsely chop the remaining 30g / ¼ cup pine nuts.",
    "8 - Bring another large pot of water to a boil over high heat. Generously salt the water.",
    "9 - Add the trofie to the water and cook for 3 to 5 minutes, until tender but still chewy.",
    "10 - Using a spider or pasta basket, transfer the pasta directly to the mixing bowl and gently toss to combine. Slowly add 55 to 78g / ¼ to ⅓ cup pasta cooking water to the bowl until the pesto easily coats the pasta.",
    "11 - Divide into serving bowls and garnish with the additional fiore sardo q.b., chopped pine nuts, and basil leaves."
  ]
}