{
  "title": "Turkey Thigh Confit With Citrus-Mustard Sauce",
  "source": "Modern Bistro - ATK",
  "servings": "6 to 8",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "3large onions, chopped coarse (4¾ cups)",
    "12sprigs fresh thyme",
    "2½tablespoons table salt for curing",
    "1½tablespoons sugar",
    "1½teaspoons pepper",
    "4pounds bone-in turkey thighs",
    "6cups duck fat, chicken fat, or vegetable oil for confit",
    "1garlic head, halved crosswise",
    "2bay leaves",
    "½cup orange marmalade",
    "2tablespoons whole-grain mustard",
    "¾teaspoon grated lime zest plus 2 tablespoons juice",
    "¼teaspoon table salt",
    "⅛teaspoon cayenne pepper"
  ],
  "directions": [
    "1  Process onions, thyme sprigs, salt, sugar, and pepper in food processor until finely chopped, about 20 seconds, scraping down sides of bowl as needed. Spread one-third of mixture evenly in bottom of 13 by 9-inch baking dish. Arrange turkey thighs, skin side up, in single layer in dish. Spread remaining onion mixture evenly over thighs. Wrap dish tightly with plastic wrap and refrigerate for 4 to 6 days (whatever is most convenient).",
    "2  Adjust oven rack to lower-middle position and heat oven to 200 degrees. Remove thighs from onion mixture and rinse well. Pat thighs dry with paper towels. Heat fat in large Dutch oven over medium heat to 165 degrees. Off heat, add turkey thighs, skin side down and in single layer, making sure thighs are completely submerged. Add garlic and bay leaves. Transfer to oven, uncovered, and cook until metal skewer inserted straight down into thickest part of largest thigh can be easily removed without lifting thigh, 4 to 5 hours. (To ensure that oven temperature remains steady, wait at least 20 minutes before retesting if turkey is not done.) Remove from oven. Let turkey cool completely in pot, about 2 hours; cover pot; and refrigerate for up to 6 days.",
    "3  Uncover pot. Heat pot over medium-low heat until fat is melted, about 25 minutes. Increase heat to medium, maintaining bare simmer, and continue to cook until thickest part of largest thigh registers 135 to 140 degrees, about 30 minutes longer. (If turkey has been cooked in vegetable oil, heat pot over medium heat, maintaining bare simmer, until thickest part of largest thigh registers 135 to 140 degrees, about 30 minutes.)",
    "4  Adjust oven rack to lower-middle position and heat oven to 500 degrees. While oven heats, crumple 20-inch length of aluminum foil into loose ball. Uncrumple foil, place in rimmed baking sheet, and top with wire rack. Using tongs, gently transfer thighs, skin side up, to prepared wire rack, being careful not to tear delicate skin. Set aside. Strain liquid through fine-mesh strainer into large bowl. Working in batches, pour liquid into fat separator, letting liquid settle for 5 minutes before separating fat from turkey stock. (Alternatively, use bulb baster to extract turkey stock from beneath fat.) Transfer 4 teaspoons turkey stock to small bowl; add marmalade; and microwave until mixture is fluid, about 30 seconds. Stir in mustard, lime zest and juice, salt, and cayenne. Transfer to serving bowl.",
    "5  Transfer thighs to oven and roast until well browned, 12 to 15 minutes. Transfer thighs to cutting board, skin side up, and let rest until just cool enough to handle, about 15 minutes.",
    "6  Flip 1 thigh skin side down. Using tip of paring knife, cut along sides of thighbone, exposing bone. Carefully remove bone and any stray bits of cartilage. Flip thigh skin side up. Using sharp chef’s knife, slice thigh crosswise ¾ inch thick. Transfer to serving platter, skin side up. Repeat with remaining thighs. Serve, passing sauce separately."
  ]
}