{
  "title": "Turmeric-Sizzled Toast With Sungold Tomatoes",
  "source": "Justine Cooks - Justine Doiron",
  "servings": "2",
  "categories": [
    "Justine Cooks - Justine Doiron"
  ],
  "ingredients": [
    "Extra-virgin olive oil",
    "1teaspoon ground turmeric",
    "Diamond Crystal kosher salt",
    "2thick slices bread, any kind",
    "1pound (1 pint) Sungold tomatoes, halved",
    "2garlic cloves, grated",
    "2teaspoons grated fresh ginger",
    "¼teaspoon ground coriander",
    "¼teaspoon ground cumin",
    "¼teaspoon smoked paprika",
    "¼teaspoon Aleppo pepper flakes, plus more for sprinkling",
    "2tablespoons canned unsweetened full-fat coconut milk",
    "4 or 5fresh basil leaves, for garnish",
    "4 or 5fresh mint leaves, for garnish",
    "Freshly ground black pepper"
  ],
  "directions": [
    "Set a pan over medium heat and pour in 1 tablespoon olive oil. Add ½ teaspoon of the turmeric and a pinch of salt and swirl to make the oil evenly golden. Once the oil is fragrant, add one slice of bread to the pan and toast until crisp and bright golden yellow, about 2 minutes on each side. Repeat the steps for the second slice of bread. Keep any remaining turmeric oil in the pan.",
    "To the turmeric oil in the pan, add a drizzle of olive oil and the tomatoes. Cook for 1 to 2 minutes, stirring occasionally as the tomatoes collapse. Add the garlic, ginger, coriander, cumin, paprika, and pepper flakes. Season with salt. Cook for an additional 3 to 4 minutes, stirring occasionally as the tomatoes release their juices and come to a soft simmer. Add the coconut milk and cook for another 1 to 2 minutes, letting the mixture reduce slightly, allowing the flavors to meld. Remove from the heat and season with salt and black pepper.",
    "Scoop half the tomatoes onto each slice of toast, making sure to gather pan juices with every spoonful. Tear up the basil and mint and scatter on top. Top with a few cracks of black pepper and a sprinkle of pepper flakes."
  ]
}