{
  "title": "Twice-Cooked Pork",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Servings: 4 to 6",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 1 pound leeks",
    "- 1 pound skin-on center-cut fresh pork belly, about 2 inches thick",
    "- 1 (2-inch) piece ginger, sliced into 1/4-inch-thick rounds",
    "- 1 tablespoon vegetable oil",
    "- 1 tablespoon douchi (fermented black beans)",
    "- 4 teaspoons doubanjiang (broad bean chile paste)",
    "- 2 teaspoons tianmianjiang (sweet wheat paste)",
    "- 2 green or red longhorn chiles, stemmed and sliced 1 inch thick on bias (optional)",
    "- 1 teaspoon dark soy sauce",
    "- 1 teaspoon sugar"
  ],
  "directions": [
    "1. Trim root ends and dark-green parts from leeks; discard roots. Quarter white and light-green parts lengthwise, then slice crosswise into 1 1/2-inch pieces; wash thoroughly. (You should have about 3 cups white and light-green parts.) Cut dark-green parts into 4- to 6-inch pieces and wash thoroughly.",
    "2. Bring 2 quarts water, pork, ginger, and dark-green leek parts to boil in large saucepan. Reduce heat to medium-low, adjusting heat as needed to maintain gentle simmer. Cook until pork skin and fat can be easily pierced with paring knife, 30 to 40 minutes, adding water as needed to keep pork submerged. Transfer pork to large plate and let cool completely, about 15 minutes; discard cooking liquid and solids. Cover pork with plastic wrap and refrigerate for at least 3 hours or up to 24 hours. Place pork skin side down on cutting board and slice as thin as possible (1/8 to 1/4 inch thick).",
    "3. Heat oil in 14-inch flat-bottomed wok over medium-high heat until shimmering. Add pork and cook, tossing slowly but constantly, until meat is just beginning to brown and some fat has rendered, 2 to 4 minutes. Stir in douchi and cook until fragrant, about 30 seconds.",
    "4. Slide pork mixture to 1 side of wok and let oil pool on opposite side (briefly tilt wok as needed to allow oil to pool). Stir doubanjiang and tianmianjiang into oil (oil may splatter) and cook, stirring constantly, until mixture is fragrant and oil has turned red, about 30 seconds. Stir pork into oil mixture.",
    "5. Stir in white and light-green leek parts, longhorn chiles, if using, soy sauce, and sugar. Cook, stirring constantly, until leeks are tender and just wilted, 3 to 4 minutes. Serve."
  ]
}