{
  "title": "Twice-Cooked Pork",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "4 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "- 1 lb / 450g pork belly (40% fat, 60% lean)",
    "- 2 or 3 (1-inch / 2.5cm) slices ginger",
    "- 2 or 3 scallions, white parts only, cut into 1 inch / 2.5cm segments",
    "- Neutral oil for frying",
    "- 1 Tbsp doubanjiang",
    "- 1 Tbsp Sichuan Chili Crisp (this page)",
    "- 1 Tbsp tianmianjiang",
    "- 1 tsp light soy sauce",
    "- 1 tsp granulated sugar or honey",
    "- 1 Tbsp fermented black beans",
    "- 1 medium leek, green part only, cut into strips about 2 inches / 5cm long",
    "- White rice for serving"
  ],
  "directions": [
    "1. In a large pot over high heat, add the pork belly and enough water to cover, then add the ginger and scallions and bring to a boil. Lower the heat to medium and simmer until cooked through, 15 to 20 minutes. Remove the pork from the pot and discard the rest.",
    "2. Let the pork cool before moving it to the fridge to rest for at least 3 to 4 hours, until the meat is thoroughly cooled and firm; doing this will make the meat easier to slice. Once your pork belly is ready, use a sharp knife and from the skin side down, cut into slices as thin as you can. Set aside.",
    "3. In a wok or other pan over high heat, warm 2 tbsp of oil until very smoking hot. Add the pork belly slices and fry them for 2 to 3 minutes, until they start to take on a little bit of color. Push the pork belly slices up to the side of the wok. Still on high heat, add the doubanjiang and chili crisp to the pan, and cook for 1 to 2 minutes, until fragrant. Add the tianmianjiang, soy sauce, sugar, and black beans and mix the pork belly back in, thoroughly cooking the meat, about 2 minutes. Add the leek and fry for 1 more minute, until it has softened but is still green in color.",
    "4. Transfer to a plate and serve immediately with rice. Leftovers can be stored in an airtight container in the fridge for up to 1 week."
  ]
}