{
  "title": "Two-Sheet Lasagna Verde",
  "source": "Starchefs.com",
  "servings": "",
  "categories": [],
  "ingredients": [
    "Spinach Dough:",
    "2.25kilograms spinach",
    "960grams whole egg",
    "6.4kilograms 00 flour",
    "360grams 00 semolina flour",
    "37grams salt",
    "Béchamel Sauce:",
    "552grams unsalted butter",
    "552grams all-purpose flour",
    "6.6kilograms whole milk",
    "276grams diced onion",
    "3grams nutmeg",
    "Salt",
    "Beef Bolognese:",
    "9kilograms ground beef",
    "50grams nutmeg",
    "100grams garlic powder",
    "150grams onion powder",
    "50grams black pepper",
    "200grams salt",
    "Corto TRULY 100% extra virgin olive oil",
    "2kilograms chopped onion",
    "1kilogram chopped carrot",
    "1kilogram chopped celery",
    "125grams chopped garlic",
    "1kilogram tomato paste",
    "2kilograms white wine",
    "11.8kilograms Jersey tomatoes",
    "2kilograms heavy cream",
    "30grams grated garlic",
    "75milliliters brandy",
    "125grams red wine vinegar",
    "To Assemble and Serve:",
    "00flour",
    "Grated parmesan",
    "Nutmeg"
  ],
  "directions": [
    "For the Spinach Dough:",
    "In a Vitamix blender, purée spinach and eggs until smooth. Transfer to the bowl of a stand mixer fitted with a paddle attachment. Add flours and salt. Mix on speed 1 until dough is smooth and elastic, approximately 18 to 20 minutes. Wrap in plastic and let rest at room temperature.",
    "For the Béchamel Sauce:",
    "In a large pot over medium heat, melt butter. Add flour and whisk until a blond roux is formed. Add milk, onion, and nutmeg. Lower heat and simmer 20 minutes, whisking often. Strain through a chinois. Season with salt. Let cool.",
    "For the Beef Bolognese:",
    "Heat oven to 400°F. In a large rondeau, add ground beef and sear. Strain off rendered fat and reserve. Season browned meat with nutmeg, garlic powder, onion powder, black pepper, and 175 grams salt. Set aside. In a separate large rondeau, heat oil. Add onions, carrots, and celery. Sweat until vegetables are mostly cooked through, approximately 8 to 10 minutes. Add chopped garlic and cook 2 minutes. Add tomato paste and cook additional 6 minutes, stirring constantly. Deglaze pan with wine and cook until liquid is reduced by one third. Remove mirepoix from heat and set aside. In two 6-inch hotel pans, evenly distribute tomatoes, cream, cooked mirepoix, cooked ground beef, and remaining 25 grams salt. Mix to combine. Cover with aluminum foil and braise 90 minutes. Remove from oven and add grated garlic, brandy, and vinegar. Cool pans over an ice bath while stirring frequently. Set aside.",
    "To Assemble and Serve:",
    "Heat wood-fired oven to 750°F. Set up a pasta machine to roll flat pasta. Starting at the widest setting, run the dough through successively narrower settings until it’s a scant 1/8 inch thick. Transfer the sheet to a lightly floured work surface and dust with 00 flour. Cut dough into two 5.5-inch by 10-inch rectangles. In a large pot over medium high heat, bring salted water to a boil. Blanch lasagna sheets 1 minute. Shock in ice water then gently dry. On a sizzle tray, lay 1 sheet of dough. Layer with ½ cup Béchamel Sauce, ½ cup Beef Bolognese, and 2 tablespoons grated parmesan. Top with second sheet of dough and additional parmesan. Place in wood-fired oven and bake 2 minutes, or until cheese has melted and edges are beginning to char. Slide lasagna onto a serving plate. Garnish with nutmeg and parmesan."
  ]
}