{
  "title": "Two-Tone Potato Gratin",
  "source": "Cravings Hungry for More - Chrissy Teigen",
  "servings": "10 to 12",
  "categories": [
    "Cravings Hungry for More - Chrissy Teigen"
  ],
  "ingredients": [
    "2¾cups heavy cream",
    "3cloves garlic, finely minced",
    "1tablespoon chopped fresh thyme, or 1 teaspoon dried, plus fresh thyme for garnish",
    "1tablespoon chopped fresh sage, or 1 teaspoon dried",
    "1teaspoon chopped fresh or dried rosemary",
    "2teaspoons kosher salt",
    "1teaspoon freshly ground black pepper",
    "¼teaspoon grated nutmeg",
    "Dash of cayenne pepper",
    "2cups shredded Gruyère cheese",
    "2cups finely grated Parmigiano-Reggiano cheese",
    "2pounds sweet potatoes",
    "1½pounds russet potatoes"
  ],
  "directions": [
    "Preheat the oven to 425°F.",
    "In a large bowl, whisk together the cream, garlic, thyme, sage, rosemary, salt, black pepper, nutmeg, and cayenne. In a separate bowl, toss together the Gruyère and Parm.",
    "Peel the potatoes, then with a handheld mandoline or a sharp knife, slice the potatoes crosswise into ⅛-inch-thick rounds. Pour ½ cup of the cream mixture into a 9 × 13-inch baking dish, then make a layer of potatoes in as nice a pattern as you can, overlapping the slices slightly. (You can do this in individual layers of sweet potatoes and regular potatoes, or mix them up, or do all the sweet and then all the regular…basically, you do you!) Drizzle ¾ cup of the cream mixture on top and sprinkle with 1 cup of the cheese mixture. Repeat this layering two more times. Finish with a top layer of potatoes and sprinkle the remaining cheese on top of that. Garnish with fresh thyme.",
    "Cover with foil and bake until bubbling, about 30 minutes. Remove the foil, reduce the oven temperature to 400°F, and bake until the top is golden and bubbling, another 30 minutes. Turn the oven to broil and broil until the top is browned, 1 to 2 minutes."
  ]
}