{
  "title": "Uova con la Salsa",
  "source": "My Kitchen in Rome - Rachel Roddy",
  "servings": "Serves 4",
  "categories": [
    "Italian",
    "My Kitchen in Rome - Rachel Roddy"
  ],
  "ingredients": [
    "1small white onion",
    "1celery stalk",
    "5tablespoons olive oil",
    "salt",
    "about 1 pound fresh or canned plum tomatoes, chopped",
    "a pinch of sugar (optional)",
    "4large eggs",
    "finely chopped flat-leaf parsley, to sprinkle (optional)",
    "good bread, to serve"
  ],
  "directions": [
    "Very finely dice the onion and celery. Warm the oil in a heavy-bottomed pan over medium-low heat, add the onion, and cook gently until soft and translucent, then add the celery and a pinch of salt. Stir well so that all the vegetables are well coated with oil. Reduce the heat and cook, stirring every now and then, until the vegetables are soft and lightly golden. This should take about 5 minutes.",
    "If using fresh tomatoes, peel them by plunging them into boiling water for 60 seconds, then transfer them to cold water, by which point the skins should split and slip off easily. Cut the tomatoes into quarters, add them to the pan, and gently mash them with the back of a wooden spoon. Increase the heat so the sauce comes to a gentle boil, then reduce the heat and simmer very gently, uncovered, for 20 minutes, or until it is dense but still saucy, and dark red. Taste and season with salt or sugar if your tomatoes are sharp.",
    "Now you have two options. The first is to keep the pan over low heat, make four wells in the sauce as best you can, and break the eggs into the wells. Cover the pan and allow the eggs to cook gently for 9 minutes. Once cooked, serve them directly from the pan with a spatula and spoon. Alternatively, divide the sauce among 4 warmed individual ovenproof dishes, make a well in the sauce, break an egg into each one, then bake in a preheated oven at 350°F for 4–6 minutes, or until the eggs have set. If you like, sprinkle with parsley to serve."
  ]
}