{
  "title": "Used to Call It Stuffing, Now I Call It Dressing",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Serves 8 to 10",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "6 to 8hot dog buns, cut into ½-inch cubes (8 cups)",
    "1¾pounds (about 6) whole chicken wings",
    "2teaspoons kosher salt (Diamond Crystal or about half as much Morton)",
    "1pound loose breakfast sausage (like Jimmy Dean)",
    "4tablespoons unsalted butter",
    "1yellow onion, cut into small dice",
    "4celery stalks, cut into small dice",
    "5garlic cloves, minced",
    "1cup buttermilk",
    "2tablespoons finely chopped rosemary",
    "2tablespoons finely chopped sage",
    "2tablespoons chopped thyme",
    "Heaping 1 tablespoon granulated chicken bouillon (preferably Totole brand, see this page; optional but optimal)",
    "2teaspoons freshly ground black pepper",
    "½teaspoon cayenne pepper",
    "2eggs"
  ],
  "directions": [
    "Get your oven to 250°F.",
    "Bake the bun cubes on a baking sheet until they’re dry and brittle all the way through, 30 minutes (depending on the brand and freshness of the buns). Take them out and set them aside.",
    "Turn your oven temp to 425°F.",
    "Season the chicken wings with 1 teaspoon of the salt, put them in a 9 by 13-inch casserole dish along with 2 cups water, and bake, uncovered, until they bust a little at the seams and the parts of the wings that aren’t submerged turn light cardboard brown, 70 to 80 minutes.",
    "Take the casserole dish out of the oven but leave the oven on. Tip the liquid into a measuring cup. You want at least ½ cup, so top it off with water if need be. Let the wings hang out until they’re cool enough to handle, then pick the meat off the bones into little bits and put them in the mixing bowl. Eat the skin as you go because it’s delicious but won’t be an awesome texture in the stuffing.",
    "While the wings cook, brown the sausage in a medium skillet over medium-high heat, stirring and breaking it up into little pieces, until it’s cooked through, about 5 minutes. Scoop the sausage into the mixing bowl, leaving any fat behind. Lower the heat to medium; add the butter, onion, celery, and garlic; and cook, stirring, until the onion is translucent and the celery has just a bit of crunch left, 10 minutes or so. Scrape it all into the mixing bowl.",
    "Go ahead and add the remaining 1 teaspoon salt, the buttermilk, rosemary, sage, thyme, chicken bouillon, black pepper, cayenne, and eggs to the bowl. Mix it all together, then add the bun cubes and mix until they’re all wet.",
    "Butter that casserole dish, add the stuffing mix in an even layer, and cover tightly with foil. Bake at 425°F for 40 minutes on the center rack, then remove the foil and keep baking until the top gets nice and brown and the center is hot and steamy, 10 to 15 minutes more.",
    "Serve the stuffing, but call it dressing."
  ]
}