{
  "title": "Vanilla Bean and Brown Butter Chocolate-Chunk Cookie Bars",
  "source": "By Heart - Hailee Catalano",
  "servings": "Makes 16 Bars",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "227grams (1 cup/2 sticks) unsalted butter, plus more for greasing the pan",
    "1vanilla bean, split and scraped (see Note 1)",
    "163grams (11⁄4 cups) all-purpose flour",
    "100grams (1 cup) oat flour (see Note 2)",
    "2teaspoons cornstarch",
    "11⁄2 teaspoon kosher salt",
    "1teaspoon baking soda",
    "300grams (11⁄2 cups) lightly packed dark brown sugar",
    "100grams (1⁄2 cup) granulated sugar",
    "2eggs, at room temperature",
    "One 4-ounce (113 g) bar bittersweet chocolate, roughly chopped",
    "One 4-ounce (113 g) bar semisweet chocolate, roughly chopped (you can substitute with milk chocolate if you prefer!)",
    "Flake salt, to taste"
  ],
  "directions": [
    "1. Heat the butter and vanilla bean (pod and all) in a medium sauté pan over medium-low heat. Whisk the butter continuously until browned, 8 to 10 minutes. (Keep an eye on it because this can happen quickly!) Immediately transfer to a large bowl, and set aside to cool to about room temperature, 20 minutes. Remove the vanilla pod and discard.2. Preheat the oven to 375°F (190°C) with a rack positioned in the center. Butter the bottom of a 9-inch (23 cm) square baking pan and line with parchment paper with an overhang on two sides. Grease the paper all over with butter.3. Whisk the all-purpose flour, oat flour, cornstarch, salt, and baking soda in a medium bowl.4. Add the brown sugar and granulated sugar to the cooled browned butter, and mix with a rubber spatula to combine. Mix in the eggs, one egg at a time, fully incorporating before adding the next egg.5. Add the dry ingredients, and stir to incorporate the wet with the dry. Fold in 85 grams (3 ounces) each of the bittersweet and semisweet chocolate.6. Place the dough on the sheet tray, and spread out evenly using an offset spatula. Top the cookie with the remaining bittersweet and semisweet chocolate.7. Bake for 35 to 40 minutes, until the cookie is puffed up slightly and the top is set and golden. Remove from the oven, and immediately sprinkle with flake salt.8. If you want to cut perfectly square cookie bars, let the cookie cool completely before inverting onto a cutting board and cutting into 16 squares. If serving warm, let the cookie cool for 15 to 20 minutes and scoop out portions directly from the baking pan."
  ]
}