{
  "title": "Vegetable Tortilla Stew",
  "source": "Chrissy Teigen Cookbook",
  "servings": "",
  "categories": [
    "Vegetables"
  ],
  "ingredients": [
    "STEW",
    "2tablespoons vegetable oil",
    "1large onion, diced",
    "1large green bell pepper, diced",
    "1large jalapeño pepper, finely diced (include the seeds)",
    "2tablespoons minced garlic (about 4 cloves)",
    "2tablespoons chili powder",
    "1tablespoon ground cumin",
    "½teaspoon cayenne pepper",
    "Kosher salt and freshly ground black pepper",
    "4cups low-sodium vegetable or chicken broth",
    "2(15-ounce) cans diced tomatoes in juice",
    "2(15-ounce) cans black beans, drained and rinsed",
    "1cup cooked rice",
    "TORTILLA STRIPPIES",
    "2cups vegetable oil, for frying",
    "4corn tortillas",
    "Kosher salt",
    "SERVING",
    "Roughly chopped fresh cilantro leaves",
    "1avocado, sliced",
    "Crumbled cotija or shredded cheddar cheese",
    ""
  ],
  "directions": [
    "MAKE THE STEW: In a soup pot, heat the oil over medium heat until shimmering. Add the onion, bell pepper, and jalapeño and cook, stirring, until the onion is translucent and a teeny bit golden, about 10 minutes. Add the garlic, chili powder, cumin, cayenne, 2 teaspoons salt, and ½ teaspoon black pepper and cook, stirring until fragrant, about 2 minutes. Add the chicken broth, tomatoes, and beans and bring to a boil. Reduce the heat and simmer for 30 minutes. Add the rice and cook until the stew gets nice and thick, about 15 minutes more. Season with more salt, pepper, and spice, if you want.",
    "MAKE THE TORTILLA STRIPPIES: Fill a small or medium saucepan with a couple inches of oil and heat over medium-high heat. Stack the tortillas on top of each other and cut them into thin strips using a sharp knife. Test the oil by dropping a tortilla strip in; if it sizzles immediately, you’re good to go. A small handful at a time, gently lower the strips into the oil and fry until crisp, 1 to 2 minutes. Pull them out with a slotted spoon, drain on paper towels, and salt ’em up",
    "To serve, divide the soup among bowls and garnish with cilantro, avocado, cheese, and the tortilla strippies."
  ]
}