{
  "title": "Vietnamese Coffee Tiramisù",
  "source": "Italian American Don Angie Book",
  "servings": "SERVES 6 TO 8",
  "categories": [
    "Italian American - Don Angie",
    "Other",
    "Other"
  ],
  "ingredients": [
    "Condensed milk custard",
    "3large egg yolks",
    "1tablespoon plus 1 teaspoon cornstarch",
    "1cup whole milk",
    "1(14-ounce) can sweetened condensed milk",
    "1½teaspoons kosher salt",
    "½teaspoon vanilla bean paste",
    "⅔cup mascarpone cheese",
    "⅓cup crème fraîche",
    "Mascarpone cream",
    "1cup heavy cream",
    "1cup mascarpone cheese",
    "½teaspoon kosher salt",
    "¼cup sweetened condensed milk",
    "½teaspoon vanilla bean paste",
    "To assemble",
    "18(3½ × 1-inch) ladyfingers, store-bought or homemade (recipe follows)",
    "2cups brewed dark French roast coffee (preferably Cafe Du Monde), chilled",
    "2teaspoons ground cinnamon"
  ],
  "directions": [
    "Make the condensed milk custard: In a medium bowl, whisk the egg yolks and cornstarch together until well combined and pale in color, about 1 minute.",
    "In a medium saucepot, whisk the whole milk and condensed milk together until very well combined. Set over medium heat and whisk continually until the mixture comes to a simmer, about 5 minutes.",
    "Remove from the heat. Very slowly, whisking the whole time, use a ladle to add the milk mixture little by little to the egg yolks, to temper the eggs. Once all of the milk mixture has been added, add the salt and vanilla paste and mix to combine. Pour the egg-milk mixture back into the saucepot and cook over medium heat, whisking continually, until thick and smooth, 4 to 5 minutes. Transfer the custard to a stand mixer with the whisk and whip on high speed until completely cooled, 4 to 5 minutes. Add the mascarpone and crème fraîche and whisk on medium speed until combined.",
    "Refrigerate for 1 hour or up to overnight to chill.",
    "Make the mascarpone cream: In a stand mixer with the whisk, whip the heavy cream on medium-high until stiff peaks form, 4 to 5 minutes. Fold in the mascarpone, salt, condensed milk, and vanilla paste until well combined. Refrigerate for 1 hour or up to overnight to chill.",
    "To assemble: Place 1½ cups of the condensed milk custard in a 7-inch glass trifle or decorative glass bowl, spreading to cover the bottom in an even layer.",
    "Break 8 to 10 ladyfingers into 1-inch pieces into a medium bowl. Slowly add 1 cup of the coffee, gently folding the ladyfingers while adding the liquid until the cookies are evenly coated in the coffee. Layer the soaked cookies over the condensed milk custard. Set the medium bowl aside. Top the cookies with 2 cups of the mascarpone cream, carefully spreading the cream in an even layer to coat the cookies. Break the remaining ladyfingers into the same soaking bowl, add the remaining 1 cup coffee, and fold to combine. Layer the soaked cookies on top of the mascarpone cream mixture, spreading them evenly across the surface of the cream. Add the remaining custard mixture on top of the layer of cookies. Sprinkle the cinnamon over the top.",
    "Serve immediately. Leftovers keep, tightly covered in the refrigerator, for up to 2 days."
  ]
}