{
  "title": "Vietnamese Rice Cakes with Eggs",
  "source": "Lemongrass and Lime (Pig & Khao) - Leah Cohen",
  "servings": "Serves: 4 to 6",
  "categories": [
    "Asian",
    "Lemongrass and Lime (Pig & Khao) - Leah Cohen"
  ],
  "ingredients": [
    "Rice Cakes:",
    "- 2 cups rice flour",
    "- 3 tablespoons tapioca starch",
    "- 1 tablespoon kosher salt",
    "- 1 tablespoon granulated sugar",
    "- 1 tablespoon canola oil",
    "Dipping Sauce:",
    "- ½ cup Kikkoman low-sodium soy sauce",
    "- ¼ cup apple cider vinegar",
    "- 2 teaspoons granulated sugar",
    "- Freshly squeezed juice of 1 lime",
    "To Serve:",
    "- ¼ cup canola oil",
    "- 1 garlic clove, finely chopped",
    "- 2 large eggs, whisked until smooth",
    "- ½ teaspoon finely diced red Thai chili",
    "- ¼ cup Pickled Daikon and Carrots"
  ],
  "directions": [
    "1. Make the rice cakes: Whisk together the flour, starch, salt, and sugar in a large bowl until combined. Whisk in 3 cups of water and the oil and continue whisking until smooth.",
    "2. Pour the mixture into a large saucepan and cook over low heat, whisking constantly so that the bottom doesn’t burn, until thickened, about 5 minutes. Remove from the heat and let cool for 5 minutes, whisking a few times.",
    "3. Transfer the mixture to a blender in batches and blend until smooth. Transfer to a medium bowl.",
    "4. Fill a pot with 2 inches of water. Make sure your steamer basket fits snugly in (or over) the pot and isn’t in danger of tipping over. Also make sure the bottom layer of food sits above the water line and doesn’t get submerged. A wok is traditionally used, but I find a shallow skillet works just as well. Add about 2 inches of water to the pan and bring it to a simmer over medium heat.",
    "5. Place the prepared pan inside. Scrape the rice cake mixture into it, making sure to flatten the top evenly. Put the steamer basket over the simmering water and top with the lid. Steam until firm and a toothpick inserted into the center comes out clean, 35 to 45 minutes. Keep an eye on the water level and add more if the pot starts to go dry. Once cool, cut the cooked mixture into 2-inch cubes.",
    "6. Make the dipping sauce: Whisk together the soy sauce, vinegar, sugar, and lime juice in a medium bowl. Let sit at room temperature while you prepare the dish.",
    "7. Line a rimmed baking sheet with several layers of paper towels. Heat 1 tablespoon of the oil in a large nonstick sauté pan and pan-fry the rice cake cubes, in batches, until golden brown and crispy. Transfer to the prepared baking sheet.",
    "8. Heat the remaining ¼ cup oil in a nonstick sauté pan and cook the garlic. Add the eggs, then the cubes of rice cake, and cook until the eggs are no longer wet.",
    "9. Garnish with cilantro leaves and Thai chili and serve with dipping sauce and pickled daikon and carrots."
  ]
}