{
  "title": "Vietnamese Lemongrass Chicken",
  "source": "Nomnompaleo.com",
  "servings": "Serves 4",
  "categories": [
    "Vietnamese"
  ],
  "ingredients": [
    "¼cup minced shallots",
    "1large lemongrass stalk, trimmed and minced (about 3 tablespoons)",
    "3garlic cloves, minced",
    "½teaspoon ground ginger (fresh ginger contains an enzyme which can break down the chicken)",
    "Freshly ground black pepper, to taste",
    "zest from 1 lime",
    "2teaspoons Diamond Crystal kosher salt",
    "2tablespoon olive oil",
    "1tablespoon fish sauce",
    "1teaspoon honey (or 1 tablespoon of orange juice if you’re doing a Whole30)",
    "8chicken thighs, bone-in and skin-on",
    "Lime wedges, fresh herbs, lettuce, and pickled vegetables (optional)"
  ],
  "directions": [
    "First, you gotta make the marinade. Mince the shallots and and toss ’em in a large bowl.",
    "Trim the fresh lemongrass stalk…",
    "…and grate finely with a microplane rasp grater (my preferred method)…",
    "…or smash the stalk with a meat pounder and cut finely against the grain of the fibers. The finer the dice, the less lemongrass fiber you’ll be picking out of your teeth when you eat the chicken later. (Check out my lemongrass tutorial for more deets, peeps.)",
    "Add the minced lemongrass to the bowl.",
    "Toss in the minced garlic and ginger. You can use a microplane to mince the garlic, too, but I prefer to use my garlic press for my bulbs—mostly ’cause I like to keep my fingertips intact.",
    "Crack some black pepper into the bowl, and then grab a lime and zest off just the outermost green layer of the fruit. If you’re grating the white pith, you’ve gone too far. Really: the white pith is bitter and will ruin your marinade.",
    "Lastly, add the salt, olive oil, fish sauce, and honey. (If you’re doing a Whole30, you can add a tablespoon of orange juice in place of honey. I promise: it’ll still taste fab.)",
    "Stir the marinade to combine all the ingredients.",
    "Plop in the chicken thighs and massage the marinade all over the bird parts.",
    "Cover the bowl and let it marinate for at least one hour and up to 24 hours in the fridge. (I’m loving these eco-friendly silicone bowl covers, by the way.)",
    "When you’re ready to cook the chicken thighs, preheat the oven to 400°F. I like to use the convection roast function because the circulating hot air cooks the chicken more evenly. No convection? No problem! Just add 5 more minutes to the cooking time and rotate the tray a few times to ensure even browning.",
    "Place the chicken skin-side down on a wire rack placed on top of a foil lined baking sheet. Ignore the gagging noises your overly dramatic seven-year-old makes upon encountering a tray of raw chicken.",
    "Pop the chicken in the oven and bake for 20 minutes. Flip the chicken skin-side up and rotate the tray 180 degrees. Bake for an additional 20-25 minutes or until the skin is evenly browned and the thickest part of the meat registers 165°F on an instant-read thermometer.",
    "First, you gotta make the marinade. Mince the shallots and and toss ’em in a large bowl.",
    "Trim the fresh lemongrass stalk and grate finely with a microplane rasp grater (my preferred method) or smash the stalk with a meat pounder and cut finely against the grain of the fibers. The finer the dice, the less lemongrass fiber you’ll be picking out of your teeth when you eat the chicken later.",
    "Add the minced lemongrass to the bowl.",
    "Toss in the minced garlic and ginger. You can use a microplane to mince the garlic, too, but I prefer to use my garlic press for my bulbs—mostly ’cause I like to keep my fingertips intact.",
    "Crack some black pepper into the bowl, and then grab a lime and zest off just the outermost green layer of the fruit. If you’re grating the white pith, you’ve gone too far. Really: the white pith is bitter and will ruin your marinade.",
    "Lastly, add the salt, olive oil, fish sauce, and honey. (If you’re doing a Whole30, you can add a tablespoon of orange juice in place of honey. I promise: it’ll still taste fab.)",
    "Stir the marinade to combine all the ingredients.",
    "Plop in the chicken thighs and massage the marinade all over the bird parts.",
    "Cover the bowl and let it marinate for at least one hour and up to 24 hours in the fridge.",
    "When you’re ready to cook the chicken thighs, preheat the oven to 400°F. I like to use the convection roast function because the circulating hot air cooks the chicken more evenly. No convection? No problem! Just add 5 more minutes to the cooking time and rotate the tray a few times to ensure even browning.",
    "Place the chicken skin-side down on a wire rack placed on top of a foil lined baking sheet.",
    "Pop the chicken in the oven and bake for 20 minutes. Flip the chicken skin-side up and rotate the tray 180 degrees. Bake for an additional 20-25 minutes or until the skin is evenly browned and the thickest part of the meat registers 165°F on an instant-read thermometer.",
    "Serve the chicken with lettuce, pickled veggies, fresh herbs, and lime wedges."
  ]
}