{
  "title": "Vindaloo-Style Chicken",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 6",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "3pounds boneless, skinless chicken thighs, trimmed and cut into 1½-inch pieces",
    "1¼teaspoons table salt, divided",
    "¼teaspoon pepper",
    "3tablespoons vegetable oil, divided",
    "3onions, chopped fine",
    "8garlic cloves, minced",
    "1tablespoon paprika",
    "¾teaspoon ground cumin",
    "½teaspoon ground cardamom",
    "¼teaspoon cayenne pepper",
    "¼teaspoon ground cloves",
    "3tablespoons all-purpose flour",
    "1½cups chicken broth",
    "1(14.5-ounce) can diced tomatoes",
    "2tablespoons red wine vinegar",
    "1tablespoon mustard seeds",
    "2bay leaves",
    "1teaspoon sugar",
    "¼cup minced fresh cilantro"
  ],
  "directions": [
    "1. Adjust oven rack to lower-middle position and heat oven to 325 degrees. Pat chicken dry with paper towels and sprinkle with 1 teaspoon salt and pepper. Heat 1 tablespoon oil in Dutch oven over medium-high heat until just smoking. Add half of chicken and brown well, about 8 minutes; transfer to bowl. Repeat with 1 tablespoon oil and remaining chicken.",
    "2. Add remaining 1 tablespoon oil to now-empty pot and place over medium heat until shimmering. Add onions and remaining ¼ teaspoon salt and cook until softened, 5 to 7 minutes. Stir in garlic, paprika, cumin, cardamom, cayenne, and cloves and cook until fragrant, about 30 seconds. Stir in flour and cook for 1 minute.",
    "3. Gradually whisk in broth, scraping up any browned bits and smoothing out any lumps. Stir in tomatoes with their juice, vinegar, mustard seeds, bay leaves, sugar, and browned chicken along with any accumulated juices. Bring to simmer. Cover pot, place in oven, and cook until chicken is tender, about 1 hour.",
    "4. Remove stew from oven and discard bay leaves. Stir in cilantro, season with salt and pepper to taste, and serve."
  ]
}