{
  "title": "Wagyu Cheeseburger Pot Stickers",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "6 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "- 6 oz / 170g bacon",
    "- 1 lb / 450g ground wagyu",
    "- 1 egg",
    "- 1 cup / 120g shredded Cheddar cheese",
    "- ¼ cup / 40g finely chopped dill pickles",
    "- ¼ cup / 20g finely chopped shallots",
    "- 2 Tbsp Dijon mustard",
    "- 1 Tbsp fish sauce",
    "- 1 (14-oz / 395g) package dumpling wrappers",
    "- 2 to 3 Tbsp vegetable oil for frying",
    "- ¼ cup / 60g Chili Crisp Aioli"
  ],
  "directions": [
    "1. Preheat the oven to 400°F / 200°C. Line a baking tray with parchment paper.",
    "2. Place the bacon strips on the prepared tray and cook for 15 to 20 minutes until they reach the desired crispiness. Let the bacon cool, then chop into small pieces.",
    "3. In a medium bowl, combine the wagyu, egg, bacon, cheese, pickles, shallots, mustard, and fish sauce and mix well.",
    "4. To form the pot stickers: Put some water in a small bowl. Dip your finger in the water and wet the perimeter of a dumpling wrapper. Place about 1 Tbsp of the filling in the middle of each wrapper and fold the wrapper in half. Crimp the edges of the dumpling with your fingers to seal and form into half-moon shapes. Transfer the dumpling to a tray or large platter and repeat with the remaining wrappers. You can make these ahead and freeze them for up to 3 months. To freeze, place the dumplings in a single layer on a tray in the freezer. Once frozen, store the dumplings in a resealable bag to save on space.",
    "5. To cook the pot stickers: In a large nonstick frying pan over medium heat, heat some oil. Working in two or three batches, so as not to crowd the pan, add the dumplings in a single layer and cook for a few minutes until the bottoms are golden brown. Then, add about ¼ cup / 60ml water (it should only cover a thin layer) to the pan and cover to steam the pot stickers for about 3 more minutes. When the water is almost fully evaporated, remove the lid and let the pot stickers cook for another minute or so. At this point, they will be fully cooked through and crispy on the bottom. Remove the pan from the heat and transfer the pot stickers to a serving plate. Repeat with the remaining pot stickers.",
    "6. Serve the pot stickers with the aioli as a dipping sauce on the side."
  ]
}