{
  "title": "Walkaway Ratatouille",
  "source": "Modern Bistro - ATK",
  "servings": "6 to 8",
  "categories": [
    "French",
    "Modern Bistro - ATK"
  ],
  "ingredients": [
    "⅓cup plus 1 tablespoon extra-virgin olive oil, divided",
    "2large onions, cut into 1-inch pieces",
    "8large garlic cloves, peeled and smashed",
    "1¾teaspoons table salt, divided",
    "¾teaspoon pepper, divided",
    "1½teaspoons herbes de Provence",
    "¼teaspoon red pepper flakes",
    "1bay leaf",
    "2pounds plum tomatoes, peeled, cored, and chopped coarse",
    "1½pounds eggplant, peeled and cut into 1-inch pieces",
    "2small zucchini, halved lengthwise and cut into 1-inch pieces",
    "1red bell pepper, stemmed, seeded, and cut into 1-inch pieces",
    "1yellow bell pepper, stemmed, seeded, and cut into 1-inch pieces",
    "2tablespoons chopped fresh basil, divided",
    "1tablespoon minced fresh parsley",
    "1tablespoon sherry vinegar"
  ],
  "directions": [
    "1  Adjust oven rack to middle position and heat oven to 400 degrees. Heat ⅓ cup oil in Dutch oven over medium-high heat until shimmering. Add onions, garlic, 1 teaspoon salt, and ¼ teaspoon pepper and cook, stirring occasionally, until onions are translucent and starting to soften, about 10 minutes. Stir in herbes de Provence, pepper flakes, and bay leaf and cook until fragrant, about 1 minute. Stir in tomatoes, eggplant, ½ teaspoon salt, and ¼ teaspoon pepper.",
    "2  Transfer pot to oven and cook, uncovered, until vegetables are very tender and spotty brown, 40 to 45 minutes.",
    "3  Remove pot from oven and, using potato masher, mash eggplant mixture to coarse puree. Stir in zucchini, bell peppers, remaining ¼ teaspoon salt, and remaining ¼ teaspoon pepper and return to oven. Cook, uncovered, until zucchini and bell peppers are just tender, 20 to 25 minutes.",
    "4  Remove pot from oven, cover, and let stand until zucchini is translucent and easily pierced with tip of paring knife, 10 to 15 minutes. Using wooden spoon, scrape any browned bits from sides of pot and stir back into ratatouille. Discard bay leaf.",
    "5  Stir in 1 tablespoon basil, parsley, and vinegar. Season with salt and pepper to taste. Transfer to large platter, drizzle with remaining 1 tablespoon oil, sprinkle with remaining 1 tablespoon basil, and serve."
  ]
}