{
  "title": "Wedge Salad with Creamy Chili Crisp Dressing",
  "source": "By Heart - Hailee Catalano",
  "servings": "Serves 6",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Dressing",
    "1⁄2 cup (120 g) labne or sour cream",
    "1⁄4 cup (60 ml) buttermilk",
    "1⁄4 cup (7 g) loosely packed fresh dill, roughly chopped",
    "3tablespoons thinly sliced fresh chives",
    "2tablespoons mayonnaise",
    "1tablespoon chili crisp",
    "1teaspoon Dijon mustard",
    "Zest of 1 lemon",
    "Juice of 1⁄2 lemon",
    "Kosher salt and freshly cracked black pepper, to taste",
    "Topping",
    "1⁄2 cup (120 ml) canola oil",
    "5large garlic cloves, thinly sliced on a mandoline",
    "3large shallots, thinly sliced into rings on a mandoline",
    "Kosher salt, to taste",
    "Salad",
    "1large head iceberg lettuce, cut into small wedges, core removed, and some leaves separated",
    "Fresh cilantro leaves, to taste",
    "Torn fresh dill, to taste",
    "Torn fresh mint leaves, to taste"
  ],
  "directions": [
    "1. Prepare the dressing: Mix the labne, buttermilk, dill, chives, mayonnaise, chili crisp, mustard, lemon zest, and lemon juice in a small bowl. Season with salt and pepper. Place in the refrigerator until ready to use.2. Make the topping (see Tip): Heat the canola oil and sliced garlic in a small sauté pan over medium-low heat. Fry the garlic, stirring often, until lightly golden brown, 3 to 5 minutes. The garlic won’t seem very crisp at this point, but it will crisp up when fully cooled.3. Using a slotted spoon or skimmer, carefully transfer the garlic to a paper towel–lined plate or small sheet pan to drain. Sprinkle with a touch of salt.4. Add the shallots to the same hot oil over medium-low heat, and cook, stirring frequently, until pale golden, 8 to 10 minutes. When the shallots are one shade lighter than golden brown, use the slotted spoon or skimmer to transfer them to a paper towel–lined plate or small sheet pan to drain. They will crisp up more as they cool. Sprinkle with a touch of salt.5. Make the salad: Arrange the iceberg wedges on a platter. Spoon the dressing all over, and top with cilantro, dill, and mint. Finish with the crispy garlic and shallots, and serve."
  ]
}