{
  "title": "Whirled Peas on Toast",
  "source": "Turkey and the Wolf - Mason Hereford & JJ Goode",
  "servings": "Serves 4 to 8",
  "categories": [
    "Turkey and the Wolf - Mason Hereford & JJ Goode"
  ],
  "ingredients": [
    "3cups (16-ounce bag) frozen peas, thawed, or even better, given a makeover",
    "½cup Verdant Blender Sauce",
    "3tablespoons unsalted butter, room-temp so it’s mayo-soft",
    "4thick slices soft white bread",
    "½cup Feta Cream Cheese, room-temp so it’s nice and soft",
    "Some thinly sliced white or yellow onion",
    "¼cup packed picked dill sprigs",
    "¼cup packed mint leaves, torn if large",
    "Heaping ¼ cup toasted slivered almonds or chopped roasted almonds",
    "1juicy lemon",
    "Feta Cream Cheese",
    "1cup (5 ounces) crumbled feta",
    "¼teaspoon kosher salt (Diamond Crystal or about half as much Morton)",
    "1cup (8 ounces) Philadelphia cream cheese, room-temp so it’s nice and soft"
  ],
  "directions": [
    "To whirl those peas: Combine the peas and blender sauce in a food processor and pulse about ten times, just to mix the ingredients and chop the peas a bit, so there aren’t any whole peas hanging around.",
    "To make those toasts: Get a well-seasoned cast-iron skillet or griddle hot over medium heat. Swipe the butter on each side of the bread and toast in batches in the skillet until both sides are golden brown, 1 to 2 minutes per side. When they’re done, move them to a rack or stand them up so they lean against each other, to keep from getting soggy.",
    "When the bread is cool enough to handle, swipe each slice with the cream cheese, then cut the toasts in half—I’m a triangle guy, so I do corner to corner.",
    "Spoon on all of the whirled peas (it’ll only seem like too much until you taste it), then sprinkle on the onion, herbs, and almonds. Finally, squeeze on the juice from about half the lemon if it’s super-juicy, or more if it’s not.",
    "Eat it.",
    "Feta Cream Cheese",
    "Combine the feta and salt in a food processor, then add the cream cheese in several blobs (it’s easier on your machine that way). Buzz, occasionally stopping and scraping down the sides if need be, until it’s smooth and there are no signs of little pebbly chunks of feta. It’ll take 2 to 3 minutes, depending on how soft your cream cheese was.",
    "It keeps in the fridge until the expiration date on the feta or cream cheese."
  ]
}