{
  "title": "White Clam Bar-Style Pizza",
  "source": "By Heart - Hailee Catalano",
  "servings": "SERVES 4 (MAKES TWO 12-INCH/30 CM PIZZAS)",
  "categories": [
    "By Heart - Hailee Catalano"
  ],
  "ingredients": [
    "Cornmeal, for dusting",
    "2heads garlic, tops trimmed to expose the cloves",
    "Olive oil, for drizzling",
    "Kosher salt and freshly cracked black pepper, to taste",
    "1recipe Thin Bar Pie–Style Pizza Dough",
    "12ounces (340 g) low-moisture whole-milk mozzarella, shredded",
    "One 6.5-ounce (184 g) can whole clams, drained (see Note)",
    "6tablespoons finely grated pecorino Romano",
    "Vinegary hot sauce, to taste (I love Crystal for this)",
    "Thinly sliced fresh chives, to taste",
    "Lemon wedges, for serving"
  ],
  "directions": [
    "1. Preheat the oven to 425°F (220°C) with a pizza stone (if you have one) in the lower third. Dust two 12-inch (30 cm) round pizza pans with cornmeal (see Note 1 for other pan options).",
    "2. Drizzle the heads of garlic with olive oil, and season with salt. Wrap each head tightly in foil, and place on a sheet tray. Roast for 40 to 45 minutes, until soft and golden. Let cool enough to handle and then squeeze out the cloves.",
    "3. While the garlic roasts, place one ball of Thin Bar Pie-Style Pizza Dough on each pizza pan, and press and stretch out the dough as far as possible with your hands. The dough will not fit the whole pan at this point.",
    "4. Lightly oil the top of each pizza dough, and cover lightly with plastic wrap. Let both pizzas rest for 45 to 60 minutes at room temperature.",
    "5. When the garlic is out of the oven, increase the oven temperature to 500°F (260°C).",
    "6. After the doughs have rested, press and stretch them out again, this time to fill the entire pan. If the doughs still won’t quite stretch out the entire way, cover and let them rest another 15 minutes and try again.",
    "7. Prick the doughs all over with a fork.",
    "8. Divide the roasted garlic, mozzarella, clams, and pecorino Romano evenly between the two pizzas, leaving about a 1⁄4-inch (6 mm) border of dough exposed for the crust. Drizzle the top of each with a bit of olive oil, and season heavily with pepper.",
    "9. Bake one pizza at a time (see Note 2) in the lower third of the oven (on top of the pizza stone, if using) for 12 to 15 minutes, until golden and bubbly.",
    "10. Transfer the pizza to a cutting board. Top with hot sauce and chives, slice, and serve with lemon wedges on the side. (I find these pies are best eaten fresh from the oven.)",
    "11. Repeat steps 9 and 10 with the second pizza."
  ]
}