{
  "title": "Wine-Roasted Artichokes",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 4 to 6",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "2–3large artichokes (1½–2 pounds total)",
    "1cup white wine",
    "1cup water",
    "¼cup olive oil",
    "4tablespoons (½ stick) unsalted butter, cut into ½-inch pieces",
    "4garlic cloves, smashed",
    "Pinch of crushed red pepper flakes (optional)",
    "Kosher salt and freshly ground black pepper",
    "Lemony Aioli (this page), optional"
  ],
  "directions": [
    "1 Preheat the oven to 425°F.",
    "2 Trim the very ends of the artichoke stem, but leave most of it (it’s an extension of the heart and will taste just as good). Using a serrated knife, slice the first 1½ inches off the top, exposing the yellow-y purple rose-like interior. Using your hands, peel away the first two to three layers of those tough, dark green outer leaves, leaving the most tender, paler green ones behind. Using kitchen scissors, trim any lingering thorns on the leaves.",
    "3 Cut the artichokes in half lengthwise. Using a spoon, dig out the fuzzy choke of each half, making sure to scrape clean any lingering bits. Place the artichokes, cut side down, in a large baking dish (size will depend on whether you’re doing 2 or 3, but a 9 by 13-inch pan should do the trick either way). Don’t worry about storing them in acidulated water to prevent browning—they are going to brown regardless once you roast them, so who cares? I never really understood this.",
    "4 Pour the wine, water, and olive oil over the artichokes. Add the butter, garlic, and crushed red pepper flakes, if using; season everything with salt and pepper. (Remember you’re seasoning the artichokes and the cooking liquid, so be generous.) Cover tightly with foil and roast until the artichokes are totally tender, 45 to 55 minutes.",
    "5 Remove the foil and continue to roast until the liquid is mostly evaporated (the olive oil will linger behind), the tops of the artichokes are nicely browned, and the garlic begins to sizzle and brown in the olive oil (the cut sides of the artichokes will also be sizzling and browning), another 15 to 20 minutes.",
    "6 Transfer the antichokes to a large serving platter or bowl. Scrape any of the garlicky oil at the bottom of the baking dish into a small bowl for serving alongside the aioli, if you like."
  ]
}