{
  "title": "Wintry Apple Bake With Double Ginger Crumble",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 8 servings",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "filling",
    "3large, firm, tart baking apples (1½ to 1¾ pounds total or 680 to 775 grams)",
    "Zest and juice of ½ lemon",
    "¼teaspoon ground cinnamon",
    "A few gratings of fresh nutmeg",
    "A pinch of ground cloves",
    "2teaspoons (10 ml) brandy, or 1 teaspoon (5 ml) vanilla extract",
    "3tablespoons (40 grams) granulated sugar",
    "A pinch of salt",
    "topping",
    "⅔cup (about 10½ tablespoons, 5⅓ ounces, or 150 grams) unsalted butter",
    "¼cup (50 grams) raw (turbinado) sugar",
    "¼cup (50 grams) granulated sugar",
    "¼teaspoon coarse or kosher salt",
    "1½teaspoons baking powder",
    "½teaspoon ground ginger",
    "2cups (260 grams) all-purpose flour, or more if needed",
    "1tablespoon (10 grams) minced candied ginger, or more to taste"
  ],
  "directions": [
    "Heat the oven to 375 degrees.",
    "Peel, halve, and core your apples. Cut each piece into 1-inch wedges. Arrange these in the bottom of a 9-by-13-inch baking dish.",
    "In a small bowl, combine the lemon zest and juice, cinnamon, nutmeg, cloves, brandy, sugar, and salt. Pour mixture over the apples, and toss the pieces so that they’re coated.",
    "make the crumbs Melt the butter in a large bowl or saucepan. Stir in the sugars, then add the salt, baking powder, and ground ginger. Stir in the flour and candied ginger. Clumps of dough should easily form; if not, add another tablespoon of flour, and stir again.",
    "Sprinkle the crumble on top of the prepared apples.",
    "bake the crumble Bake for 40 to 45 minutes, until the crumble is lightly browned and apples poked with the tip of a knife have no resistance.",
    "to serve Let cool for 10 to 15 minutes before serving with a dollop of whipped cream, a trickle of cold cream, or some ice cream."
  ]
}