{
  "title": "Winter Greek Salad",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "1large shallot",
    "1small garlic clove",
    "1lemon",
    "1tablespoon fresh oregano leaves, or 1½ teaspoons dried",
    "2English (hothouse) cucumbers",
    "2Fuyu persimmons",
    "DAIRY",
    "2(4-ounce) blocks feta cheese",
    "PANTRY",
    "¼cup red wine vinegar",
    "½cup extra-virgin olive oil",
    "Kosher salt and freshly ground black pepper",
    "1cup Castelvetrano olives",
    "Stuffed grape leaves (a.k.a. dolmas), for serving (optional)"
  ],
  "directions": [
    "1. Make the dressing, adding the ingredients to a large bowl:- Thinly slice 1 large shallot lengthwise. Add ¼ cup red wine vinegar, ½ cup olive oil, 1½ teaspoons salt, and lots of black pepper.- Finely grate in 1 garlic clove and the zest of half a lemon. Cut the lemon in half and squeeze in the juice of 1 half.- Lightly smash 1 cup Castelvetrano olives with the bottom of a mug or glass measuring cup. Discard the pits and add the flesh to the bowl.- Tear 1 tablespoon oregano leaves in half as you add them to the bowl. Let the shallot and garlic sit in the dressing to macerate while you prep the salad—the dressing will only improve with time.",
    "2. Prep the veg:- Trim the ends of 2 English (hothouse) cucumbers. Cut the cucumbers into 2-inch(ish) spears by making bias cuts, rotating the cucumber a quarter turn, making another bias cut, rotating again, etc., etc.- Slice 2 Fuyu persimmons crosswise into ⅛-inch-thick rounds, discarding the stem and root ends. Cut the persimmon rounds in half to create half-moons.- Cut 2 (4-ounce) blocks of feta crosswise into thin planks.",
    "3. Combine and serve:- Add the cukes and persimmons to the dressing and toss gently with your hands. Season with salt. Divide the salad among 4 serving bowls, reserving some of the dressing that’s accumulated at the bottom for drizzling.- Break the feta planks into smaller pieces and scatter them over each bowl. Drizzle the remaining dressing over each salad. Finish with a crank of black pepper and nestle a few stuffed grape leaves in each bowl (if desired)."
  ]
}