{
  "title": "Xi-An Famous Hot Rice Ribbons",
  "source": "Ladyandpups.com",
  "servings": "Servings: 2 to 4",
  "categories": [
    "Chinese"
  ],
  "ingredients": [
    "The seasoning:",
    "Chili oil:",
    "2cups (474 grams/500 ml) canola oil",
    "1/2cup (50 grams sichuan chili flakes, or Korean chili flakes (I don’t recommend using any other kind)",
    "3tbsp (23 grams white sesame seeds",
    "4star anise",
    "2~ 3 dried bay leaves",
    "2tsp ground coriander",
    "1 1/2tsp ground cumin",
    "1/4tsp curry powder",
    "2tbsp ground sichuan peppercorn",
    "2tbsp soy sauce",
    "4grated garlic",
    "Seasoned soy sauce:* for a quick fix, you can just combine soy sauce, water, sugar and vinegar",
    "3/4cup (187 ml) soy sauce",
    "1/4cup (60 ml) water",
    "1tbsp light brown sugar",
    "2tsp whole sichuan peppercorn",
    "1tsp fennel seed",
    "2star anise",
    "1/2stick cinnamon",
    "2whole cloves",
    "1/3cup Asian black vinegar",
    "To serve:",
    "Blanched bean sprouts",
    "Granulated chicken bouillon",
    "7oz (200 grams, about heaping 1 cup) short-grain rice (see update!), or 200 grams rice flour (about 2 cups minus 2 tbsp)(I used this brand, or you could try Bob’s Red Mill, too)",
    "1/2cup (65 grams) potato starch (much preferred), or cornstarch",
    "2cups + 2 heaping tbsp (535 grams) of water"
  ],
  "directions": [
    "To make the chili oil: Mix the soy sauce and grated garlic together, then set aside. Combine canola oil, chili flakes, white sesame seeds, star anise, dried bay leaves, ground coriander, ground cumin and curry powder (leave the ground sichuan peppercorn for later!) in a large, deep pot and set over medium heat. Bring to a gentle boil and fry the mixture for 3 ~ 4 minutes, stirring constantly, until the chili flakes have turned darker in color (but NOT BLACK!!). Turn off the heat immediately, then add the ground sichuan peppercorn. Stir and let fry in residual heat for about 10 seconds. Then add the soy sauce/grated garlic mixture. The oil will boil up a little due to the added moisture. Just keep stirring until the sizzling has died down.",
    "Let the chili oil sit for at least 2 hours, or best overnight before using.",
    "To make the seasoned soy sauce: Combine soy sauce, water, light brown sugar, sichuan peppercorn, fennel seed, star anise, cinnamon and cloves, and simmer on low for 15 min. Strain the mixture, discard the spices, then add the Asian black vinegar and set aside.",
    "Homemade rice noodle, or “mi (rice) pi (skin)“: adapted from many recipes combined",
    "To make the rice noodle batter from scratch: Put the rice in a large sieve and rinse clean under water. Shake off any excess water, then transfer the rice to a blender, along with 535 grams of water. Let soak for 4 ~ 5 hours. The grain should crush easily between your fingers after soaking. Then add the potato starch or cornstarch, and blend for 2 ~ 3 minutes (stopping for 30 seconds in between if your blender needs rest) until finely pureed. Run the mixture through a very fine sieve, into another large bowl. Use a spoon to press on any larger rice-bits, to help crushing and passing them through the sieve.",
    "To make the rice noodle batter from rice flour: Whisk together rice flour, potato starch of cornstarch and water together until even.",
    "To cook the rice noodle: Bring the water inside a large steamer to boil, and keep on high heat during steaming. You can use any shallow sheet-pan that fits into your steamer, and it would significantly speed up the process if you have 2 rotating pans to use. I am using a pizza-pan for my wok-turned-steamer. Brush the interior of the pan very thinly with canola oil, then pour enough batter to cover the pan in a thin layer (WHISK THE BATTER EVERY TIME BEFORE YOU POUR). Place the pan inside the steamer as levelled as you can (so the noodles are even in thickness), then put the lid on and steam on high heat for 2 ~ 3 min. The rice noodle is done when the surface form large air-bubbles (don’t worry it will deflate in a split second). Remove the pan from the steamer, and place with the rotating pan filled with thin batter, if you have 2 pans.",
    "Thinly brush the top surface of the cooked noodle-sheet with canola oil, then run a spatula around the edges. Tilt the pan so it faces the counter, then gently scrape the noodle-sheet onto a cutting-board, and cut into thick strips with pastry-cutter. Don’t worry if your sheet is more “curled/rolled up” than a “flat sheet”. The noodles will stick to each other no matter what in the absence of liquid. Don’t freak out! They will separate more easily once sauce is applied.",
    "Repeat the process until you’re done with all the batter. Serve the cut rice noodles with blanched bean sprouts, seasoned soy sauce, 1/4 tsp of granulated chicken bouillon and LOTS of chili oil."
  ]
}