{
  "title": "Yogurt-Crusted Lamb Chops with Charred Lemons & Sesame",
  "source": "Molly Baz - Cook This Book",
  "servings": "Serves 4",
  "categories": [
    "Cook This Book - Molly Baz"
  ],
  "ingredients": [
    "PRODUCE",
    "2garlic cloves",
    "2lemons",
    "1small red onion or large shallot",
    "1½cups mint leaves",
    "DAIRY",
    "1½cups plain whole-milk Greek yogurt",
    "MEAT",
    "8lamb rib chops (about 3 pounds)",
    "PANTRY",
    "Kosher salt",
    "1tablespoon fennel seeds or cumin seeds",
    "1teaspoon red pepper flakes",
    "½teaspoon sugar",
    "3tablespoons extra-virgin olive oil",
    "1tablespoon toasted sesame seeds"
  ],
  "directions": [
    "1. Season and marinate the lamb:",
    "- Arrange the lamb chops on a rimmed baking sheet. Season the chops all over with 1 tablespoon salt.",
    "- Finely grate 2 garlic cloves into a small bowl. Add ¾ cup whole-milk Greek yogurt and stir to combine.",
    "- Finely chop 1 tablespoon fennel seeds (or crush them with a mortar and pestle if you have one); stir into the yogurt along with 1 teaspoon red pepper flakes.",
    "- Smear the yogurt mixture all over the lamb chops. Let them sit for at least 30 minutes at room temperature and up to overnight, covered, in the refrigerator.",
    "2. Pickle the onions:",
    "- Cut 2 lemons in half crosswise.",
    "- Cut 1 small onion in half through the root end, then thinly slice.",
    "- Toss the onion in a medium bowl with the juice of half a lemon, a big pinch of salt, and ½ teaspoon sugar.",
    "3. Sear the chops:",
    "- Heat 2 tablespoons olive oil in a large cast-iron skillet over medium-high heat.",
    "- When the oil is very hot, arrange 4 lamb chops (marinade and all!) in the skillet and cook, undisturbed, until deeply caramelized, 3 to 4 minutes. Flip the lamb chops and cook on the second side for 3 minutes. Using tongs, upend the chops and sear them on the fat cap until golden brown, about 1 minute. Transfer to a plate to rest while you repeat with the remaining 4 chops and 1 tablespoon olive oil.",
    "- Once all the chops are cooked, add the remaining 3 lemon halves to the pan, cut-sides down. Sear them in the residual fat until deeply charred, 3 to 4 minutes.",
    "4. Serve:",
    "- Spread ¾ cup Greek yogurt on a serving platter and arrange the lamb chops on top.",
    "- Add 1½ cups mint leaves and 1 tablespoon toasted sesame seeds to the bowl of pickled onions, tossing to combine. Season with salt and serve piled on top of the lamb chops with the charred lemons alongside."
  ]
}