{
  "title": "Yogurt-Marinated Leg of Lamb with Spicy Fennel and Sumac",
  "source": "Nothing Fancy - Alison Roman",
  "servings": "serves 8 to 12",
  "categories": [
    "Nothing Fancy - Alison Roman"
  ],
  "ingredients": [
    "4½- to 5½-pound bone-in leg of lamb",
    "Kosher salt and freshly ground black pepper",
    "¼cup fennel or cumin seeds, finely crushed, plus more for serving",
    "2cups full-fat Greek yogurt, plus more for serving",
    "6garlic cloves, finely grated",
    "¼cup fresh oregano leaves, coarsely chopped, plus more for serving",
    "1tablespoon crushed red pepper flakes, plus more for serving",
    "¼cup olive oil, plus more for drizzling",
    "¼cup plus 2 tablespoons fresh lemon juice (from about 3 lemons)",
    "2large fennel bulbs, thinly sliced, divided",
    "2cups fresh parsley, cilantro, and/or mint, tender leaves and stems",
    "Ground sumac (optional)"
  ],
  "directions": [
    "1 Using a sharp paring knife, score the lamb about ½ inch deep every few inches or so—this is a really large cut of meat and we aren’t trying to keep it intact or anything, but we still want to cook it on the bone. Making these incisions will help season the meat deeply and cook more evenly. It seems like a fancy technique, but I promise, you can’t mess it up.2 Season the lamb with salt and pepper (you’ll need at least 1 teaspoon kosher salt per pound here) and sprinkle with the fennel seed, making sure to get everything into those incisions.3 Whisk the yogurt, garlic, oregano, crushed red pepper flakes, olive oil, and ¼ cup lemon juice in a medium bowl. Season with salt and pepper. As if you were applying a mud mask, smear the yogurt all over the lamb, making sure to get into any and all nooks and crannies (not just for English muffins!). Let the meat sit, lightly covered with plastic wrap, at room temperature for at least 1 hour or up to 2 hours, or wrap tightly in plastic and keep in the refrigerator overnight.4 Preheat the oven to 300°F.5 Scatter half the fennel at the bottom of a large roasting pan, and season with salt and pepper. Without wiping off excess marinade, place the lamb on top of the vegetables (or simply in the roasting pan), fat side up. (If braising, add 2 cups of water to the bottom of the roasting pan and cover tightly with foil.)6 Roast, without touching or moving or peeking, until the lamb registers 115 to 120°F when a thermometer is inserted about 2 inches deep into the thickest part of the leg (taking care not to touch the bone), 60 to 90 minutes. (If braising, continue cooking until the lamb is extremely tender and nearly falling apart, 3 to 3½ hours. Remove the foil.)7 Increase the temperature to 450°F and continue to cook until the lamb has reached 120 to 125°F and is deeply golden brown all over with little bits of charred marinade, 20 to 25 minutes more. (If braising, this step is just to brown and crisp up the outside of the lamb.)8 Remove from the oven and let rest a few minutes.9 Once the lamb is cooked to your liking, carve the larger lobes off the bone and thinly slice. Or, for more dramatic albeit slightly messier presentation, thinly slice lamb directly off the bone in the style of a large country ham or prosciutto—this is my favorite way. (If braising, using two forks, simply shred the meat into large pieces.)10 Combine the remaining sliced fennel bulb and 2 tablespoons lemon juice, and season with salt, pepper, and crushed red pepper flakes. Add herbs and toss to coat.11 Place lamb on a large platter and scatter with the fennel mixture, sprinkling with extra fennel seed and sumac, if using. Drizzle with olive oil and flaky salt and serve alongside extra yogurt."
  ]
}