{
  "title": "Youtiao",
  "source": "A Very Chinese Cookbook - Kevin Pang",
  "servings": "Makes: 12",
  "categories": [
    "A Very Chinese Cookbook - Kevin Pang",
    "Chinese"
  ],
  "ingredients": [
    "- 3 1/2 cups (17 1/2 ounces) all-purpose flour, plus extra for dusting",
    "- 1 tablespoon baking powder",
    "- 1 1/4 teaspoons instant or rapid-rise yeast",
    "- 1 teaspoon table salt",
    "- 1 1/2 cups (12 ounces) water",
    "- 1 1/2 tablespoons vegetable oil",
    "- 2 quarts peanut or vegetable oil for frying"
  ],
  "directions": [
    "1. Whisk flour, baking powder, yeast, and salt together in a large bowl. Using a rubber spatula, fold water and vegetable oil into the flour mixture until a cohesive dough forms and no dry flour remains. Transfer dough to a lightly floured counter and knead by hand to form a ball, about 1 minute. Place dough in a lightly greased bowl, cover tightly with plastic wrap, and let rest for 20 minutes.",
    "2. Transfer dough to a lightly oiled counter. Gently stretch and press dough into an 18 by 12-inch rectangle, with the short side parallel to the counter edge. Starting at the bottom of the dough, fold into thirds like a business letter, using a bench scraper or metal spatula to release the dough from the counter. Press edges of dough firmly to seal folds. Turn dough 90 degrees counterclockwise. Stretch and press dough into an 18 by 12-inch rectangle and repeat folding into thirds and pressing edges to seal. Repeat rotating, pressing, and folding dough into thirds one more time. Transfer dough to a lightly greased rimmed baking sheet and cover loosely with greased plastic. Let dough rest at room temperature for 2 hours. (Alternatively, refrigerate dough for at least 12 hours or up to 24 hours; bring to room temperature before proceeding.)",
    "3. Transfer dough seam side down to a well-floured counter and dust top with flour. Stretch and roll dough into a rough 13-inch square. Using a pizza cutter or sharp knife, trim edges of dough to form a uniform 12-inch square. Cut dough into two 12 by 6-inch rectangles, then cut each rectangle crosswise into twelve 1-inch-wide strips.",
    "4. Separate strips and use a pastry brush to lightly dust tops and sides with flour. Using a bench scraper or the edge of a metal ruler, press lengthwise down the center of the 12 strips to create a crease, making sure not to cut through the dough. Arrange the remaining 12 uncreased dough strips on top of the creased strips and use the bench scraper to create a second crease that adheres the dough strips to each other. Cover youtiao with plastic and let rest for 20 minutes.",
    "5. Set a wire rack in a second rimmed baking sheet and line with a triple layer of paper towels. Add peanut oil to a large Dutch oven until it measures about 1 1/2 inches deep and heat over medium-high heat to 400 degrees.",
    "6. Working with 1 youtiao at a time, hold at each end and gently stretch to 11 inches. While still holding the youtiao at each end, gently and carefully lower, middle first, into the hot oil. Cook, using tongs or cooking chopsticks to flip continuously until the dough puffs and begins to turn light golden brown, about 30 seconds. Continue to fry without flipping until deep golden brown on one side, about 30 seconds. Flip and continue to fry until deep golden brown on the second side, about 30 seconds. Adjust the burner as necessary to maintain an oil temperature of 400 degrees. Transfer youtiao to the prepared rack. Return oil to 400 degrees and repeat with remaining youtiao; transfer to rack. Serve."
  ]
}