{
  "title": "Za’atar-Rubbed Butterflied Chicken",
  "source": "The Chicken Bible - ATK",
  "servings": "Serves 4",
  "categories": [
    "The Chicken Bible - ATK"
  ],
  "ingredients": [
    "2tablespoons za’atar",
    "5tablespoons plus 1 teaspoon extra-virgin olive oil, divided",
    "1(3½- to 4-pound) whole chicken, giblets discarded",
    "1teaspoon plus ⅛ teaspoon table salt, divided",
    "½teaspoon plus ⅛ teaspoon pepper, divided",
    "1tablespoon minced fresh mint",
    "¼preserved lemon, pulp and white pith removed, rind rinsed and minced (1 tablespoon)",
    "2teaspoons white wine vinegar",
    "½teaspoon Dijon mustard"
  ],
  "directions": [
    "1. Adjust oven rack to lowest position and heat oven to 450 degrees. Combine za’atar and 2 tablespoons oil in small bowl. With chicken breast side down, use kitchen shears to cut through bones on either side of backbone. Discard backbone and trim away excess fat and skin around neck. Flip chicken and tuck wingtips behind back. Press firmly on breastbone to flatten, then pound breast to be same thickness as legs and thighs. Pat chicken dry with paper towels and season with 1 teaspoon salt and ½ teaspoon pepper.",
    "2. Heat 1 teaspoon oil in 12-inch ovensafe skillet over medium-high heat until just smoking. Place chicken skin side down in skillet, reduce heat to medium, and place heavy pot on chicken to press it flat. Cook chicken until skin is crisp and browned, about 25 minutes. (If chicken is not crisp after 20 minutes, increase heat to medium-high.)",
    "3. Off heat, remove pot and carefully flip chicken. Brush skin with za’atar mixture, transfer skillet to oven, and roast until breast registers 160 degrees and thighs register 175 degrees, 10 to 20 minutes.",
    "4. Transfer chicken to carving board and let rest, uncovered, for 10 minutes. Meanwhile, whisk mint, preserved lemon, vinegar, mustard, remaining ⅛ teaspoon salt, and remaining ⅛ teaspoon pepper in bowl until combined. Whisking constantly, slowly drizzle in remaining 3 tablespoons oil until emulsified. Carve chicken and serve with dressing."
  ]
}