{
  "title": "Zhong Dumplings",
  "source": "The Book of Sichuan Chili Crisp - Jing Gao",
  "servings": "Makes 6 servings",
  "categories": [
    "Chinese",
    "The Book of Sichuan Chili Crisp - Jing Gao"
  ],
  "ingredients": [
    "Sauce",
    "- ½ cup / 100g dark brown sugar, lightly packed",
    "- 2 or 3 pieces star anise",
    "- 2 dried shiitake mushrooms",
    "- 1 piece cassia bark (1 to 2 inch / 2.5 to 5cm)",
    "- ½ cup / 120ml light soy sauce",
    "- ½ cup / 120ml Chili Oil",
    "- 1 Tbsp black vinegar",
    "- 1 large garlic clove, minced",
    "Filling",
    "- 1 lb / 450g ground pork (30% fat, 70% lean)",
    "- 1 Tbsp plus 1 tsp cornstarch",
    "- 1 Tbsp fish sauce",
    "- 1 Tbsp toasted sesame oil",
    "- 1 Tbsp Shaoxing wine",
    "- 1 tsp soy sauce",
    "- 1 tsp kosher salt",
    "- 1 tsp ground white pepper",
    "- 4 scallions, green parts only, thinly sliced",
    "- 1 egg",
    "- 1 (1-inch / 2.5cm) piece ginger, minced",
    "- ½ cup / 120ml water",
    "- 1 (14-oz / 395g) package dumpling wrappers"
  ],
  "directions": [
    "1. To make the sauce: In a small saucepan over low heat, infuse the brown sugar, star anise, mushrooms, and cassia bark in soy sauce for 30 minutes. Remove the pan from the heat and cool completely before stirring in the chili oil and vinegar. Store in an airtight container at room temperature for up to 1 month or in the fridge for up to 3 months. Remove the spices with a slotted spoon before using.2. To make the filling: In a large bowl, combine the pork, 1 Tbsp of the cornstarch, the fish sauce, sesame oil, wine, soy sauce, salt, pepper, scallions, egg, ginger, and water and mix well. If you’d like to test the meat’s seasoning, fry a little bit in a pan with some oil. It should taste delicious and umami-rich with no other seasoning.3. To form the dumplings: Put some water in a small bowl. Dip a finger in the water and wet the perimeter of a dumpling wrapper. Place about 1 Tbsp of the filling in the middle of each wrapper and fold the wrapper in half. Crimp the edges of the dumpling with your fingers to seal and form into half-moon shapes. Transfer the dumpling to a tray or large platter and repeat with the remaining wrappers. You can make these ahead and freeze them for up to 3 months. To freeze, place the dumplings in a single layer on a tray in the freezer. Once frozen, store the dumplings in a resealable bag to save on space.4. To cook the dumplings: In a large pot over high heat, bring some salted water to a boil. Once boiling, drop the dumplings in, about a dozen at a time so as not to crowd the pot, making sure to gently stir right away so nothing sticks to the bottom of the pot. The dumplings should start to float to the top after 3 to 4 minutes. Wait another 15 seconds, then, using a slotted spoon, remove them from the water.5. When ready to serve, in a small bowl, stir the garlic with 3 Tbsp of the sauce. Drizzle the sauce over the freshly boiled dumplings and enjoy! Store any remaining sauce in an airtight container in the fridge for up to 2 weeks."
  ]
}