{
  "title": "Zucchini-Stuffed Zucchini With Sorta Salsa Verde",
  "source": "Smitten Kitchen Every Day - Deb Perelman",
  "servings": "makes 2 large or 4 small portions",
  "categories": [
    "Cookbooks",
    "Smitten Kitchen Every Day - Deb Perelman"
  ],
  "ingredients": [
    "zucchini",
    "4smallish, slim zucchini (6 ounces or 170 grams each)",
    "½teaspoon kosher salt, plus more as needed",
    "1 to 2tablespoons (15 to 30 ml) olive oil or butter",
    "2medium shallots, finely chopped",
    "Red pepper flakes or freshly ground black pepper",
    "¾cup (70 grams) panko breadcrumbs",
    "⅓cup (40 grams) coarsely grated Gruyère or Comté",
    "A few fine gratings of lemon zest",
    "sorta salsa verde",
    "1large or 2 small garlic cloves, roughly chopped",
    "1tablespoon (10 grams) capers, drained (and rinsed, too, if salt-packed)",
    "1teaspoon loosely packed fresh oregano leaves, or 2 teaspoons dried",
    "¾cup loosely packed fresh parsley leaves",
    "¼cup loosely packed fresh mint leaves",
    "¼cup (60 ml) olive oil",
    "1tablespoon (15 ml) lemon juice, or more to taste",
    "Salt and freshly ground black pepper to taste",
    ""
  ],
  "directions": [
    "Heat the oven to 400 degrees.",
    "prepare zucchini Halve the zucchini lengthwise. With a teaspoon or melon baller (my choice), scoop out the flesh from the interior of the zucchini, leaving about ¼ inch flesh all around, so they resemble boats. Place the zucchini boats in a lightly oiled or buttered 9-by-13-inch casserole dish.",
    "Roughly chop the zucchini flesh, toss with ½ teaspoon salt, and set in a colander to drain for 10 minutes.",
    "make your sorta salsa verde while the zucchini drains Place the garlic and capers in the work bowl of a food processor or blender, and grind them together. Add the herbs, and run the machine until they’re chopped. Add the olive oil in a thin drizzle, running the machine the whole time, until the herbs become saucy. You’ll want to scrape the mixture down a couple times so it mixes well.",
    "No blender or food processor? Just mince everything quite finely and stir in the olive oil. That works fine, too.",
    "For both methods, then add the lemon juice, and adjust the seasonings to taste.",
    "cook and assemble Heat 1 to 2 tablespoons olive oil or butter in a large skillet over medium heat. Add the shallots, and cook for 2 minutes, until soft and lightly browned. Add the drained zucchini flesh, and cook for 5 minutes more, until most of the moisture has cooked off. Season with pepper and more salt, if needed. Remove from the heat, and combine in a bowl with all but 1 tablespoon of the panko, the cheese, zest, and 2 tablespoons of the herb sauce.",
    "Spoon the mixture back into the zucchini cavities and press to heap slightly if needed. Sprinkle with the remaining panko.",
    "to finish Bake for 40 to 45 minutes, until the zucchini are soft and the filling is browned. Dollop on the remaining salsa verde."
  ]
}